{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Springfield, Massachusetts",
        "Status:": "Active",
        "Formed in:": "1998",
        "Genre:": "Metalcore/Melodic Death Metal (early); Metalcore/Melodic Hard Rock (later)",
        "Lyrical themes:": "Relationships, Personal struggles, Society, Hope",
        "Current label:": "Razor & Tie",
        "Years active:": "\n1998-present ",
        "Number of Reviews": 47
    },
    "Band Reviews": [
        "\nAll That Remains had made it huuuuuuge with The Fall of Ideals. A dynamic explosion of metalliferous mayhem, compacted into an easy-to-digest metalcore package that likely got a number of people into the world of metal alongside Killswitch Engage and the like. But then they followed it up with Overcome, where they overcome precisely fuck all except for the challenge of making music detractors thought The Fall of Ideals was. The biggest victim was Oli Herbert – like, why even have this Paul Gilbert-level guitarist when you’re not going to actually use him, you know? I didn’t even bother with anything else afterwards – sampling the following two albums resulted in worse and worse versions of Overcome, like why even bother?\n\nWell, behind my back, it seems like they’ve gotten their mojo back! Madness sees them play some of the most adventurous, most technical metalcore since Behind Silence and Solitude with the unbridled excitement of The Fall of Ide- nah, I’m just fucking with you. This is about as far in the other direction as you could go, even given those constraints – Madness is basically radio rock with like tinges of their old sound. Focusing more on simple, in-your-face melodicism with some wiffle-hard riffs, they construct songs that fit in more with the alternative rock crowd like Seether and Staind than their old contemporaries from the old melodic metalcore movement. Furthermore, they grossly underuse their guitarists. Even the solos just lack that absolute shredding goodness the band once had.\n\nBut honestly? Even though much of this is as faceless as your typical radio rock album gets and lacks the necessary melody to stay in your head five seconds after the song’s over, this is a better move for them than just trying and failing to rehash The Fall of Ideals over and over again. They even made that much clear in the prior album apparently. I know the old fan in me should be wanting that again and again – especially given the revitalization of bands like Killswitch Engage, not to mention there’s some easy nostalgia bucks likely to be made there – but it’s because of that part of me that I find this to be a good move for them.\n\nIt shows... sort of. Songs like “If I’m Honest” and “Far from Home” sound like every sappy song Seether ever made. Songs like “Halo” and “Trust and Believe” have some kick to them with some more fast-paced riffing and they’re at least vaguely familiar enough next to their old sound, but with weak hooks, they do little to make an impact. Still, they’re waaaaaay more enjoyable than literally anything on Overcome and especially A War You Cannot Win, mainly because they’re creating more what they want than what they think sounds like a cut of The Fall of Ideals. The riffs, as boneheaded as they are, show more conviction than they had in A War You Cannot Win – or, more accurately, they don’t plod about as much. There’s a little more going into them than before, which generates a bit more hype when they’re on, which at least makes the experience not as turgid, nor as bland, nor as ultimately boring as before.\n\nThat’s pretty much it, really. The thing with overly simple, in-your-face music like this is that there isn’t a whole to go over – especially what are ultimately faceless, mediocre cuts. “Madness”, “Halo”, “Trust and Believe”, “Never Sorry” – hell, even the Garth Brooks cover, “The Thunder Rolls”, just sort of happen. They sound alright when they’re playing – there’s some decent riffs in there, or there’s some potentially bopping melodies in there. But when the hooks so easily pass you by and the melodies never manifest into anything even remotely resembling something that worms their way into your subconscious, it winds up failing in what it sets out to achieve. Granted, that would’ve been the case for their music for about a decade by the time Madness came out – they really haven’t done anything as good as The Fall of Ideals or even Behind Silence and Solitude. It’s just, where A Way You Cannot Win is a fifth-rate rehash of their best album, Madness is simply a very mildly entertaining album you’d likely forget even exists if it wasn’t done by the same band that did The Fall of Ideals.\n",
        "\nOvercome is a pretty lame album. Largely bland instrumentation breeding listless compositions lacking in melodicism or anything really worth a damn. Any remaining edges The Fall of Ideals had – which were but a scant few – are rounded to a point where Overcome becomes spherical in its look. Effectively, most every song on here sounds the same. So, if you don’t like what “Before the Damned” and “Two Weeks” are selling, Overcome ends up dead on arrival. Even when given a generous appraisal, all that can be said is that every song on here vies so hard for radio play that you can see it all the way from Pluto without a telescope. Like, it’s not incompetently put together or anything. Phil isn’t putting nearly as much into the screams as he had in the prior two albums, but... at least he’s not just lazily barking into the mic like he had in the debut? The clean vocals aren’t as strong as before, but it at least – yeah, I think you know where this is going.\n\nThe main problem with this album is that it always seems like it’s building up to something really good. Like, you’re listening to riffs that just barely pass a quality control test serving as the framework for this rocking kinda metalcore track, you’re constantly expecting somebody to let it rip and yet... nothing. The riffs travel along this semi-serviceable groove. Phil provides the vocals necessary to make a non-instrumental song work, adding to the groove with his own vocal melody. The percussion provides the groove with some kicks to stop it from being a 111% monotonous wall of sound. The chorus morphs the riff either into a higher register or slows it down. The percussion follows this change adequately enough, trying to give this grandiose sound to try and make the chorus pop. It monotonously chugs on through as if it’s trying to blend in with the verse riffs, only showing it’s the chorus by reprisal at certain junctures in the song. It eventually ends, not with a bang or even a whimper. No, it just ends. Another song down. Hope this one ends up on the radio.\n\nOvercome is an album that just happens. Some guitars are played, some harsh screamy vocals and clean vocals are vocalized, some drums give beats to these things, a ripper of a solo is played after the second chorus – like, imagine taking a Racer X song and just taking the life out of everything but Paul Gilbert’s solos. It’s a pretty rough (and generous) approximation of every song on here. In particular is “Chiron” – man, what a frustrating song this is. Given a surface-level appraisal, it sounds like something left on the cutting room floor when putting The Fall of Ideals together. There appears to be a little more oomph. Namely, the riffs having a little more pep to them. But talk about squeezing the life out of a song... just apply some sterile production, round off any sort of edge in the riffs and vocals, and voila! An absolute disappointment within a disappointment of an album that signalled the end of this band being interesting as they continued down a path of background noise full of nothing riffs, nothing grooves and wasted Racer X solos.\n",
        "\nWhile This Darkened Heart (and The End of Heartache) characterized that melodic metalcore sound of the 2000s, The Fall of Ideals absolutely perfects it – even if it doesn’t seem to be the case at first glance. With cuddlier production and less abrasive riffs, this is less a metal album and more like a heavier pop album. What exasperates this is how the compositions of each track lend themselves to catchiness than anything else. Much of the old hardcore influence has been excised in favor of those big choruses and leading verses we all know bands like Killswitch Engage and Lamb of God for. Speaking of which, at least on a conceptual level, The Fall of Ideals was looking to be like The End of Heartache. Putting aside “Rose of Sharyn” which was unabashedly poppy and fun to listen to, that album was a pretty underwhelming collection of nothing riffs (except the beginning of “When Darkness Falls”) and equally nothing choruses that just don’t stick. So, going along those lines, this is either going to be the musical equivalent of junk food or just some boring ass shit.\n\nMuch of it comes down to the riffs, which don’t really seem like much... because they largely aren’t. Many are like your standard metalcore riffs, with some of the faster ones lending to an upbeat pace while the slower ones err more towards the sound those old steam trains made. Granted, you get some more furious riffing in songs like “The Weak Willed”, “Six” and “Empty Inside”, as if Oli and Mike went through their old Dissection albums and wanted to sneak in some of their meloblack riffing. Oli also noodles around a bit in a couple of songs, but other than that, what you get is what you largely got in albums like The End of Heartache and what have you where they are more of a means to an end – that end being potentially catchy shit. Even though the riffs still have an aggressive nature to them, they’re a lot more calculated towards a hyper melodic endpoint, which doesn’t allow them to just let it rip. Given how they’re lent towards a poppy structure, it is fucking amazing how they manage to take all this and totally nail it!\n\nYeah, they managed to take riffs that should be mostly dull and boring on their own terms, and twist and contort them into songs that are catchier than the flu during an aggressive flu season. The arrangements lend themselves to some serious build-up to these big fuck off choruses that especially work their way into your memory and won’t get out of your head like the Duck Tales theme song. Granted, the verses aren’t exactly filler or satellite characteristics of the songs – not when they’re so smoothly put together with the kind of gusto that make radio stations overplay the fuck out of your song. Listen to “The Air I Breathe”, bask in the delicious lead, the hectic solo and the uplifting chug, and then tell me that song’s verse is just for build-up. But really, it’s the choruses that seal the deal here. The juxtaposition of the double bass drums and Phil’s squeaky-clean vocals in “This Calling” create this weirdly compelling contrast that nevertheless makes quite a lasting impression. “Not Alone” has this bopping composition with this smooth groove and almost falsetto vocals booming out of your speakers. “Whispers (I Hear You)” give you this syrupy vocal performance with a real searing melody to make its impact with. “Empty Inside” ratchets things up with some real tremolo picking and shrieks that show that All That Remains can still rip and tear, as long as they keep it within some poppy confides.\n\nOf particular note are Phil’s vocals. I don’t know what came over him while recording this album, but his vocals are off the hook! He unleashes his yells, his screams, his grunts and his shrieks with the fury of a thousand suns. Yeah, he’s kinda barking into the mic at times, but then at other times, he’s tearing into the microphone with a righteous vigor. His screams get outright fucking vicious! With a ridiculously dynamic range to boot, Phil’s just about flailing all over the place. At times, like in “Not Alone” and “It Dwells in Me”, I swear he’s blaring right into the microphone. Yet, it’s all highly controlled – or at least, he has a good idea of what range or ranges to use in that moment. He knows to let out this melodeath-esque black metal-y shriek over this meloblack riff that kicks off “Six”, but the way he executes it gives that riff a more vicious quality. All from the vocals. This applies well across the board as his various vocal techniques give each riff – from the most flaccid core riff to the most stereotypical Pantera groove, and even the occasional inspired riff – a lot of that there extra bite.\n\nNot that you should be sleeping on his clean vocals, however, as they help to add some contrast in the choruses to the rougher verses and specially to assist the choruses in having that big feeling. There’s a lot to even the clean vocals, actually. Phil’s no Howard Jones or anything, but it’s more about the arrangements than the technique. But even the technique is basically like what he applies to his harsher vocals in that he’s got a good idea of how he wants to do it and executes it about how he wants to, but the amount of energy convicted by the execution flails about a bit. Where it’s absolutely controlled is during the chorus of “This Calling”, allowing for flawless melody making. Songs like “Whispers (I Hear You)” and “Not Alone” tend to have him overdo it at places, yet it only makes things even more memorable precisely because he overdoes it. There’s just a lot of these moments where the vocals help to elevate an album from “pretty good” to “fucking good”, and they’re found all throughout this album.\n\nThe only thing that gets in the way a little is “The Weak Willed”. It doesn’t totally stop the momentum, but it is a noticeable step down from the other songs because it isn’t nearly as catchy nor as well put together. I know I pointed out it’s got a more intense riff, but frankly, it only leads into a Pantera-esque groove that also just kinda does its own thing. Like, it’s appreciated and all that, but it doesn’t have that kick to it that the less riffy joints do, nor is it as effective as on “Six” and “Empty Inside” where they help to hook you in nice and good. I’m also aware I just basically slobbered all over Phil’s vocals, but there’s a bit of an asterisk there. Namely, his growls are just a teeny tiny bit shitty. It lacks the energy of his other vocal techniques and it lacks the conviction necessary to make it work even as just some brutal, gurgly growls. Instead, it sounds like somebody kind of making fun of those kind of vocals. He at least has the courtesy to only let about a quarter of the song be dominated by those vocals, but that on top of the middling death metal-y and groove metal riffs, as well as it happening in the middle of the album, does stop this album short of true excellence.\n\nYeah, excellence... from a radio-friendly metalcore band. Most of the time, you get bands in this scene like Lamb of God and Killswitch Engage who very much focus their attention on certain songs and the rest just don’t rock like those three or four do. Yet, All That Remains – the absolute fucking mad men – did it! Yeah, there are highlights, totally. “This Calling” is an explosive opener. “Not Alone” follows it up splendidly with its rapid-fire pacing and infectious chorus. “The Air I Breathe” – mmm yeah, those delicious melodies! “Six” masterfully mixes tremolos with core riffs – no wonder its inclusion in Guitar Hero 2 suckered many into their clutches. But the rest are absolutely not to be overlooked as they have many, many of the same characteristics that make those songs bang so much. Essentially, even with “The Weak Willed” which has its weaknesses, The Fall of Ideals is an entire album of bangers.\n",
        "\nThis Darkened Heart takes All That Remains’ debut album and adds some poppy sensibilities to its compositions. You still have those In Flames-esque dual harmonics, those hardcore-drenched At the Gates-y riffs, and Oli Herbert doing his best Paul Gilbert impersonation. However, they’re better developed here as the band – and US metalcore on the whole – has had time to properly mix that Converge fucked At the Gates sound into a smoother affectation. In fact, this is absolutely a milestone in the development of that New Wave of American Heavy Metal sound of the early-2000s, as it characterizes pretty much everything emblematic of its sound.\n\nSongs like “The Deepest Gray”, “Focus Shall Not Fail” and “For Salvation” integrate that pop metalcore structure of having harsh vocals for verses and clean vocals for choruses, although the cleans are quite understated compared to what Howard Jones was belting out the prior year with The End of Heartache. Ideally, they’re meant to be this clean, melancholic contrast to the more emotional harsh vocals. In execution, this only works because they add hooks to the songs through how they vocalize the lyrics. Otherwise, well, let’s just say that they’re way better on the next album. “Tattered on My Sleeve” adds an extra dimension to the clean vocals that wind up serving as a preview of this, as there’s a bit of a siren’s call to its execution. Although, this is a more noticeable contrast because Phil’s screams are more impactful here and quite good on their own terms. He integrates a couple extra ranges and adds some much-needed texture – and more importantly, emotion – to his default voice. As such, the vocal end of the proceedings is most certainly going to pique your interest and never leave your head. You’re welcome.\n\nBut the make it or break it moment comes with the instrumentation, and this is where I stop myself short of saying This Darkened Heart is some great amazing album. It’s got the kind of charm these formative albums have – like, some songs are unabashedly poppy like “The Deepest Gray” while songs like “And Death in My Arms” and “Tattered on My Sleeve” opt for that less poppy hardcore sound. For instance, “And Death in My Arms” may have those twin-guitar licks and leads endemic in In Flames’ sound and then break it down so the mosh pit can really go and fuck shit up. It’s a heavier joint with enough of those sugary sweet guitar theatrics – and of course, Oli letting it rip with a ripper of a solo. Although this album largely follows two similar formulae, the first four songs and “Tattered on My Sleeve” showcase these formulae to a goddamn tee with some infectious grooves, vocal melodies and guitar solos that just up and pop right on out of your speakers!\n\nThere is one song that deviates from the formula, and it’s the mid-album instrumental. “Regret Not” is an instrumental track which better shows off just how good Oli really is, with this contemplative acoustic passage building up to a melancholic groove before he bends and contorts his guitar like it’s doing a Cirque de Soleil routine before climaxing into a bit of a mournful solo, letting the listener breathe again once the acoustic comes back to end the song. If you’re going to do a mid-album instrumental, why not gun for something like this, you know?\n\nBeyond that, you get those moments that do stick in your head like a few of the choruses and some particularly engaging instrumentation. Said instrumentation is whenever Phil or Oli can construct something truly melodic instead of something vaguely melodic. The latter occurs too often – like, some riffs just end up going nowhere, or that part of the song doesn’t pop into mind nearly as easily as “The Deepest Gray”s and “For Salvation”s choruses or “I Die in Degrees” smooth groove. Like, going through “Focus Shall Not Fail” and “Passion” and all I get is “And Death in My Arms” and “The Deepest Gray”, but with weaker melodies. They don’t climax into catchy choruses, or memorable grooves or anything. As a result, the compositions end up more aimless than anything else. Shit, “For Salvation” is pretty much saved by its chorus since it’s instrumentally similar to “Vicious Betrayal” if “Vicious Betrayal” rounded off the edges of its riffs to a point where there’s no real pop or groove.\n\nIn defense of these other songs, they’re lively enough in composition to where they aren’t boring to listen to. But outside of any good moments, they go in one ear and out the other. The highlights are catchy and they’re the ones that really define the sound that we all know as the New Wave of American Heavy Metal. Hell, even the filler songs help as they maintain the sound; they’re simply not as well executed. Basically, when This Darkened Heart is on, it’s on like Donkey Kong. When not, it’s... aight. You know, more historically significant than anything else. But fuck me, those highlights are why it’s such an important album!\n",
        "\nAll That Remains is a melodeath-esque metalcore cum hard rocking metalcore band that has some chops lying underneath typical metalcore (and eventually just rock) compositions. Although very well-known for their poppier and more melodic affectations, their deubt, Behind Silence and Solitude, is kind of like that link between that old metalcore structure from the 90s, and that poppy metalcore sound characterized by Killswitch Engage’s End of Heartache. That one where the pop’s trying to burst out, where the band realizes what would propel them further into the mainstream and yet, they stubbornly stick to what worked before. So, what you end up with is a bunch of those harmonized In Flames leads and them At the Gates-esque and Dark Tranquility chords played under production that wants to be crunchy but sounds a bit too muted to properly come across that way.\n\nThe problem is that the songs all sound the same, and not in a good way. Not a whole lot differentiates each of the songs – like yeah, “Follow” has a breakdown with a solo playing over it, “Shading” kicking off its second half with some minor guitar theatrics and “Clarity”s intro laying those In Flames harmonics a bit thick. Otherwise, what you get in the titular track is what you get for the other seven songs. What you end up getting are some passable crunchy riffs filtered through a Gothenburg lens, Phil’s vocals monotonously going about their day in a rather hoarse manner, and some fucking sweet solos kicking off at just the right time to bring the songs back to life. Like, they’re not bad songs by any means, but past the solos and any particular standout moment (and I mean it when I say particular) lie songs that go in one ear and out the other.\n\nNow, you would think with the longer jams in “Clarity”, “Erase” and “Home to Me” that they’d put more of their all into it... and they do kinda, as these songs contain some more melodic guitar-work and some slightly ambitious instrumental segments that break up the monotony. A lot of it comes down to these jam session-esque breaks where the drums ease up a little from the double bass and everybody else quietens down while Oli Herbert shows off some cool little guitar techniques. It’s often said that Oli is out of place as a ridiculously talented guitarist in a band that doesn’t just let him let loose and have fun with it. Here, it definitely shows. This is especially the case with the closing act of the closer, “One Belief” – like shit man, did Jesper Stromblad and Yngwie Malmsteen just stumble into the recording session here or something? Christ, these harmonized solos fucking rock!\n\nBeyond that, you can safely file Behind Silence and Solitude under the “band’s first album” category. Riffs that try to manifest into melodic verses and choruses meander about, failing to be memorable in any way. I’d say that the latter half of the album is where they get more comfortable as they do more than just play third-rate melodeath riffs, but they aren’t much better. It doesn’t riff into a more memorable album as it goes – its more “experimental” moments are cute, but they don’t go full throttle there... nor do they go full throttle into melodicism, heaviness or anything. It’s an album that just is. They’d go on to write more melodic joints, which worked out well for them for the next two albums (but ONLY the next two albums), so this might come across as a curious little oddity in their discography. Frankly however, if this sound gets your goat going, go give Converge or Soilwork a listen instead.\n",
        "\nThe Fall of Ideals is the third studio album by metalcore band All That Remains. Consisting of Philip Labonte on vocals, Oli Herbert on lead guitar, Mike Martin on the rhythm guitar, Jeanne Sagan on bass guitar and Shannon Lucas on drums. It is the only All That Remains album to feature Shannon Lucas on drums and it is the first album to feature Jeanne Sagan on bass. The Fall Of Ideals was released on July 11, 2006 and was accompanied by the release of three music videos for the songs This Calling, Not Alone and The Air That I Breathe. \n\nStylistically All That Remains make it very clear from the start of the album with the intro track This Calling that their focus has shifted towards a a more prominent metacore sound which contains more clean vocals while sticking with the aggressive yet melodic tone set by the guitarists. You add that alongside the bands brutal screams as well as the frantic but focused drumming you get the brand new All That Remains. However for older fans this may be a harsh reality to accept as it will feel vastly different leaving behind the bands previous traditional melodic death metal sound of the past two albums, Behind Silence and Solitude and This Darkened Heart. \n\nWhile All That Remains introduce more clean vocals it doesn't make the album bad contrary to some of the metal communities beliefs. They fail to understand that it allowed the band to grow and express themselves in a more creative way. One of the ways All That Remains managed to grow and mature was allowing themselves to express deeper, more meaningful lyrics closer to the bands hearts which allowed them to create a more personal product. In the end the move seemed to have worked in the bands favour as they hit number 75 on the billboard 200 charts.\n\nWith any album released there are always going to be the few songs that manage to really stand out with each one of those tracks bringing something different to the table. All That Remains are no exception to this, Six, which was featured on the popular video game Guitar Hero 2, Whispers(I Hear You), Not Alone and Become The Catalyst. Starting off wth the track Six because I believe it is the best track off the album based on the fact that it simply manages to embody what metalcore is. It manages to show off a high tempo, soft clean vocals mixed with harsh low and high pitched screams as well. All of this is carried by the fantastic work of Shannon Lucas on the drums. However Lucas's abilities really manage to be on display with the bands heaviest track, Become The Catalyst. Now with the song Whispers(I Hear You) All That Remains to get to show off Phils clean vocals. The listeners are going to realize quickly that the clean side of the vocals are going to be just as important to the band as the screams, guitars and drums are because Phil manages to make you feel emotionally connected to his lyrics with his empowering voice.\n\nThere is a reason this album is regarded as one of the best of all time metalcore albums ever made. The Fall Of Ideals manage to join a very prestigious list of mid to late 2000s metalcore albums that helped shape the future of the genre. In conclusion this is a must listen to for any fan of the genre. I would also highly recommend newer fans of metalcore to checkout one of the older albums that helped shape the genre into what it is today. I firmly believe 95% is a very fair rating for this particular album.\n",
        "\nThis Darkened Heart is the second studio album by the heavy metal band All That Remains. This Darkened Heart was recorded by Philip Labonte(vocals), Mike Martin(guitar), Oli Herbert(electric and acoustic guitars), Matt Deis(bass guitar and piano), and Michael Bartlett(drums), the album was released on March 23, 2004. It includes the albums singles \"This Darkened Heart\", \"Tattered on My Sleeve\" and \"The Deepest Gray\", all songs had music videos created for them. The album was also seen lead guitarist of Killswitch Engage, Adam Dutkiewicz handle the duties of producer, engineer, and the mixing. \n\nIt is clear from the start of this album All That Remains are building on the success of their first studio album, Behind Silence And Solitude, with a vicious vengeance. \n\nOut of the gate they start off with a furious pace with the intro tack of And Death In My Arms, beginning with the a mellow intro that makes you doubt this is going to be a metal album, however that changes with the flick off a switch. The guitars come blasting out of the speakers with a very aggressive tempo, the drumming begins to blast into your ears, then the introduction of the violent scrams make it clear that this album is going to show what metalcore is all about.\n\nAnd Death In My Arms manages to set the pace and mood for the entire album. What follows is a myriad of songs. The album in its entirety is fantastic from start to finish. It defines what a metalcore album is. Aggressive guitars, blistering solos, mesmerizing clean vocals, brutal and heavy screams alongside drums that blast away. This Darkened Heart contains many standout tracks, wether it be fantastic lyrics, an amazing solo, steady drumming, or a brutal scream.The impressive thing to me is most of the albums songs include all of these elements. \n\nTwo songs in my opinion that embody what metalcore are off this album are the tracks Vicious Betrayal and Passion. These two songs are the perfect examples of what metalcore embodies. They contain meaningful but also painful lyrics that are perfectly balanced by both the clean and unclean vocals. Then you add melodic aspect of the blistering speed and solos coupled alongside the steady but hard hitting drumming. You get two songs are a must listen to, not just for fans of All That Remains but for any fan of metalcore.\n\nI do not want to to go into much detail as it hard to do this album justice it deserves with words, but take my word, you have to listen to it to truly respect and understand what All That Remains have created here. 95% is my final rating of this album and a very deserving rating in my opinion.\n",
        "\nLet's just cut the part where I tell you my history with All That Remains and just go straight to the part where I tell you I was 100% not expecting that opening track. I mean it was musically typical for metalcore with the chug riffs and \"panic chords\", I believe is what hardcore kids call the stuff the guitarist was throwing in on the leads, but I digress an unexpectedly savage opening for a band that's most notable music the last decade was no balls radio rock. So of course how do they follow up on that momentum? With ballad that couldn't be more cheesy and less interesting if it tried.\n\nThat's just how this album goes though. 'Fuck Love' as I already stated is actually a pretty hard hitting savage opening track. All gutturals and harsh vocal styles with no clean singing for the chorus, which despite being a chorus seems the intent was less to be catchy and more provide a chance to show off some pseudo gang shouts. Oh boy guys I'm getting not just a more classic All that Remains vibe here but am vaguely reminded of early metalcore pioneers such as Earth Crisis and Integrity. If I were to air some critique of this track its that it should have finished it at the 2:13 mark, where it actually sounds like it does end, like it hits total silence for a second or two, and then drags in a slow section with some weird hardly audible chanting before going into a completely unneeded breakdown, which sort of ruins the song which was total smooth sailing until they reached that ending where it seems like they were done and ready to hit the studio but then thought \"you know, one more breakdown and a held out fry scream couldn't hurt right?\".\n\nThat basically hits the whole album on the head though. There's a lot of genuinely hard hitting metalcore here, though sadly the thrashy riffs of their early career are replaced by more trendy chug riffs, but it still is some genuinely hard hitting stuff. Just about every time a song starts building a good momentum though it gets bulldozed by a poorly executed staple element of melodic metalcore, either a chrous that should have been excluded (and often feels more suited for a ballad) or a breakdown that just padded out the run time too long. The song 'Wasteland' for example was going pretty good until they suddenly threw in a chorus that sounded like they found it while dumpster diving in the trash can where Breaking Benjamin throws away any ideas that it thinks lacks testosterone. There's also a lot of ballads here and none of them are worth really getting into, except that they also were probably pulled from the same aforementioned dumpster dive that gave us the chorus for 'Wasteland'. 'I Meant What I Said' is a particular offender since you can clearly hear Phil's auto tune but it also pads out the run time with a breakdown and then a piano line that should have been cut off from the track and used as a standalone interlude instead, although to their credit it was at least a pretty piano line even if it was a worthless addition.\n\nSo we get this junker where its literally half sappy ballads and radio rock, and the other half seems to want desperately to prove its a total throwdown that punishes its listeners with face melting intensity and those two halves aren't separated out by track or else it might be forgivable. It's more accurate to say that each song started with a vague idea, maybe a riff they liked or a line they thought was genius and all these ideas were developed into long songs but without thinking \"is this gonna be a brutal cut or a nice ballad\" so basically every track bar the opener and a ballad halfway through try to do both in a sporadic on and off pattern. It doesn't work, it doesn't really portray a good hard/soft dynamic, it just sounds like bad writing. I'm looking at some metalcore material that might be worth a 70ish if they baked it a little longer, but any song with promise gets wrecked by something or other and theres nothing here, not a single track, that I consider to be worth returning to.\n",
        "\nDo you folks like auto tune? Blatantly obvious auto tune? No? Well, then go ahead and give this album a skip if you haven't heard it already and go put on The Fall of Ideals instead. Overcome is like the mass marketed pop washed version of The Fall of Ideals, which is telling when taking into consideration that The Fall of Ideals was already riding the rails of one metal's most commercial forms.\n\nThis may be a bit of a disingenuous description though, because The Fall of Ideals had some fast thrashy riffs, this has slower riffs all the way through and a softer guitar tone to boot. The Fall of Ideals has a couple tracks with scant traces of clean vocals, Overcome has tracks made almost solely of cleans topped with lousy auto tune. Overcome at least retained the double pedal though, if in more limited quantities. The album encapsulates all of the elements of The Fall of Ideals but pop washed, all except the very cornerstone of metalcore music. Where the hell are the breakdowns? They're not there, I can't decide if this is good or bad though, on the upside it'd give these tracks a much needed punch near the ends, on the other hand though, I don't want to hear those dumb clean vocals performed over a breakdown ala third wave metalcore style, because I've already heard Attack! Attack!, Asking Alexandria and the rest of their \"scene kid\" ilk and it was a traumatizing experience the first time around, and with how pop washed this album is, that's the exact kind of garbage maneuver I'd expect Phil to pull if their were breakdowns here.\n\nThe fact is though, with the exception of the radio single Six, no one was listening to All That Remains prior work to sing along with a badly auto tuned singer with a mediocre vocal range. Hell, the band put out two straight albums where singing along in any capacity would have been quite a feat prior to this. People were listening to All That Remains because it was hard hitting melodic death metal band with just enough hardcore influence to transition almost seemlessly into a hard hitting melodic metalcore band over the course of three albums.\n\nNow, to be fair, I used to be a fan of this album, the melodic edges on the guitar are quite nice, but its a bit absurd to hear songs that were clearly intended to be hard hitters like say Two Weeks, or really any of these songs and then be greeted with overly long melodic leads as the intro for basically every single track followed by the world's worst Adam Levine impersonation on the chorus and a squeaky clean production job with sterile guitar tones to boot.\n",
        "\nThere was once a time in my life when I could sit through The Fall of Ideals and love every bit of every song, back in my more juvenile days when I was riding the melodic death metal/melodic metalcore train loud and proud. Then a few years of tech death, slam, black metal and grindcore later I find myself revisiting the album as a whole and it's as if my whole world has changed.\n\nTo a less experienced metalhead this album might seem like it has it all. Fast relentless double pedal work, hard hitting thrash riffs and breakdowns. An album that also has melodic sensibilities and pays homage to the old school in its own way. The problem is, it's not all the eclectic. For all the different elements at play there's actually not much variety, do a heavy verse, add a sugary chorus, make sure to include your breakdown and guitar solo, then rinse and repeat. At this point it's basically a matter of deciding which tracks do it the best, and as far as that goes I find myself agreeing with the general fanbase, this album is loaded on the front end and becomes more and more uninteresting as it goes.\n\nThis Calling is undoubtedly the best song here in my mind. The double pedal work, the thrashy main riff, the breakdown all perfectly contrasted by the melodic break just before the breakdown and the general Iron Maiden-esque gallop on the chorus, even has a rather tasteful implementation of a pinch harmonic during the breakdown. Which gets followed by Not Alone, again a good track, but you can already see the band in decline, rehashing something they literally just did, but with a slightly weaker thrash riff and with out the melodic break that makes the breakdown sound so good. This then happens again, It Dwells in Me is the same concept, but with weaker parts, and then again in We Stand.\n\nAbout halfway through the band adds a track or two that are more ballad like in form, Whispers (I Hear You) and Six. The first is a doozy, it's not great, too cheesy, the second seems to be a fan favorite, but isn't all that notable in the grand scheme of things, besides that it's ending marks the beginning of the band continuing to push the same musical idea into the ground. By the time you reach track 9 The Air That I Breathe you've essentially listened to every riff and melody of any value on the album, burn the band continues on for another 3 tracks ending with what I assume was intended to be one last glorious hoorah with Indictment. Which comes out flat, it drops the clean sung chorus and some of the gallops for what I assume was intended to be a hard hitting song for pure carnage sake, which would be all fine and dandy except there's not a memorable piece of music to it and that it still is dripping with melodic sugar in several parts of the song.\n\nAll That Remains, while it's line up is a revolving door of members around Phil Labonte has brought talented and skilled musicians to the table on multiple occasions, and it does show, specifically on the early tracks. They're not all talented mind you, Phil man himself is a pretty cookie cutter metalcore vocalist, sans that he has deeper a less feminine clean singing voice.\n",
        "\nAll That Remains has always come across as a rather second or third tier band, peddling a most generic form of metalcore. However their first album Behind Silence And Solitude was not a generic metalcore album but rather a more traditional and generic melodic death metal album.\n\nThe major point of difference between this and latter albums is the lack of clean vocals. This a good thing as once All That Remains adopted clean vocals on later albums, they did so in the most clichéd manner possible.\n\nOverall the music is reasonably well performed and rather accessible to anyone that is a fan of bands such as Arch Enemy or earlier In Flames and Soilwork. The album actually picks up in quality on the second half with a few more energetic and interesting songs. \n\nThe riffs and solos are satisfying if not exceptional and for the most instance predictable. Philip Labonte also delivers a pretty good vocal performance. The short album length (under 40 minutes) keeps the album from getting too boring.\n\nPerhaps the most exceptional point is that the band actually manages to keep the songs varied. Not many debut albums manage this, especially in more extreme genres. \n\nBare in mind that by the time this album was released, melodic death metal had reached the point of over-saturation and was artistically bankrupt. Also Philip and company don't seem to have ever had the talent to create something truly unique or even something truly enjoyable at a generic level.\n\nAs such the album could be regarded as good yet completely redundant. There are more interesting melodic death metal albums out there. Behind Silence And Solitude is perhaps best viewed as something to listen to for a change when one is in the mood for melodic death metal but the old favourites aren't appealing.\n",
        "\nMassachusetts: home to Killswitch Engage, Unearth, Shadows Fall, Overcast and the more chaotic Converge: also known as some of the most successful metalcore bands in the metal scene. All the aforementioned artists seem to go from strength to strength with each album, however since 2006, fellow neighbourino’s All That Remains seemed to have strayed from their solid metalcore anthems such as This Calling and The Air That I Breathe and have instead taken (a) to the gym and (b) a more outspoken attitude to the meaning behind their newly watered down music. Recently singer Phil Labaonte has publicly made a point that he does not mince his words: “When it comes to rubbing people the wrong way, I don’t care who I offend”; and has a strong outlook on opponent topics such as politics, war and general apathy which is most evident in 2012’s tepid A War You Cannot Win. With all this built up aggression and defiance plus the addition of Josh Wilbur behind production (Gojira, Lamb Of God) for new album The Order Of Things, what could go wrong? \n\nAh… The album starts more with a pop than a bang… Immediately noticeable is Labaonte’s vocal work: the song is entirely cleanly sung and the dramatic buildup has zero effect. The clean vocals are a prominent feature of the album. Whilst it does bring in a sense of clarity it does overshadow the rest of the music in a negative way. The title of the first track (This Probably Won’t End Well) is actually decent summation of the album really…\n\nAll That Remains continue to use their approach of unity and self belief. These topics can be interesting and spark conflict in conversation however when sung in the wimpy way Labaonte sings the lyrics, it takes away the seriousness of what is invoked. Therefore someone farting the rhythm to Megadeth’s A Tout Le Monde would make a better ballad than the abysmally cheesy For You; and lyrics like “Remember what made us great/I am forever grateful for your hand to make me this way” (The Greatest Generation) follow the same mundane message of: You’re-a-strong-person-promise-me-you’ll-never-forget-that?\n\nThere are good aspects to this album however. All That Remains throw in a couple of surprises such as the addition of female backing vocals in Divide, even if it does make the singing even weaker than it already is… Josh Wilbur calibrates all the elements of precision within traditional metalcore into this record to make the overall production of the record its strongest point. Lead guitarist, Oli Herbert and, drummer, Jason Costa’s abilities are put in the spotlight in tracks such Bite My Tongue and Victory Lap. Hell, Labaonte even does a scream in Fiat Empire that would fit perfectly in 2006’s career best The Fall Of Ideals. \n\nFor a heavy metal album, there are only 2 ‘heavy songs’: Tru-Kvlt-Metal and the slightly somber No Knock. These songs just about save the album being laughable however the former track might be a genuinely good tune if it wasn’t so ironic for them to sing about not wanting to conform and it end up summarizing everything musically commercial and melodic that was released within the past 5 years…\n",
        "\nThe newest album in All That Remains catalog, The Order of Things, is a step in the right direction. However it's far from being perfect, let alone great or good. I'll start out with statement: This album is a less memorable re-hash of Fall of Ideals and Overcome. If you like All That Remains older efforts, then rejoice! (kinda). One thing for sure is, it's much better than their last album, so I'll definitely take it. \n\nFirst, some pros this album has, which isn't very many, is that some of the guitar solos on The Order of Things are actually pretty good and gave a few of the songs potential (i.e Criticism and Realization). Phil has started to incorporate both of his singing styles in songs more so this is also a plus for me. One can only imagine him getting annoyed by such an opinion, though. Lastly, the some of acoustic guitar passages put a nice touch on a few songs, which sadly this album lacks a lot of \"nice touches\".\n\nNow onto the cons, a small margin of the songs just get pure sloppy and start sounding like a wall of noise (i.e the verses This Probably Wont End Well, heh.) Another glaring issue for me, is that there is about zero originality in this album like I stated in my opening paragraph. Even though lack of originality isn't necessarily a \"bad thing\", it just comes of as playing it safe and I'd like to see more creativity come from a once good band. The song \"Tru-Kvlt-Metal\" in itself is a con, and was more or less simply written just so Phil could shut up the \"haters\". Yay, thanks for the cringe, Phil. Please write less songs like this and go back to making songs with catchy choruses again.\n\nAll in all, The Order of Things is a textbook definition of mediocre. At the end of the day Did Phil shut up his haters? No, most likely not, but this album is a step back in the right direction and gave All That Remains potential to make good music again.\n",
        "\nA War You Cannot Win was quite simply shit. It can't be analysed any further than that, the whole album was just terrible. And to be honest that's what All That Remains seem to be as a whole, just another metalcore band that border closer to emo than metal. Not my cup of tea, although admittedly some of the stuff that they've churned out does impress me to some degree (a guilty pleasure, you might say). And so I've decided to check out their latest effort, The Order of Things. The name might seem a little lacklustre, but there are some good things to be found here.\n\nFirst off, I've always been a fan of melodic sections. Doesn't matter whether the band is playing black metal, metalcore, heavy metal or any other sub-genre of metal (or even if it isn't metal), if there are nice leads then I'll be able to appreciate it. All That Remains have that part of their band nailed very well, and every song has at least one bit with epic hooks in it, even the deathcore-styled No Knock. I'm actually quite impressed with a lot of it, and I'm slightly surprised to say that they're actually doing a far better job than many new melodeath bands that are popping up.\n\nThe drumming surprises me in quite a good way as well, because I've always thought of All That Remains as just another band with average level of drumming. That isn't the case here at least, and while most of the stuff that is played is fairly basic the blast beats are strangely rhythmical, coming in sets of three or four at a time but always equally distanced apart. Everything played on the kit also seems to work itself together very nicely and it fits the rest of the band equally as well.\n\nI'm not such a big fan of the vocals, and although I can tell that Philip Labonte is a decent singer, I don't particularly like the way that he does his job. He reminds me too much of so many other whiney metalcore/emo singers, especially because of the soppy lyrics that he's singing. Granted, I'd rather he sang than growled, most of the growls actually falling more in line with angry shouts or screams in a typical metalcore fashion. The backing vocals don't really help the cause either and just add another layer of screams or whines.\n\nNormally the amount of chugging that's coming from the guitars here would put me off majorly, but something about the way that All That Remains perform them makes me actually not mind them at all. I'd still rather that they didn't involve chugs, but they're easily bearable here. Maybe it's because the leads tend to feature over the top of the chugs, but I can't say for sure. There are a few annoyingly noticeable breakdowns that get in the way, but they're less of a problem than I'd feared that they would be.\n\nAbout the song Tru-Kvlt-Metal though. That song deserves a special mention for being a complete facepalm moment. It's intended to be a joke aimed at the elitists that only listen to stuff that's 'trv' or 'kvlt', which I'd completely agree with if it wasn't for the fact that this song happens to be the worst song on the entire album. It's the kind of thing that I had momentarily believed that they'd left behind on A War You Cannot Win. Plus there's the fact that the band completely ruins the point that they're trying to get across about metal not needing to be brutal or whatever by making this song one of the heaviest on the album. Well done guys.\n\nOther than a few minor issues though I find that The Order of Things is actually pretty solid. They've surprised me given the nature of their last release, and to be honest they'll probably surprise you too. Maybe not everyone's cup of tea, but I found this album to be rather enjoyable.\n",
        "\nIn 1998, singer Phil Labonte was kicked out of Shadows Fall. Immediately afterwards, he formed All That Remains. In 1999, they released a 3 song demo containing Follow, Shading, and Erase. 3 years later, they came out with this, their debut full length. The songs appear in almost the same form as they did on the All That Remains demo, with slightly better production. When I first decided to try to check out older All That Remains, I didn't really know what to expect, having only previously listened to ...for We Are Many and The Fall of Ideals. What I heard was surprisingly similar to the Shadows Falls monster debut Somber Eyes To The Sky.\n\nFirst off, all the vocals that you will hear on this album are from Phil Labonte. However, I feel that he took a step down from Somber Eyes To The Sky.. In that album, he was doing all sorts of growls and screams, and even some clean singing. Here, the majority of the albums vocals are very similar; he plays it safe, which is not a bad thing necessarily, although Adam D's production on some of his death growls (hint Follow) still sounds breathy, similar to how Matt Bachand's death growls on Somber Eyes To The Sky sounded. The guitar solos, however, are a drastic improvement and change from Somber Eyes To The Sky. While they still aren't the speedy shredding that Oli Herbert demonstrates on later albums, they are very classical and similar to some of the Gothenburg guitar solos heard in Slaughter of the Soul.\n\nOne thing that differs and makes this album a lot different from later work is the tuning of the guitars. Throughout the majority of their recording career, All That Remains has played their guitars in C# or D tuning. This album is played in B tuning, and with the very At The Gates style riffing on the lower strings, this album sounds much different from their later work. Also, the clear and obvious sound of the Marshall JCM800 is very prevalent, as the palm muted lower notes don't sound \"clicky\" so to speak, as they sound with the Peavey 6505 and EVH 5150s that they have used in later albums. Overall, while this album is much different, it sounds spectacular, and frankly shocking, compared to later All That Remains albums. Go out and buy it, enjoy. Every track on the album, while different, sounds great, but my favorite track is the opener, Behind Silence and Solitude.\n",
        "\nIt’s really sad what happened to All That Remains. We are far, far away from their glorious beginnings with \"Behind Silence and Solitude\" and its exquisite brand of melodic death metal, or even their metalcore albums, as since they released “Overcome” the band started to sink deeper, and deeper… and deeper until they hit rock bottom, with this “A War You Cannot Win”. I’m always in favor of bands exploring new musical grounds and experimenting with their sound, but not when that means to shit on everything you’ve done before and become a poor rock band with down-tuned guitars and screams. There are so many regressions in this album that I don’t even know where to start from, but oh well, let’s begin. \n\nLet’s start with Mr. Labonte. What can I say? We can find all kinds of things, so let’s go for the lyrics. First of all, ATR never was a poetical spring of lyricism, but at the moment of reading the lyrics of the new songs we can realize the seriousness of the matter. He attempts to sound revolutionary and defying (Stand Up, A Call to All Non-Believers, Sing for Liberty), there are cheesy love songs (Asking Too Much, What If I Was Nothing) and others where he tries to be philosophical about life (Just Moments in Time). The following verse is the chorus extracted from “Asking Too Much”:\n\nI know I’m asking too much\nAnd you’re not coming back again \nI know I’m asking too much\nAnd you’ll never be mine again\nI’m not gonna find you outside of my door\nBut damn I wanna let you in…\n\nOr “Not Fading”:\n\nI can still feel you, it’s not fading\nMy heart is always with you\nAnd if you’re lonely, wondering about me\nCall out my name\n\nLabonte is almost 40 years, and he comes up with this? This is what a 13-year-old would write after breaking up with her boyfriend of two weeks. His voice is quite degraded too. The songs have this screamed verse-clean chorus format, and the choruses turn out to be really annoying. Labonte’s voice is overproduced and overflows with autotune. I have nothing against clean singing, but the vocals in this album sound totally devoid of feeling. I cannot stand his voice in songs like “Down Thorugh the Ages” or “Stand Up”.\n\nThe instrumental part of the band is also lame. The guitars show no musical variation whatsoever. The songs are all made of your average Gothenburg riff which repeats throughout the whole song. For example, the riffs from “Down Through the Ages” and “You Can’t Fill My Shadow” are both the same, only with minimum variations and interchanged notes, the solo of the former even includes the main riff as part of it; and if it wasn’t enough don’t forget about your mandatory and dull breakdowns. “You Can’t Fill My Shadow” goes into a really bad groovy/breakdown-ish break at the end that is completely insipid. The leads have regressed a lot too. It seems that the guitar solos have become more of a filling resource or an obligatory element of it rather than being an instrumental passage to show the musician’s musical skills or have the intention to delight the listener with nice instrumental demonstrations, as most of the leads here are rather short, uninspired and quite simple and straight-forward, result of the musical stagnation that the guitar duo has been suffering since “Overcome”. Songs like “Asking Too Much” or “Not Fading” evidence poor and (I don’t like using this word but it’s the one that describes it best) poppy song structures aimed to wider audiences. The only decent track here is the instrumental (curious, huh? the only track where Labonte doesn’t sing) “Calculating Loneliness” which is an acoustic interlude that is quite well executed. I’m still waiting for Oli Herbert to leave this dead band and start investing his talent anywhere else. Jeanne Sagan doesn’t contribute something interesting either. His bass playing is mediocre at best, only in songs like “What If I Was Nothing” or “Not Fading” some different lines can be heard, but it’s of no use when the compositions are so shallow and simple. \n\nIf there is ONE, and only one thing to highlight about this album is the impeccable (as always) work of Adam Dutkiewicz producing and engineering the album, as every instrument can be clearly heard and everything is well balanced. But then again, this is completely useless when the musicians play the same thing over and over again with no variation at all. The only dude that nailed it, and hell, is not even a member of the band! That’s why it get’s 10%.\n\nHonestly I saw it coming, everyone did, but though I didn’t like “…For We Are Many”, it still retained a bit of the band’s… “metallic” aspect. However, as I said at the beginning of this review, they hit rock bottom with this album, a record completely devoid of emotion, ideas and feeling. I still can’t understand what made them go in this direction. Was it their current label? Was it money? Lack of ideas? A combination of all three? I don’t fucking know, but what I do know is that this was one of 2012 worst musical aberrations. It irritates me so much, as I really enjoyed their first albums, and even a part of Overcome, and watching them release this big, huge pile of musical crap fucking annoys me. Sorry All That Remains, you lost. Avoid at all costs. \n\nOriginally submitted to http://theforlornson.wordpress.com/\n",
        "\nFor most of my time as an ardent metal addict, I've continued to mull over exactly what it is about metalcore that makes it extremely difficult to get into. It draws much of its noteworthy influence from styles that I've found myself liking, notably the late 90s Gothenburg sound and a melodic strain of hardcore that isn't exactly the worst thing to come out of the New York and New England scene. Even though I found myself being instantly repelled by most of what In Flames and Soilwork put out after 2001, it never quite dawned on me exactly what was leaving me in a state of utter boredom. Upon first hearing All That Remains' 3rd LP \"The Fall Of Ideals\" it suddenly hit me why nearly every band that plays this style tends to sound exactly alike and not to my liking.\n\nLong story short, All That Remains is a niche band, and functions completely on a particular formula that eschews any sense of organic ordering or stylistic evolution. It's a bit less obvious on early albums where the sound they seek to achieve had at least some semblance of freshness, and on certain later albums by other bands where elements of 80s Metallica were being introduced to try to vary things a bit (with minimal success), but the punishingly orthodox character of this album hits like a ton of bricks. The most utterly predictable snippet melodic guitar hooks and chug-a-lug chugger riffs, played within the confines of a songwriting formula that isn't all that far from overt pop/rock radio fodder, trade blows with a grab bag mixture of clean, gruff, and gutteral vocalizations that is equally conformed to the same vapid symmetry, resulting in something that's about as involved as In Flames' \"Reroute To Remain\" but minus the industrial keyboard additives.\n\nAs with most songs in this style, the best songs are front-loaded onto the album like a severe case of premature ejaculation. \"This Calling\" essentially leads off with a violent thrash riff that gets itself tripped up on overuse of gallop rhythms, but generally doesn't relent apart from the chorus section where things enter overt Iron Maiden rip-off territory. One thing I will say in Philip Labonte is that his clean vocal work is not nearly as gimped and boyish as Matt Heafy's and a number of others in the same field, and he does do a recently compatent job as switching between vocal characters. \"Not Alone\" follows in the usual approach by attempting to fool the listener with a odd timed melodic intro before essentially kicking into a slightly slower and less thrashing version of what just preceded it, already exposing the artificially imposed limits of this style and its consequential drudgery. From here on in, the formula becomes more and more contrived as the same idea wears thin, thus every song sounds incrementally worse. Some sugary lead guitar lines that rival some of the technical work of European power metal bands and some slightly darker vocal work comes into play later to try and compensate, but comes off as sleek window-dressing adorning a misshapen window with rusted bars.\n\nEvery style of music has its generic adherents whom inspire little more than boredom in those with limited time to devote and standards to cling to, but metalcore has the unique disposition of amassing more of them than any other style on the melodic side of the spectrum. Rather than showcasing a passion for their craft by taking on the individuality of an actual craftsman, this band and much of their ilk simply churn out similar products in an assembly line fashion. It works for cars, but it doesn't work for music, and simply giving one model a nice cigarette lighter or a slightly different shade of blue paint won't change that. The metalcore phenomenon could actually be likened to a literal fall of metal ideals, though thankfully it didn't engulf most of the metal scene the way groove metal did in the early 90s, and will hopefully continue to decline in influence as the next fly-by-night fad comes to replace it.\n",
        "\nAll That Remains used to be a meat and potatoes metalcore band that even made the archetype of the catchy-and-heavy metalcore song, \"This Calling\". Good stuff, but when meat and potatoes are overcooked, the potatoes get mushy and the meat gets tough - it's hard to say that their last few albums have been anything but overcooked, and songs like \"What if I was Nothing\" and \"Not Fading\" are nothing but mushy, kind of like cold french fries that never really had the hard crust that gave them texture. Two albums prior to this, on Overcome, the rhythm playing was chunky, but it was starting to give the feeling that it was more a result of the meat grinder being broken than being an inherent upside of the style. \n\nThere's still a fair amount of metalcore riffing, double bass, and growled vocals, but it's not very good. They replicate the feeling of listening to a Van Halen song while waiting for the guitar solo, or listening to deathcore and waiting for the breakdown - it's just kind of there to frame the highlight if you're not infatuated with it. The highlights here are choruses led by vocal melodies that are lamer than a Poison ballad amidst thrash metal. All of these lead vocal parts are what you've heard about whenever you've heard anyone make fun of this band. It's just embarassing when there's a contrast of super-chunky chugging and intense shouting in \"A Call to All Non-Believers\" alternating with the wussiest chorus I've ever heard - it sounds like Phil Labonte isn't even trying here. \n\nDespite the music being bad, Oli Herbert is the highlight of this record with his lead guitar work, not just comparatively good, but genuinely interesting and enjoyable. \n\nAll That Remains made a record around radio-friendly choruses with uninteresting and forgettable hooks. They also made a video for \"Stand Up\" that looks like the dreams of a teenager who plays Call of Duty all day - watch that and you'll earn the right to make fun of them in four minutes.\n",
        "\nBack in 2006, the American metalcore scene continued to reach new heights. As I Lay Dying had just released “Shadows are Security” the year earlier, Killswitch Engage released “As Daylight Dies” and All That Remains released “The Fall of Ideals,” which continues to be one of my favorite albums of the genre. \n\nNow, in early 2013, As I Lay Dying continues to release very strong albums and Killswitch Engage hopefully can come back from a near four year hiatus with a new album featuring original singer Jesse Leach. Unfortunately, All That Remains seems to be the most hopeless out of these three. After recovering slightly from a disappointing “Overcome” with “For We Are Many,” I had hoped that All That Remains would continue to become heavier again. While this album is definitely the heaviest since they hit their prime in some respects, it is ultimately brought down by increasingly pervasive pop-rock elements that make me think at times that I am listening to a Daughtry album. \n\nFirst, I should qualify the positive elements of the album. The biggest plus is that Oli Herbert has more and longer guitar solos than in past efforts. While all the musicians in All That Remains are too talented to be playing in what the band has become, I have always thought Herbert was the best musician in the bunch and it’s good to see him get even more play in the music. Some of the riffs on the album are actually the heaviest All That Remains has written since “This Darkened Heart,” and songs like “Down through the Ages,” “Just Moments in Time” and “Sing for Liberty” give me some hope that All That Remains still has some metal chops in them. \n\nUltimately however, the album is weighed down by disappointing singing and a softening, pop element that has been forced to the forefront of the band’s efforts since “Overcome.” For the record, I am not against big choruses and clean singing in metalcore. Bands like The Sorrow and Times of Grace show that singers with powerful voices can blend harsh and clean vocals seamlessly and effectively. Phil Labonte is not one of these singers. While Labonte has pretty good harsh vocals, his clean vocals were better left to short choruses. Unfortunately, Labonte continues to write songs that feature predominantly or solely clean vocals. If it wasn't bad enough to suffer through the painful exercise of listening to his clean vocalizations for five minutes at a time, some of the songs on this album can’t even be remotely considered metal. Songs like “Not Fading” and “Asking Too Much” are borderline metal but ultimately feel like if Daughtry or some other radio rock group sped up their riffs and tossed in a guitar solo. Then there are songs like “What if I Was Nothing?” I am honestly not sure how a band that identifies as a metal band can write a song like this. It sounds like a ballad from Bon Jovi or Cinderella album, which is even less acceptable now than it was in the 80’s. The problem is that it’s not just one song. If it were just “What if I Was Nothing?” I would say that it was an aberration, but songs like “Stand Up” (which tries to have a rock anthem feel) just fall flat because of a sub-par and overly soft approach. This problem ultimately brings down the whole album and crushes a lot of songs that could have been solid in a sense of mediocrity. \n\nThis is possibly what makes “A War You Cannot Win” so painful to listen to. It has moments that feel like All That Remains can become a great metalcore band again, but those moments are ultimately fleeting. Like fans of many metalcore bands that have become more pop-oriented in their approach over the years, All That Remains fans are split over whether they should denounce the band entirely or continue to support the music no matter what. While I hold nothing against those who legitimately enjoy the band’s current sound and think it would be silly to write off the band’s past accomplishments, it would also be wrong as a fan to tolerate substandard efforts like “A War You Cannot Win” and pretend like everything is alright with the band’s sound.\n",
        "\nAll That Remains have existed since before the turn of the century. They've been around since before either of my little brothers were born. They were there at the start of the metalcore explosion alongside genre luminaries such as Killswitch Engage and Shadows Fall. In their fourteen year existence, one would assume that over time they've honed their sound, tweaking and perfecting it until they can be considered nothing less than a force to be reckoned with in the world of metalcore and metal at large. Well a force certainly comes to oneself through listening to All That Remains, said force being the pushing on one's gut as he runs to the toilet to be ill. Almost a decade and a half and they're still pumping out this garbage. At least their earlier material sounded kinda interesting, if still quite run of the mill (save some stuff on The Fall of Ideals, which actually sounded *gasp* genuine!). A War You Cannot Win, the sixth release by this band, is so blatantly-appealing-to-the-lowest-common-musical-denominator that it's not even funny. It's damn near 2013, people; why are the masses still buying into this shit?\n\nI'll tell you why, good sirs and dames. It's because All That Remains have perfected the musical model of \"make every song sound pretty much the same sonic and structure-wise, but have a couple songs be more pop and radio rock influenced so that they'll be played on the radio\". A War You Cannot Win especially exploits this model, as the radio friendly songs are more radio friendly than ever. This is due to a mixture of both more clean vocals and dumbing down the songwriting even more than they had on For We Are Many. Combine that with the fact that the general musical audience of this generation just eats up whatever overproduced, made-for-the-masses schlock they are handed, and you've got a record that'll appease all those that lack good taste in music. Tracks such as Stand Up feel like they belong in the live setting of a shitty hard rock tour like rather than on a purportedly metal album, while a song like Asking Too Much would not sound out of place on a Paramore album. I am not engaging in egregious hyperbole with that either; the song sounds like slightly more Swedish Paramore with male vocals. It's blatant pop rock and is nigh-unlistenable, and I actually enjoy Paramore! The heavier tracks are no less creatively bankrupt than the lighter tracks, as these too run through the proverbial motions by way of the overdone Gothenburg based riffing that's been a staple of ATR's style from day one. Would it really kill All That Remains to add just a little bit of variety into their sound? Hell, would it be so hard to sound like they actually give a crap? Just fake it if you have to; it works often enough in porn.\n\nPerformance wise the instrumentalists are sufficient, although they don't have much to work with. Oli Herbert's few leads on the record are good enough, but he's wasted talent here since there's not a whole lot for him to do aside from play the aforementioned generic Swedish riffing. Jason Costa is much the same, although since being the drummer allows for a bit more creative freedom with what you can put down in the studio, he's easily the best performer on the album. However, as mentioned with Oli, he doesn't have a whole lot to work with here, making him yet another great talent in a crap band. Mike Martin holds down the fort well enough on rhythm guitar, but he doesn't really stand out much here beyond that. Jeanne Sagan's bass is nonexistent, as has become the thing in modern rock and metal album production, therefore there's nothing to comment on with that aspect of the instrumentation. That brings us to one Phillip Labonte, vocalist and crazy loudmouth who seems to have made it his mission in life to out-insane Dave Mustaine (just read his Facebook posts about how the solution to gun violence is to give EVERYONE guns if you don't believe me). As with every other ATR record, he uses a variety of vocal styles, among them mid-ranged shouting, low death growling, high shrieking (those last two aren't used on this album that much), and crooning, strained sounding clean singing. There's quite a bit more clean singing on this record compared to past albums by the band, with a number of songs consisting entirely of clean vocals. Trust me when I say his clean singing gets grating after a while. Hell, I got sick of them within 3 minutes of first hearing Stand Up while driving to my attorney's office a few weeks ago.\n\nIt's kind of sad to see what's become of All That Remains. At one point they were among the better bands of the New England metalcore scene, namely around the time of The Fall of Ideals. Since then, however, they seem to have fallen into a deep, deep, DEEP rut that they cannot possibly get back out of. The fact that there are actual people spending actual dollars for this stuff is just disheartening when you think of all the bands that get no recognition that have poured their souls into the music they have created. It's even more completely pathetic that they've had almost 15 years to hone their craft, and they've merely resigned themselves to making dumbed down, consumer friendly crap such as A War You Cannot Win. It's like the musical equivalent of when Kevin Smith made Cop Out, only All That Remains only had one genuinely good record to their name and therefore had very little to live up to aside from a legacy of poor music, lack of passion, and legions of people willing to scarf this stuff down. It is completely possible to have a mainstream, radio friendly sound and not be so goddamn boring and lifeless that you wonder if actual people could have made something like this. All That Remains just refuse to both get with the times and give a shit to make something worth listening to.\n\nP.S. Why in the world is the track labeled \"Intro\" the sixth track on the album? Sense this does not make.\n",
        "\nMy god, I don't know why I keep doing this to myself. I realize it isn't productive at this point, everybody knows that I don't like All That Remains. Everybody knows that I wish Phil Labonte would shut his goddamn mouthflaps, that Oli Herbert would join a band that doesn't suck, that somebody in the band would have a musical idea more radical than \"Let's just do This Darkened Heart again, except let's get slightly poppier again and keep ripping off Strung Out and hope nobody notices\". I've said all this three times now, and a fourth review really shouldn't even be necessary. But goddammit yes it is. If All That Remains is going to keep on releasing crappy, derivative, poppy metalcore-lite, then I'm going to keep telling everybody how much they suck. I didn't even know they had a new album until roughly an hour before I started writing this review, believe me when I say I couldn't care less about the band if I tried. I don't sit here all hawkeyed waiting for another opportunity to poke at these guys with a stick, they just keep coming back for more, each time with less effort than before. And with the least amount of effort displayed so far, here we have their sixth album, A War You Cannot Win. They're like the musical equivalent of the Toronto Maple Leafs. Nobody likes them except for their niche little home crowd, and they consistently suck.\n\nAll the problems from the previous three albums are still here, and unironically this is the third straight album with this lineup. This is not a coincidence. They have been using the same five brains to write the same songs with the same problems and they are showing absolutely no signs of reversing the trend. These riffs are the same dry, poppy melodeath inspired garbage that they've been spoonfeeding us since 2006. The sad thing is that The Fall of Ideals is actually my favorite All That Remains album, and it still kinda sucks. I mean, This Darkened Heart was... okay I guess. It was really samey and dull overall but it was catchy and \"The Deepest Gray\" is one of the first metalcore songs I heard that I actually liked all the way back in 04, but since then they've just given up on being creative in any way. The Fall of Ideals is just as samey as anything before or after it, but it's the most focused and most infectious of all of their albums, whereas Overcome and ...For We Are Many just plodded through inconsequentially. A War You Cannot Win has once again just kinda happened, with nothing helping it stand out amongst the rest of their material.\n\nThis is the biggest problem with any given All That Remains album, the songs within the album are all very similar and are structured and executed identically. If there's anything at all that's different about this newest album, it's that there are more clean vocals by volume than any other album. The choruses are all cleanly sung still, but now more of the verses are as well and the cliched layering of cleans over screams are more prevalent as well. But that alone doesn't really help it stand out at all because every fucking song sounds like the song before it. This is impressive because this is an entirely valid complaint and somehow there are still some notable differences, like \"You Can't Fill My Shadow\" is rather breakdown heavy whereas \"Stand Up\" is a light, pop metal attempt at an anthem and \"What if I was Nothing?\" is essentially just another cover of Nevermore's \"Believe in Nothing\". In fact, a good portion of the tracks here sound like they could be the slower, more radio-friendly Nevermore tracks like the aforementioned \"Believe in Nothing\" or \"The Heart Collector\". And I have to point out I really like \"The Heart Collector\". I think it's one of the best modern radio-tailored pseudo-power ballady metal songs written in the 00s, but dull regurgitations of it just end up sounding like \"Believe in Nothing\", which is a plodding and boring song that sounded like it took as much time to play as it did to write. All That Remains here gives us \"What if I Was Nothing?\", \"A Call to All Non-Believers\", \"Asking Too Much\" and others in this style and it's just dull and shitty and not interesting at all.\n\nOh yes, I've spent the last paragraph comparing them to a poppier and more boring Nevermore, but readers of my last ATR review should remember that I chided them mercilessly for ripping off Strung Out so egregiously. Well that hasn't changed either, (I mean look at their goddamn logo now, at least they're being more upfront about it nowadays) as Phil's vocals sound so much like Jason Cruz's nowadays that the last couple albums may as well have been titled Exiled in Oblivion and Blackhawks Over Los Angeles. The less metal elements are becoming more and more prevalent, whereas it's been the opposite with Strung Out, who started as a punk band. Blackhawks Over Los Angeles is basically just a much, much better version of Fall of Ideals, and I urge fans of All That Remains to listen to pretty much any Strung Out records from The Element of Sonic Defiance onwards. You'll see the similarity and the veritable canyonesque gap in quality between the two. They're obviously a huge influence on All That Remains and it's gotten to the point where it's gone beyond influence, and even beyond aping, they're straight up cloning themselves at this point. The light melodeath riffing, the poppy clean vocals and choruses, the only real glaring difference is that Strung Out seems to stick to less optimistic lyrical themes. \n\nYou all knew what this album would sound like, you all knew what the problems would be, but that doesn't excuse A War You Cannot Win from sounding the way it does and having the problems it has. They try less and less with each successive record, and somehow they keep charting. All That Remains fans, I legitimately do not understand you. Never changing your core sound is fine (I'm a raging Vader fan), but never getting creative within your songs, never trying to put a new twist on anything, never even sounding passionate for what you're doing? That's inexcusable and lazy, and that's what makes this so deplorable. It's bad enough that it's dull and boring AND bad all at the same time, but the fact that this is the sixth time we've been given such a product from this band is just absurd and actually makes me hate it even more than I would if this were a different band. The best part about A War You Cannot Win is that when it's over, the new Allegaeon album starts playing on my iTunes. All That Remains, please stop. If anybody claims to be impressed by this new album, dangle some keys in front of their face and see if they freeze up in glee.\n\n\nOriginally written for http://lairofthebastard.blogspot.com/\n",
        "\nI'm pretty sure we all can agree that the fundamental flaw in metalcore is that pretty much every band sounds the same. As I Lay Dying, Killswitch Engage, All that Remains, they all sound like variants of the same template; up tempo Gothenburg riffs, vocalists that pull every hat trick out of their asses, mechanical production, cliche triplet, quadruplet, sextuplet riffs, and breakdowns that sound like they're ripped straight from Far Beyond Driven and Vulgar Display of Power. All in all, this album isn't terrible, it just lacks the cohesion and originality for me to give it an \"A\". \n\nThe majority of the album plods along peppy, upbeat Gothenburg and triplet riffs. The lead work and solos are run of the mill Iron Maiden worship with some of the flair of the Amott Brothers. Shannon Lucas demonstrates his prowess for frantic rolls and blasts along with a nice control over what it is a heavily groove-orientated wankfest. As with the majority of metalcore, the bass is just there following the same basic progression as the guitars. Mr. Labonte has a fairly versatile voice, bellowing gutturals and grunts that resemble Phil Anselmo on Far Beyond Driven and The Great Southern Trendkill, high shrieks that sound like they belong on a sub-par black metal album, and clean sections that went through shit tons of chorus effects and pitch correction. \n\nThe standout tracks would be the opener \"This Calling\" and the climax \"Six\". Both open up with a barrage of blasts and tremolo riffs before settling into user friendly, mid-pace, verse-chorus-verse structure.\n\nSince this essentially a more more mechanical version of \"Alive or Just Breathing\" (considering Adam Dutkiewicz is the producer, it's not all that surprising), I would only pay about $5-$7 for this bad boy. But since I have friends who a liberal when it comes to sharing cds, I don't really need to worry about pissing away cash.\n",
        "\nCommercial success on Razor & Tie has been a double-edged sword (razor?) for All That Remains, who have seen increasing sales over the last three albums, but with the price of a restrained attack. Fellow Massachusetts metalcore magnate Adam Dutkiewicz produces albums like this in his sleep, and those familiar with the back catalogue of ATR, Killswitch Engage, and Shadows Fall, etc. will find little new on For We Are Many.\n\nNeed I say anything about the pointless intro/lead-in? Ah, too late. The only reason it’s split from the title track is for easy playing. But it is some of the heaviest music the band has written in recent years, with “Some of the People, All of the Time” the strongest competitor as it includes deep death grunts out of the slow-churning chug toward the end.\n\nBut man, those (numerically) odd tracks just kill me with their poppy, repetitive, clichéd choruses, such as on “The Last Time” or “Won’t Go Quietly”. The real one who won’t go quietly is lead guitarist Oli Herbert, who thankfully takes over in the middle of that track for a decent solo, but the concluding Frampton-esque wah-wah outro felt totally out of place.\n\nHe shines better, as does the band on the whole, during “Aggressive Opposition”. On principle, I can appreciate their positive battle cries, but the lyrics lack defining character. When focusing on the sound of the vocals alone, they benefit from layering, but sound as if they are multi-tracking Phil Labonte. Underutilized band members like bassist Jeanne Sagan could be worked in more effectively rather than increasing reliance on studio effects.\n\nThey mostly lose me after the pointed accusations of “Dead Wrong”, although “Keepers of Fellow Man” has the strongest potential, even through a wordy refrain (much better than what they attempted on “Two Weeks” from Overcome). If you are down with this style of music, it ought to satisfy, but recently signed label mates like Norma Jean have made bold artistic leaps while staying true to their roots and never at the expense of memorability. All That Remains continue to bait their hooks with familiar morsels of metallic goodness, but after awhile we fishies hunger for something different.\n\n~MetalMattLongo\nMindOverMetal.org\n",
        "\nAs metalcore albums over the past decade have gone this is possibly one of the better releases, with a moderate range of different songs, from the 100% chart oriented two weeks through to the more mellow believe in nothing; this album doesn't leave anyone uncatered to. Beyond potentially fans of their first 2 releases. this darkened heart and behind silence and solitude, on a whole this album is a nice combination of melodic riffs and perfect vocals through out - the lyrics on the other hand were a bit weak but that can be forgiven as vocal style and guitar work is THAT much better than some of their other releases.\n\nThis album puts them are the forefront of the metalcore scene, with other bands such as Bullet for my Valentine and Killswitch, to name but a few. They seem to have taken the best of both, combined them with an awesome vocalist, to produce a phenomenal end product that wouldn't shame the best of the metal scene. As All that Remains go, this is perhaps that slight bit worse than their third release, The Fall of Ideals, but trumps their first 2 albums.\n\nThis album pretty much fulfills any expectations anyone may have of a metalcore release, pretty simple solos with softer vocals around the choruses, making them softer than any other form of Metal, the only issue with this' that they seem to have lapsed on the content of the album, making this release forever a shadow of Fall of Ideals, and forever compared to it.\n\nThe best tracks to this album are by far Two Weeks and Chiron, Two Weeks being the clearest attempt at the mainstream they've had in recent years, catchy vocals with a chuggy guitar through out, being the break from the rest of the album in terms of being a weaker song - But the better for it. Cleaner vocals and a better song structure through out. Chiron on the other hand was typical of the rest of the album, but being the best among them, this in mind, it was the typical song about drivel that Phil sang pretty well which made this song the best from the rest.\n",
        "\nWow... I used to love All that Remains. \"The Fall of Ideals\" is still one of my favorite albums, and I listen to it all the time. But \"Overcome\" saw them shifting towards a more mainstream style. I was able to overlook that because there were a few really good cuts on the album (\"Two Weeks\", \"Chiron\"). But this new single, \"Hold On\", is nothing short of huge disappointment from a band that I have extremely high expectations for.\n\nIs this a bad song? I wouldn't say so by any means- for any other shitty metalcore band. The melodies are catchy, the vocals are good,and there's some shredding stuff going on. But All that Remains should be able to produce something with a whole hell of a lot more originality than this. First of all, the screaming that used to be the prevalent style on the album is now altogether absent. Phil LaBonte has some awesome vocals, and his screams are pretty recognizable to my ear. He has good clean vocals too, don't get me wrong, but I want to hear some screaming. On top of that, the riffs have become even more generic (not that they were ever really that insane, but...). This song just plods along with some \"heavy\" chugging rhythm in line with the kick drums, some chords for the chorus and then a palm-muted chugging riff leading up to the solo.\n\nSpeaking of the solo, let's talk about Oli Herbert for a second. Oli has an incredibly unique style... most of the time, anyway. He's a very melodic soloist, and he also knows his way around a few very unusal scales, especially the Hungarian Minor (for all music buffs reading). However, here he stays in a very typical natural minor context, and there's no real melody. It's basically just a collection of really fast, shreddy licks of no real value to the song. \n\nIn short, this single is a huge disappointment to me, because I expect so much higher quality tunes from this band. The talent is there, and I truly hope that this single isn't going to be the tune of the entire album, otherwise All that Remains will certainly be losing some fans.\n",
        "\nThe release of All That Remains' 2008's album, Overcome, was a disappointment to me. From Behind Silence and Solitude to This Darkened Heart to The Fall of Ideals, the band moved from a predominantly melodeath sound into metalcore, with increasing use of clean singing. Still, despite that progression, I was still a big fan of The Fall of Ideals. On the other hand, Overcome crossed the line.\n\nThe aggressive instrumental backdrop was still there, and Phil Labonte still made use of growly howls and piercing shrieks, but the overall tone of the album was more radio-friendly than the band's preceding releases, and the single \"Two Weeks\" seemed overtly calculated to achieve crossover success. With nothing but clean singing in that song, it actually broke into stratospheric territory on the mainstream rock charts and helped land Overcome at No. 16 on the Billboard 200 list with sales ultimately topping 240,000 copies. Given my tastes, however, the band's trajectory was headed in the wrong direction.\n\nWhen For We Are Many was announced, I wondered whether the strong taste of success would lead the band further along its progression toward the forbidden lands of hard rock, or whether instead we would we see a course change.\n\nAt a high level, For We Are Many contains most of the same ingredients used in the making of Overcome -- the alternation between harsh vocals in the verses and clean singing in the chorus, tightly integrated and hard-hitting rhythms as executed by drummer Jason Costa and bassist Jeanne Sagan, and attention-grabbing guitar leads and solos by Oli Hebert and Mike Martin. And in the main, the songs are still defined by catchy melodies and infectious hooks. But are there any \"twists and turns\", as Phil Labonte promised in an interview? Has there been a departure from what we thought was a too-formulaic approach to the song-writing on Overcome? Is there more in store for masochistic metalheads like me who enjoy being mercilessly punished by our music?\n\nThe answer to all these questions is yes. With the exception of the closing track, a mid-paced ballad called \"The Waiting One\", which features acoustic guitars at the open and close, the songs are uniformly fast, with jolting rhythms and rapid-fire riffs, and in many identifiable ways,For We Are Many has spun the aggression dial up a pleasing number of notches.\n\nThe brief opening track \"Now Let Them Tremble\" foreshadows the changes to come, with bursts of sawing guitar and martial hammering followed by a throat-rending Labonte howl. The title track that follows includes Gothenburg-style chords and deep gutturals in the vocalization. \"Some of the People, All of the Time\" is marked by staccato rhythms and pulsating riffs, a screaming guitar solo (one of many on the album), plus a big breakdown that includes more of those abyssal gutturals.\n\nThe backward turns on the album reach their crescendo on \"Dead Wrong\", a song that honestly can be labeled death metal: It's fast and pummeling, with tremolo-picked sawing in the guitar leads, deep, resonant bass riffs that rattle the ribcage, and death-metal growls that sound positively evil. It's downtuned, dissonant, and quite pleasing to our pointy ears. Yes, even on this song there's some clean singing, but it's a raspy, bluesy style that fits nicely with all the howling and growling.\n\nThere's plenty of thundering drumwork and merciless pounding on the toms in songs like \"Hold On\", which generally features a heavy-as-shit bottom end to accompany the catchiness of the melody. And oh yes, Oli Hebert still delivers the goods: You'll get your shred prescription amply filled on this album, with particular stand-outs in \"Some of the People\", \"From the Outside\", and \"Faithless\".\n\nHappily, nothing on the album is like Overcome's \"Two Weeks\". Every song on For We Are Many includes growls and howls, and nothing seems so overtly designed to infiltrate the ranks of active-rock radio. On the other hand, the album still includes offerings of metalcore-standard with high-pitched Labonte crooning that will appeal to Overcome lovers. \"From the Outside\" and \"Keepers of Fellow Man\", in particular, sound like metalcore songs from 4 or 5 years ago. Of course, for me, they're the least interesting offerings on the album.\n\nI mentioned the closing track, \"The Waiting One\". It represents a marked change of pace, with acoustic guitars, generally subdued clean vocals in Labonte's middle range, and quiet interludes. Yet even \"The Waiting One\" builds in intensity, and it seems destined to become a sing-along magnet when performed live.\n\nIn a nutshell: Fans of Overcome will still find much to like among the 12 tracks on For We Are Many, but for those of us who've been pining for All That Remains to turn up the brutality dial, the new album delivers a satisfyingly amped-up dose of aggression, too. It's a blend of metalcore and melodeath that continues to display All That Remains' trademark brand of catchy melodies while inflicting plenty of hammer-blows to the head.\n",
        "\nAs much as I like metalcore and \"bad\" music in general, this simply doesn't cut it. Throw in vocal effects, a tepid solo, a music video, and extreme reliance on the chorus - this is the end result.\n\nFirst of all, a huge gripe I had with this single were the abject failure of the lyrics and the vocalist's enunciation. \"Still clearly\" sounds just like \"yo baby\" for some pseudo impersonation of insipid rap lyrics.\n\nFor example, some of the lyrics of the song are:\n\n\"And you neglected I called you out don't please\nI said we're stronger than this now\nyou resurrected mistakes years past it seemed\nand they exist to still haunt you\"\n\nThere is quite a notable difference between abstract lyrics and simple, yet convoluted and tasteless lyrics going for the mainstream cash grab. While I don't have anything against mainstream music, I don't like music that tries to mould itself into whatever their audience would want to hear, rather than what a band would love to play. While lyricism is at an all-time low in modern times, and we can't expect every band to right lyrics and fresh as Lykathea Aflame, this is nothing less than the most cliché of subjects, and frankly, it’s getting on my nerves for how much more of this I can take. It also doesn't help that the vocalist is noticeably controlling his lame excuse for a shout, which is already obscured by cheap vocal effects.\n\nThe music itself is poorly played, with technicality and a display that may impress Slipknot and Linkin Park fans. I don't really have much to say, because it is so repetitive with horrible songwriting and the same old riffs again and again; no variation except with a solo half way through. Unfortunately, not every band can be saved by solos alone, and this is no special solo, either. The music, like the vocals, lack any sort of feeling or heaviness, let alone aggression, partially displayed by the fact that the guitars are hardly downtuned, again catering to the mainstream audience.\n\nI sincerely hope that this was some sort of a sick joke, however, that is unfortunately not likely, as All That Remains took Overcome seriously enough to actually release singles off it. Not recommended even to diehard fans or collectors (why would you want to collect off yet another 'metal' sellout band, anyway?)\n",
        "\nOn All That Remains most recent release they take a turn for the worst. Overcome is much more commercialized than on any previous album that All That Remains has released. Gone is practically all the melo-death influences in comes a much more average commercial sounding melodic metalcore sound. The technical edge of All That Remains last release The Fall of Ideals has also been dropped.\n\nMost of the song tempos on Overcome are mid-tempo metalcore leads and riffs except on the more fast paced numbers like Two Weeks the album highlight. The choruses are a big step down in terms of performance and melodic melodies. The guitar work is much more riff based this time around which is unfortunate, since All That Remains is much better at crafting strong leads with alternating riffs instead of more riff based songs. Breakdowns are more prevalent than on any other previous release as well and are used to no effect.\n\nThe bands performance is much weaker than on The Fall of Ideals especially Philip Labonte’s vocal performance. Philip’s vocals are more metalcore based this time around and even have a ruff sound to them unfortunately his choruses aren’t nearly as strong and he seems to be having difficulty singing on some songs. Jason Costa is the newest member here and acquits himself well on the drums unfortunately his drumming isn’t as top notch as Mike Bartlett. Both Oliver Herbert and Mike Martin have less solid performances but are still the highlight of Overcome. Jeanne Sagan bass work is inaudible like on previous efforts nothing else to tell about the bass.\n\nLike on The Fall of Ideals the songs and album length need to be lengthened for greater effect. The lyrics are even cheesier than usual re treading on points made on countless other metalcore releases. A cover of Nevermore’s Believe in Nothing ends the album with nothing special just a solid song. Finally solos are less present and aren’t nearly as well crafted or entertaining.\n\nOverall Overcome is a solid release but a fore warning to an even more commercialized future ahead. Hopefully All That Remains will not continue on the path laid down on Overcome in the future but instead improve upon the excellence of The Fall of Ideals. Best songs are Before the Damned, Two Weeks, Chiron, and Overcome. I recommend this album to any fan of metalcore but not the more melo-death metal fans of All That Remains earlier releases.\n\n-5 points overall weaker band performances\n-5 points album length and song lengths are to short\n-5 points a much more commercialized approach\n-5 points technicality gone and weaker solos\n",
        "\nOn The Fall of Ideals All that Remains finds their sound combining metalcore, melo-death, and a technical edge. This album is far above the average metalcore or melo-death band in terms of songwriting and entertainment value. Unlike many other metalcore bands All That Remains doesn’t just retread old ideas, they introduce new aspects. Every song on this release fits well together and as a whole this album is very cohesive. The Fall of Ideals shows what a metalcore/melo-death band should sound like.\n\nThe Fall of Ideals mixes the typical metalcore leads, riffs, and melodic vocals with the more brutal, fast-tempo of melo-death. Breakdowns are rarely used instead the two guitarists focus more on technical leads and solos. Vocals are used in two ways either the more typical low pitch death growls with higher pitch screams or the very melodic chorus based metalcore clean vocals. All the songs range from mid-tempo to up-tempo riffs which are usually based around a strong repeating lead and main riff. Not one of these songs is below solid and most are much better than an average metalcore song. The production is clean and mixes ever instrument well so you can clearly hear each one. \n\nThe bands performance is excellent easily showcasing some of the most skillful musicians in either metalcore or melo-death. Philip Labonte is easily one of the most talented vocalists in modern metal, showing off an impressive range and contributing great choruses to every song. Mike Bartlett drumming is mainly double kick bass focused as with most modern drummers but he uses ample fills and some great rhythms. Both Oliver Herbert and Mike Martin show off their skills with some very excellent riffs and leads especially the very technical yet melodic Six and The Air That I Breathe. Jeanne Sagan’s bass guitar is beyond notice mainly because it is almost entirely inaudible and is overshadowed by the rest of the band member’s performances.\n\nA few minor weaknesses are present on The Fall of Ideals barely bringing down the score. Many of the songs could have been extended because they seem to end abruptly especially on Six and The Air That I Breathe. The lyrical approach is cheesy mainly focused on personal struggles the usual metalcore garbage. Finally The Fall of Ideals overall length could have been longer, like the songs the album ends abruptly.\n\nThe Fall of Ideals is easily a metalcore/melo-death classic and should be considered a high point in All That Remains career. Best songs are This Calling, Not Alone, Whispers (I Hear You), Six, and The Air That I Breathe. I recommend this album to any fan of metalcore/melo-death who actually likes depth to an album.\n\n-2 points songs ended to fast could have been extended\n-2 points the lyrical approach is cheesy and unoriginal\n-2 points overall album length end to short also needed to be extended\n",
        "\nI was really pissed off after popping this CD in. I really liked ATR’s first album, longer songs with amazing solos and instrumental sections. On This Blackened Heart we have what seems to be the beginning of the end for Phil and co. Instead of creating an interesting metalcore band, Phil decided to water down the bands once unique sound for a wider audience. From what I have seen over the past few years… that seemed to be a good move after all…financially that is.\n\nProduction is decent, all the instruments have breathing room. Adam from Killswitch produced this album, which I will give him credit…the man did a good job. Vocals are a step up from the debut. Drums are somewhat generic, filling in sound rather than adding to it.\n\nWhat lacks on this album is the song structure. The songs do not adventure off like in their debut. What we have is generic At The Gates/In Flames riffs with an American hardcore attitude. Yes, the hardcore element was in the first album but was often overshadowed by melodic guitar work. Clean singing is now introduced which will be overused in future releases. I was left with the impression, “what makes this album stick out from other metalcore bands?” Solos are still pretty good, but they are shorter thus leaving a void in my ears.\n\nRegret Not, is actually one of the better songs on this album. A four minute instrumental with some rocking guitars. Focus Shall Not Fail, contains a much needed progressive element into these rather straight forward songs. The song starts off slow and builds up in the vein of their older works. There is some clean vocals in the mix but they are not overdone like their later works, ie every chorus!!\n\nOverall this album is not bad, but it’s not anything that sticks out in the sea of metalcore. Personally, I seek stuff that stands out in any style of music. This album really only has three good songs and a lot of generic songs. Will the average listener be able to tell the difference from As I Lay Dying, Killswitch Engage, Sad Leaves of Regret (okay I made that last one up, but you get my drift).\n\nDownload at best. Pick up Behind Silence and Solitude instead.\n",
        "\nI read All That Remains was releasing a new album. So it came out and I got it, went home played it in my radio. The first track \"Before The Damned\" played and it sounded good until the vocals came on. It didn't sound like Labonte at all. His hardcore rasps and death growls were no were to be found on this song or the entire disc, but instead they sounded modified by production equipment and his clean singing sounded way more commercialized then the last disc. I thought with the lack of intensity, though catchy \"The Fall of Ideals\", it would have signaled to them to step up their game. They chose to ignore the underground metal appeal, but instead they chose to chase the money and get more mainstream appeal.\n\nMusically there is good and bad things, mostly bad. First off the vocals, as I mentioned before, they don't sound like they did on other releases, the screaming sounds strained and programmed by equipment, unlike the past releases. The drums have no variation except for keeping the rhythm and the bass is still inaudible just like in, \"The Fall Of Ideals\". Songs like \"Do Not Obey\" and the Nevermore cover of \"Believe In Nothing\" fail greatly in holding your attention. \"Two Weeks\" and \"Forever In Your Hands\" are the biggest mainstream offenders here, even though \"Forever In Your Hands\" has a sweet solo near the end. \n\nNow for the good things, not many but they are crucial points in keeping my and your attention. Guitar solos and riffs show that the members have improved, the solos show technicality in them if these were not included in the mix I would have scored it way lower. \"Before The Damned a great opener to the disk, opening with crazy drums and a some what technical guitar riff, midway “A Song For The Hopeless is unique opening with acoustic guitar, a mini solo and clean singing, then it smacks you with aggressive bass kick and screaming. Also still showing promise of All That Remains signature sound are the back to back tracks \"Relinquish\" maintaining a heavier sound, sick solos and void of clean vocals. Then \"Overcome\" keeping a catchy but heavy and technical.\n\nIn conclusion this album is only for collectors and mainstream metalcore fans (ex. Bullet For My Valentine, Killswitch Engage, and Atreyu. Hopefully the next ATR album will be back to normal and this was just a joke.\n",
        "\nAll That Remains is one of those melodic death/metalcore bands that differ from all the other ones in the scene. This proven with there first two releases the straight melodic death metal \"Behind Silence And Solitude\" and \"This Darkened Heart\" melodic death with some metalcore elements. But \"The Fall Of Ideals\" by no means is as good as either of the two and it looks like they’re going for a mainstream and accessible sound. Proof of that is \"This Calling\" had charted and was on the Saw III soundtrack.\n\n\nMusically it's more metalcore than anything else, following the stereotypical formula of alternating between screaming and clean pop like singing. Also the guitar solos here outshine the breakdowns, which are good thing and also are played with clean precision. The drummer is able to hold the rhythm of the songs together but the bass can't be heard at all through out the entire disk. The vocalist Phillip Labonte uses a variety of vocal styles hardcore shouts, clean singing, and even death growls and rasps mostly in \"The Weak Willed\" but holds them out on \"It Dwells In Me\" and in the beginning of \"Become The Catalyst\". The guitar player’s play with on point riff and at least keep the mix interesting and able to keep the listeners attention. \n\n\nAlthough it doesn’t hit as hard as \"Behind Silence And Solitude\" and \"This Darkened Heart\". It still is good for what it is and is a good purchase for fans of metalcore or collectors. Good songs include \"This Calling\",\"It Dwells In Me\",\"The Weak Willed\" and \"Indictment\" and it's still is better than most metalcore on the scene today.\n",
        "\nMetalcore isn't a genre that I'm a huge fan of. Most of the bands are very generic and unoriginal and most of them sound exactly alike. All That Remains, however, is a band that caught my attention. This band has elements of metalcore, but they also add a melo-death twist into their music as well. Other metalcore bands such as God Forbid and Bleeding Through do this as well, but neither of those bands has impressed me as much as All That Remains has. Some people might listen to this album and think that its nothing more than another generic metalcore album and to tell you the truth those people are probably right, but some people, including me, will love this album and think of it as a gem in the very bland and unoriginal metalcore scene.\n\nThe album starts off with This Calling and right away you get Phil's menacing high pitched scream. Its not high pitched like a black metal style, but more in a regular metalcore style. Anyways, while Phil holds a pretty long scream, the normal style of chugging metalcore guitar riffs are playing in the background. The riffs throughout the album are very melodic and thats where most of the melo-death influence comes from. After that the extremely catchy chorus comes in. I'm telling you that chorus might be stuck in your head for weeks. Phil let's out another long scream and the song continues on the same path. After Phil sings the chorus again, the duel guitars play the same melodic riff for about 15 seconds and then a breakdown comes in with Phil screaming overtop of that. Shortly after that there is a pretty short solo and it leads right into the chorus once again and after about 30 of that the song comes to a close.\n\nNext up is Not Alone. This song starts off with the dueling guitars playing a melo-death riff. Phil screams and the melo-death riffs turn into metalcore chugging riffs. Once again after about 30 seconds another catchy chorus comes in with Phil's great clean singing. Just like This Calling, this track pretty much repeats the same formula. After they repeat the chorus they go into another solo that includes both guitarists. It sounds like something like In Flames would play. The chugging riffs and drums follow the solo and the chorus is repeated one more time before the song closes out the same way it started with the dueling guitars. Following Not Alone is It Dwells In Me. This song starts off with Phil's screams and some melodic riffs playing in the background and some pretty simple drum beats. Yet another catchy chorus comes in early into the song. Just like both songs before it, this same formula is repeated. That leads into the guitars playing some more melo-death influenced riffs and also another solo. Not too complex, but all the solos on the album are very well executed. After the solo, the band goes right into a breakdown with Phil screaming in the very common metalcore styled vocals. Right after the breakdown the chorus is repeated again and the song ends with a very death metal like growl and some regular metalcore vocals.\n\nWe Stand is the next track. It starts off with the melo-death riffs. After a couple seconds the riff continues and Phil comes in with his screaming/shouting vocals. About 45 seconds in the chorus comes in. This chorus is one of the more catchy ones on album. The same formula is repeated once again and Phil does some talking. After the chorus they go into a breakdown with some melo-death riffs added in as well. Then both guitarists go into another well executed solo. This solo is the most technical up to this point of the album. Another breakdown follows the solo and then the chorus comes in again and the song ends. Next up is Whispers (I Hear Your). This track starts off different than all the others with an acoustic guitar at the very beginning. After a couple seconds it goes into their regular metalcore/melo-death style. Then comes another chorus, which is my favorite on the album. Phil's vocals are absolutely amazing on this song. Especially his clean vocals. The song repeats the same thing once again. The chorus leads into a breakdown and then a short solo. The song repeats itself again and then ends.\n\nNext up is The Weak Willed. With this song, you will notice big change in the musical style. This song is almost purely melo-death/death metal. It starts off with death metal style riffs and fast drumming. After about 20 seconds Phil comes in with a menacing death metal growl. He keeps up this style plus the regular high pitched scream throughout the entire song. During the chorus he doesn't sing. He uses the scream and the metalcore shout. His death vocals may remind you of the vocalist for Blood Red Throne. Around two minutes into the song the melodic riffs enter the song, but they don't last long. The fast death metal drumming and guitar riffs re-appear and the song goes to almost pure death metal again. About three minutes into the song Phil's clean vocals make an appearance, which is nice. The song slows down after that with a slow drum beat and a piano playing and then it ends.\n\nSix is also another song that is very death metal influenced. Once again fast melo-death riffs and extremely fast blast beats start the song off. Then the song starts to follow the regular metalcore formula with a breakdown and the clean/shouting vocals. Phil also does some death growls in this song as well. At about 1:40 the song slows down and the guitar plays some slow, melodic riffs with a simple drum beat playing. At around 2:30 a pretty slow and short solo comes in and the song just pretty much repeats itself. Becoming the Catalyst is the next track. This song starts off with a death growl by Phil and some fast melo-death riffs playing with a pretty simple drum beat. There's not really anything special about this song or really any of the last three songs. They all pretty much follow the same path that the first couple songs did. Fast melodic riffs, fast drumming, catchy choruses, solos, etc.\n\nAll in all this album is really good. Like I said earlier, if you were to call this just another generic metalcore album, you would probably be right. The thing for me is that this was my first metalcore album and thats why I have a little soft spot for it. Its nothing groundbreaking and its not going to be considered one of the best metal albums of all time, but its very enjoyable and worth a couple listens. Or in my case, more than a couple of listens. If you are a fan of metalcore, melodic death metal, or both, you will probably enjoy this album.\n",
        "\nEven though I am one of the most dedicated enemies of the Metalcore movement, this is one of the very few bands that make me bang my head or sing along the lyrics of some song (usually of a nice melodic catchy chorus). The fact is, that Metalcore managed to prove that I am 100% right for one more time, since even ALL THAT REMAINS disappointed me releasing their worst album ever and showing that in this kind of music, after the success comes the downfall.\n\nAfter releasing their previous successful album \"The Fall Of Ideals\" (2006, Prosthetic), ALL THAT REMAINS managed to become known and get their lazy asses out on the street for some serious live appearances. The album’s hit \"This Calling\" - which I personally adore - was even a part of many compilations and movie soundtracks. Two years later, the band returns with a brand new album, \"Overcome\", which doesn’t overcome the success of their previous album by no means.\n\nWe know the story. We have the classic AT THE GATES/IN FLAMES rip offs, the screaming vocals that are interrupted only in the chorus by some clean melodic ones and the melodic guitars with the pseudo technical breaks. This is definitely the worst moment of creativity for this band. We are talking about the worst song structures and the worst riffing ever written by ALL THAT REMAINS. Let me add the shitty lyrics that almost touch the emo fields (I really can’t stand Labonte’s whining) and the meaningless cover of NEVERMORE’s amazing song \"Believe In Nothing\". I have listened to this cover many times just to understand why they chose this track, but I still haven’t managed to find any specific meaning behind this move. The only thing I found was a shitty cover.\n\nI am completely disappointed by ALL THAT REMAINS and I just hope they return to their good old self quickly. Let’s just hope that this was just a small wrong step.\n\nOriginally written for Metal-Temple.Com\nYiannis D.\n",
        "\nI've mentioned in the past that I find All That Remains to be one of the very few metalcore bands that are worth one's time. Well, I have been proven wrong once again, as 2008's Overcome ranks as not only by far the band's absolute nadir, but also one of the worst albums of the year. All That Remains has never been the peak of creativity or musicianship, but they've always been able to craft catchy or memorable tunes at the very least, and yet here I can't remember a single fucking song. I have complained about the previous album, The Fall of Ideals, being formulaic, generic, mediocre, and nigh indistinguishable between tracks, and I genuinely feel that the band could be an incredible melodic metalcore band (wow, that tag makes me cringe just by reading it, but I feel they could've pulled it off) if they would let the riffs evolve, loosen up the structure of the songs a bit, and allow the guitarists let it all hang out and shred to their hearts' content. It seems like the band actually heard my thoughts and considered answering my prayers, but instead they decided to bound and gag them, beat them with frozen trout, and then incinerate them. I'll never understand their steadfast stubbornness on the subject of change. They refuse to progress, they refuse to evolve, and each album just gets more and more formulaic and restrained.\n\nThe vocals on Overcome are the exact same as the last three albums, metalcore screams for the verses, clean for the choruses, and the obligatory overdub on the final chorus. The riffs are the exact same interchange of fast chugging chords and melodic death metal At the Gates/In Flames rips that we've been hearing for well over a decade now. I'm being 100% honest when I say that pretty much any song can be randomly picked out and it would define the words \"generic\"\u009d and \"mediocre\"\u009d. Absolutely nothing has changed since the last album, except everything seems toned down and held back. The harsh screams are lackluster and uninspired while the clean vocals are whiny and lack conviction. This is All That Remains by numbers as performed by 15 year olds. At this point in the review, I would usually reach back to a song and give a concrete example as to why I make the claims that I do, but I seriously can't decide which song to use as an example. They are all boring, all formulaic, and all weak. Somewhere down the line, this band lost their balls. I firmly believe that there is a very thin line between an abundance of balls and a lack of brains. The more I listen to this album (and the entire back catalog), the more I realize that they were actually uncomfortably nut deficient from the start, thus making them brainless and babydicked. What's worse is that this is the point in their career where it becomes the elephant in the room. This is where I finally realized that the band has tucked in their collective scrotes (or stitched up their vag; can't forget about the bassist!) and completely submitted to the pressure of the mainstream. Wussified metalcore is what sells, not balls out thrashing metalcore. The masses want brutal breakdowns! The kids want anthems about heartbreak! The wallets of the youth do not open for innovative or intense, they open for the masquerade. A good friend of mine recently described Whitechapel as \"the heaviest band in existence\", and that is what the people honestly believe. The mainstream metal has two camps in where the money is/was made in recent years, and that is the overtly crushing and retardedly downtuned buffoonery of deathcore and the metal-lite and whiny metalcore. The latter ship has honestly seemed to set sail in recent years, but All That Remains never got the memo. I understand what I'm implying, but believe me when I say that this movement they seem to be trying to ride on was a commercial style ala the hair bands of the day. How mainstream has brutal death metal ever been in America? How's about European speed metal? How long have these styles been around? How long have they persevered? You see what I'm getting at? Digression aside, I'm sure y'all can see what I'm saying. Overcome is a safe release in a commercial genre, no matter how withering the scene may be.\n\nI feel I must make special mention of the cover of Nevermore's most boring and radio friendly song ever written, Believe in Nothing. I believe that there is a right and wrong way to cover a song, depending on whether the song being covered is a metal song or not. Since Believe in Nothing is a questionably metal song by a metal band, it's a little difficult to categorize. This is a straight port, no modifications at all. The drums are the exact same plod as the original, the solo is a note for note transcription with no added flair, and the vocal performance is exactly the same (even the subtle nuances in the background). If anything, it's actually more boring and whiny. I really like Nevermore, but this was easily the worst song anybody could've picked to cover, especially when it's a band as painfully mediocre and afraid of pushing any envelope as All That Remains. \n\nAnd yet throughout it all, there is one aspect of this album I have yet to criticize, and actually thoroughly enjoy... the solos. Of all my thoughts and hopes that the band brutalized and immolated, they seemed to take a special liking to that one particular one, and decided to spare and harness it. Oli and Mike are undoubtedly in top form here, finally fully utilizing those once latent skills that I always knew they had. There isn't much that one can describe about solos, unless of course they are laughably bad. Although most of this dungpile is indeed indistinguishable, the harmonized solo in the debut single, Chiron, stands as probably the most impressive showcase and one of the only enjoyable moments on the whole album. Sadly, this is essentially the only positive aspect of the entire album.\n\nAll That Remains is done, over, kaput. They've been silently building their coffin ever since the beginning, but this blatant show of artistic death was their act of crapping in said coffin and nailing the lid. As much as I wanted to like this album and band, as much as I've tried to look past the mediocrity and embrace the empowering message of the music, I just can't look past it anymore. If you were previously a fan of this band, then this probably won't change your mind, although the overabundance of the clean vocals could scare away those that preferred their metal side. If you hated them beforehand, then this will only reinforce your opinion. And if you were on the fence like me, Overcome will most likely shove you over to the haters' side. I'd say avoid this like the plague.\n",
        "\nALL THAT REMAINS - Overcome\n\nAll That Remains have definitely come a long way from their first release. With the massive success of the album The Fall Of Ideals sealing the band's fate as a staple melodic death metal act, it was only a due amount of time before the band fell prey to the typical signs of money oriented melodic metal.\n\nMuch of the music on Overcome is rather bland. There are moments that will leave you gripping your chair, such as during \"Before The Damned\", and some songs that are just catchy as hell, like their single \"Chiron\", as well as the simply amazing \"A Song For The Hopeless\", which should have been the blueprint for this album, period, instead of tracks like \"Forever In Your Hands\" (which has a rather emo chorus) and other weak, unmemorable cuts.\n\nThe other problem this possesses is that the release falls under a \"metal by numbers\" train of thought, meaning that it contains screaming verses with singing chorus lines, as well as extremely simplistic chords, and extremely weak singing vocals that simply cannot compare to those found on The Fall Of Ideals.\n\nEssentially, it's the second half of the CD that becomes a saving grace. This houses the aforementioned \"A Song For The Hopeless\", as well as \"Relinquish\". Both offer a bit more technicality to them, deviate from the aforementioned mapped out metal pattern or lack a vocal style that may turn a killer track into a whiny emo-sounding track. However, the final track, \"Believe In Nothing\", happens to be a Nevermore cover. Only difference here is that the Nevermore track definitely packs more passion into it, while the All That Remains version sounds weak and will make you cringe from time to time. The music may be dead on, but as a whole it just lacks the passion found in the original.\n\nSo, let's break it down here. A good majority of the album is stereotypical, follows a pattern, and lacks the tenacity of it's predecessors on many different levels with the exceptions of a few songs. \"Chiron\" for it's catchy melodic aspect, and \"A Song For The Hopeless\" though \"Overcome\" for their technicality, as well as how well they are performed. All in all, this album is a rather big let down, and will leave you in fear of how much father they will descend into an unmemorable, unmoving style of music typically created by the prospects of cash.\n",
        "\nAt first, I found All that Remains to be a breath of fresh air in the metalcore scene. They seemed to be one of the few with a considerable influence of some form of metal, albeit the much frowned upon Gothenburg scene. The guitars were fast, the songs were catchy, the voice was good... they were a good band that I enjoyed quite a bit. After their newest album, The Fall of Ideals, had a couple spins under it's belt, I came to the conclusion that they are in fact an exceedingly average band, with nothing much to set them apart anymore and a crippling lack of variety in the record.\n\nThe difference in time between the longest and shortest song is less than one minute, which would suggest a similarity in the songs. That assumption happens to be right on the money. Every track has the exact same intro - verse - chorus - verse - chorus - break/solo - re-verse - chorus 2X - outro pattern that never ever deviates, and that's frankly annoying. Most of the songs are forgettable, which is obviously a huge negative. What the hell is the point of listening to an album that you won't remember in an hour? It's like crapping in a toaster... utterly pointless.\n\nThe members themselves are all competent, and Labonte has a versatile voice, it's just that it is unfortunately used poorly. It's always his harsh screams layered over each other three or four times in the verses and clean vocals in the chorus (except in each obligatory final chorus where he will inevitably mix harsh screams in the spaces without singing). Oli Herbert is a decent guitarist, and Bartlett is a solid drummer, but nobody ever stands out in this formulaic pile of sugar scented shit.\n\nThe only song that breaks this formula is The Weak Willed, which is absolutely god awful. It's like midpaced groove/deathcore bullshit, avoid what anybody says about this being the best song, their ears are obviously broken. The acoustic passage at the end does not save it from sucking a big fat one either. Absolutely terrible song. Everything else though, is textbook mediocrity. The Air that I Breathe deserves special mention for actually having an emphasis on melody and doesn't drone on boringly throughout the duration.\n\nI can liken the approach to being like blowing up something with a missile. But the thing is, once you blow up one section, you have to blow up another one considering there's nothing left to obliterate after the first missile. All that Remains didn't get this memo, and they continually bomb the exact same clearing in the forest eleven times in a row, which is not only ineffective, but incredibly dull. I want to like this band, as they are definitely above average for most metalcore, but that really isn't saying much in a genre where mediocrity is not only accepted, but encouraged. Songs like This Calling, Not Alone, and The Air that I Breathe are catchy enough to satisfy a quick craving for mainstream metal, but anything more will just give you a gnarly stomachache.\n",
        "\nMetalcore, one of several portmanteau genres of the metal world, typically turns me off. Of the many commercial juggernauts the genre has to offer, I’ve often felt repulsed by the overpowering influences of hardcore punk and alternative. When a friend played The Fall of Ideals for me, however, I was intrigued by the obvious melodic death metal influences the band incorporated into their latest release. After picking the album up for myself, the initial attraction I felt soon faded as the dazzle of powerful melodies and ‘get psyched’ lyrics faded. \n\nThe Fall of Ideals earned All That Remains number 75 on the Billboard charts and a lot of attention. I was surprised to learn they played last year at Wacken. The album was produced once again by Adam Dutkiewicz of Killswitch Engage to crystal clarity – for the most part.\n\nVocalist Phillip Labonte possesses excellent range. Some tracks assault you with guttural death metal growls or raspy screeching. Typical to the formula of most metalcore, Labonte breaks out the baritone to complement those melodious hooks and passionate riffs of the chorus. As cheesy as it is, the songs really are extremely catchy as a result and really resonate. Unfortunately, this aural addiction is short lived as there is not much behind the melodies to draw you back in once they conclude. The only thing drawing you back for another listen is a quick fix of mind numbing harmony.\n\nGuitars on The Fall of Ideals are powerful and fast, yet despite the technical prowess of the guitarists, remain generic and uninspiring metalcore fare. Both guitarists play well off one another for excellent results. The painfully short leads in various parts of the album left me aching for more, but the majority of the songs failed to deliver satisfactorily. When most metal albums drown out the bass in their cacophony, it is refreshing when they are clear and distinct as on this album. The drums are also well done. Many songs make good use of blast beats for more metal influences, but the over use of bass drums tends to nullify many of the cymbals and other portions of drumming. Listening to the album on my Sony MDR-V6 headphones allowed me to pick up what sounded muffled over my speakers or in my car.\n\nLyrics seem standard for a metalcore album. Self-empowerment and a general sense of 'getting psyched' pervade, but there are also the, dare I say, more emo passages of whiny clichés and deep feelings. While this fits the style of play mostly, I still fight back rising bile when I hear \"I see her in my dreams / Wish she was not there,\" or \"Just want to feel again.\"\n\nAll That Remains stands out in the mediocre sea of metalcore releases as it draws more from metal influences like dual harmonizing and blast beats. What props it up above that crowd, however, rests on a flimsy foundation. Once you recover from the initial explosion of baritone melodies and enticing musical arrangements of The Fall of Ideals, you’ll find little remains to fill the void. Despite the negative aspects of the album, most metal fans, no matter their loyalties, should find something to interest them if only briefly.\n",
        "\nAll That Remains is one of the better acts amongst the many shit trend bands flourishing in this era. The majority of their music is, in my oh so humble opinion, metalcore tinged with technical melodic death influences. But, also note that the main reason I label it with the melodic death tag, would be Philip Labonte's type of singing, which usually fall into low, guttural howls and high pitched screams... and yeah, there is the baritone singing, as this is obviously of the metalcore sub genre and singing is pretty much... well... mandatory amongst this type of music...\n\nFirst off, I think it'd be best to start off the in the vocal direction. Philip Labonte is the former vocalists of Shadows Fall, another metalcore act. From what I've seen, read, and heard, the reason for his being cut out of the band had to do with his style of singing making the band sound a lot darker/heavier than they were aiming for, which was allowing them to mistakingly claim to be a member of the death metal genre. While much of his performance in this album is rather generic metalcore screams, he does at time experiment and reach a very low, guttural sound (see The Weak Willed) more akin to the death metal genre... Also, he does, at times, breach out from the generic mid range howls into high pitched screams... (again, see The Weak Willed) The softer baritone parts that he sings in between screamed parts are pretty well done, and on this album the best example of his clean singing would be... either This Calling or... The Weak Willed... Yeah, track #6 is pretty much the best of the best on here. Overall, he's a great vocalist, and at times his talent really shines through in their junior effort.\n\nOn the subject of instruments, everything here is pretty tight knit. The guitars fall back on dual harmonizing (Iron Maiden influence... blah blah black, etc) for some catchy melodies and great solos. Oli Herbert and Mark Martin have amazing chemistry here, and are very proficient guitar players... and dare I say it, probably two of the best players in the \"New Wave of American Metal\". Yeah... Well, in any case they do show off their prowess in this installment with some very technical riffing and some other progressive elements they throw in every now and again. They do experiment some with different styles of playing, and I can't help but note a distinct lack of power chords for the majority of the album.\n\nJeanne Sagan is a pretty good bass player, I suppose. You can easily hear each note played in on the bass, and she does provide a very steady bass sound. Oh, and the bass is also quite palpable in comparison to most of the bass I hear in metal bands nowadays. Check out It Dwells In Me for some of her best parts on the album, though The Weak Willed also has a very heavy feel, too. On the drums... Jason Costa is a great drummer. Yes, there are many... MANY better drummers out there, but I've never heard him drop out of time or lose the beat once... And I'm counting live performances, btw. Good speed, etc, etc.\n\nAnd finally, on to the main event. Lyrics. Yes, the genre is metalcore, yes there is emotion. But in a good way. The majority of the content is akin to the type found in hardcore, that of being a BMF, or Bad Mother Fucker. You know, being strong, powerful, getting psyched up and such. On the songs dealing with relationship troubles it's usually of a \"Move, bitch, get out the way\" deal, not a, \"OMFG, ANGEL DUMPED ME, SO I GONE KILLS MEHSELF! SLIT SLIT SLIT /emo\" deal.\n\nIn conclusion, All That Remains' third studio album, The Fall of Ideals is a better than average, but not really great album. For metalcore, it's just about one of the best albums out there, especially talent wise. Highly recommended for any fans of Post Thrash, Metalcore, Hardcore, Technical... everything, I guess, or Melodic Death Metal.\n",
        "\nI had a very difficult time trying to procure a copy of this album from the record stores in my area. After a few weeks I finally set hands on one. The first listen is destined to be just like the ones that proceed it. \n\nRight away you can recognize the staples and signature sound of the band, in the delicate riffing that upon closer listen is not so simple as you once thought. Granted the production value is a bit low and not as pristine as many would expect. Although even though the album's sound is very hollow is adds a sort of ambiance. Like it would be the sort of record sold at some off the charts venue from a band that was just getting started, which of course is not too far from the truth.\n\nThe songs are relatively short, as is the entire album. You can't complain as the experience is better short, I couldn't imagine an album like this dragging on and still being able to hold my interest.\n\nThe stand out tracks are \"Clarity\" and \"Erase\", they show a bit more experimentation from the band and best represent the musical prowess the band has to offer. The scope of the songs, lyrically, is bland and sort of vague but best conveyed through the caustic and guttural harsh vocal stylings of Philip Labonte. Already early in the life of All That Remains he was top notch in his ability to push deep and get the best screams and growls for your money's worth. Already you could tell that this band was going to be rather big, and of course you could look no further for proof than this very album.\n\nThe bottom line is that this album is slightly less accessible than their later efforts, yet is rewarding in another way. It rewards in it's energy and the way it stirs your blood and intensifies emotion with each passing track. While this album certainly won't be for anyone, for those willing to seek it out, it will most certainly not disappoint.\n",
        "\nWith the recent and overpowering metal core surge that the heavy metal industry has felt in the last half decade, many (many, many) metal core bands have gotten signed to labels that haven’t really deserved to have the attention they get. So needless to say I was very cautious picking this album up at the local music retailer. My caution has always been right. \n\nAll That Remains is more or less in the upper crust of metal core genre. They have talent (in their revolving door of band members) and as with a lot of metal core – they can throw in a pretty bad ass thrash riff every once in a while. Unfortunately, All That Remains really doesn’t deviate from the ABC’s of metal core for The Fall of Ideals. \n\nMusically, The Fall of Ideals is mostly uninspired melodic death metal influenced hardcore. Most of the songs seem repetitive (riff overlaid with Iron Maiden “inspired” melody, breakdown, and repeat) and most of the songs are done in the same manner. Granted I have to give it that this album leans more towards the metal area of metal core rather than the hardcore aspects. The melodies are sometimes catchy and once or twice I found myself falling into the music then the breakdown would kick me out. Granted, I will give that there are some riffs that didn’t really sound too hardcore inspired, but they were few and far between. The drumming definitely seems to be focused on the bass drum (whether it was a production choice or a writing choice isn’t clear) and it literally consumes most of the other drum parts.\n\nAs for vocals and lyrics, both are equally uninspired. What’s that? Barking vocals intermixed with baritone softer parts? Sounds like most other metal core bands. And for some reason, it seemed to me as if ¾ of the songs began with a double bass and a scream. Lyrically, there doesn’t seem to be a lot of thought into the songs. Most are the usual metal core, “oh I can’t think about her leaving me, I don’t want to be alone” generality. Forget about clever phrasing or things like that, most of the more important lyrics in the songs are cliché phrases, “I hear this calling”…I can’t count the number of times I’ve heard that in a song. \n\nIn the end, I will say this. If you want this album: expect metal core. Expect more metal than core. Expect a mostly lack luster experience unfortunately. It is one of the better metal core albums out there – but really it’s nothing spectacular.\n\nSongs to check out: This Calling, Six, The Air That I Breathe\n",
        "\nI have long been a fan of All That Remains, I bought This Darkened Heart when it first came out and played it constantly, I still do in fact. I bought The Fall of Ideals and didn't like it upon first listen but grew into it. After a long quest for years to get a decent copy of their debut album I finally had one about a month ago. \n\nFirst off the album is void of clean vocals with the exception of a few lines. Which means more metal choruses and no metalcore breakdowns with emo lyrics as you'd get with Killswitch Engage. Here you get only the best in riffing and tightly produced and executed drumming. The sound of the band in it's early years isn't too far off from This Darkened Heart, except that the lyrics aren't quite at a notable point. Labonte's vocals are top notch here and he uses them very well in coordination with his fellow band mates. As always there are plenty of guitar solos.\n\nThe thing I most like about this album is now accesable it is and how the songs are lacking in clean vocals with melodicism and hooks. It's a straight up metal record. I may be wrong, but I dare say it's melodic death metal.\n\nIf you're in the mood for a solid album that you won't tire easily of, here it is.\n",
        "\nAll That Remains hail and call from the metal-core Mecca of Massachusetts. Their latest indictment itself remonstrating the fallacy of ideals, may be laconic; yet it wails and whispers the iconic culling of pure mettle. Philip Lebonte may dare dichotomously to dance between brutal banter and sharp penetrating vocal histrionics; but this does not classify the band as merely being metal -core. All That Remains have become the catalyst for angry tempered passionately powerful melodies. ATR are not alone in this resurgence and revivification of a classic metal sound. Several new bands now yearn to unearth the previous past-time metal glory.\n\nGuitarists Oli and Mike have truly been trained as soldiers of steel in metal boot camp. Mike Martin's appetite for destruction will drive you crazy thinking it's so easy to slash and thrash with his useful elusive patience. Oli Herbert himself has earned a degree in music appreciation, and he studied under the tutelage of Frank Aresti of Fates Warning fame. His never lost angered adoration for Andy LaRocque clearly shines through in his graceful guitar guise. I also hear the music of Arch Enemy, Sanctuary, Megadeth, and even certain European power metal artists bleeding through as an influence. The cowering weak will wince once they undergo the chaotic crush of Philip's punishing prudence; after they succumb to Shannon's shameless deadly drumming, as he demonstrates his desire for extreme death metal. Mad maiden Jeanne Sagan sagaciously plays her bass like Rachel Bolan. Her uncouth, gone wild, approach is apparent with this kid rowing out rollicking rhythms. She also emulates \"Iron Harry\" as she picks away at her own peace of mind.\n\nWhen Philip sings on tracks like the The Weak Willed or Become The Catalyst, he evokes Chuck Billy's low testament to baritonality, as well as Dani's filthy lacquer. Philip may also be compared to Anders Friden on cuts like Whispers and It Dwells In Me. The opening speed of Six sick section will just floor you, until it's melodic breakdown blows you away. After several intense revolutions, I'm instantly ensconced in all that remains of the sweaty air that I breathe, almost choking on the vile bi-lines of linguistic fortitude; yet still never feeling empty inside. Lyrically, the majority of the songs' subject matter concentrates on self empowerment and rising up against authority. Other themes embrace the pain and anguish of heart wrenching relationships.\n\nATR easily have the tenacity to follow in the shadows of the more successful mass artists. They have been receiving radical response while playing this summers Ozzfest. Eventually, this autumn they have the honour of opening for those inhuman dragons, forcing their modicum of metal into the hearts and minds of adolescent anarchists at sold out shows everywhere.\n\nas originally posted at www.metalcdratings.com\n",
        "\nOn their last record, All That Remains showed that they had a much bigger European influence than many of their metalcore counterparts. On this record many of those influences are lost. There are still melodies and harmonies and the like, however this is a very tone driven record, and one where Phil Labonte, the band's vocalist, really shines.\n\nI was very impressed with this man's delivery on TDH, but here he just busts out a variety of vocal styles, all of which kick total ass. He can do death growls, a more hardcore approach, high shrieks that border on black metal, and a clean voice that fits just as nicely (to me anyway) as Jesse David Leach did for Killswitch Engage back in the day. Why Shadows Fall ever let this man go for the less than exceptional Brian Fair is a mystery to me. \n\nAs far as the sound of the band is concerned, I much prefer the overall tone and production here than on the last album. The guitars aren't as dry and have a punch behind them. The drums are deep and thick and when he decides to do a blast beat, the effect definitely hits you harder than it would with lesser production. The vocals are crystal clear and the record just has an overall heavy and thick sound.\n\nAs for the actual songs, they seem less polished than on TDH, but have a much heavier edge to them and have a much more death metal feel to them than on their previous material. The first song \"This Calling\" starts off with Labonte taking a breath and unleashing a gut wrenching scream over some ferocious riffing. Already you know you're in for something pretty intense. The clean chorus is perfectly executed, this is a great song. \n\nWhat I enjoy about All That Remains is that they write RECORDS, not a CD with a couple of good tracks and a bunch of filler. They conceive their record nicely and have a natural progression and a cool flow between the songs. From front to back the songwriting is very good, the arrangements are well thought out and this record is fun to listen to. Plus these guys can play too. If there are any guitar enthusiasts out there, this record has some very solid lead playing as well. \n\nThis is just a good heavy metal record. Case closed...\n",
        "\nI've been a fan of All That Remains since the debut album nearly half a decade ago. I loved the tasty riffs and frantic drumming but this new album gives me mixed feelings. \n\nI'll start with the vocals. Both clean and harsh vocals are both now evolved, and while the new and more guttural harsh vocals are very much welcome... the clean vocals seem way too emo for their own good. Leave that sort of thing to Atreyu or whatever radio band you'd like.\n\nThe drumming is more produced and tighter. The kick drum now sounds deeper and more like it's taken note from Lamb of God, which kind of marred the drumming and nuances I had come to know them for. The musicianship in this aspect really hasn't changed, it still ranges from breakneck speed to the punchy cymbal riding melodic breakdowns and choruses.\n\nAh, the guitars. Not much has changed here, if you heard their previous effort, This Darkened Heart then you know what to expect. Maybe a few less solos per song, and mostly altogether. \n\nWhat I said before about the clean vocals having an emo tinge, the same holds true for the lyrics. They become bland fast and fade into all the other bands out there and offer no new dimensions for a band I once loved. Such a shame, after waiting nearly 2 years for new material I feel so let down. This disc is more of the mindless metalcore we have come to know, love and ultimately forget.\n",
        "\nAll Thar Remains is yet another \"new wave of american heavy metal band\" which have ties with other of the new england bands such as Killswitch Engage and Shadows Fall. In fact, KSE's Adam Dutkiewicz produced this record and Phil Labonte is Shadows Fall's old singer.\n\nLabonte in fact does a fantastic job on this disc. His mix of harsh vocals with clean is very well done and he laces his screams with a double punch of low death metal-like growls. An excellent performance on his part. \n\nThe guitars are quite clear but have a pretty dry tone to say the least. It is a very direct sound that is meant to chug away and hit the listener hard. However these are complemented with tasteful guitar solos as well as acoustic passages that mellow you down before rocking out again. The solos are pretty good, nothing exceptional or unheard of but solid nonetheless. The bass is also present in the core of the band's sound, chugging away and complementing the guitar play well.\n\nThe drums don't stand out much but they don't hinder the performance either. It isn't mindless skin bashing but it isn't anything super refined either. \n\nThe strength of the band lies in its songwriting, and is there really anything more important. The riffs are heavy and the song structures are well thought. The intensity is there but you have a sense that this is just a bit more polished than some of the style's contemporaries. There seems to be a little bit more of a euro feel than most massachussettes based bands. \n\nThe album is very well balanced out with no absolute standout tracks rather a complete album that keeps the listener interested. A worthy album to look out for, much better than some of the other bands from the area.\n",
        "\nRecalling early era Metallica with their acoustic introduction to the opening track ‘And Death in My Arms’, Boston Mass quartet ‘All That Remains’ make an extremely positive impression upon the listener. And when the bludgeoning begins, you can be assured that this mob know their metal. ATR had to step up a level with this sophomore effort, and it is heartening to report that they have indeed made the necessary improvement upon their 2002 debut ‘Behind Silence & Solitude’.\n\nI must admit that I am a most avid fan of this so-called New Wave of American Metal – I’m a sucker for crunchy metallic riffs laced with that Maiden-esque like harmonies. Along with label mates Lamb of God, Shadows Fall and the awesome Killswitch Engage, ATR are another act of similar ilk, yet still possessing enough individual charisma to stand on their own. KSWE aside (whose new one is going to bring the house down!), after hearing ‘This Darkened Heart’, I’ve a feeling that ATR may have jumped above the other two aforementioned acts in terms of their overall musicality.\n\nCompared to their solid, if unspectacular debut, there has been marked improvement noted in all facets of this bands music. From the bruising, riff-laden production (courtesy of KSWE’s Adam Dutkiewicz) to the more inventive and interesting song structures, Phil Labonte’s vocal histrionics and an overall maturing of their sound, ATR is an exceptionally worthy pick up for the avid modern metal fan. \n\nFurthermore, it is this bands willingness to give the lead solo a much-needed workout that impresses most. Finally, it seems there are some modern metal bands beginning to realize the importance of a good solo. Taking it’s cues from the melodic leanings of their Gothenburg counterparts, plus investing a healthy dose of those twin Iron Maiden leads the work of Oli Herbert and new guy Mike Martin must be commended. \n\nVocally, Labonte is exactly what you would expect on an album like this - Harsh, aggressive and thoroughly convincing in his lyrical rage. Yet, it is clear that hanging out with his buddies in KSWE has left its mark. There are some very familiar ‘clean’ vocal sections on this album that give their music another dimension. Fortunately, they are extremely well placed and not overdone to the point where they become predictable. \n\nATR have made a mighty transition with this new record. Their early metalcore tendencies are virtually gone, opting for a more straightforward thrash, classic mid tempo metal sound to permeate their song writing. With a crushing production and an excellent melodic sensibility, there is no reason why the current American Metal crowd won’t lap this up.\n"
    ]
}