{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Portland, Oregon (early); Atlanta, Georgia (later)",
        "Status:": "Active",
        "Formed in:": "2016",
        "Genre:": "Atmospheric Death Metal (early); Death/Groove Metal (later)",
        "Lyrical themes:": "Instrumental (early); Darkness, Corruption, Depression, Substance abuse (later)",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2016-present ",
        "Number of Reviews": 2
    },
    "Band Reviews": [
        "\nGiven the fact that instrumental metal has been my thing only in small doses, I was very interested to see how an instrumental death metal album would sound like and whether it would remain interesting to listen to even after the half-way mark. Hell, that’s something that even the best death metal bands have a hard time fulfilling and here we’re talking about only the instruments doing the talking. Not an easy task by any stretch. Either which way, I certainly didn’t have very high hopes for the final product, but was certainly curious and intrigued about the music. I had heard a few songs by Keith Merrow and was fairly impressed by his playing, but still had no idea what exactly to expect from this project in particular. \n\nThe aura of both the album cover and the music reflects a very bleak and gloomy outlook to life with the licks and riffs mirroring that image in every possible way. The opener “Colony” opens with a blistering oscillating lick, leading to a frontal assault of tasty dissonant riffs that sound like Jeff Loomis if he expanded the riff sound on his seminal album Zero Order Phase. A pretty damn good start, I must say. I’ve always wondered how his album would sound with minimum leads and maximum riffs and now with this album, it’s safe to say that I’ve found the perfect answer to my question. “Lila” has an amazingly mystical intro with some of the most melodic progressions on the album making it my personal favourite and “In Penitence” (with some of the best and heaviest riffs on the album) along with the title track give you a pretty good idea of what to except with searing memorable riffs, along with memorable licks and leads that really sink in by the 3rd/4th listen of the album. \n\nIf you want the song with the most headbanging reflex, “Mirelands” and “As The Crow Flies” are just what the doctor ordered and “Occlusion” is a refreshing break from the dire, somber feel of the album with the riffs having a more major and happier feel. Funnily enough, I feel the exact same way about the closer “Gabrielle” with a medium to slow-paced solo, bringing the album to a peaceful finish. The 7 minute long “Compound” is quite the furious and frantic guitar clinic with leads and riffs bouncing everywhere leading to quite the crushing breakdown around the 4th minute. \n\nAt the end of the day, it is certainly worth noting that even though this album is anything but an everyday, casual listen, it is impossible not to get sucked into the mystical and uniquely heavy atmosphere that this album evokes. You don’t listen to individual songs off this album, but listen to the whole thing from beginning to end to get the true and proper essence of what heavy, instrumental music is all about in the 21st Century and how this band is one of the main bands actually progressing and pushing the instrumental metal mould to realms not previously traversed before. Given the fact that so many metal albums today sound completely cookie-cutter and one-note, this is truly a breath of fresh air in today’s saturated scenario. Even if you aren’t an instrumental metal fan, give it a listen, it may just surprise and convert you.\n",
        "\nThe first album of Portland, Oregon based band Alluvial has been long awaited by the followers of both founding members o the band, Keith Merrow and Wes Hauch has been released in January 6th, 2017 . Both of these musicians have been involved in some of the most cutting-edge technical metal bands at some point, most notably Conquering Dystopia, where Keith and the seven-string guitar god Jeff Loomis (ex-Nevermore, Arch Enemy) made some of the most intricate, technologically-driven yet absolutely catchy and groovy instrumental music, and the notorious The Faceless where Wes was a part of their third studio album and touring cycle till his departure from the band in 2014. It is no surprise that The Deep Longing of Annihilation should be delivering some of the greatest instrumental death metal sounds ever recorded.\n\nUsually I start the review from the instrumental standpoint. This time I want to put the emphasis on the one of the most crucial aspects of the record. First thing that hits the listeners ear is this eerie atmosphere you don’t really find in this kind of music. Instrumental guitar oriented music tends to sound a little bit dry for most cases. In the case of Alluvial you don’t really get that. Right off the bat you feel like you’ve been put in a different dimension where a certain nihilistic sense of dread takes control. \n\nNow let’s go over the instrumental part of the music, and as usual I’ll start with the guitars.\n\nThe opening track “Colony” starts with Wes’s lead that immediately suggests that his technical abilities to play the instrument is no joke. As soon as the rest of the instruments kick in you are being pummeled by the massive yet clear and instantly recognizable tone of rhythm guitars. If you check out the official album stream in Youtube, you’ll see why the comment section is saturated with comments praising Keith's understanding of guitar tone and after witnessing it by your own ears it leaves little to no doubts why. \n\nThe drumming in this album is handled by Dan Presland, most notably the drummer of Australian extreme progressive metal band Ne Obliviscaris. If you try to compare the drum parts to Conquering Dystopia’s record, it is not a saturated and overly complex yet it has a really obvious purpose along with the rest of the instruments - the atmosphere and making sure everything glues together for the same reason. The production is immaculate, every single hit is articulated to perfection without making it sound sampled or somewhat synthetic. \n\nThe bass guitar plays a huge role in overall sound, tone and feel of the music. While listening to parts where the entire band is playing together, it is not as recognizable as you’d expect, but as soon as the rest of the instruments take a little step back, you can clearly hear what the bass is doing. It’s extremely distorted, yet punchy, the low end is something that pretty much ties it all together. Personally I’ve never heard a bass this distorted but still able to maintain the character and precision that it is required for this type of music.\n\nThe track listing of the album is really thought out. While the opening track starts with a certain fury, the second track that shares the title of the album really puts you in the general mood of the rest of the songs. It takes you through these mood swings of melancholy growing to the heaviest extremities of technicality and brutality.\n\nTo close up the review I want to thank the guys in the band for this amazing record. It’s been a long since the instrumental music scene has put out anything like this. So for anyone who enjoyed the Conquering Dystopia this should be a real treat to listen. Of course the album is somewhat aimed towards the guitar nerds and recording enthusiasts, it should satisfy anyone who fancies heavy metal music.\n\nOriginally written for my personal blog https://noumenonblog.tumblr.com\n"
    ]
}