{
    "Band Information": {
        "Country of origin:": "Germany",
        "Location:": "Dortmund, North Rhine-Westphalia",
        "Status:": "Active",
        "Formed in:": "1984",
        "Genre:": "Speed/Thrash Metal (early); Melodic Power Metal (later)",
        "Lyrical themes:": "Dreams, Existence, Morality, Life, Feelings",
        "Current label:": "Unsigned/independent",
        "Years active:": "\n1984-1990,\n1997-2011,\n2016-present ",
        "Number of Reviews": 27
    },
    "Band Reviews": [
        "\nThe tale of two Angel Dusts is one that’s been told for decades. Their first run, marred by unstable line-ups during a productive ‘80s metal landscape, was able to produce two albums of speed / thrash proficiency. Propelled by frenetic riffs, steadfast writing, and their own distinct flavor, they were a product of their time, ending before many of their contemporaries in a burgeoning scene that would see its own demise shortly after. Angel Dust’s second coming was a different breed. Benefiting from a returning rhythm section anchored by new blood, the emphasis was now on elegance and heaviness instead of zealousness. That meant refining their core sound around expressive guitars and passionate vocals. All that was needed was a permanent vocalist to bring it all together and usher them into a new scene. Enter Dirk Thurisch, a man whose voice would become synonymous with Angel Dust. His dominant cleans brought a new dimension to their sound, giving the band a chance to outdo their peers and carve a new, superior identity. \n\nThis went stirringly on Border of Reality, a good album that mixed ‘80s speed metal fervor with the latest brand of power metal. It was a testament to their skill that they were able to switch genres, cater to several inspirations, and maintain a high level of quality at the same time. It served as a second debut to what now felt like an entirely different band, born again with fresh resolve. Despite being a success, the abundance of ideas and lack of focus meant they were still finding their footing. Having fulfilled their stock of unused ideas, they needed to push forward and create more melodic hooks, memorable vocal lines, meatier riffs, and overall better songs that didn’t reflect who they once were, but who they are now. Going all-in on this direction, Angel Dust created one of the best, most potent power metal albums ever made - Bleed.\n\nIn all ways but one, this album is fucking awesome. The atmosphere is richer, the riffs are crunchier, the tone is darker, the cover art is incredible, almost every song is a hit, and the flow is magnificent. The catchy title-track absolutely exemplifies the leap they made by writing with a unified purpose. Banx’s heavenly keyboard intro typifying melodic power metal was already beautiful, but Aufermann’s resounding riff that follows catapults this into legend. Thurisch soars as he snarls and sings (shades of Tim Owens and Warrel Dane come to mind) unforgettable passages with a firm, delicate intensity. His confident, pained vocals ooze so much emotion that I’m hooked on every line. It’s a terrific opener that almost risks being too godly to put at the beginning of an already stacked album. \n\nThe album progresses with palpable flavor, blending thrash, progressive, power, and heavy metal stylings together in one cohesive force. It’s the tightest the band’s performed, with staples such as the gritty “Black Rain” and the anthem “Addicted to Serenity” displaying a tougher disposition. It’s a balanced sound, similar to what Tad Morose or Brainstorm were doing as their aggressive guitarwork gave them a harsher edge compared to usual European power metal. The pulverizing rhythms are already entertaining, but it’s the way they accentuate the thematic elements and melodic overtones throughout the album that make them the sensational backbone of Angel Dust. The two-part “Follow Me” showcases both extremes of their abilities, going from soft balladry to pummeling harshness with a harmonious climax. While effectively a perfect album, it kills me to say that it isn’t. If this ended on the juggernauts of “Surrender?” and “Sanity” this would have been flawless, but “Liquid Angel” contends with being a lackluster closer. While not inherently terrible, being a slow piano-ballad, it has nothing significant to offer on an album this vigorous. To be that close to total paradise only to fall short at the end…\n\nIf Angel Dust started a new legacy with Border of Reality, they consecrated it with Bleed. It surpassed everything they created up to that point, with only one aforementioned reason it can’t be called the pinnacle of the genre. Along with the following album, Enlighten the Darkness (another veritable classic), they had what seemed like unstoppable energy and creativity. But like all good things, it came to an end. Decades later I’m still clinging to these albums because they’re so much fun. All we’ve had ever since is this snapshot of one great run of music standing the test of time. For all that Angel Dust was unable to achieve since, it can’t take away from what they accomplished back then.\n",
        "\nThere are two classic blunders that all need remember, the first being the folly of waging a land war in Asia, which is followed by the slightly lesser known one of doubting the efficacy of German thrash. Whether it be the glorious speed metal forerunners that set the stage in the early to mid-80s, to the legions of disciples that accompanied or soon followed the wrathful anthems of the Teutonic trio, there is a masterful execution coupled with a militaristic precision that guides this high craft to its elite status. Even when a more accessible chord is struck in response to changing commercial interests as occurred with many prominent acts in the late 80s, there is a commitment to what works that shines through even the lightest of stylistic variants. Thus stands the majestic yet largely unsung speed/thrash opus and second studio outing by Angel Dust To Dust You Will Decay, a wildcard of the late 80s thrash scene by any estimation that serves as a missing link between the frenetic sound of the mid-80s and the emerging European power metal sound being pushed by Helloween and Running Wild.\n\nThe circumstances surrounding this album's creation were a fairly common tale told by the numerous bands that filtered in and out of prominence during the decade of metal. Following a respectable showing on their more textbook thrash-infused debut Into The Dark Past, a series of lineup changes left only the rhythm section in bassist Frank Banx and drummer/founder Dirk Assmuth remaining, an eventuality that would have likely ended an even slightly lesser band. To fill out the roles vacated by guitarist/vocalist Roman Keymer and shredder Andreas Lohrum (who himself handled vocal duties a year prior), two guitarists from the nascent German power metal act Crows were tapped in Vinni Lynn and Stefan Nauer, which sheds a fair degree of light on the more melodic character of the guitar assault that would take shape. However, the true ace in the hole that gave this incarnation of the band its unique edge was Croatian-born singer Željko Topalović, better known by his stage name S.L. Coe, whose soaring tenor and penchant for well-executed banshee wails after the Halford model made him the linchpin of this album's hybrid power.\n\nThis album's power metal proclivities are all but impossible to miss, despite sharing the stage with a neck-destroying speed/thrashing riff assault that could rival the most insane moments put forth by Flotsam And Jetsam or Laaz Rockit at the time. The opening prelude \"3rd Challenge\" presents a looming symphonic instrumental passage that is lofty enough for Keeper Of The Seven Keys, but has more of a military-like flavor akin to Accept. Then, like a mighty Teutonic train running off the tracks, the opening speeder \"Mr. Inferno\" sets the tone for the album on an absolute fever pitch, with the dueling riff battery of Lynn and Nauer being matched by a vicious high-end vocal assault out of Coe that leaves little mystery as to why Scanner would tap him for their second album a year later. What is even more auspicious is the brutal chugging thrash riff that lands just before the guitar solo like a 2 ton anvil, classic Eric Peterson-like viciousness there. Nipping on this apex moment's heels is a more mid-paced and melodic number in \"Wings Of An Angel\" and a somewhat restrained driving beast in \"Into The Dark Past (Chapter II)\" that, nevertheless, manage to work in that fist-pounding thrash edge into what would otherwise be a couple of more mainline 80s heavy metal anthem off Accept's Metal Heart.\n\nContrary to what one might suspect given the slight edge given to more mid-tempo fare, this album devotes an equal amount of time to kinetic, frenzied mayhem as it does slower, epic splendor. Not content to have the fast-paced speed thrasher \"Mr. Inferno\" be the most intense entry, the sheer riff happy pandemonium of \"The King\" blazes away in the most unrelenting of fashions, to the point of rivaling the most insane displays that Jon Schaffer would take to Iced Earth's Night Of The Stormrider a few years later. The riveting title anthem \"To Dust You Will Decay\" has a bit more of a melodic flourish to it, but cooks away at a similarly insane tempo and features one of the most brilliant guitar solo interchanges between Lynn and Nauer, reaching close to the sort of madness that Tipton and Downing would dabble in on Painkiller. \"The Stranger\" has a more well-rounded blend of melody and intensity, but is by no means a slouch when push comes to shove, and the driving speed of \"The Duel\" has a bit more of a tuneful Helloween vibe to it, yet sticks to its speed metal credentials to a fault. Round the whole thing out with a more atmospheric but still impact-based metal send off in \"Hold On\", and what culminates is among the most powerful blend of infectious hooks and uncompromising thrash to come out of 1988.\n\nWhy this album isn't held in the same regard as undisputed classics such as Running Wild's Port Royal and Scanner's Terminal Earth will likely never be properly explained, but perhaps a clue to this past injustice is just how utterly unique it happens to be. The closest analogous album to the peculiar blend of power metal and thrash metal that occurs on here would be to that of Onslaught's often panned third LP In Search For Sanity, and even that comparison is a bit flawed as this album is a bit less convoluted and S.L. Coe's voice is a tad more adaptable to the more percussive shouted style that is often called for within a thrash metal context than that of Steve Grimmett. Ultimately it's the albums that truly offer something original that tend to be passed up by the majority of passers by, despite their insistence that said trait is the paramount in their search for new music. For many of the true blooded thrash fanatics out there who think that the gruff-steeped yells of James Hetfield and Chuck Billy are the closest their music should get to clean singing, this may prove a bridge too far, but it's as much a thrash metal classic as it is a power and speed metal staple, and mainline thrash hounds who can tolerate a Joey Belladonna alongside their usual query should give this a long overdue chance.\n",
        "\nA friend of mine had somehow gotten a hold of the “Border of Reality/Something Wicked This Way Comes” split cassette in 1998, and proudly presented it to me, being quite happy that he had come across another distinguished Iced Earth soundalike. The guy had no idea that that same German act were behind two of the finest creations of the entire German metal roster, especially the orgasmic debut… it took me quite some time to accept the fact that Angel Dust, the retro speed/thrash wizards, had become the next-in-line power metal act…\n\nwith the huge disappointment washed away with quite a few beers, I started seeing the comic, also practical side of this collaboration: but of course it made perfect sense to bond with the Earths; the Americans were following the same trajectory, from an indomitable speed/thrash cohort to a more or less generic power metal team… only that the latter were followed by a sizeable fandom wherever they went… supposedly Angel Dust were hoping that by siding with their more celebrated US colleagues the crowds would readily embrace them, too, provided that the two bands’ styles were quite comparable… besides, who would remember their first two instalments from the dark past, when they were just naïve over-enthusiastic speed/thrash moshers?\n\nSuch must have been the musings of Dirk Assmuth, the only member left from the 80’s team, when he decided to steer his ship in another direction after the reformation. Speed/thrashing like demented is not his cup of tea anymore… why not try something safer, something more commercially viable? But by no means something wicked… yep, sure thing, why not mix muscular power metal cords, a few angrier on-the-verge-of-thrash rhythms, a couple of keyboard nuances, some rousing epicness and boom… you already sound like every fifth act on the planet. Yeah, when you’ve chosen the most commonplace metal genre out there it’s hardly about originality and creativity anymore…\n\nit’s not that the band re-invented the wheel in the 80’s with their first two albums; but “Border of Reality” was such a standard, played by-the-book fare that apparently generating a high level of excitement among the late-90’s fandom was hardly Assmuth’s most urgent agenda. He simply wanted to put his band on the map alongside the other (Iced Earth again, Kamelot, Morgana Lefay, Conception, Tad Morose, early Symphony X, etc.) representatives of the power metal wave at the time, without looking for any immediate returns, and without sounding drastically different from the lot. But then “Bleed” appeared a year later with an angrier and thrashier delivery, and when the album reviewed here came out two more years down the line, flashing the “Darkness” tag from the title, the old fanbase started getting giddy, anticipating a nostalgic look at the past…\n\nnah, nothing of the kind; Assmuth carries on with his power metal infatuations as this opus is quite comparable to the mentioned “Border of Reality”, the more belligerent thrash-prone moments from the preceding one not exactly accentuated on. By that time the listener has already gotten accustomed to the band’s new face, and can’t help but appreciate the professional execution, and the meticulous arrangement which doesn’t miss a single ingredient from the power metal recipe: the rowdy scene-setting opener (“Let me Live”), the more sprawled progressive pageant (“Fly Away”), the poignant keyboard-tinged, sing-along crowd pleaser (“Come into Resistance”), the short lyrical ballad (“Beneath the Silence”), the longer heavy semi-ballad (“Still I'm Bleeding”), the marginally angrier thrashier disturber (“Cross of Hatred”), even the goofy quasi-groovy filler (“Enjoy!”) is here… yep, they haven’t skipped a beat, the new Assmuth gang; add pretty cool clean emotional vocals, the expected polished production and you have nothing to blame the guys for… no blemishes, no glaring pitfalls. \n\nIn other words, this recording has everything… except character. It sounds like dozens of other albums released around the same time; Assmuth was aiming at the golden middle, at the very heart of the comfort zone, and had hit it handsomely. He merged with the hordes of power metal practitioners from the late-90’s/early-00’s, and stayed there until the next band dissolution, providing four decent workmanlike albums. The one reviewed here is arguably the most typical and best representative of the man’s conformist’s stance, again it ticks all the right boxes in the right places, a perfect example of the polished-from-all-sides “go with the flow” creation, one that will never find sworn detractors, and one that will invariably attract a certain fanbase. \n\nOn the other hand, there are moments that sound sincere, like the guys really have fun playing this stuff… and, if you think of it, it’s not only Angel Dust that shed their early more aggressive skin for the sake of a more welcoming one… we have Scanner, Helloween, Running Wild… it runs in the German family obviously… besides, one never knows how Assmuth and Co. would choose to surprise the audience; they’re back on the field, and may have gone past their customary power metal predilections… I don’t know; I guess I always prefer to revel in memories of dark unforgettable past than to ground myself in ephemeral blink-and-it’s-gone present.\n",
        "\nOften considered by other people here to be one of the best speed/thrash metal album from the 80s German scene, I have to agree on that one, for this time. Angel Dust wasn't what it is today at all, to say the least. The band had its best moments right in the 80s, when the genre was at its peak of popularity, but unfortunately, they didn't survive mainly due to the high competition. However, it didn't mean that this album doesn't belong among the best ever recorded in the genre. Angel Dust were not an evil and satanic band at their debut compared to other acts, they were also great musicians at first while having this aggressive mood to create powerful music. In term of quality of the music, I would easily put them at the same level of Iron Angel, early Blind Guardian or Helloween. As you may know, they never got the attention that those other bands had at the time, which proves even more that popularity doesn't really include all quality stuff.\n\nThey released the demo \"Marching for Revenge\" in 1985 which got them a deal with Disaster, this label had awesome bands, but all known in the underground scene only. I am pretty sure that the promotion and distribution wasn't that good too, well all things that are supposed to help a band growing. The first full-length \"Into the Dark Past\" was released one year later in 1986 and just by looking at the cover art of this album, you know that it will be some serious shit right there! Content-wise, the album is filled of great fast-paced riffs, crushing drums and intense vocals. Featuring eight tracks, in which the self-titled one is the introduction, we have a total running time of 39 minutes mostly consisting of speed metal with some thrash elements. I have to say that the introduction of this record is pretty cool, it sets you a bit in the mood because it makes the following track \"I'll Come Back\" to start off as a total blast of guitar riffs. Without an exception, every songs on this album is killer, catchy and memorable in its own way.\n\nThe musical skills and good song writing is easily noticeable, each tracks is over four minutes and has a great variety of riffs and structures. Of course, the best example in this case is the famous track \"Gambler\", which is over seven minutes of length and shows the talent and passion that those guys had at the time. We also can see the presence of great heavy parts in tracks like \"Victims of Madness\" and \"Marching for Revenge\". To me, the most brutal songs are definitely \"Legions of Destruction\" and \"Fighter's Return\", those tracks are the true essence of German speed metal, and I think rightfully so. To be quite honest, it's hard for me to say something negative about this release, in part because there are none, as far as I am concerned.\n\nWell, the only thing I may say against \"Into the Dark Past\" is that some songs are very repetitive, which explain a bit why some tracks are so long. However, it doesn't bother me that much so I guess it explains my rate of 98% on this review. The production work is also very well done, the sound is clear, but definitely has that 80s original mood. The instruments are perfectly balanced in the mix, even the bass is audible, which is a pretty damn cool thing for such an album. After re-visiting this piece of the 80s German scene, I am still not surprised about why I listened to it that many times in the past years, the choruses of those songs are easily getting stuck in my head for a quite a long time... The only sad thing is that the first front man of Angel Dust \"Romme Keymer\" left the band after this album, he unfortunately never did vocals for any project beyond that, but his guitar in the other speed metal band \"Risk\" is pretty good too.\n\nOverall, this is an absolute of the speed, thrash metal genre. Every fan should give a listen to this record, I don't even know how you could not like it. Even their 1988 second release \"To Dust You Will Decay\" is good, so you don't want to miss these guys. This is an essential album and highly recommendable.\n",
        "\nIn my last review, I talked about Angel Dust's debut record \"Into The Dark Past\". That record was a excellent debut, and a step in the right direction. Angel Dust would however go through a drastic line-up change. Guitarist/ vocalist Romme and guitarist Andreas were replaced by Stefan K. Nauer and Vinni Lynn. Vocalist S.L. Coe also joined, making the band a 5-piece. The band released their sophomore effort \"To Dust You Will Decay\" in 1988, the band would take a more melodic power metal approach to their thrash sound. Let's take a look at the record...\n\nThe record opens with \"3rd Challenge\", which serves as an instrumental intro. The synths are epic, and it sets the mood for this classic power/thrash album. \"Mr. Inferno\" follows, and the one thing I love most about this record is Coe's vocals. His melodic power metal approach is even better than Romme's more aggressive style. His vocals are some of the best I've heard ever. New guitarists Vinni and Stefan are even better than Romme and Andreas also. Their riffs are killer throughout the record, and the guitars have that distinct 80's sound. Bassist Frank Banx is more audible and clear here, his bass lines are excellent and they compliment the guitar parts quite well. Drummer Dirk Assmuth's drumming is as good as it was on \"Into The Dark Past\". His drumming is on point and it works. \n\nOne of my favorites here is \"Wings Of An Angel\", the vocal melodies here are just amazing. Especially when he sings these lines...\n\n\"To take you to the stars\nTo take you on your last fight\nThey're taking you so high\nhigher & higher & higher & higher & higher\nTaking you higher\nTaking you high!\"\n\n\"The King\" is where the riffs stand out the most, with the opening riff being one of my favorites. The chorus is memorable as well. This is another killer track! The title track is another highlight., with some very melodic guitar work and vocals. The chorus is the strongest on the album. The highlight on the record for me is the closing track (for the vinyl version), \"Hold On\". This track starts with a beautiful guitar intro and some melodic vocals from Coe. The main riff is superb and the lyrics are almost poetic...\n\n\"You ride on a silver spider\ncaptured in his net\nand your prince rides beside you\nhe knows no way to help\"\n\nThe chorus also provides an uplifting and positive message, basically the lyrics say to never give up and to follow your dreams, hence the title \"Hold On\". The solos are great, they remind me of something Dave Murray and Adrian Smith would of played on Somewhere In Time. This is one of my favorite songs ever, and it is certainly my favorite Angel Dust song. \n\nSo Angel Dust out did their debut in nearly every department. The songs are better, the vocals are better, the guitar work is better, and the bass and drum work is better. No disrespect to Romme and Andreas, but this album was Angel Dust at their peak. I recommend this to fans of Iron Angel, Powermad, Metal Church, and Scanner.\n\nHighlights: \"Mr. Inferno\", \"Wings Of An Angel\", \"The King\", \"To Dust You Will Decay\" and \"Hold On\"\n",
        "\nWhile bands such as Kreator, Sodom, Destruction and Tankard were getting all the praise and recognition, Angel Dust never got the attention and respect they truly deserved. They formed 1984 and released some demos not too long after, so it begs the question: \"Why haven't these guys gotten the same praise and attention as their peers?\" Their 1986 debut \"Into The Dark Past\" was released on Disaster, the same label that brought us Exumer's \"Possessed By Fire\". Let's take a look at one of the best German releases of the 80's...\n\nThe title track opens the record, it's a short instrumental keyboard intro. It sets the mood for what's to come perfectly. After the intro, the fast guitar riff comes in and then BOOM! \"I'll Come Back\" is a fast and furious classic, with some killer riffs. Roman \"Romme\" Keymer handles both vocals and guitar duties and does a awesome job. He has a gruff vocal approach and barks out the lyrics with great power. Andreas Lohrum is the other guitarist, and his solos are killer on this record. His solo on \"I'll Come Back\" is especially awesome. He along with Romme make for a excellent guitar duo. Bassist Frank Banx is audible in some parts. He stands out especially right before the solo on \"I'll Come Back\". His bass can be buried under the guitars at times however. Drummer Dirk Assmuth plays very fast on this album. His drumming isn't anything mindblowing, but he does a decent job. \n\n\"Gambler\" is the highlight of the album, it is 7 minutes of amazing speed metal riffage. The opening guitar melody is creative and original, and Romme's vocals are fantastic. The solos are plentiful, and there isn't a wasted moment to be found. This is an undeniable classic! The opening riff of \"Victims Of Madness\" sounds like something Vivian Campbell would of played on Dio's Holy Diver. The closing track \"Marching For Revenge\" sounds strikingly similar to \"Strike Of The Beast\" by Exodus. The hammer-on/pull-off riff in the intro sounds familar, even the vocal melodies are reminiscent of Baloff's vocal on that song. Similarities aside, this track kicks major ass. Especially the lyrics...\n\n\"I must do what you demand from me\nYou give me orders – and I have to obey\nBut it can’t go on that fucking way\nTime has come for me to break the chains!\"\n\nThis record is one of my favorite German speed/thrash metal albums of the 80's. The riffs, the drumming, the bass, the vocals, everything is on point. The reason I don't give this a perfect 100% is because a few songs aren't as memorable as the others. These guys are talented and competent musicians though, so this is partially excused. I recommend this to fans of Vendetta, Deathrow, Iron Angel, and Agent Steel. \n\nHighlights: \"Into The Dark Past\", \"I'll Come Back\", \"Gambler\", \"Victims Of Madness\", and \"Marching For Revenge\"\n",
        "\nI’m writing this to atone for my atrocious behaviour towards this album when it was released. I severely disliked it as I was expecting a faithful follow-up to “Into the Dark Past”, one of my perennial top twenties; I was expecting the same vocalist, the same no-bars-held blitzkrieg speed/thrash and all the rest. As this wasn’t the case, I quickly forgot about it since there were so many other albums that year for one to lose himself in. A few years later this guy gave me a cassette with the debut albums of two new German acts, Secrecy and Squealer, saying that those two were great stuff, something like the perfect mixtures of power, speed, and thrash, and that they owed a lot to old works like Angel Dust’s sophomore…\n\nthose two were really good albums, and I had to give the album reviewed here another listen, which was on the other side of the cassette that contained “Into the Dark Past”. I wanted to listen to the latter first, naturally, but I had to rewind the tape, which was a hassle, so I went straight for “the dust and the decay”. This was our second encounter, and under more propitious circumstances, as the moment the vocals hit I instantly recognized S.L. Coe, the great singer who did such a wonderful job on Scanner’s “Terminal Earth” which had appeared two years after. That changed the situation entirely, and helped me get into the music much more easily. So the band weren’t doing anything wrong, if you think of it, as the whole German scene (Helloween, Warrant, Iron Angel, Tyrant, Running Wild, etc.) was subjected to this detrimental “softer/mellower sophomore” syndrome which may have been an unofficial sequel to the strives of the more renowned bands (DIO, Judas Priest, Iron Maiden, Scorpions, etc.) to capture the attention of the huge American audience by becoming more radio-friendly. Helloween did hit the big bucks with the “Keepers”, but the others, including our friends here, remained in the underground. \n\nTo tell the truth, the album does have “an infernal” beginning, one I had criminally overlooked the first time around, in the form of “Mr. Inferno” which may even qualify for the debut with its lashing, explosive riffage, pure German speed metal at its most shining best Coe’s assured, emotional vocals adding more depth to the musical proceedings, also pulling out a great chorus. The production is way more polished compared to the debut, and regardless of the aggressive guitars the whole thing comes with a rousing epic sound recalling Helloween’s first “Keeper” and Iron Angel’s “Winds of War”. “Winds… sorry, “Wings of an Angel” justifies this epic part being an officiant mid-paced power metal anthem “winking” at the other side of The Atlantic (Omen, Griffin, Jag Panzer), but the album doesn’t stay on this ground for very long as what comes next is “Into the Dark Past (Chapter I)”, another “wink”, but at the guys’ first coming this time, a great diverse speedster moving from impetuous gallops to more intricate, heavier shreds the whole time. \n\nDespite the title, the latter piece can’t hold a candle to “The King”, explosive speed/thrash which must have been a leftover from the debut, the absolute highlight here, razor-sharp riffs galore and numerous headbanging opportunities at every corner, a shredfest of the highest order which also shows the bass player as a very capable performer. The title-track carries on in a very similar direction and is another sure headbanging fest with screamy leads and the next in line memorable chorus, a perennial delight for all metalheads (where the fuck was I listening the first time around?!). “Stranger” is not “a stranger” to steel gallops and superb speedy accumulations, the intensity toned down by a small notch thanks to a more lyrical passage which accompanies the supreme chorus. “The Duell” (could be “a duel”, but misspelt) is a fabulous short speed metal anthem, a spontaneous slab of energy and vigour, the last one of its kind since “Hold On” is a more moderate mid-tempo power metaller with the nice chorus again and the upbeat, bouncy rhythm-section.\n\nI used to take quite a few albums based on prejudice and the failure to fulfil unrealistic expectations in the (dark) past; ones that I learnt to appreciate for what they actually are. An unreasonable, dogmatic, young metalhead, what could you do… at least in this case I completely made up for my ignorant stance earlier as I’ve listened to this opus hundreds of times now although I still prefer the debut, with the one here a close second in their discography. The similarities to Scanner’s “Terminal Earth”, for example, are quite obvious as the cosmos explorers moved to similar ways of execution on their second instalment as well, influences hypothetically brought by Coe… yes, power, speed, and thrash come mixed in a very appetizing manner here, for the first time on German soil, not worldwide though (remember Lazz Rockit’s “Know Your Enemy” released a year earlier), and in this train of thought this album could be viewed an influence on future practitioners, like the two outfits mentioned at the beginning. \n\nSadly, the guys didn’t preserve this blend after their reunion in 1998, but opted for a more streamlined power metal delivery that still generated a fair amount of interest, but wasn’t anywhere near the combustible level of musicianship exhibited on the first two showings. Regardless, Angel Dust were a very pleasant moment from the 80’s metal scene, they managed a great double (two strong albums released in quick succession before the band split up or disappear for a long period of time), and they’re still alive and well, confidently shaking off the dust of ages, looking into the bright future by always keeping an eye on the dark past.\n",
        "\nThe greatest full-length debut in German speed/thrash metal history is no mean feat. It’s no wonder that the guys changed the direction right after that; they simply didn’t wat to compete with their magnum opus, an album that literally exploded on the scene in the distant 1986 enhancing the speed/thrash metal craze that had already taken voluminous proportions worldwide. This album is a hybrid which sits in the company of Destruction’s “Infernal Overkill” and Exumer’s “Possessed by Fire” those two also crossing both genres, all three some of the finest examples of the blend. \n\nStill, this gem here seems to shine the brightest sounding every bit as ravishing as at the time of release thirty years ago. The orchestral instrumental title-track inaugurates “the carnage” with sinister intimidating tones which grow into the gorgeous speed/thrashing melee of “I’ll Come Back”, a most combustible speed metal anthem to which my neck owes its most serious sprain, again in the dark past. It’s difficult to describe these historical 5-min during which a downpour of steel, sharp lashing riffs will shower the listener who may bypass the interesting bassy implements and the acceptable mid-ranged semi-clean vocals, overwhelmed by the constant riff “assault”. I’ve always tried to imagine how this album would have sounded like with a really emotional high-strung throat behind the mike like Ralf Sheepers (Primal Fear, Gamma Ray) or Michael Knoblich (Scanner); I guess in those not very attached, dispassionate vocals lies some of its charm as well… “Legions of Destruction” has a dramatic melodious beginning where even some leads interfere to enhance the drama, but once the intense speed/thrashing rifforama commences there’s no mercy whatsoever as the essence of the two styles is served with a few more complex breakdowns making things even more interesting. A most compelling headbanging fest so far which is superseded by more progressive arrangements on “The Gambler”, a marginally more laid-back layout which abruptly turns into the next in line speedy fiesta with fiery blitzkrieg guitars and more technical arrangements occupying the middle, with flashy screamy leads interfering as well to make these 7.5-min a most treasured moment from speed/thrash metal history.\n\n“Fighters Return” is another admirable portion of furious fast-paced riffs the cavalcade moving onward remorselessly a few short stomping passages spicing up the vigorous proceedings which receive a more melodic, but equally as intense, decoration on “Atomic Roar”, the definitive speed metal opus with the raging guitars, the more melodic sweeps, the more aggressive thrashy insertions, and the heroic attempt at a semi-declamatory chorus; a most eventful carnival closing on nearly 6-min. “Victims of Madness” prefers a slightly more restrained way of execution initially the riff-patterns clinging more towards the mid-pace recalling Warrant’s “The Enforcer”; expect a full-on attack in the second half, and also book your appointment with the dentist for there will be fallen fillings after these explosive dashes. “Marching for Revenge” is obviously aware that it’s the closer, and that there’ll be nothing after it so it embarks on a most exhausting speed/thrashing “journey” on which even the levelled singer tries a few infernal shouts to add more pathos to the hurting brutal riffage which will literally nail you down first before it makes you mosh around with most reckless abandon. \n\nFor 40-min of pure unadulterated, perennially headbanging fest one simply can’t get any better than that. Toxik’s “World Circus”, Blind Guardian’s first two, Forbidden’s “Forbidden Evil”, Vio-Lence’s “Eternal Nightmare”, Wargasm’s “Why Play Around”, Paradox’s debut which is clearly influenced by this “madness” here… I exclude the Helloween, Scanner, Exumer and Warrant first showings as they contain way too many mid-paced moments; in other words, not that many opuses can offer such grand scale entertainment when it comes to moshing to oblivion and dropping dead on the ground. Such uncompromising adherence to speed with unflinching unwavering attitude has to be admired since even nowadays it’s not very common to come across such a rigid approach as the contemporary practitioners usually like to spice it up in order to attract wider audience. Well, our friends from Angel Dust had no such interests; they sat down one day just like that and created one of the definitive exercises in sheer speed which could put some hardcore, and even death metal outfits to shame. \n\nMusical proficiency was seeping through the few cracks left by the steam-rolling speed metal machine, a sign that the guys might explore a more serious direction on the next instalments. And indeed, this is exactly what happened on “To Dust You Will Decay” two years later, a very strong coming by all means, but not built on speed anymore, though, the merciless shredding replaced by more intricate, progressive arrangements and more melodic configurations the latter now siding much better with the new vocalist S,L. Coe, a great versatile performer with a unique emotional blend that also graced Scanner’s “Terminal Earth” a year later. Alas, this alteration didn’t lead to securing the band a place on the spotlight, and the Angel Dust fellowship was done. Ten years later the drummer Dirk Assmuth, the only permanent member and survivor from the original line-up, found other like-minded musicians to commence a new chapter from the band’s career. The diehard fans haven’t been very happy with this new start as the style has shifted towards more melodic power metal with very few shades of the old speedy prowess if any at all. \n\nThis new delivery found its devoted fans, too, which prompted the guys to carry on with it with four albums released so far by 2002; a more productive period for sure, but hardly superior from a quality point-of-view. Not much has been heard from their camp for the past 15 years… reportedly the guys are back to a more active mode, and if they decide to start marching for revenge once again, with all the speed they can summon, I can see a lot of poor souls looking back at the past full of nostalgy with this most bleak, dark future lying ahead.\n",
        "\nAngel Dust is another band like Vio-lence, they showed up late to the thrash metal party (although early in comparison to Vio-lence), are all but unknown outside of the thrash metal community, and are loved by those within. But unlike Vio-lence, Angel Dust 1. had a decent enough vocalist 2. evolved as artists 3. had a long career. This makes Angel Dust the better band for me, but at the time of this release the two bands weren't very different. \n\nAs a debut album, Angel Dust's \"Into the Dark Past\" feels surprisingly well thought out. The album's sound isn't that of a reckless band who is trying to emulate Metallica, this is a band with focus and at least some identity. The songs are fairly complex compositionally by pure thrash metal standards and while not exactly their own style yet, are fairly recognizable as Angel Dust songs, assuming you've heard some of their other work. There are hints of the power metal band to come, however this is truly a thrash album, so don't expect to hear THAT much of a resemblance to their later compositions. The songs are mostly 4 minutes long, and considering what kind of songs they are, I wouldn't have it any other way. Many bands experiment with 6-7 minute epics, and while some of those bands find success with that, those are far and few between. The songs also clearly have a \"second wave of thrash metal\" feel to them. It's hard to explain, but once you start listening to a lot of thrash you'll understand.\n\nThe album has an okay, but somewhat dry and boring production. The music is exciting enough to make up for that, but the production doesn't do it any favors. Obviously, audiophiles should more or less avoid this album, and to be honest, should avoid the thrash metal sub-genre all together, as production for albums of this type weren't exactly... good. It's the kind of thing that will be annoying at first, and the more and more you listen to the album and albums like it, the less and less you will really care about it. Production on this kind of album is something that is wanted, not something truly necessary. \n\nFor those who've spent sometime with thrash metal, you'll appreciate this album. It's not that what it does is that different, it just is better. This album is somewhat eclipsed by the bands work later on, but this is still a great album that almost all thrashers will love.\n",
        "\nThe debut of Angel Dust marked a fantastic entry into the thrash metal scene. It remains a mystery to me why they did not continue in this direction, because they had definitely a knack for stirring thrash compositions. The album released immense amounts of energy, but it was just a flash in the pan in view of their further development. However, this is a genuine gem and a lot of bands would be happy if they had the ownership of the here presented songs.\n\nAngel Dust surprised with multilayered yet straightforward songs. The material was maintained at a constantly high level. Of course, it is always a matter of personal taste, but Angel Dust worked in a technically flawless manner from a purely objective point of view. There´s no question that the group had no need to hide behind its competitors. The precise approach of the band members was admirable. Fully developed compositions - seven songs and an intro in nearly 40 minutes - were by no means just a matter of chance. The highly elaborated riffing and the sense for the adequate number of melody lines built the foundation of the tracks. Even the longest song (\"Gambler\") left no time for boredom due to its well thought-through construction. At the risk of being attacked for behaving like an old, nostalgic bastard, I would say that everything sounded fresh and lively due to the fact that any kind of today´s riff-recycling had not been invented yet.\n\nOf course, there was still room for improvement. The vocals did not sound very voluminous, but they did also not give any grounds for serious objection. A similar situation applied to the production. But these minor flaws paled beside the excellent level of the songs. With one highlight chasing the next, the band brilliantly performed its style of thrash metal. On the one hand, their almost perfectly flowing songs led to a smoothly running album. On the other hand, the full-length did not lack of power or aggression. The average velocity was high, the sharp riffs at the interface of \"Bonded by Blood\" and the more aggressive tracks of \"Ride the Lightning\" were absolutely convincing. \"Atomic Roar\" was and still is my personal favourite, not at least because of its dramatic drum rolls after the chorus and, of course, the energizing riffs. Its lyrics dealt with the fear of a global nuclear devastation, a typical issue at that time.\n\nThe fantasy cover looked rather kitschy, but this did not really bother me. What mattered was the joy of listening to crushers such as \"Legions of Destruction\" or \"Fighter´s Return\", which demonstrated impressively the astonishing professional level of each and every band member. And it is amazing to see that this joy has not become less throughout the years because the album shows no signs of wear. It seems to be able to keep its youthfulness endlessly. Conversely, this means that it is never too late to get in touch with this record, one of the most matured debuts of the German thrash metal explosion of the eighties.\n",
        "\nThere’s not a whole lot of talk about the first incarnation of Angel Dust outside of the most devoted of early German thrash metal adherents, mostly due to the lack of any reissue to introduce said albums to the current generation. In wake of the revival of interest in thrash metal of the mid 80s variety, this could be seen as a bit perplexing, though most younger bands of today take their cues from either the Bay Area scene of the Teutonic Trio, of which this era of the band doesn’t quite fall into either yet has some elements of both in their earliest stages. Thus relegated to the realm of obscurity, “Into The Dark Past” has become one of the most rare gems in the world of original vinyl and audio cassette recordings, though the world of mp3s has made it more readily available to an audience with a thing for hidden treasure hunting.\n\nThe common ground that this album shares with other releases is a bit less obvious than their locale would suggest, and boasts a bit more of a direct, mainline early Metallica and Exodus influence, not all that far off from the contemporary Tankard debut “Zombie Attack”. But at the same time, this album doesn’t go into full out party mode, and definitely takes a few hints from the more serious side of the German metal paradigm. It’s character of sound involves an outright avoidance of overt tradition the way Talon and Tyran’ Pace had been exploring up to this point, and actually leans a bit more in a thrashing direction than a straight up speed metal one as some might suggest. Nothing on here gets quite as aggressive and heavy as Slayer’s “Chemical Warfare” or even Metallica’s brief lean towards the extreme in “Fight Fire With Fire”, but particularly when listening to “Atomic Roar” and “Marching For Revenge” is definitely reminiscent of several factors at play on “Show No Mercy” and “Kill Em’ All”.\n\nGranted, at the same time that this album cooks away and reminds of why the mid 80s was an incredible period for the development of faster metal sub-genres, there are some subtle hints at Angel Dust moving towards the place that they ended up in come 1998 when they came back into the picture. Perhaps the most overt example is the slower parts of “The Gambler” which definitely show a more mainline heavy metal character that is indicative of several bands in the Accept school. “Victims Of Madness” is a similar story and features a main riff set that comes off as a faster version of Dio’s “We Rock” and a vocal display out of guitarist Romme Keymer that has a few more high pitched screams that average for the album. What actually keeps this album somewhat in line with the broader German thrash sound is Keymer’s mostly harsher yelling vocal sound which is somewhat reminiscent of Schmier, though also in line with Tom Araya’s sound on the first couple of Slayer releases.\n\nWhile this album is among the more difficult to track down these days from the mid 80s German scene, it’s well worth the effort and loss of money if there’s a vinyl loving fanatic in your blood. It’s not quite the cream of the 1986 crop and easily bends the knee to the likes of “Pleasure To Kill” and “Eternal Devastation”, which were a bit edgier and overtly trailblazing the style rather than reaffirming and only slight expanding what had been established a year prior by Agent Steel and Iron Angel. But it’s a high quality album from a band that is less known for its thrashing madness than for its more mainline metal friendly progressive power metal style nowadays, but does a solid job of it.\n",
        "\nWhen we think of German speed/power metal, what usually comes to mind? Helloween, Blind Guardian, etc...sound familiar? Take Walls of Jericho and the Keeper albums by Helloween, Battalions of Fear by Blind Guardian, maybe a great thrash album like Vendetta's Go and Live.... Stay and Die, and combine them into the ULTIMATE power/thrash album! Yes, the keyboard-driven power metal band you might know from the 90's and early 2000's wasn't always that \"laid back\" (if you want to call it that!). Angel Dust didn't hold back in the 80's and ESPECIALLY not on this album! It has it's super thrashy tracks as well as it's power metal classics scattered all throughout this masterpiece!\n\nTo Dust You Will Decay was the follow up to the pure speed metal debut Into the Dark Past. These two albums both share their moments of speed metal glory, but this sophomore release was WAY more melodic and had a new singer by the name of S.L. Coe. Coe had also sang for another great power/speed metal band called Scanner on their second album Terminal Earth. To Dust You Will Decay pushes the limits in every way possible here and really shows what kind of amazing singer S.L. Coe actually was! Terminal Earth was a little more \"straight forward\" than this. Imagine some of the most tightest riffs imaginable in the genre, crazy shredding solos, super memorable and slightly epic melodies all coming together to challenge the best of the best! This album is so monstrous that I wouldn't be surprised if Kai Hansen himself was awed by it's greatness! For all musicians out there, some of these riffs will make your head spin. If you're a guitarist and can pull off the ultra complex thrash numbers like \"The King\" and the title track \"To Dust You Will Decay\" than you are officially GREAT. Helloween and Blind Guardian both show some top notch talents, but this takes it above and beyond. \n\nNow let's talk about the songs themselves and the overall production of the album. There are 9 original tracks and 2 bonus tracks called \"Flight to Russia\" and \"Dawn of the End with a grand total of 11 tracks. The bonus tracks are every bit as great as the rest of the album so they fit like a glove! The production couldn't be better also! You can really tell it is a product of the late 80's with much reverb unlike the more \"dry\" debut. I think the reverb sounds great here giving the songs more atmosphere. Everything on this album also sounds very clear, which is really great because there are so many notes and runs crammed everywhere! \n\nThe album begins with a nice little epic intro track that shifts quickly into the menacing, yet slightly bizarre \"Mr. Inferno\". Angel Dust definitely decided to hit us with something thrashy and very unique. Some of these riffs are very odd-timed and just wait till it gets to the chorus! It's powerful and sounds almost apocalyptic! Then it goes to a few more \"heavy/power metal\" moments rather than the speed/thrash sound of Mr. Inferno. They even did a sequel to their debut album called \"Into the Dark Past Chapter II\", which sounds nothing like the first album at all, but more of very epic power metal! The album decides to hit you even harder in the middle of the album with \"The King\" and the title track. These songs are certainly some mesmerizing thrash metal that will leave you dropping your jaw after every riff, lead, and run played ever so tightly! After the album already leaves you wondering, \"well, I think I've heard it all, this album couldn't possibly have more to offer... could it??\" \nThe answer is... YES. The album finishes with more classic power metal that always seems to throw in a headbanging thrash riff for good measure. As for the bonus tracks, it certainly adds to the album to make a great thing even better! \"Flight to Russia\" is a very well-done instrumental and the second bonus track \"Dawn of the End\" is more of a ballad, but strangely it's a fantastic way to end such an album as this. It's a good way to bring you down easily from all the amazement that has just graced your ears... \n\nThis album definitely deserves a perfect score, for it doesn't lack in anything! The songwriting is topnotch with every song being entertaining. In all fairness it's way more entertaining than the debut and personally I wish they would have done more like this... But ah well, Border of Reality was a great comeback anyway, but still doesn't compare to this epic masterpiece! Every track is a highlight!\n\nNow, for those who actually buy their music like me, these CD's have been out of print for a good while. The general price for To Dust You Will Decay is around $30.00, but it is worth 50 or even 100 in my book! There are also some bootlegs that were floating around for a while, my first copy was a bootleg and I purchased it about 7 or 8 years ago. Even though its a bootleg, it's a good one and I might even say that it's better than the original. However, if you're a completist you might have both versions like myself. \n\nBottom line... GET THIS ALBUM NOW!!! If you like Helloween, Scanner, early Blind Guardian, etc. you can't go wrong!!!\n",
        "\nDon't you love it when you find these hidden, minor classic's, this is speed/thrash ecstasy, What's funny is how the album starts out with a short intro which is the title track featuring some slow piano. It then emerges into a monster of a track called \"I'll Come Back.\" This song is pretty straight forward speed metal but the riffs are classy and effective, the only time the intensity let's up is in a short twenty second break during the solo, then straight back into to the speed insanity, great start.\n\n\"Legions of Destruction\" is next track and is pretty much an instant classic in it's class. Again the song structure uses the same basic speed principles, but the guitars are a touch more melodic and the riffing and soloing is even more stylish here. \"Gambler\" follows pretty much in the same vain with some slight tempo changes, It does have some great riffs and it's also the longest song coming in at seven and a half minutes, but it's just not quite as effective as the first two though, their ideas seem to shine most on the shorter tracks. The next song is another great track with a nice headbanging chorus: \"This is the Fighter's Return!\" This song has a more generic feel, but it's still a very effective track and in the end the unrelenting, pounding chorus sticks in your head and wins you over easily.\n\nEach song is a fun listen, a couple of songs shine more than the rest, I have my personal favorites, you might find that yours differ as there is a consistent quality throughout this album and it's only natural that certain songs might stand out and appeal to the individual listener. The vocalist in this album is also a personal favorite compared to their more power metal oriented vocalists later on, his rough and raw style of barking out the lyrics adds to the appeal of this great debut.\n\nThe whole album uses the same formula of song writing and successfully avoids monotony, even the next two songs are great, \"Victims of Madness\" is probably another classic, it seems when the band try a more varied approach in songwriting and combine this with their fast tempos, they come out with something really special. \"Marching for Revenge\" is another good track, but the same speed and repetitive riffing in this one does take it's toll, there is only so far you can really get with this kind of thing until the repetition starts to effect you in a negative way. Still, everything is far from tedious which is surely a good sign, luckily this was the last track and there is no harm no foul in the end.\n",
        "\nIt can be something of a chore to go back and read some of the reviews I wrote a decade and more ago. Some of them, I think the quality just couldn’t be justified, so I went and deleted them. Others, like this one (which I gave a perfect twenty before), I feel deserve to stand, albeit with a revised score and some caveats. Going back and listening to Enlighten the Darkness, I quickly realise that it’s not a perfect twenty. A lot of the breathless superlatives I loaded this album down with back in 2011 were the fruits of naïveté—and of a surface-level knowledge of both the music scene and of the German penchant for thoughtful explorations of the darkest corners of their national history.\n\nFor one thing, nuanced retrospectives on the Second World War, the Holocaust and life under the Nazi régime in Germany are easy enough to find if you know where to look. In film: Eine Liebe in Deutschland (starring Hanna Schygulla) and The Reader (starring Kate Winslet and Ralph Fiennes, adapted from a book by Bernhard Schlink) both explore the twisted psychology of (former) Nazis, the evils both petty and grotesque of the horrid society they created, and the traumas they visited upon their descendants. The poetry of Günter Grass and Bertolt Brecht, as well, deals with the same themes explored here—the elision of historical consciousness from those complicit in its horrors, the complexity and tortured nature of guilt, the trauma of the perpetrator (while never minimising the trauma to the victim).\n\nIn German music—even specifically in German metal—you can find similar thoughtful historical themes in Ritual Steel, Macbeth, Blind Guardian and even (occasionally) older bands like Accept. Heck: even NDH bands like Die Apokalpytischen Reiter and Bellgrave talk about World War II occasionally with the kind of dark-mirror poetic sensibility that Grass and Brecht brought to their art. Enlighten the Darkness is therefore not a standalone or a unique album in terms of where it stands among postwar German intellectual and artistic output… and I think this is something that I believe, from a careful reading of the liner notes, that Dirk Assmuth and Bernd Aufermann would agree with. They certainly don’t pretend otherwise, and quite frankly it’s not their fault I wasn’t better-informed to begin with.\n\nDon’t get me wrong. Enlighten the Darkness – though not without flaws – is still very much so a brilliant album in its own right. I do feel that the quality of the music holds up admirably alongside the big dogs of contemporary power metal. I still get a major kick out of mid-career Angel Dust’s combination of the atmospheric melodic keyboards with the groove-inflected crunch and squeal of the guitars-bass-drums. Dirk Thurisch’s singing, the carefully-layered keyboard work and the intricate melodic-heavy compositions in particular, still make this album a standout. This album still starts with a bang: ‘Let Me Live’, ‘The One You Are’ and ‘Enjoy’ are still a 1-2-3 flawlessly-executed melodic heavy metal kick to the nuts. And Enlighten of course has the power to draw out the air-guitars and even jerk the occasional manly tear—particularly on tracks like ‘Break the Chains’ and ‘First in Line / Cross of Hatred’. But there are still places where the album drags a bit, or gets wrapped up in its own concept: ‘Still I’m Bleeding’ comes to mind. And ‘Oceans of Tomorrow’, even though it’s a solid song for which it’s really worth listening to the lyrics, still has a slightly radio-rock inflection that raises a bit of an eyebrow given what just preceded it.\n\nI still demur, strongly, from the more neutral-to-negative review for this album that has been posted recently. This album doesn’t shoot for a comfortable mediocrity at all; even if Dirk Assmuth’s speed-slaying days are behind him, he was still aiming strongly for a coherent, well-constructed album which could stand up easily in comparison to what the other A-list veterans of German power metal were putting out at the same time… and he succeeded. I would say that Enlighten the Darkness easily outclasses Power Plant and Chalice of Steel, and that it stands up pretty well even when compared to Nightfall in Middle Earth.\n\n18 / 20\n\n~~~\n\nOriginal review:\n\nAngel Dust is possibly one of the most underrated power metal acts of all time, and Enlighten the Darkness is likewise possibly one of metal’s greatest hidden classics – a quantum leap above Bleed in overall quality (though that's a kick-arse album as well). I’m seriously outraged at not having heard them before now. Listening to Enlighten the Darkness is a sublime experience; I don’t believe I am alone in ascertaining that it should hold appeal for more than just fans of progressive and power metal. Angel Dust (even since their days as a Teutonic speed-thrash band, but much more so in their more melodic reincarnation), has made an artistic point of juxtaposing the brutal with the gentle in creative and startling ways; this album is nothing less than a perfection of that art.\n\n‘Let Me Live’ starts off with a ghostly synthesised whisper, before yielding suddenly to a martial bass lead delivered with all the force of a swift and potent kick to the face – setting the scene for Dirk Thurisch’s lost and bewildered scream, ‘Separate me from the dead all around smashed into the ground; ecstasy of killing blinded my eyes!’ In the first two lines we already see sketched out the conflict that plays out across this entire album – the soldier’s mandate to kill warring against his instinct for self-preservation and his need to be close to his fellow human beings (particularly, in this case, his wife and children). As a concept album, Enlighten the Darkness hangs together remarkably well. Even the slower, more melodic ballads like ‘Beneath the Silence’, ‘Still I’m Bleeding’ and ‘Oceans of Tomorrow’ do not feel overwrought, maudlin or out-of-place. All of them explore and develop this conceptual tension lyrically and musically.\n\nThe production is amazing, and every element is remarkably well-balanced on this album, and each of the musicians is really at the top of his game. Dirk Thurisch deserves particular kudos here; he demonstrates a vocal range and an emotional honesty and intensity rivalling that of Geoff Tate on Queensrÿche’s Operation: Mindcrime, whether he’s in screaming mode (as in ‘Let Me Live’) or moving into a more pained, introspective bass range (as in ‘Oceans of Tomorrow’). Frank Banx’s bass and Dirk Assmuth’s drums are also given numerous opportunities to shine, and they take full advantage (I’m guessing they had particular fun with ‘Enjoy!’). Guitarist Bernd Aufermann also provides the needed power and technical skill, particularly on tracks like ‘Come Into Resistance’. Steve Banx’s keyboard, here given to futuristic chirps and whistles and sound effects as much as melodic synthesiser work (to amazing effect on ‘The One You Are’), is a bit more subdued here than on Bleed, overall, but I think that works to the band’s advantage in this case; the taiji of the keyboard’s yin against the bass/drums yang has been developed and refined to a point where transitions between the melodic sections which the keyboard dominates and the more raw, crunchy power metal sections where the bass and drums do are flawless. I dare any metalhead to listen to the transition between ‘First in Line’ and ‘Cross of Hatred’ and tell me afterward that he didn’t start headbanging at the word ‘go!’\n\nLooking for weak spots on here, I truly and honestly cannot find any. There are no simply weak tracks to this album; however, my favourites here are certainly ‘Let Me Live’, ‘The One You Are’ and ‘Come Into Resistance’. All of them showcase both the band’s massive momentum and sheer, overbearing power – however, once they’ve completely rolled over you with deep, crunchy bass/drums tank treads, on a second and third listen you can appreciate more fully the almost-symphonic compositions which ride atop them. This, my fellow headbangers, is how melodic metal SHOULD sound.\n\nA couple of notes on the album’s lyrics and politics. As readers of my reviews should be aware, I like my music to have an edge to it, preferably one touching on social issues. Angel Dust is far less ham-handed in their antifascist message than, say, Masterplan (who take the standard liberal ‘can’t-we-all-just-get-along’ approach) or Sabaton (who appear to be fans of a mindless rah-rah jingoism); but for all that, Angel Dust explores the issue in greater depth, from the personal perspective of a common foot soldier with an ordinary life and ordinary goals. (Given that they are a German band, and this part of their history remains in many ways a sensitive topic, the perspective this band offers is that much more valuable.) \n\nAs a result, their antifascism is that much more thoughtful and more thoroughgoing – by exploring the horrific experiences and wounded, twisted psychology of someone who actually followed a fascist regime, they are in a better position to tear down the pretensions of the ideology. This is reflected in the music – the soul of the soldier lost in the horror of the mechanised killing all around him, screaming to an unseen power to ‘let me live’; whose pain and sense of loss don’t fade away even when he returns to his family.\n\nConclusion: brilliant album which cannot be hailed enough. For it, Angel Dust deserve all the steel-studded laurel wreaths we can toss their way.\n",
        "\nThough Angel Dust is perhaps best known for the progressive power leanings of their later years, they once dwelt on the same cusp as bands like Iron Angel and Vectom, performing a hybrid of speed and thrash that was borne more of melody and velocity than the barbarism of the more popular German thrash acts. While I've found myself getting into a few of their more recent albums, such as Bleed from 1999, I think overall I prefer this earlier phase. They had a more uplifting tone to them than Kreator or Sodom, and you could see their power metal transition from a mile away, but there's still enough savagery in position here for the fan of harder edged thrash, and the vocals on this debut were performed by original guitarist Romme Keymer, with a very down to earth, blunt tone that is wildly different than Dirk Thurisch's meaty melodic presence in the 90s and beyond.\n\n\"Into the Dark Past\" is an eerie piano piece that ascends into a brief, synthesized choir, and then the storming speed metal of \"I'll Come Back\", Keymer and Andreas Lohrum weaving the riffs through a proto speed/power metal grinder that would thrill fans of old Helloween, Rage, Iron Angel or Scanner. Romme's voice casts a tinny glow over the surge, not unlike Kai Hansen from his Walls of Jericho days, only lacking the same nasally high tone. Great bass and a great lead switch offer a lot to the bridge, and Frank Banx gets another chance to shine as he propels along below the early melodies of \"Legions of Destruction\", another well written piece with some superb guitars throughout; possibly one of the best Angel Dust tracks through their entire career, with enough aggression that you could compare it to Vendetta, Destruction, and the first few Deathrow records.\n\n\"Gambler\" drops to a mid pace for its opening volley, but ramps up speed to provide a verse very similar to what Scanner would be dropping a few years later. Rinse and repeat for both \"Fighter's Return\" and \"Atomic Roar\", and herein lies one of the few flaws of Into the Dark Past: several of the songs do seem to blend together, without much to distinguish them individually. Add to this the other weakness, the lack of any truly memorable chorus parts, and you come up with an album that's very good, but well below the masterpiece margin. Granted, \"Victims of Madness\" is one of the better songs here, with Romme adding some shrieks and a slew of blazing guitar work, and \"Marching for Revenge\" doesn't disappoint either, with a crazed thrust to the verses, but even these fail to muster a chorus sequence that stands to attention.\n\nA pretty strong argument can be made that Into the Dark Past is Angel Dust's best album, but I think I'd have to give the edge to To Dust You Will Decay and Bleed. Neither has such a purist hard-on for the reckless speed of the time period, but both ultimately succeed where this is lacking, in sticking with you longer. Other albums like Border of Reality and Enlighten the Darkness have some choice moments through to their poppy prog devotion, but are both littered with less appealing filler. In fact, if you compare Into the Dark Past to their most recent album from 2002, Of Human Bondage, it's quite difficult to recognize them as the same band outside of the logo. But if you're seeking more along the lines of Rage's Reign of Fear, Iron Angel's Winds of War, Scanner's Hypertrace, or Vendetta's Brain Damage, this is highly likely to please.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nPeople, this is it, one of modern Power Metal's finest moments. Angel Dust used to be a mediocre Thrash band, but the harsh and grueling sands of time weathered them into a tried-and-true Power Metal monarch with riffs, groove, power and intelligence to spare. While their previous two albums Border of Reality and Bleed were great, they were really sort of a transition, of which this album is the final product.\n\nI'm not going to bother with the usual moronic sentiments like \"Oh my God, it's Power Metal that isn't about dragons!\" because I have at least half a brain, but really, this album does eclipse most stereotypical Power Metal with class and style to spare. Angel Dust were always a fairly unconventional band after their reunion, with the closest comparison being a thrashier Symphony X, and here we have their creative peak. Enlighten the Darkness is an oddity in the world of concept albums in the way that it doesn't fuck around with shitty interludes and ten minute songs with spoken word parts, but also in the way that its lyrics are not only unique, but also really good. The concept revolves around the horrors of World War II in relation to one soldier who has come home from the war, and whose vivid, terrible memories are hindering his relationship with his wife. It is a rather vague concept, but it is also really beautifully written, with some absolutely stunning poetic verses in there, and Dirk Thurisch is really the perfect vocalist to communicate it, with his clear, distinct tone and phrasing evoking some of the most heartfelt emotions the human mind can possibly muster.\n\nI think another reason this concept works so beautifully is that the band wasn't afraid of experimenting. The first few songs are all fast and heavy, and they rule, but then the band dips into a slower section of the album, with more poignant and emotional songs detailing the protagonist's failing relationship, and it doesn't sound kitschy or forced at all. These guys just let the music play according to the emotions they wanted to evoke, rather than the opposite way around, which is where most bands that attempt these things come off as contrived. Enlighten the Darkness is a very direct and flexible album, not afraid to go a step beyond what the band's contemporaries were doing and possessing every inch of the musical prowess necessary to get their message across. This album was written in the way that an author would write a novel, in a linear and fluid manner that lends a lot of variety to the sound on hand - it can do anything it wants, not constrained by any genre conventions or cookie-cutter molds, and that is something I wish more bands would do. \n\nOn the musical front, we are met with crunchy, aggressive guitar work that will snap your neck like a twig, yet can also morph into a balladic slow section at its whim, kinetic drum and bass work, and keyboards that only add to the rich musical field of jewels that Angel Dust have mined like Daniel Planesview on his best day, perfectly intertwined with the heavy attack and accentuating the more emotional side of the album as well. Every song pleases, from the crunchy, blazing leads of \"Let Me Live,\" to my personal favorite on here in \"The One You Are,\" with its ultra-melodic tendencies clashing beautifully with the wall of rock-solid sound the guitars churn out, all layered over with that awesome, infectious chorus, to the heavy stompers \"Enjoy!\" and \"Come Into Resistance,\" which will crush your eardrums and mull the remains over into a fine dust, and then to the balladry of \"Beneath the Silence\" and \"Still I'm Bleeding,\" until the album finally climaxes with the one-two punch of the blazing, infectious and triumphant \"Cross of Hatred\" and the poignant \"Oceans of Tomorrow.\" And then, you will either be a fan of this band, or you will be nothing.\n\nAngel Dust really hit home with this one, going miles beyond what anyone else was doing at the time in this genre, and honestly, I don't know if this album has been beaten yet, except by prodigal master-works like A Flame to the Ground Beneath and maybe Be Gone. Enlighten the Darkness is a seminal masterpiece of Power Metal, an artistic statement with few rivals in its field, and any fan worth his or her salt should get this as soon as possible. Essential.\n",
        "\nAh, Angel Dust, one of Power Metal's unsung heroes. Bleed was their second comeback album, and also the one where they really got their shit together and started to rule. There really isn't a whole lot to write about Bleed, as it does not pack much that is especially artistic or special, just a collection of groovy, thrashing Power Metal from one of the best in the genre. Angel Dust were always a very strange band, looking back - nobody else really sounded like them after they re-united. Sure, they had a few similarities to those ever-loving tomb raiders Tad Morose, but those were only superficial, really. So how do I describe this?\n\nWell, let's see. Angel Dust play complex, driving Power Metal with class and finesse, aiming not only to rip your head off with riffs, but also to rip your head off with riffs and class, busting out a gamut of catchy, streamlined hooks and even some tastefully executed synthesizers, which duel with the raging, blistering riffs like the Dueling Dragons roller coasters at Florida's Islands of Adventure theme park. It's kind of like taking a big beat-'em-up bully and teaching him how to use his brain in his nefarious schemes instead of just his fists - this album has both the brawn and the intelligence in spades!\n\nThe whole band moves as a unit here, with vocalist Dirk Thurisch leading the pack with his howling charisma and unstoppable energy. His voice is really something that must be heard to be believed, as he doesn't really sound anything like anyone else in the Metal scene right now, but trust me, he is definitely in the upper echelon of Power Metal vocalists. The guitars here are aggressive and snappy, maybe even packing more of a punch than several of the so-called \"hateful\" Black and Death Metal bands! The rhythm section backs everything up with mind-blowing technicality and heart-stopping conviction, about enough to stop a goddamn bear in its tracks. The songwriting here is extremely complex and yet also extremely memorable, and there really isn't any sort of frill or extra catch here aside from it all just being ridiculously good.\n\nPeople will always cite the title track, with its Savatage-esque piano/riff combination and its driving, hook-laden chorus, as the best song on here, and it probably is. I mean, seriously, listen to that awesome riff and tell me you disagree. And that vocal performance! \"Frightening shadows/Appear behind the light!\" Just picture that being sung in the most vitrolic, menacing, convincing manner you can get with clean vocals, and then picture this bad-ass riff stomping along behind it, and tell me you're not sold already. But where they fail is ignoring the rest of the songs, which are all within a hair of being as good. \"Follow Me Part 2\" is incredibly addictive, with a hook and melody line that will never leave your head, and then they kick into the unstoppable trio of \"Addicted to Serenity,\" \"Surrender?\" and \"Sanity,\" all towering, riff-heavy constructions with time changes and rich musical trappings to spare. The remaining songs are quality, too, even if they aren't quite as good, but who cares? Buy this if you like Power Metal that stands on its own two leather-boot-clad feet.\n",
        "\nAngel Dust surprised everyone with this release, seeing as it is nothing like the stuff they were doing in the '80s, rather taking on a Prog/Power approach that wasn't all too common back in 1998. Comparisons could be made to a slightly thrashier Symphony X, with similar riff patterns and a similar guitar tone, but that's a bit of a stretch, since the material here is so diverse.\n\nThere is a charming sense of youthful creativity at work here, as Frank Bankowski and Dirk Assmuth obviously had a lot of pent-up ideas to let loose after reuniting their band. It almost becomes a detractor, as longer songs like \"When I Die\" or \"Behind the Mirror\" are very, very loosely constructed and filled with a lot of proggy noodling that the band would soon abandon on subsequent releases. But mostly these are great songs all the same, and this progressive slant only serves to make them even more colorful and entertaining.\n\nThe songwriting on the shorter tracks is much more focused and kinetic, with a lot of addictive, catchy, heavy riffs and a bombastic, energetic vocal performance from newly recruited screamer Dirk Thurisch, who is definitely one of the best things about this album and Angel Dust's later albums as a whole. He has a clean voice, but he also has a great ear for melody and he doesn't sound like he's got his balls caught in a vice. There are really no comparisons to be made here, as he doesn't sound like anyone else. His gruff, aggressive snarl can segue instantly into a smooth, melodic croon, and he has an awesome, unique style that you won't be able to get out of your head.\n\nStandout tracks are a bit hard to name, as almost every song here is good. The track listing is well done, with fast and heavy songs like the stomping, hooky title track and the fiery \"No More Faith\" slowly building up a storm to the epic, sprawling \"When I Die\" and the real winner here, the melodic thunderstorm of \"Where the Wind Blows.\" The Rainbow cover is out of place, though, and should have been stuck at the end of the album instead of in between the mesh of colossal Prog epics that the band surrounded it with. This album is not Angel Dust's best, but it is an extremely fun listen and a great display of the virtuosity of the new, superior Angel Dust. Recommended.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nAh, Angel Dust. Somewhere between 1988 and 1998, these guys went from third rate Thrash Metal to first rate, ass-kicking Progressive Power Metal with serious balls. This was their last album to date, and that was six years ago, so who knows if we'll ever get another one from them, but this is some seriously good shit. Even though this is more streamlined and modern than their previous works, with heavier riffs and more conventional song structures and instrumentation, that does little to deter the amount of sheer ass-stomping on display here.\n\nThe title track is a good song, showcasing what Angel Dust are all about with a crunchy main riff and some slicing synth melodies, but it's the double-whammy of \"Inhuman\" and \"Unreal Soul\" that gets things going - just good, catchy fun at its finest, done by one of the best bands in the genre. \"Unite\" and \"Forever\" are equally mouth-watering displays of virtuosity, and then you get the awesome, epic ballad \"The Cultman,\" which has singer Dirk Thurisch stretching out his vocal chords for quite an admirable performance. Definitely the best one on here, and it's nothing like what they were doing before, either, with a masterful display of acoustic guitars complimenting the heavier parts and making for a nice atmosphere. Not everything is good, though, as we also have suckjobs like the lame \"Disbeliever\" and the faceless \"Freedom Awaits,\" as well as the awkward \"Got This Evil,\" with its 80s rock influences that seem out of place on such a dark, straightforward album.\n\nInconsistencies are a problem here, but really the only thing holding Of Human Bondage back is the fact that it just isn't as good as Angel Dust's previous work. There are many good songs here, but none that match the brilliance of the seminal Enlighten the Darkness or the visceral, blistering intensity of Bleed - compared to those records, this one comes off as uninspired. I do like it, though. You will, too, if you enjoy Power Metal that doesn't suck.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nThis. Song. Fucking. Rules. Even if the rest of the album was something like Hurricane Chris \"A Bay Bay\" on repeat, I'd still rate the whole album at least 70. Wisely picked as the opening track, it's no wonder they named the whole album after it; this here is the absolute epitome of heavy(!) German power metal, and in case the exclamation mark in parenthesis doesn't get the point across, I mean we're talking all caps fucking HEAVY here. While the song may be built mostly around a catchy piano riff, the guitars underneath crush, maim and kill everything in sight and provide an utterly unbeatable backbone. In the art of combining heaviness and melody, this is simply unparalleled - the style is a bit similar to \"piano-era\" Savatage, but they were never this heavy, or good for that matter (as damn good as they may be). On a similar topic, as for building a song from light to heavy, the beginning is possibly heavy metal's greatest achievement in this category: awesome smooth piano + string intro and then SMASH!!! If this doesn't send your head into a wild headbanging frenzy, nothing will. As if that weren't enough, the vocals are nothing short of unbelievable and totally on par with the quality of the music. Think Criss Oliva's powerful shrieking, delivered in a soaring, majestic RJD fashion, and with an ungodly Tim Owens-like scream near the end to top things off. On the whole, I cannot stress enough how everything just fucking CLICKS in this one - guitars, drums, keys and vocals all come together oh so beautifully, songwriting and arrangements are dead-on and the production is of course stellar, Century Media and all. Good god, what a song. Four minutes, thirty-nine seconds of pure perfection. One of the top five heavy metal songs ever written. \n\nUnfortunately, this makes the album somewhat of a difficult listen. With the bar set so high by one song, the fact that no other song comes close to matching it is a bit hard to overcome, initially. The rest of the album is thoroughly solid for sure, make no mistake there, but throughout the first few spins you WILL find yourself comparing the other songs to the title track more than you'll enjoy them for what they actually are. The style is pretty much as described above; a definite German crunching heaviness at work, with mid-pace being the order of the day for the most part, and the production brings to mind Century Media labelmates Jag Panzer and Iced Earth. Keyboards are featured and gives the music a bit of a Kamelot-like atmosphere (or Savatage occasionally, when it's a \"plain\" piano sound utilized, like in the title track), but they're only used as a backing instrument and don't sacrifice heaviness in a big way. Overall, what really separates the other songs from the title track is that they're just plain not quite as good, and especially not as easy to get into - songs that require time to sink in are usually the best ones, but not on this album. Still, though, it's all very impressive stuff and surprisingly original and progressive in style for German power metal. \n\nI can't stop mentioning the title track; for anyone that can be bothered with the sub-genre, this song alone should be more than enough reason to look into this one. \"Power metal with actual POWER\" has become quite the cliché in reviews lately, but if there was ever an album to describe as such, this is it. \"Follow Me (Part 1)\" does stick out a bit though, as it's not only a ballad, but really damn poppy and cheesy for this band, sounding like a mix between Queensrÿche's \"Silent Lucidity\" (part of the verse sounds directly taken from it) and L.A. Guns' \"The Ballad of Jayne\". I like it quite a bit but then I like those other songs it sounds like too, so what do I know. The only song that doesn't really do a lot for me is \"Liquid Angel\", a much more typical German-style shit ballad that is seemingly mandatory for every German metal band to pollute their albums with (Primal Fear is especially guilty of this). But other than that, it's piledriving crunch, soaring emotion and a whole lot of headbanging action all the way. All in all, title track: must hear. The rest: highly, highly recommended. \n\n\"FRIGHTENING SHADOWS! APPEAR BEHIND THE LIGHT!\" Oh fuck, I gotta go listen to it again...\n",
        "\nThough Bleed makes more of an initial bang and is an outstanding album in its own right, Angel Dust’s best effort is actually the lesser known Border of Reality from 1998. A comeback album after a ten year hiatus, Border of Reality marked a change for the band as they abandoned the thrash and turned towards power metal. To this date, no other band sounds quite like Angel Dust, which holds true for Border of Reality especially. It’s unique even for Angel Dust – primarily known for being a full on power metal band - because the band borrows freely from the power-progressive realm and have never sounded as epic and ambitious, before or after. Later albums showed the band abandoning some of the ideas present here, to focus more on a straightforward brand of power metal. \n\nThe production is as excellent as on their other (newer) albums. All the instruments are clearly audible and properly mixed. The guitars have a smooth and warm yet heavy sound to them; not raw in any way, yet powerful like hell. What sets apart Border of Reality from the rest is the quality of the songwriting. Although the band has an uncanny ability to produce world-class songs such as ‘Bleed’ for instance, consistency has always been a problem, but not here as my score indicates. There are no weak songs to be found, and it’s exceptionally well-written as demonstrated some of the more grandiose compositions such as ‘When I Die’, ‘Behind the Mirror’ and ‘Coming Home’ - three carefully constructed songs, written with a great sense of melody and pace. Faster cuts such as ‘Border of Reality’ and ‘Spotlight Kid’ mix things up but for the most part it’s a mid-paced affair, which is a good idea considering the epic feel the band is going for. \n\nThe rhythm guitar is as strong as usual and you can find some of the strongest leads here on an Angel Dust album. They don’t make much noise in the beginning and are quite short and few, but starting with ‘Nightmare’ Bernd Aufermann unleashes his creative powers. Noteworthy are the solos in, ‘When I Die’, ‘Where the Wind Blows’, ‘Spotlight Kid’ and especially ‘Behind the Mirror’ and ‘Coming Home’ – all of these totally ripping in a melodious way. Keyboards play a larger role here than on any other Angel Dust album even though they’re fairly anonymous. Their presence is clear on tracks like ‘Nightmare’ and ‘Where the Wind Blows’, but when I took the time to analyze the album, I was surprised at how much keyboard there actually is. The keyboard is mostly used to augment melodies already started by another instrument and it’s done in such a subtle and effective way that it’s easy to miss if you’re not paying attention. \n\nFlowing, melodic and insanely catchy, the vocal melodies are the biggest highlight of the album and largely contribute to its excellence. Dirk Thurisch possesses one of the finest voices in metal in my opinion and is in many ways integral to the band’s sound. He does his best work here, providing some of the most heartfelt and engaging vocals I’ve heard to date. It may be exaggerating things a bit, but the question now that he’s left the band is if they’ll ever be able to reach the same heights.\n\nGreat albums have a tendency to inspire and touch on a host of feelings in the listener. Border of Reality succeeds in that regard. When people talk about great comebacks, this expertly written album in the power-progressive mold, should be high up on people’s lists. Truly monumental and a must have.\n\nHighlights: ‘Border of Reality’, ‘When I Die’, ‘Where the Wind Blows’, ‘Behind the Mirror’ and ‘Coming Home’.\n",
        "\nNo, this isn't another \"Walls of Jericho\", \"Battalions of Fear\", \"Gates To Purgatory\" or anything, but is definitely something that would fit on the shelf right below them. It definitely seems much more polished over their debut before this, and much more mature. This is still the old speed/thrash Angel Dust of their older days, and is drastically different compared to their newly reformed sound, which could be thrown in a big pile of power metal.\n\nThis album features S.L. Coe on vocals, probably mostly infamous for his vocals on Scanner's \"Terminal Earth\", who would later go on to sing for the extremely obscure band Reactor (and eventually created his own self-titled band). Coe has always been one of those vocalists I really enjoy. He isn't mindblowing by any means, but always seems to give out an incredible performance, and his voice is very self distinguished and original. His vocals here are top notch, and are actually easier to hear than his vocals on \"Terminal Earth\". Scanner fans would probably really enjoy this. Thanks to him all of the chorusese here are extremely catchy and enjoyable. Because of his energetic performance alone, this album becomes a very enjoyable one.\n\nThe aggression does tend to feel a bit toned down compared to their debut, but at the same time this feels so much more mature and there's actually some memorable songs. The production is very good for its time, and especially coming out of Germany. The instruments and mixing are pretty comparable to Blind Guardian's debut, but slightly better and clearer. Everything is really easy to hear.\n\nAs for the style, its your typical German speed metal sound with a few more thrash moments than its predecessors. This kind of stuff probably gets its thrash image from the aggression, but for the most part speed metal out of this area tends to focus more on catchy rhythm's and melodies than some of the stuff you might hear out of the States (certainly not the case for all thrash, but to make a point). The King, Angel Dust You Will Decay, The Duell, and the instrumental Flight to Russia sound like something you'd hear right out of the Bay Area. All very great tracks. The intro is actually pretty cool, and after that the first three tracks Mr. Inferno, Wings of an Angel, and Into the Dark Past (Chapter II) carry on the German sound more than anything else on here. Fast, energetic, and with some great catchy choruses. Into the Dark Past is probably one of the best tracks on here, especially when it gets towards the end. Emotions just spill out with the incredible harmonies, and the blistering solo's come back for revenge. Stranger is one of the more diverse numbers, with some of their best melodies, and not to mention the incredible layered acoustic leads in the background fit perfectly. Only to build up to more dual blistering solo's. Hold On is pretty similar in style, and often sounds like something you could have heard from Scanner. The final track also comes off as a little more dynamic and diverse like the previous two songs mentioned, building up to great ending. The very end repeats the intro song in a sense that you could just go back and listen to whole thing over again, and would probably enjoy it. \n\nWay better than their debut, and very underated. Personally I haven't been able to get into Angel Dust's newer stuff, but I really enjoyed this album. So if you're in a similar case and their new stuff doesn't do much for you, it'd still be worth checking out this release. Fans of early German speed metal, and bands like Running Wild, Helloween, Gamma Ray, Scanner, Blind Guardian, Iron Savior, and so forth would probably really enjoy this one. Definitely a great album with some amazing moments.\n",
        "\nHailing from Germany, Angel Dust were one of the more lesser known artists in the metal scene, yet since their resurface in 1998 with Border of Reality they have surged into a much wider audience with a slew of top-notch power metal albums. Their earlier albums are extremely rare; 1986's \"Into The Dark Past\" was their debut - a speed/thrash album sounding typical, and definitely outdated, yet of pretty damn good caliber. And \"To Dust You Will Decay\" in 1988 which featured a much more dominant power metal vibe. In 1985 however, the band released a demo titled \"Marching For Revenge,\" and while I can only speak for myself when I say I prefer their earlier thrash era, I can honestly tell you that this tape is FAR better than their later thrash albums (and for me personally, you could say this band went downhill from here).\n\nI only have this in mp3 format, courtesy of Soulseek, (and will probably die laughing if I can ever find an original copy) but it does indeed sound authentic. The sound is exactly what you'd expect to hear from a 1985 live demo tape, but this is part of the strength of this release. It sounds precisely as you'd expect to hear if you were seeing them play in a pub in Germany at that time. It's easy to envision these guys rocking out on stage before Kreator or Destruction, it just has that brilliant aura and energy of the golden past of Heavy Metal.\n\nWhen you listen through the production and hear the songs that are being presented it's easy to see why this band never released anything this good afterwards. Not only do the sound and energy consititute towards the greatness, but the songs themselves are better written than anything released on their later thrash works. Only the demo's title track, \"Marching For Revenge\" was put on the 1986 debut. Why they never put more of these songs onto the debut or its successor is baffling, but all the same, it just makes this tape worth far much more.\n\nMusically it's much more speed metal, much more than their later speed/thrash albums. There's still the thrash riffing surfacing everywhere, \"Marching For Revenge\" is of course a fast, brutal thrash song, and \"Bang Your Head\" is for the most part thrashy as well. But overall it's akin with speed metal and NWOBHM - it's not just an influence, they capture that fire and wield it like it was their own. The vocals are done by Romme Keymer* who also sang on \"Into The Dark Past,\" only here his vocals are much more fitting to the sound and feel of this tape than the later-released debut. They add a certain \"fuck you, I'm rockin out and don't care how bad I sound\" punk attitude to the music.\n\nThe first song, \"Thunder War\" starts off with a very evil intro provided by a chilling little riff/lead (honestly, you'd think you scored some awesome black metal demo tape) but then it bursts into speed metal frenzy (an awesome transition riff too) and also featuring a really rockin middle section with excellent soloing.\n\nThe next song, and my personal favorite, \"Watch Out\", features really catchy guitar riffing - the main riff just flat out rules, sounding like it's off \"Walls of Jericho\" (same year) and blazing speed. Excellent soloing as well.\n\nThen we have a real gem, \"Angel Dust,\" the band's name track, and it's an awesome instrumental, with some excellent harmonies and leads all throughout the song. It begins off mid-paced with an excellent lead/riff and later some midpaced riffing and more excellent soloing (they just don't know when to quit!), but near the 2-minute mark it picks up and gets faster, and the highlight of the song, the lead at 1:59.\n\nThe next song, \"Bang Your Head\" musically forces you to, and is one of the more thrashier songs on this demo, which has good riffing again and an awesome thrash breakdown in the middle of the song.\n\nThen of course there is the title track of this demo, \"Marching For Revenge\", the most brutal song on \"Into The Dark Past\" and also the most brutal song on this demo. It's fast, it's furious, and it sounds right at home with bands like Destruction and Kreator (who both only had their debuts that year). \n\nThen there's Dixie, a little instrumental outro, which also feature's an out-of-tune section at the end, the only time where the guitar really sounds horrid, but since it's at the end and sounds like the main melody of a German drinking tune, one can only laugh, and say at least the fuck-up brought some laughter to the release.\n\nAll in all, it's a must-have for anyone who likes the thrash-era Angel Dust, and definitely worth a listen from everyone else, as it is not only musically brilliant, but it fits right in with the 1985 audience, who came across Kreator, Destruction, and Helloween for the first time. It just happened to get lost under the shadow of the previously mentioned bands. Get this if you ever see it, don't even hesitate. It's too rare and too valuable to leave behind.\n\n* This site lists Andreas Lohrum as the vocalist, but he is not, he is a guitarist. Romme Keymer plays guitars as well as handling the vocals. Refer to this interview: http://www.angelfire.com/nj3/ufwz/interview26.html\n",
        "\nAngel dust aren't probably the loudest or fastest power/speed metal band in town. In fact, they are easily beaten in those fields. And still, they are an outstanding band on their own merits.\n\n'Enlighten the darkness' is a complex album that could fall in the cathegory of 'concept albums' in which belong, for example, Blind guardian's 'Nightfall in Middle-Earth'. Most of the lyrics talk about nazism in the Germany of the 1930s-1940s, and about the feelings that drove all the horrors that happened during Hitler's dictatorship and the second World War. Some other certain themes are difficult to put in the same box, however, seeing as 'Enjoy' takes more similarities with the film 'Gladiator' than with any of the issues that are mentioned in other songs. The lyrics are good, but just good, with some highlights in songs like 'Come into resistance' or 'Fly away', but their composition doesn't really reach the level of lyrically intensive bands like Dark tranquillity or Blind guardian.\n\nIt's in the music that comes the real meat of this album. The music is composed with a strong sense of power and beauty, and executed flawlessly. Especially highlightable are Steven Banx's futuristic keyboard melodies, Bernd Auffermann's magnificent use of guitars, and definitely Dirk Thursich's voice. I do believe that if only Thurisch was more famous, he wouldn't have anything to envy from the likes of Kai Hansen or Hansi Kürsch. The best-sounding songs in this album are for sure 'Let me live', which has the best beginning a metal band could want for any album as well as one of my favourite guitar solos ever; 'Fly away', that has very good lyrics and awesome voicework, 'Come into resistance', 'Still I'm bleeding', which features very good female vocals; 'I need you', 'Cross of hatred' and 'Let me live'. More than enough songs to justify a buy!\n\nI recommend this album to all those who won't go whining about the music not being loud or anything like that. This album manages to mix some real firepower with ellegant melodic tunes, never sounding much like Iced earth or HIM (to mention two extremes they tend to compare this album to). If you like good music, you owe it to yourself to take a look at this.\n",
        "\nFirstly, I'm going to start with laughing at the apropos that while this LP was quietly derived from the mid 80s, Metallica had just released their \"Master Of Puppets\", which is, to anyone with remote taste in “Heavy” Metal (not seed-to-weak-angst-mall-pop) can easily point out that that particular LP is the most dire, overrated, worthless Thrash LP of the 80s (shame it's taken nearly 20 years for people to quasi realise that). But not this LP I'm about to review.\n\nThe LP Starts off with a typical piano intro track, bit of a typical and pointless LP starter, but some of the best LPs ever have worthless intros, so who cares? Not me. Especially when I heard the fade into the next track over the top of a choral effect (which goes well). I always thought you know a good Thrash/Speed LP by that first riff. Well, the first riff is good, but it's the drop onto the drums that is absolutely excellent. And the vocals soon meet perfectly, too. Decent drop mid song, with an interesting solo part. Nothing excellent, but still consistently good. The song lasts a decent 5 minutes, emphasizing non-appreciation for Metal songs that just drone on and bores the hell out of you.\nNext track is much the same consistency, another 5 minute song. If it was a Metallica LP of the same year, by now some tosser would be screaming \"MAAASTER MAAAAAASTER\" and sending you to sleep over the top of mid-paced, overrated Thrash riffs, designed for accessible-CD-grabbing kiddies.\n\nThe next song 'Gambler', is fucking great, the intro riff is good, drops well after 0:10 or so, vocals soon to follow. But, the impressive part is the early break on the 0:50 mark and the fast technicality displayed on the riff work, brilliant 30 second teaser of brilliance shown there that isn't really repeated on the LP again. Don't think the solo soon to follow after the 3rd minute does the song justice, but the general tempo isn't bad at all. Not too fond of this song being nearly 8mins long, and the 2nd solo nearer the end is confirmation of that opinion. But the way the song ends is amusing, heh.\n\nThe next few songs are pretty much along the same lines, nothing special or mind-blowing, but the emphasis being to competently write consistent good 80s Thrash/Speed, with good tempo. Which they do very well. The song ‘Atomic Roar’ starts off nicely, good song.\nThen we get to the last track 'Marching For Revenge', this song is very good. Great sounding riff work. Great tempo throughout.\n\nOverall, I’m not going to negate the review with negativity about this release not being inspirational enough, or not baring enough ‘importance’ on Metal History, simply going to mention that it’s a decent and consistent LP, nothing awe-inspiring just great Metal to bang your head to. While other crap was being hailed as “genius”. \nGo.\n",
        "\nIf you've heard one German speed metal LP from the mid/late 1980s, you've heard all. Okay, maybe not all, but most. This definitely falls into the \"most\" category... no surprises to be found here, it is pretty much the sound derived by bands like Running Wild, Iron Angel, Grave Digger, etc. There is hardly any thrash to be found here, unlike a band like Paradox, but it isn't as overly melodic as a band like Helloween, nor does it have the over-the-top choruses of the first Blind Guardian or second Iron Angel. It's very fast, being almost completely speed metal (as opposed to thrash and power) and the closest comparison is maybe Grinder, or - from the other major land mass - the first Agent Steel.\n\nThe album doesn't have any cringe-worthy moments, which separates it from the dregs of the genre (Vectom, Tyran Pace), but is not incredible memorable for the most part, with the vocal delivery a general fast yell, and only an occasional scream. No real absurd choruses to be found here, and the riffage is lots of the single-note stuff with the occasional fast counterpoint. In fact, if I had to pick an album to sum up the \"typical\" speed metal sound, this very well may be it.\n\nThe real highlight is the power-metal-based \"Victims of Madness\", which has that one awesome simple three-note riff (it's the first one, and comes back a lot) that's very similar to Toxik's \"Count Your Blessings\", and more variation in melody than the other songs on here. \"Atomic Roar\" is probably the fastest song on here, and also has the coolest solo. The rest is a lot of very similar-sounding matter that could be one very long song for all I can tell. Oh yes, the little bass intro to \"Legions of Destruction\" is total \"Killers\" (Maiden, of course), but only for like three seconds.\n\nIt's not bad, but there really isn't much to differentiate it from the pack. One really brilliant song, a kinda cute intro, good production, and a whole fucking shitload of single-note hyperspeed riffage. If you're a German speed metal freak, go for it.\n",
        "\nThink a combination of Kamelot and Iced Earth. A strange mix, to be sure, but that describes Angel Dust in a nutshell.\n\nThis is a Power Metal band with a lot of power, as one might expect. The guitar riffage is constantly intense and just on the fine edge of thrashy, while the solos are extremely virtuosic, as one would expect from a Power Metal band. The drums are great and make sure that you never stop headbanging throughout the entire album. The vocalist is very sneery and deliberate, with Roy Khan's speed and Matt Barlow's attitude (but fortunately not his stupid melodramatic flair and penchant for being WAY too extreme with his emotions). It's a solid combination, and Angel Dust is really a solid band. There's nothing too new in what we're seeing here, but it's damn good music.\n\nThe best song on here is Bleed, which makes the Top Ten Power Metal Songs of All Time. It starts out with a really cool piano intro, then explodes into a wave of riffage, and the chorus is fantastic. Black Rain is also a very good song and lies in the same vein, although it doesn't have that cool little piano ditty. Addicted to Serenity is another of those nonstop headbangers. Really, the primary purpose of this band is to make you headbang like you were having a seizure, and they're vary good at what they do.\n\nA solid buy for power and thrash fans. Nothing incredible (except Bleed), but the headbanging more than makes up for it.\n"
    ]
}