{
    "Band Information": {
        "Country of origin:": "Finland",
        "Location:": "Helsinki, Uusimaa",
        "Status:": "Active",
        "Formed in:": "1993",
        "Genre:": "Symphonic Heavy Metal/Rock",
        "Lyrical themes:": "Mostly instrumental, Love, Relationship issues",
        "Current label:": "Silver Lining Music",
        "Years active:": "\n1993-present ",
        "Number of Reviews": 39
    },
    "Band Reviews": [
        "\nThe Life Burns Tour might capture Finnish symphonic metal band Apocalyptica at its height, being released right after the exceptional self-titled album and its successful tour. The three cellists and one drummer are joined by session cellist Antero Manninen who had already been an official member of the group in the nineties and would continue to play concerts with them through the first decade of the new millennium. The five musicians play a diversified, energetic and liberating concert consisting of twenty songs and a running time of eighty-six minutes in front of a passionate crowd in Germany.\n\nThe concert convinces with organic and vibrant sound, the fans can also be heard and seen very clearly and the light effects are simple but efficient. The track list offers recent material such as dynamic, fast and short ''Life Burns'', several cuts from the early years like dramatic, melodic and playful ''Path'' as well as a decent selection of cover songs such as gloomy, haunting and menacing ''Hall of the Mountain King'' by Norwegian composer and pianist Edvard Grieg that closes the set with a bang. This concert is a wonderful experience for all fans of the band and also a highly recommended introduction to the unique band.\n\nThis release includes some interesting bonus material as well. There is a short but entertaining tour film that portrays how much the band has been enjoying itself on its most recent tour in the United States of America. There is an electronic press kit for brand-new single ''Repressed'' featuring Bullet for My Valentine's Matt Tuck and Soulfly's Max Cavalera on vocals. The song has otherwise only been released as single and included on greatest hits compilation Amplified - A Decade of Reinventing the Cello. The chaotic tune isn't my favourite but it's great to have it on one of Apocalyptica's releases now. Other than that, this release includes seven music videos released in the past three years since the band's previous live DVD. The music videos show quite some creativity as the chosen locations blend in perfectly with the moods of the different songs.\n\nAs you can read, Apocalyptica's The Life Burns Tour is one of the band's greatest releases ever and has aged particularly well. The concert portrays the band at its very best and the generous bonus material offers diversified entertainment. This release even includes a little booklet which is another nice gimmick. If you can find this release for purchase on the internet or in some dusty second-hand store like I have, then it's certainly worth a few bucks.\n",
        "\nLive might be a bland title for the first concert release by Finnish symphonic metal quartet Apocalyptica but this is actually a damn fine output that has aged particularly well and captures the band's early years splendidly. Back in those years, Apocalyptica simply consisted of four cellists who mostly played covers of famous heavy metal songs from the eighties and nineties with a few first own compositions that were oozing with dramatic, elegant and gloomy atmosphere that might actually please members of the gothic scene more than the occasional metal fan. Another element that made the band sound pure and simple was the fact that there was no drummer involved yet and that no guest singers appeared on stage. The focus is entirely on the cellos, so fans of strictly classical music should also enjoy this concert recorded in a small but atmospheric setting in Munich.\n\nThe concert covers seventeen songs and roughly ninety minutes of energetic, inspired and playful music. Among the cover songs, one can easily point out the soulful rendition of Metallica's ballad ''Nothing Else Matters'' that might even outclass the original version, the dystopian, gloomy and menacing version of Sepultura's ''Inquisition Symphony'' and the brutal, fast and rhythmic take on Sepultura's ''Refuse / Resist''. Sure, it would have been great to cover more than just two metal bands but the versions offered here are certainly played with much passion.\n\nAmong the band's own material, the most outstanding tracks in my ears are the dramatic and heavy ''M.B.'', the excellent mixture of angst and melancholy on ''Harmageddon'' and the slow but soulful ''Path'' that doesn't need any additional vocals in my book.\n\nOne also has to point out the band's rendition of Edvard Grieg's ''Hall of the Mountain King'' that sounds like a twisted dystopian nightmare of the original tune and ends the concert on a high note in seven chaotic, creative and memorable minutes. This rendition of this particular song is perhaps one of the most balanced mixtures of classical music and heavy metal ever created. So-called symphonic metal bands that are essentially composing overambitious rock operas with female pop vocals should listen and take notes.\n\nThis release also includes some excellent bonus material in form of seven music videos, including a very rare version of ''Little Drummerboy''. These music videos have been crafted with much creativity and love that outweigh the lack of budget by a mile. The settings for these music videos always match the moods of the different songs perfectly. Just watch and be amazed.\n\nAs you can read, Apocalyptica's Live represents the band's early years better than any other release and has aged particularly well in my opinion. If you can still find this output someplace on the internet or in some dusty second-hand store as in my case, don't hesitate to invest a few hard-earned bucks into this release, put it on your television at home, grab an ice-cold beer and enjoy two hours of entertainment to the fullest.\n",
        "\nApocalyptica has never shied away from trying new things. Some of those were great ideas, such as moving beyond the novelty of being a cello-only metal cover band by writing original material and adding drums. Others were hit and miss, such as adding vocals. As a result, Apocalyptica’s journey has always been an interesting one, but no album ever appealed to me nearly as much as 2003’s ‘Reflections’. Enter ‘Cell-0’, their first post-‘Reflections’ album to exclusively feature original instrumental material. This announcement was met with a degree of anticipation that could easily result in disappointment. Fortunately, ‘Cell-0’ is nothing short of excellent.\n\nDo not expect a second ‘Reflections’. ‘Cell-0’ is notably less overtly metallic than that record was. Eicca Toppinen, Paavo Lötjönen and Perttu Kivilaakso still occasionally run their cellos through distortion pedals and other effects, but the dominant sound on ‘Cell-0’ is the natural sound of the instrument. Compositionally, the music on ‘Cell-0’ appears to be inspired by soundtracks first and foremost. Listening to the album is an atmospheric, almost cinematic experience defined by beautiful melodies, interesting textures and an expert sense of dynamics. The movie ‘Cell-0’ accompanies still needs to be written, but the music certainly brings images to mind.\n\n‘Cell-0’ still contains a couple of moments during which the cello parts can be described as riffs. You do not need a lot of imagination to picture large portions of ‘Ashes Of The New World’, ‘En Route To Mayhem’ and ‘Beyond The Stars’ being played by a guitarist. And the lengthy title track is a progressive metal tour de force. Much of the album is devoted to a more traditional approach of the cello, however. Heavy metal is such an important part of Apocalyptica’s inspiration that it will likely never be completely gone, but ‘Cell-0’ certainly sounds more classical. Almost gothic at times.\n\nLike always, Apocalyptica manages to bridge the gap between classical music and rock music. This time around, the dramatic ‘Call My Name’ balances melancholic string quartet arrangements with surprisingly contemporary rhythms and subtle electronics. ‘Fire & Ice’ starts out folky, with pronounced celtic sounds, but has arguably the most metallic middle section on the album, while ‘Scream For The Silent’ switches between metallic and classical modes rather abruptly, but surprisingly never sounds disjointed. The subdued darkness of ‘Rise’ has an almost suffocating atmosphere, while ‘Catharsis’ would not have sounded out of place on the concert programme of a chamber orchestra.\n\nIn true Apocalyptica tradition, ‘Cell-0’ is once again something completely different than anything they have ever done before. There are subtle nods to the likes of ‘Reflections’ and ‘Cult’, but the band was careful not to release the same thing again. Turns out the title of the album was not just a random thing to put on the album cover: ‘Cell-0’ definitely is a tribute to the instrument that defined the careers of Toppinen, Lötjönen and Kivilaakso. Anyone who, like myself, was somewhat disappointed by the vocal detours of the past years should be pleased by Apocalyptica’s return to instrumental. Let’s hope it’s the first chapter of a new trajectory.\n\nRecommended tracks: ‘Call My Name’, ‘Cell-0’, ‘Ashes Of The Modern World’\n\nOriginally written for my Kevy Metal weblog\n",
        "\nFinnish quartet Apocalyptica goes back to its instrumental roots on Cell-0 and delivers its best studio album since its self-titled effort fifteen years ago. The nine songs clock in at nearly fifty-four minutes and make this inspired release an early candidate for album of the year. Fans who were craving for the band's sinister sounds as heard on Cult or the group's more adventurous approach on Reflections will finally get what they have been waiting for so long. The band's weakness for thrash metal inspired by the group's recent world tour in support of the twentieth anniversary of its debut album also shines through as multiple songs recall trademark sounds by Metallica, Sepultura and Slayer in the heavier moments.\n\nAmong the highlights, one has to cite the ambitious, adventurous and creative title track ''Cell-0'' that is the most entertaining song on the release despite being by far the longest tune with a length of almost ten minutes. Those who like Apocalyptica a little bit more structured, melodic and focused will certainly appreciate ''Rise'' as another shining highlight on this output. If you want the Finnish masterminds to sound more aggressive, chaotic and relentless, the appropriately titled ''En Route to Mayhem'' will tear your heads off. Another outstanding song is album closer ''Beyond the Stars'' that enters progressive territories with a short spoken word passage recalling Avenged Sevenfold's record The Stage and its shining highlight ''Exist'' in particular.\n\nThere are only a few things the band could improve from here. The canny drum sound in the opener ''Ashes of the Modern World'' recalls Metallica's St. Anger which isn't necessary at all. Actually, if the band decided to go completely back to its roots, the drums wouldn't be necessary at all. This record also features a few minor electronic soundscapes in order to keep the album diversified. Again, those keyboard sounds weren't necessary as the music offered by the three cellos is diversified enough to carry this record on its own.\n\nDespite those little complaints, Apocalyptica's Cell-0 is an adventurous, creative and heavy record of classical music that entertains from start to finish with a balanced mixture of aggressive and smooth, fast and slow, short and long songs. Anyone who likes classical music or heavy and thrash metal should check this brilliant record out. Apocalyptica manages to go back to its roots with much inspiration without ever sounding old-fashioned but timeless instead.\n",
        "\nClassical tributes to metal bands might not sound like anything special by contemporary standards but the band that started it all was Apocalyptica. In a time when symphonic metal was still in the early stages of development, four Finnish cellists who equally admired classical music and heavy metal, decided to record a tribute to thrash metal giants Metallica. What initially seemed like an ambitious misfit or an odd experiment turned out being a winning combination and beginning of an era.\n\nThe record Apocalyptica Plays Metallica by Four Cellos was a surprising success because it showed skeptical traditionalists that classical music and heavy metal have quite similar soundscapes and are actually compatible. The elegance, intensity and skillfulness of this project might have convinced Metallica to experiment with classical music as well and record a live record with a symphony orchestra about three years later which is now known as S&M. \n\nApocalyptica's approach works in all departments. The epic, majestic and powerful ''Master of Puppets'' doesn't lose any of its oomph in seven and a half entertaining minutes. The wonderful ballad ''The Unforgiven'' feels as heartfelt, melancholic and resilient in its classical version as it does in its original form. Even more contemporary tracks like nu metal prototype ''Sad but True'' sound surprisingly detailed, fluid and profound in their classical adaptations.\n\nThe album was recently remastered and released anew with three additional tracks totaling a commendable running time of fifty-eight minutes that sparked a worldwide tour and the release of a massive live album twenty-two and a half years after the initial studio album. This only underlines the significant impact Apocalyptica's Plays Metallica by Four Cellos has had and continues to have if one takes the numerous classical tributes to rock and metal music into consideration. The original eight tracks might not be spectacular by contemporary standards but they are still timeless, dynamic and creative and contributed to the emergency of a fusion of classical music and heavy metal.\n",
        "\nApolcalyptica's second record Inquisition Symphony still focuses on transforming metal songs into classical tunes with four cellos but there are already some significant changes between this sophomore output and its predecessor. The band covers a multitude of bands this time around and opted for a few unusual choices such as covering Faith No More and Pantera which are certainly bands one could hardly imagine in such classical soundscapes before. The Finnish quartet also wrote three own tracks for this release and this tendency would significantly increase on future outputs. The musicianship is overall more adventurous, diversified and also skilled on this second output that marks a step in the right direction despite the international acclaim of its more popular predecessor.\n\nPeople have argued whether the band's three original tracks can compete with the successful cover songs and I tend to say that these songs blend in very nicely. ''Harmageddon'' offers indeed a combination of beautiful melodies and a sinister vibe referencing armageddon. It's quite a statement to open the record with an own composition and it sets the tone for the rest of the album very appropriately. The mysteriously titled ''M.B.'' is pitch dark with its gloomy, menacing and sinister tones but contrasted by an airy, dreamy and haunting middle section. Upon first listening to it, it seemed to be the least spectacular song of the three but turned out being the one with the greatest potential in my opinion. ''Toreador'' is the most engaging of the three songs with its at times playful, haunting and bittersweet melodies. The song proves that the line between darkness and light is a very small one. The band wrote and recorded an even greater sequel to this song for its Reflections release five years later that came around with vivid trumpet sounds giving the tune a most unusual Latin American folk vibe.\n\nAmong the cover songs, Sepultura's ''Inquisition Symphony'' that gave this release its fitting title might be the best because it's haunting, disturbing and at times quite brutal. The original song is great but witnessing cellos producing such sharply discordant sounds is even more fascinating and elevates this version over the original one in my book. ''Refuse / Resist'', another brilliant Sepultura cover, is equally disturbing and has an almost industrial vibe since the instruments sound so cold, discordant and nihilistic. Classical music can't get any heavier than this.\n\nIn the end, Apocalyptica's Inquisition Symphony is a step in the right direction for the band as it combines diversified cover songs with three solid own compositions. The record is timeless and has aged very well as it combines classical instruments from the past with contemporary metal tendencies in an efficient way. The album title accurately represents what this record sounds like and stands for. Fans of both classical music and heavy metal should appreciate this unfairly overlooked gem.\n",
        "\nCult is the first Apocalyptica record I have ever bought fourteen years ago and it's still among my very favourite records of the Finnish cello quartet. It's the first record that focuses strongly on Apocalyptica's own material. Predecessor Inquisition Symphony had included three of their own songs while the predecessor here only features three cover songs on its regular version.\n\nThe sound that defines Cult is a quite apocalyptic, menacing and sinister one. There are a few more melodic songs like ''Path'' or melancholic tunes like ''Hope'' that offer some diversity but the almost nerve-firing''Struggle'' or the haunting and perfectly titled ''Hyperventilation'' exemplify a destructive mixture of dramatic classical music and thrash metal spirit. Listening to the record from start to finish feels like listening to an auditory horror movie that oozes with haunting atmosphere. The album title and cover artwork only underline this gripping approach.\n\nThe record's special edition is the first to include collaborations with singers that would later on become a regular element in the band's career. ''Path Vol. 2'' features Sandra Nasić, singer of German alternative rock and nu metal band Guano Apes, and her varied and emotional performance on this song is probably the best in her career. This isn't a case when the vocals make the music sound better but when the music makes the vocals sound better. The combination of both is a perfect match. ''Hope Vol. 2'' features vocals by Matthias Sayer, singer of German alternative rock band Farmer Boys who usually crafts a mixture of gothic metal and alternative rock. His vocals have never sounded as great as in this dreamy, mysterious and uplifting song as he manages to convince with his lower register as well as with his almost angelic high notes. The song was appropriately chosen for the soundtrack of visually appealing French gothic mystery masterpiece Vidocq. I usually don't discuss films in music reviews but if you haven't watched this film yet, do yourself a favour and do it since this unique movie hasn't lost any of its charm almost two decades later and is still among my very favourite films.\n\nApocalyptica's Cult is a surprisingly apocalyptic indeed, intensively haunting and overwhelmingly sinister record where the sum is greater than its parts. Despite its constantly ominous atmosphere, the album also comes around with heartbreaking melancholy and mysterious melodies to keep things diversified. Ironically, the cover songs blend in well with the overall concept but are among the weaker tracks which only underlines the band's incredible talent. This record has more atmosphere, depth and energy than many regular metal bands are able to offer. It can be described as a symphonic metal milestone and important step towards emancipation for the band.\n",
        "\nReflection is Apocalyptica's last full length instrumental record to date and also its most diversified in this regard. It\"s also the group's first album without any cover tracks and exemplifies the band's great leap forward in terms of self-confidence, identity and evolution in general. \n\nThe band varies from heavier tracks with additional drumming by no other than Slayer's Dave Lombardo on tracks like the engaging ''Somewhere Around Nothing'', offers gloomier songs that could have been included on intense predecessor Cult such as the ominous ''Cohkka'', contrasts such tracks with adventurous ballads like the beautiful ''Faraway'' and also offers experiments such as ''Toreador II'' with additional trumpet sounds that give the song a lively Latin American folk vibe.\n\nThe record's special edition, entitled Reflections Revised, is comparable to the one of predecessor Cult. It includes, among other elements, a haunting cover version of Rammstein's gloomy ballad ''Seemann'' with German punk legend Nina Hagen on vocals who gives a truly expressive performance. This is one of the few cases where I prefer the cover version over the original track which was already great. You can almost feel the stormy waves hit you in the face on a dark night while listening to this atmospheric masterpiece. Things get even better with an alternative version of the dreamy ballad ''Faraway'' that gets additional vocals by Lambretta singer Linda Sundblad who gives an already intense song an even more soulful and almost sexy appeal.\n\nReflections is one of Apocalyptica's finest hours and shows how diversified the mixture of classical music with cellos and occasional pianos and trumpets on one side and heavy metal song writing structures with drums and additional percussive elements can sound. The record exemplifies Apocalyptica's emancipation and grows with every single spin. It can rightfully be considered a symphonic metal classic in hindsight. If there were only one record to represent the band and what made it famous in the first place, this album would be the ideal choice because of its stunning diversity.\n",
        "\nEponymous efforts either represent the beginning of a career, the end of an era or a significant reorientation. The latter option is Apocalyptica's case. \n\nThe Finnish trio had collaborated with different singers for special editions of different albums and alternative versions of singles before but this eponymous album was the band's first record to feature regular tracks with different vocalists. Some fans of the band's early years were quite displeased but this change proved to be commercially successful as this album can be considered the band's breakthrough record on the old continent. \n\nThe album even dares opening with the straight-forward ''Life Burns!'', featuring vocals by The Rasmus' singer Lauri Ylönen. To give you some context, The Rasmus had just had its commercial breakthrough and had conquered the charts all around Europe with its gloomy alternative rock style that equally appealed to younger gothics and younger metal fans. Their records were the kind of music that would be played at a party and appeal to all types of pop and rock music fans. Still, The Rasmus was everything but an ordinary band and especially the vocalist has a quite unique timbre that doesn't compare to anyone I had ever heard before or have ever heard after. Personally, I adore this record's courageous opener with dynamic cello sounds, emotional vocals and fast drum passages. It opens the record with a bang and leaves a profound impression. \n\nThis isn't Lauri Ylönen's last appearance on this output. He performs vocals with HIM's Ville Valo on melancholic gothic ballad ''Bittersweet''. HIM was another highly successful Finnish band at the time and its charismatic chain-smoking singer was particularly popular among young female gothics. Traditionalists might have been shocked by his appearance on this record but the truth is that his incredible low register harmonizes perfectly with Lauri Ylönen's higher timbre. ''Bittersweet'' is a gothic ballad of the grandest kind, a timeless classic oozing with atmosphere that has stood the test of time. \n\nThe record's final track includes a hidden track or alternatively a bonus track with vocals by either German-Czech alternative rock band Die Happy's singer Marta Jandova or French alternative rock band Dolly's singer and guitarist Emmanuelle Monet. This hidden track is in fact an alternative version of instrumental song ''Quutamo'' featuring English, German or French lyrics. The melodic vocals blend in surprisingly well and give the song an eerie vibe. It's noteworthy that the lyrics aren't simple translations as especially the French version has quite a different meaning than the other two songs.\n\nAs if that weren't enough, this album is only the second to feature drums and they sound particularly energetic here. Again, old-fashioned elitists saw this as a loss of identity while new audiences appreciated the additional drive. ''Fisheye'' for instance can almost be called a thrash metal track with complex drum patterns, incredibly fast cello parts and yet the band's typically melancholic melodies. ''Betrayal / Forgiveness'' features Slayer's drummer Dave Lombardo and could be described as best Slayer song from the new millennium that wasn't even written and performed by Slayer. Both tracks are among the heaviest songs Apocalyptica have ever written.\n\nThis leads to another point. Another element that makes this release special is that it's by far the band's most aggressive output. The sounds made by the three cellos are often more brutal than what many traditional metal bands manage to unleash with guitars and similar instruments. This just shows how versatile classical instruments can sound. ''Fatal Error'' for instance sounds quite stressful and evokes an unbearably apocalyptic atmosphere in only three consistent minutes.\n\nFans of the band's previous records should not be afraid though. Apocalyptica still features a few songs that slow down and focus on elegant melodies like melancholic ''Ruska'' and the elegiac closer ''Deathzone''.\n\nUntil today, Apocalyptica's eponymous record remains my favourite release of the Finnish trio. The album is very atmospheric and features numerous soundscape from aggression over melancholy to mystery. The three tracks with vocals blend in perfectly and only enhance this album's overall angry and gloomy soundscapes. This commercially successful release was an introduction to both classical music and heavy metal for many young listeners one and a half decades ago and deserves more credit than it gets. Classical music and heavy metal have rarely harmonized so well as on this output. This record has aged perfectly and its impact and legacy are unquestionable.\n",
        "\nApocalyptica had started as an instrumental band consisting of four cellists offering covers of metal songs before gradually writing their own impressive music. The band later on focused more and more on collaborations with different singers and even hired a permanent vocalist at a certain point. Worlds Collide is a transitional effort between both phases. The record still included numerous instrumental songs but also features four collaborative efforts with commercial appeal. While the self-titled predecessor was quite a success in Europe, Worlds Collide led to a lot of radio airplay in the United States of America and can be considered as commercial breakthrough on the American continent.\n\nThe title Worlds Collide is cleverly chosen because the band offers quite different soundscapes. This is particularly obvious in the collaborative efforts. ''I'm Not Jesus'' featuring Slipknot's and Stone Sour's Corey Taylor sounds quite repressed, modern and gloomy. David Bowie cover ''Helden'' featuring Rammstein's Till Lindemann is an atmospheric, epic and mysterious gothic anthem. ''I Don't Care'' featuring Three Days Grace's Adam Gontier is catchy alternative rock and turned out being the band's most successful single internationally. ''S.O.S. (Anything But Love)'' is a melancholic pop ballad featuring soothing vocals by Lacuna Coil's Cristina Scabbia. While all four songs have their certain appeal, they don't really fit together. Personally, I neither like the pressured ''I'm Not Jesus'' nor the saccharine ''S.O.S. (Anything But Love)'' even though they might appeal to fans of the respective groups of the band members involved here.\n\nThankfully, the instrumental tracks make the record a little bit more cohesive, fluid and structured. They often sound adventurous, epic and somewhat menacing. The opening title track ''Worlds Collide'' has a majestic atmosphere and showcases the band's outstanding musicianship that made the group so unique in the first place. The limited edition offers some of the best instrumental tunes on this album with the melancholic epic ''Ural'' that unfolds progressively with surprisingly vivid drum passages, the uneasy, lethargic and gloomy ''Dreamer'' that would blend in perfectly in a film noir and finally the more dynamic, focused and melodic ''Lies'' that was sadly only included on Japanese versions of this record.\n\nAside of the lack of cohesion, Worlds Collide can be described as Apocalyptica's most diversified release that serves as excellent introduction to new and occasional fans. Personally, I would have preferred more instrumental tracks without unnecessary drum passages and less collaborative efforts for a more cohesive release. The instrumental songs have a constant high quality while the diversified collaborative tunes won't equally appeal to everyone. Still, Worlds Collide is overall a very good and especially entertaining record. While it can't compete with the strong predecessors, it would leave a better impression in hindsight if compared to the unfocused successor 7th Symphony.\n",
        "\nAmplified - A Decade of Reinventing the Cello is a greatest hits record that underlines Apocalyptica's first five studio records and the fact that ten years have passed since the group's first release. Back then, Apocalyptica was slowly shifting away from its mostly instrumental records towards albums that would include more and more guest singers which would first take away from the band's own identity before the group reinvented itself recently and decided to work with a regular singer as a fifth band member. That's why a look back at the band's early years makes sense and it's great to see that this compilation includes fifteen instrumental tracks versus eight songs featuring quite interesting guest vocalists.\n\nIn order to add something new to the compilation, Apocalyptica included one new instrumental tune and one collaborative effort on this release. To be honest, those two songs are among the worst despite the band's respectable intentions. The instrumental cover of Slayer's \"Angel of Death\" doesn't unfold the same magic as some other heavier instrumental tunes such as Sepultura's \"Refuse / Resist\". The new collaboration titled \"Repressed\" features Soulfly's Max Cavalera and Bullet For My Valentine's Matt Tuck. They aren't my favorite singers to say the least but that isn't the problem here. The skills of the harsh modern metal vocalists just don't harmonize with the three cellos. In addition to this, the song writing is underwhelming since the song isn't even remotely memorable. I have listened to it several times again before writing this review and I already can't remember it anymore, that's how faceless this track is.\n\nThe rest of this compilation features Apocalyptica at its very best though. Among the instrumental tunes, the diversified and melodic ''Harmageddon'' is one of the band's early and often overlooked masterpieces. Concerning the cover songs, the mixture of melodic and explosive sections in Metallica's legendary \"One\" works perfectly with the cellos. Among the collaborative efforts, the deeply melancholic yet beautiful \"Bittersweet\" featuring the charismatic vocals of The Rasmus' Lauri Ylönen and HIM's Ville Valo is an eternal anthem for gothics all around the world while the enchanting \"Faraway Vol. 2\" featuring Lambretta's young singer Linda Sundblad represents the opposite with its liberating and positive vibe despite the darkly romantic and desperate lyrics and actually invites you to dream yourself far away.\n\nIn the end, Apocalyptica's Amplified - A Decade of Reinventing the Cello is a richly detailed anthology for new and occasional fans. Its only weak spots are the two new tracks but they don't drag the uniqueness of this creative band down. This band and this compilation prove that heavy metal and classical music are quite similar in terms of techniques and emotions and can in fact harmonize and complement each other perfectly. Anyone who likes either genre should go for this record without any hesitation.\n",
        "\nApocalyptica has always been a diversified yet unique band. In the past five years, the band has released a video game soundtrack, recorded a commercially successful regular album and gone back to its classical roots inspired by Richard Wagner for a couple of sophisticated concerts that were recorded for a great live release. “Shadowmaker” also tries out something new as the line-up includes a regular singer for the very first time in Apocalyptica’s career. Franky Perez has a powerful and versatile voice even though he isn’t the most charismatic and impressive singer. Still, his continuous presence on the record adds a coherent flow and Apocalyptica sounds like a real band rather than a project that invites a couple of random guest singers as it was the case on the previous efforts. Another thing that keeps the album together is its atmosphere somewhere between melancholy and mystery.\n\nFear not, old fans, for the band still includes a couple of great instrumentals on the album plus a few epic songs where the instrumental passages add much more to the listening experience than the vocals. The menacing bonus song “Reign of Fear” would be a perfect tune for a horror movie. In the beginning, the track sounds disturbing, heavy and slow and by the end it sounds dramatic, epic and fast. This is the best instrumental track the band has done in a while. “Riot Lights” is another outstanding instrumental track based on hypnotizing and rather fast cello sounds but it features an elevated amount of electronic samples and some weird background noises that give the song a quite unique identity. This is definitely the most courageous track on the new album. Those who want to hear some calmer and purely classically inspired material should appreciate the epic album closers “’Til Death Do Us Part” and “Dead Man’s Eyes” even though the latter one has some noticeable lengths and fails to end the album with a bang.\n\nIn general, the useless short opener and the unfocused closer are the weakest parts of the album and fail to kick the record off on a high note and end it in a glorious way. The only other track that I don’t appreciate on a personal level is “House of Chains” which sounds a little bit like a commercial metalcore song on cellos that could also come from Bullet For My Valentine or Trivium. I know a couple of great metalcore bands but the mixture of classical music and this kind of modern metal just sounds odd and reminds me of the track “Repressed” from Apocalyptica’s greatest hits record. The track feels alien on this album.\n\nAll other songs with vocals work quite well. “Cold Blood” is really catchy and features great cello riffs, intriguing background noises and truly soulful vocals. The song has the most promising commercial potential along with the compact bonus track “Come Back Down” which sounds a little bit out of context on the album but that convinces with an experimental drum play and a chorus that I would describe as chaotic beauty. The gloomy title song “Shadowmaker” goes in a very different direction as it sounds really epic and mysterious. I immediately liked this courageous first single choice that never falls off despite a challenging length of eight minutes. “Slow Burn” is another really melancholic song that could have found its righteous place on Apocalyptica’s amazing self-titled effort ten years ago. “Sea Song (You Waded Out)” has a similar approach but has a more elegiac yet hopeful tone that should please to those who liked Apocalyptica’s “Reflections” release twelve years ago. It’s not just because of the title that the song sounds like Apocalyptica’s own take on Rammstein’s melancholic ballad “Seemann”.\n\nThe great thing about this release is that almost all tracks have grown on me after four or five spins. At first contact, I wasn’t all that impressed and missed Apocalyptica’s old classical and emotional style. This album is still not as consistent and profound as “Cult” or “Apocalyptica” but the record has convinced me with a balanced mixture of Apocalyptica’s old classical style and more recent commercial efforts, a fusion of a clear guiding line in form of a mostly melancholic and mysterious atmosphere and an elevated number of short experiments, a potpourri of extended instrumental parts and solid vocal performances by the same versatile singer. My first advice to fully enjoy this effort is to buy the limited edition of this release and to always listen to the record as a whole. My second advice is to give the album time to grow on you. Don’t give up after one or even two tries. Let the album work on you in different situations. I’m sure you will get rewarded for your patience at a certain point. It’s great to see that Apocalyptica has shifted away from more accessible music and delivered it most profound studio record in ten years. This album can be seen as a new beginning for the band and I’m curious to see where the band goes from here.\n",
        "\nFor best results lets split these tracks into 3 categories. Metallica covers, other covers and original songs. The Metallica covers are all well done, as proven by its predecessor the guys know how to get it done and they have only improved their craft since then. Vocal melodies, bass lines, guitar riffs and solos all almost seamlessly turned into cello melodies into a sort of 4 man symphony. You wouldn't believe how stunningly great Metallica's compositions really were from a musical stance (music in general, not just metal) until you replace the heaviness with beauty. \n\nThis works best with Nothing Else Matters, obviously because of how relaxed and soft the original one was, the acoustic guitar melody translated to cello becomes more beautiful and equally as touching, pretty much set in stone this one would work though, let's try another one like... For Whom the Bell Tolls. Sadly, it doesn't have that classic bell opening or any of the drumming. However all the melodies are tightly performed. You can hear string plucking on the intro to really capture the nature of the riff being played. Despite the lack of drumming the rhythmics are still there.\n\nNext come the other covers, 1 from Faith No More, 1 from Pantera and 2 from Sepultura. From Faith No More we get From Out of Nowhere, probably the most upbeat of the song selection. I would have hoped for one of FNM's more funk styled songs to hear how it would come out, but alas this one is more rock oriented so the result doesn't stand out from the others nearly as much as it could. Sepultura's covers are actually heavier then Metallica's and the cover of Inquisition was the best of all the covers. Refuse/Resist for example is where the distortion on the cello is mostly clearly present.\n\nPantera was also covered, remember what I said about Metallica, here its the opposite, take away how heavy it is and it's a one way rollercoaster to wanting to shred your ears, granted I was never a Pantera fan to begin with but man this was lame. The distortion allows them to make unusual sounds with the cellos making up for sections where a cello wouldn't normally go but it still doesn't match up to the missing screeches and squeals typical to Dimebag's style. They also pluck quite a bit more here to make some of the one note riffs more emphasized.\n\nFinally we have the original songs, they are some of the best tracks to be found, beautiful, intense and about as heavy as a four man symphony will ever get. If these had been done with conventional metal instruments they would be both melodic but also heavy as fuck. They make good use of the distortion to provide heavier rhythmic sections while the others lay off the distortion to provide melodies more front and center. They lean farther away from typical song structure as well making them distinctive.\n\nThe best part though is that they played it very well, I can only imagine that these 4 men are amazing at the instruments they play. True virtuosos, I can't imagine this was easy for them at all. Keep in mind though, this really is more of a novelty then anything else and even the band that made it left the idea for something else to albums in to their career.\n",
        "\nThree years after their least convincing studio effort “7th Symphony”, Apocalyptica comes around with a rather intriguing project. The band came together with the MDR Symphony Orchestra and different choreographers to create fourteen instrumental songs inspired by but not directly copied from legendary German composer Richard Wagner. The band performed these songs to celebrate the legend’s two hundredth birthday in his hometown Leipzig in front of a cheering but sophisticated crowd. Those who were missing the earlier years of the band inspired by instrumental works somewhere between extreme metal and classical music will finally get new exciting material from the band. Despite the addition of audiovisual effects, circus and theatre arts, dance performers and the symphonic elements, the three celli and sometimes even the drummer still stand out on here.\n\nThe band starts with an atmospheric, disharmonic and menacing introduction in form of the short pieces “Signals” and “Genesis” that should immediately please to fans of the “Inquisition Symphony” and “Cult” records. The band even gets a lot heavier in several tracks when the pace gets faster and the drums kick in as in the second half of the dark “Fight Against Monsters” or the apocalyptic and dramatic “Flying Dutchman”. Calmer songs such as “Bubbles” or the elegiac and melodramatic “Birth Pain” offer some well-deserved breaks to the audience. The mixture of symphonic elements and the original Apocalyptica sound works best in “Path In Life” as well as in the diversified double pack “Ludwig – Wonderland” and “Ludwig – Requiem”. While all of these songs are amazing, I associate something special to the outstanding “Path In Life” that remains extremely gripping from the beginning to the end. It’s maybe the best Apocalyptica song ever written.\n\nIn the beginning, I was afraid that this project might be too overambitious and sophisticated and at first try, it was unusual to listen to the band in that kind of way again after their chart hits with different singers such as “Life Burns!”, “I Don’t Care” or “End Of Me”. After a second try, I was entirely convinced and at my third try, I started to realize that the band delivers us a true little masterpiece on here. It’s a little bit tough to give a rating on here as I’m not familiar with all of Richard Wagner’s works and don’t know how much comes from him and how much from Apocalyptica and their partners but maybe this doesn’t really matter in the end. This album is musically diversified, emotionally profound and technically stunning as music should be. Apocalyptica fans simply can’t get around this and should even evaluate this release as a new studio release rather than a live record of the band. From that point of view, the band surpasses the amazing “Worlds Collide” and is at least on one level with “Cult” and “Apocalyptica”. Time will tell if this release is even better than those but I guess that Apocalyptica is finally back in full strength.\n\nOriginally written for The Metal Observer\n",
        "\nI don't know about your opinion, but I've heard a lot of things about this album (7th Symphony), some very bad things...\n\nI loved it, and I'm a die-hard Apocalyptica fan so it is difficult for me to see my favorite band doing this kind of stuff. I was pretty shocked when I saw the guest list for 7th Symphony. You know? But after listening to it I realised it was another one of their experimentations... Not bad at all, you can read my review.\n\nBut then they decided it would be cool to re-record one of the songs with another vocalist, why? I have no fucking idea (though it was probably due to financial/marketing reasons). I would just have let it go if the new vocalist was more into the metal scene than the original one. Or if it were the same vocalist but the music was being re-recorded (kind of what they did to \"I Don't Care\"). \n\nOK, so what's wrong with this one? It's got Doug Robb. Yes, the guy from Hoobastank... Really? Didn't you guys have enough after putting Lacey into 7th Symphony? Did you REALLY have to do this? Rather than just being bad, this is disappointing.\n\nSo, why did I give it a 50? Because the music is exactly the same. Though it is ruined by the vocals, half of the song remains good. \n\nYou better avoid this, just as I did before today.\n",
        "\nSince Apocalyptica released Amplified, they have markedly changed their sound. Vocalist collaborations have been (over)featured, cutting out some of the more interesting instrumental tracks. While this style is not for everyone, Apocalyptica has adapted to it. This album, however, does take a step up from Worlds Collide.\n\nOverall, I felt the vocal tracks on this album were much more consistent with the feel of the album (not necessarily the style). Everything here felt darker and more emotionally charged than most songs on previous albums, including the vocal tracks. Compare a song like I'm Not Jesus to the rest of Worlds Collide, versus a song like Not Strong Enough to the rest of 7th Symphony. Two drastically different vibes. Though the vocal tracks do seem to be more tailor-made for the radio, they seem to get an excessive amount of frack from fans of the band, and while their instrumentals are better, the vocal tracks on 7th Symphony at least meshed better with the rest of the album.\n\nThis is not to say that vocal tracks did not detract from the album. I have been a fan of Apocalyptica since I picked up Inquisition Symphony a long time ago, and watching the evolution into a more radio-oriented band has disturbed me, much in the way Metallica's change to Alternica disturbed the metal world (oh dear, the similarities...). I feel the integration of vocal tracks into the album ruins the flow to a certain extent (even if this album flowed better than Worlds Collide), and ultimately it made 7th Symphony a bit of a difficult listen. That being said, I am a fan of some of the vocal tracks on this album, moreso than previous albums, notably Not Strong Enough and Bring Them To Light, though these would function much better as singles released separately from the album.\n\nComments on the vocals aside, the instrumental tracks on this album simply blew my mind. As a cellist and metalhead myself, I was content with their previous crossover style, but have always wanted more from the band. Apocalyptica has slowly morphed into a much more solid metal band. Albums like Reflection struck much more of a balance between classical training/writing and metal riffing/song structures, but 7th Symphony shifted that balance more towards riffing, something that feels to me much closer to reinventing the cello than the mix of styles before. From the onset of At The Gates Of Manala through to Shadow of Venus, I felt much more like I was listening to a metal band than I ever did listening to songs like Faraway or even Betrayal. The sheer awesomeness of the instrumentals is what really saved this album for me.\n\nThe addition of the live DVD was certainly a treat, though Tipe Johnson was an unnecessary addition to the session. Watching these guys play is simply awe-inspiring to me. It's becoming harder and harder to find string musicians who can really hook into what the Spanish call the don, that extra something that makes the music come alive. These guys have it, and it shows in their live performances. Just get rid of Johnson and it would have been that much more perfect.\n\nOverall, considering the pros and cons of the vocal tracks, the instrumentals blowing my mind, and the live DVD, this album felt like a B-. An A could have been achieved if the band included the vocal tracks on a separate CD or as singles only and incorporated more instrumentals, which I hope they will do on their later albums.\n",
        "\nI've been a fan of Apocalyptica for over a decade. I was a bit shocked a couple years ago to hear them on the radio--I never thought they were radio material before. But on their last album, they definitely started to shift toward a more radio-friendly sound, at least on some tracks.\n\n7th Symphony continues that trend, resulting in another schizophrenic album of half Apocalyptica as they were and half Radiopocalyptica.\n\nA few of the instrumentals are strong examples of their old sound, notably opener \"At the Gates of Manala\" and the best track on the album: another collaboration with drummer Dave Lombardo, simply titled \"2010\". Some of the other instrumentals are much weaker, and instead of \"reinventing the cello\" seem to be \"this is regular cello\" (see \"Beautiful\"). Even so, that's not such a bad thing in context.\n\nThe other half of the album is songs with guest vocalists. These tracks tend to be weaker on this album than the last--the guests have much weaker voices, especially Gavin Rossdale. Brent Smith (Shinedown) and Lacey Mosley (Flyleaf--I have never heard of this band) are slightly better. These vocalists are definitely a step down from Corey Taylor, Till Lindemann, and Cristina Scabbia.\n\nThe only vocalist who doesn't get lost in the cello assault (or force the cellos to go soft so you can hear him) is Gojira's Joe Duplantier. \"Bring Them to Light\" actually manages to be a highlight of the album.\n\nThe Verdict: The album is schizophrenic, like Worlds Collide. It's also extremely hit-and-miss, with some really great tracks and some really boring tracks, but not much in between. Still, the good parts are worth hearing.\n\noriginally written for http://fullmetalattorney.blogspot.com/\n",
        "\nThe phenomenon of Apocalyptica is dead. What has been original and unique one decade ago when the band began to reinvent well known metal songs into a classical and symphonical style or when the band made their first entirely acoustic albums which were really intense and profound, has now become a mainstream band which repeats itself. At least, the last albums had still a few very interesting collaborations but that isn't the case on this album.\n\nAll the songs with guest singers, a part of \"Bring them to light\" which is a positive exception but has already been recorded several years ago, sound very commercial and faceless. The worst one is really the pop rock song \"Broken pieces\" which could be on a \"Twilight\" movie score. The first single \"End of me\" is really faceless and boring. \"Not strong enough\" would have been the better choice but this song is also far away from emotional collaborations like the dreamy and soft \"Faraway Vol. 2\", the darker and intense \"Hope Vol. 2\" or the very melancholic \"Bittersweet\". The band decided to chose mostly some less popular singers from some modern and commercial bands and they lose all their charm and uniqueness by doing this. While collaborations from the past still gave a lot of space to the celli and their unique sound and atmosphere, the new songs are concentrated on some cheesy lyrics and the classical instruments sound like ordinary guitars.\n\nAt least the instrumental songs deliver the expected standards. The only negative point is that the drums are more present in most of the songs which destroys their old and unique style somehow. The band only shows its brilliant talent in the songs without or with less drumming and when they take their time to develop epic and intelligent structures somewhere between Mozart and Metallica like they used to do a few years ago. There are four nice songs on the album, two very good and two brilliant ones. The opener \"At the gates of Manala\" goes more into a metal style and is a little bit too long while \"Beautiful\" has an original classic and acoustic approach but is way too short. The only really well done songs are in fact the melancholic \"Sacra\" and the very interesting and fresh sounding bonus track \"Throgh Paris in a sportscar\" even if the song title makes you think of the modern crap which mostly dominates this album. It's a funny antithesis that this bonus track is one of the most traditional and profound songs on the entire album. The rest of the songs feel like some fillers and are only average stuff.\n\nI must conclude that this album is the weakest one in the complete discography of Apocalyptica. The songs sound too metal during most of the instrumental parts (\"2010\") and too commercial and boring during their collaboration with guest singers (\"Broken pieces\" is maybe their worst song ever). One nice collaboration and four interesting instrumental songs save the album and make at least one half quite enjoyable. But overall, this album is still somehow boring. The bonus DVD is very interesting too and shows us that the band can still perform in a very personal and intense mood. I have seen them recently on stage and know that they are still really intense and powerful there.\n\nLet us hope that their next album will not only be based on commercial collaborations and want-to-be metal riff shredding, but on the unique power and creativity which has made this band unique. If they will fail, one of the most dynamical bands risks to become as horrible as pseudo-innovating metal clowns like \"Van Canto\". Let us pray that those boys go back to their roots or reinvent themselves completely but that they won't chose the commercial and faceless path.\n",
        "\nMany of us fans of this band were kind of excited when we heard about this new realease. Of course the expectation grew when they announced who would be doing the vocals during this album: Gavin Rossdale (better known for his band Bush), Brent Smith (who apparently has plays in a band called Shinedown), Lacey (who sing ins this awful alternative band called Flyleaf) and Joseph Duplantier (yeah! The singer from french band Gojira).\n\nSo I just got the Special Edition so that's the one I will be reviewing. The album starts with one of the most amazing songs they have used as an intro. It has everything, the distorted cellos, the classical breaks, the heavy stuff. In one word: EPIC.\n\nThe second track was their first single: End of Me, with Gavin Rossdale, it is more like a rock-oriented track, but still powerful, full of emotion, and this guy fits well with the music. The track was written by Eicca and Gavin so it has something from both cello metal and rock. The album keeps kicking your ass during Not Strong Enough, another one with vocals, the vocals style it's kind of generic but this guys managed to make it sound heavy as fuck, and the fucking chorus is catchy as hell...\n\nWhen 2010 starts to play, you'll notice something: that's Dave Lombardo on drums again!!! And you know this is going to be one of the heaviest moments in the album. It is also one of the tracks with the darkest atmosphere they have written in a while. it kind of reminds me to Betrayal/Forgiveness from the self titled album. The next couple of songs are amazing instrumental and classical shit. Now you understand why the named the album \"/th Symphony\", because it is a fucking metal symphony!!! \n\nBut wait, what's this??? This ugly singing??? Oh yeah, this is one is Lacey, her voice sounds like the average pop/rock singer, but that's like the worst thing here. If vocals on this song were performed by someone else, I'm pretty sure this could have been a 100% score but hey... You can't ask for perfection...\n\nBut perfection returned in the next tracks. On the Rooftop with Quasimodo is one of the most beautiful doom tracks they have done in a bunch of time. And then it's time to get heavy! Joseph surely adds the death/thrash bit they needed in order to keep this a fucking amazing piece of art. This is going to be a perfect song for live performances.\n\nSacra, Rage of Poseidon and The Shadow of Venus are perfect songs designed to make you feel a lot of things, sadness, sorrow, rage... The atmosphere its great in these songs, the riffs, the solos, the cellos!!! My god this fucking guys should be doing more instrumental shit and keep the vocals for bonus tracks. Or maybe inviting more metalheads to sing along them.\n\nAfter the disaster that Worlds Collide was, they knew what to do, write more symphonies. And even this was ruined by that girl singing like the girl from Paramore, the music, the lyrics, the production, the feeling, everything was in perfect plaece.\n\nIf you got the chance give this a listen, you won't regret it. For us fans is harder to review albums, because we always expect a lot more from the bands, las time when Corey Taylor was singing, many of us were dissapointed. This time I'm sure many will be dissapointed becasue of Lacey, but dou you give a damn about a song that's not that bad??? At least it is listeanable...\n",
        "\nApocalyptica is a Finnish band which used to play Metallica covers using cellos, but in this album they just use original material. These professional cellists also called for Dave Lombardo to play drums on this album; and the fucker really has his shit going, since his playing plus the production allows the drums to sound great while not drowning the cellos completely. And yeah, I'd call this cello \"metal\", they don't need guitars to be heavy, but just making cellos riffs--Yeah, thats right, cello riffs.\n\nIt's kinda sad, that a band that uses no guitars at all sounds heavier than some bands that use absurdly distorted distortion over their absurdly downtuned downtuning. Apocalyptica makes use of riffs the way they're supposed to be; by having them be the backbone of the songs, while they inject inhumanly fast solos over everything. The album starts with a bang with \"Prologue (Apprehension)\", which is really catchy (Reflections is catchy by itself, though), it doesn't really have shreddy cello solos, but it's very fast paced, and since it's catchy it already has half the job done. However, there are no weak tracks at all, just some songs which even though they aren't BAD per se, aren't very godly either. But it's really hard to compete against, say, that awesome lick at 1:16 in \"No Education\", it sounds beautiful, and thanks to Mr. Lombardo, it manages to sound heavy!\n\nI'd say that the most emotional and beautiful track is \"Farway\", it starts with a piano, and a very mellow cello melody. I like how, even though they're using cellos, which are mostly used in classical music, this sounds like a metal (or at least rock) album, probably it's the way they're used, by having some sustained chords behind the melodies. \"Farway\" gets intenser every second; the cellos get louder and the music much more emotional. I love those cello's vibrato, it sounds much deeper than a guitar's, at 3:00 it gets even better, with the beautiful backing which sounds natural since they don't use keyboards, but real instruments! I can feel my neck hair tingling in the last minute of \"Farway\", it's some of the most beautiful music I have heard.\n\nBut enough of beautiful and soft stuff, theres fucking \"Somewhere Around Nothing\"! It's the second best track in here, and it kicks ass in every way imaginable, the cellos seriously sound like they were singing, and I can almost hear them saying \"somewhere around nothing\" during the song's 'chorus'. Who needs a voice when you have a fucking cello anyways?! I really like it, it's almost a classic metal song in itself, with the riffs and the 'voiced' cello! Obviously this is complete when Lombardo comes with his drum fills, and then there's a weird distorted part at 2:09, full of fucking INSANE drum fills, then it builds up tension with chords (DAMN THEY'RE REAL, NO SYNTHS! YAY!) and then the last chorus once again...I can almost sing along to it, heh.\n\nThen there are songs like \"Cohkka\", which is very slow, almost doomish. \"Conclusion\" is another 'ballad', though it doesn't have shit on \"Farway\" (what does, anyways?). \"Pandemonium\" is very fun, it sounds like a march or something, with some melodies that sound slightly arabic. Then--You guessed it! A solo out of fucking nowhere! Why don't all the songs have these? You have some march-like riff, and then when least expected, A FUCKING SHRED SOLO! The solo on \"Pandenomium\" is insane, proves what you can do with 1000 notes in a short period of time!\n\nOk, on to the best track now--Fucking \"Toreador II\", that is! It has Lombardo doing some cool double-bass drum beats, and a very brooding melody over the cello riffs, damn how do they come up with those? Apocalyptica is able to incorporate evil melodies on their songs without sounding forced, and there's a little shreddy solo before the song explodes in a 4/4 beat and a very heavy riff, with more of those 'vocal cellos' over it. I swear that if they had done lyrics, they wouldn't even need a singer! \"Toreador\" is a fucked up way of saying \"Torero\", which means \"bullfighter\" (at least in Spanish), and so, they have a very Spanish sounding trumpet playing a melody, until there's this fucking insane cello solo, which is probably the fastest cello solo I have ever heard, out of all of them (I don't know how many they are, but it's fucking fast). \"Toreador II\" then fades away with that magnificent solo, and the last track, \"Epilogue (Relief)\" comes. It's probably the only track which can compete against \"Farway\", it's very mellow, full of emotion, I really wish they had came up with lyrics for this one, even if nobody is singing, they shouldn't take away my privilege of doing it at home!\n\n\"Reflections\" is a very beautiful, kickass, heavy, yet soft, but still awesome, album. Yes, I used all those adjectives, and they're accurate, since you can have anything you want in here--Heavyness, shred, ballads, emotion, it's all packaged here. The only problem is that it's just a tad overlong, and that if they wanted to make such godly songs as \"Somewhere Around Nothing\" or \"Toreador II\" or fucking \"Faraway\"...Then they should have made more hehe. Get this at full price, it's worth it, a catchy, shreddy, beautiful, and HEAVY album!\n",
        "\nApocalyptica take a step away from the (as I call it) thrashy symphonic goth metal they played on their self titled previous album to a more (half-)thrash/groove oriented sound with \"Worlds Collide\". And they do it quite well, with heavy, groove-influenced riffing in most of the instrumentals, a straight-forward thrash song (\"Last Hope\") and a nice ballad, that features the more mellow, classical side of the band (\"Peace\"), all arranged nearly perfect with the drumming of Mikko Siren. Sounds good, doesn't it? Well the INSTRUMENTALS on here are good, but Apocalyptica have made a big mistake by asking other people to join them.\n\nAs we all know, Apocalyptica always had a commercial oriented side, asking terrible vocalists from shitty trend- or pseudo-metal bands to join them, but the result was at least listenable most of the time. On \"Worlds Collide\" any quality has vanished from the non-instrumentals. They are terrible mallcore, pop rock and emo songs, and, as if Corey Gaylord and Christina Crappia weren't terrible enough by themselves, the songs that feature guest vocalists that are not David Bowie covers were co-written by mainstream pop(!) songwriters.\n\nThe appearence of japanese guitar hero Tomoyasu Hotei on the song \"Grace\" is completely unnecessary and adds nothing to the song, as all he plays could also have been played by the cellos and many people who listen to the song won't even notice where the part played by the cello ends and the guitar begins to play. It's a nice gimmick, nothing more.\n\nIf you want some more quality songs, get the Special Edition. It features the bonus songs \"Ural\" and \"Dreamer\" which belong to the best songs written for this album. It's a shame that those two are only bonus songs but all the guest vocalist crap is included in the regular version and ruins it.\n",
        "\nApocalyptica is an interesting band that many question the metal of. Cello isn’t the first thing that pops into my head when I think but let me assure you, Apocalyptica knows what metal is. On “Worlds Collide” they bring in a number of guests that each contribute to the album in some way. The guests include Cristina Scabbia (Lacuna Coil) on “S.O.S.”, Adam Gontier (Three Days Grace) on “I Don’t Care”, Till Lindman (Rammstein) on “Helden, Cory Taylor (Slipknot, Stone Sour) on “I’m Not Jesus”, Tomoyasu Hotei on “Grace”, and Dave Lombardo (Slayer) on “Last Hope”. Each on of these artists brings a different sound to the songs. Many are quick to say this album sucks simply because many of the artists are from the rock genre as opposed to the metal genre. But quite simply that is false. Apocalyptica is opening themselves up to other styles in order to create a more progressive sound for themselves. But they refuse to leave metal behind and this album is no exception. \n\nThe album opens with only cello slowly building until the drums burst in a launch into an awesome riff. Cellos and guitars blend astoundingly well on all the songs of the album creating a unique sound that can be compared to no one. Most of the other songs follow a pattern similar to this song. Cello melodies supported by metal riffs and quick, intelligent drumming. The second song “Grace” utilizes guitars done by Tomoyasu Hotei with excellent results. The riffs support the metal sound when the cello caries the melody and the cellos have no problem backing up the guitar when the guitar gets the melody. The guitar and cello often at times play melodies and countermelodies creating a wonderful sound. This song is by far on of the best on the album. “Last Hope” is another excellent song. The riffs are impressive and well done but it’s the drumming that keeps this song going. The speed is just down right impressive. I can’t even begin to imagine how difficult it is to keep up with Dave Lombardo on a cello.\n\nFour of the songs feature guest vocalists. Cory Taylor’s vocals on “I’m Not Jesus” are nothing special. This song is a little catchy but definitely is one of the least metal songs on the album. It is quite a popular song on American radio stations so ultimately this is an effort to earn a few bucks on Apocalyptica’s part. This song doesn’t ruin the album but the album would be fine without it. Helden is entirely in German and is by far the best song with vocals on the album. The dark, powerful voice of Till fits extremely well with the music. This song is dark and is well thought out and arranged. “I Don’t Care” is interesting. It certainly prefers hard rock riffing to metal riffing and would seem to be another radio ploy. But they try to making the song heavier and harder to disguise the fact that it is more hard rock. The band also didn’t really pick Adam. The labels told them to try looking at Adam. As musicians they decided that it would be interesting to work with someone of a completely different genre. The song is catchy but the only song that isn’t truly metal. The vocals are definetly what you would expect from a rock lead singer. S.O.S. seems like all the other songs on the album just with lyrics. Cristina Scabbia does a good job but this song is pretty boring with no impressive riffs and is only moderately catchy. \n\nThis is impressive work by Apocalyptica especially with the attempt to be some what progressive and try new things. Sometimes it works like on the song “I Don’t Care” and other times it doesn’t (“I’m Not Jesus”). Apocalyptica shows impressive musicianship and a knowledge of metal that no other artist. Who else can make cello sound metal?\n",
        "\nApocalyptica began as a small Metallica cover band with one particularity: they played cellos instead of the mandatory metal instruments (bass, drums, GUITARS, etc). So, their first albums were filled with some competent covers; in fact, they gave to the Metallica classics an interesting classical edge, with the aggressive guitar melodies being replaced with the beautiful cello melodies. Then, they decided to move on and play some original stuff. They began to compose new things and “Worlds Collide” is their fourth work. This was the first (and only) Apocalyptica album I have ever heard too.\n\nSo, after all, the first question is: is their music metal? Is their music heavy? After all they play with cellos, isn't it? Well, yes, they play metal without doubts and they play it well. The cellos here sound great and heavy and they give, on the calmer sections of the songs, a classical feeling that is pretty unique within the metal community. The riffs are the best point of the album, they are great and catchy, remaining in your head for weeks. Last Hope and Grace are the best examples of this fact, but we'll get to the songs later.\n\nAbout the drumming, it really helps to give a heavier atmosphere to the album. The drummer is pretty competent and his work is quite varied: two examples are the soft approach on the beginning of “I'm Not Jesus” and the powerful one on “Grace”. Dave Lombardo, who is well known for his work with Slayer but also played with Apocalyptica in the past, is the guest drummer on “Last Hope” and he does an EXCELLENT work on that almost-thrash metal song (amazing fills!).\n\nThe songs are divided into two categories: the instrumentals and the ones that feature a guest vocalist singing for the band. The instrumentals are the absolute highlights of “Worlds Collide”. The title track (and opener) a good song featuring some nice breakdowns and heavier sections. In fact, many of the instrumentals follow this structure: they are heavy songs during most of the time, but have some breaks and soft parts; all is blended together with the decent songwriting abilities of the band. “Grace” got to be one of the best tracks here, mainly thanks to that fantastic main riff, that is played in the beginning. What a riff, indeed! “Peace”, the closer, is another highlight, being a very classical-influenced piece, very calm, a good way to end the record.\nNevertheless, the best track of the bunch is “Last Hope”, a song that is an absolute thrash metal (or cello-thrash metal) monster. It begins with a nice intro and then, after a quick drum fill, wow, a fantastic riff kicks in, supported by fast-as-hell drum work (it's a shame the bass drums are almost inaudible). In the middle, the cellos stop and Lombardo throws in some very nice fills and rolls, leading us to the solo section. What a song, indeed.\n\nHowever, this record has a problem. A BIG problem. The biggest mistake of Apocalyptica probably was inviting some shitty guest vocalists to sing on some of the other tunes. The result is absolutely terrible. “I'm not Jesus” is the biggest aberration; at first I thought that it was sung by some insignificant mallcore vocalist, but wow, the singer is Corey Taylor of Slipknot and Stone Sour fame (hm, he really is an insignificant mallcore vocalist, after all). However, if the music kicked ass and the vocals don't, well, I would label the tune as average or something... The problem is that the music also sucks terribly... And the lyrics suck too! And badly! Take a look:\n\n“I thought you were a good man \nI thought you talked to god \nyou hippocratic messiah and child abusive turned satanic \n\nDo you remember me? \nand the kid I used to be? \ndo you remember? \n\nWhen your own world comes undone \nlet me be the one to say \n[your God is looking down on me] \nI'm not jesus \nyou can't run away \nand the innocence you spoil \nfind a way to live \n[your God is looking down on me] \nI'm not jesus \nI will not forgive”\n\nFuck, it's terrible, isn't it? “I Don't Care” is also pretty bad and sung by Adam Gontier (I don't know who te fuck he is, but he sounds terrible, nevertheless). The lyrics are stupid too and so is the silly, mallcore-ish, chorus (“I don't care... I don't care!!”). Don't worry, I don't care about you too.\n“SOS (Anything but Love)” is sung by Cristina Scabbia, the lead vocalist of the g(arbage)othic band Lacuna Coil. And guess what, it also sucks. I don't know, but Apocalyptica shouldn't invite guest vocalists anymore, this records would turn out a lot better if it only contained instrumentals.\n\nHowever, there's a pearl among all those shitty tracks (not a pearl, more an average song, but when an average song is sorrounded by some horrible ones, it sounds like a masterpiece): “Helden”. Ironically, this song is a cover of David Bowie, but sung in german by none other than Rammstein's lead vocalist Till Lindemann. Since I love his guttural, deep voice, I really appreciate this tune, beginning quite softly in the beginning and then slowly progressing to a heavy sections when the infectious chorus is sung by the first time. An average track.\n\nConcluding, if this album wouldn't have “I'm not Jesus”, “SOS” and “I don't Care” it would receive more points (70, 75 points perhaps) but as it features those musical abortions... Meh, “Worlds Collide” is worth listening after all, but better not spend too much money on this piece, friends. Nevertheless, a decent album ruined by the poor vocals.\n\nBest Moments of the CD:\n-the beginning of Grace.\n-the explosion of Last Hope, when the main riff is played by the first time.\n",
        "\nIf you read my review for the World's Collide album you'll notice that I didn't like it that much only because of some guests. Well there is an exception with this one.\n\nS.O.S (Anything But Love) is by far one of the better songs with vocals Apocalyptica has ever done and that's because they invited one of the most recognisable (which doesn't mean sucky) voices of gothic metal: Cristina Scabbia. She is also one of my favorite lyricists. As you might notice lyrics are about love, but not the typical lovesong either, instead is some kind of sick love. That's more like what you could hear in a Lacuna Coil song excepting, obviously, the fact that Apocalyptica composed music for this pretty lady and took her writing to another fucking level.\n\nLies (yeah the japanese-only song) is the second song in this single. I didn't have the chance to hear it before, so I didn't know what to expect. It somehow reminds of the Reflections era. A beautiful song, great riffs, great notes, catchy tune, and if you liked Reflections you'll like this one. Is more like a rock song with a heavy end.\n\nThe only think missing is an instrumental version for S.O.S. but no one said this was perfect.\n",
        "\nWhen most of us hear this album for the first time we think \"What th hell got into Apocalyptica's head???\", \"Have they lost their touch?\", \"What happened to cello metal???\". And certainly, the answers are in the album itself.\n\nFirst: They simply decided to try (something dangerous in music industry), for fuck's sake!!! It's not as bad as everyone says!!!! They composed (or arranged) every song in this album, but guess what? They invited a few people in the writing and composing process. So, this album is strongly influenced by those who helped build it. Scabbia, Taylor, and even Sirén (yeah, the drummer!) gave Apocalyptica a hand. Something interesting I must say, as in every track music sounds acording to each guest. More guests than before, but also more variety. This shows how this band has grown, as they can ask for someone outside of the band for help, and still they kick ass.\n\nSecond: No they haven't, they just changed a little. As I said before, this album is strongly influenced by outsiders, soemthing good or bad, depending on who the outsider is. For example, \"I don't care\" sounds like a generic mallcore song, but \"S.O.S.\" has a little from gothic. \"Last Hope\" can kick your smelly ass (yeah, Dave Lombardo again!) and it sounds like thrash to me. \n\nThird: Cello metal was invented (or discovered, whatever) by them, so, it changed with them. Making it a little more \"commercial\", they want to conquer the world (something really ambicious coming from a band like this).\n\nMusically speaking, this album did it! I mean, amazing production, amazing lyrics, amazing composition, some masterpieces. But, it is not as great as older albums. You can't compare their early sound to this, as it is something completely different, but you can decide wheter you like this \"Apocalyptica reloaded\" or not. Hopefully this guys will do something better in the future, Cult Vol. II maybe (I'll be waiting for it...).\n\nTrying isn't bad, but maybe it just isn't their thing....\n\nBest song: Dreamer (from the special edition, sorry)\nGood songs: Last Hope, Ion, Stroke, Burn\nBad song: I Don't Care\nWorst song (ever): I'm Not Jesus\n",
        "\nI decided to check out this single due to some weird uprising interest in a band I liked years ago. Apocalyptica were an original force once who reached their creative peak in the quite impressive album \"Cult\". A while ago, I heard parts of \"Reflections\" and their self-titled album, but quickly lost interest again. \n\nSo recently, i saw this new single on MA and decided to check it out. For some weird reason, the single had Max Cavalera on it, which made me hesitant, but I thought \"maybe the old fag got some metal left in his bones\" - but boy, I couldn't have been more wrong. \n\nApocalyptica goes for straight mallcore on \"Repressed\". They've never been too far away from commercialism but somehow, they always managed to be exciting or at least mildly entertaining, but \"Repressed\" is simply horrible. It has the retarded monkey shouting from our beloved Neo-Cavalera, some whiney Linkin Park-esque background vocals (which I later found out was the guy from Bullet For My Valentine) and 3 cellos playing groovy nu-metal \"riffs\". I just listened to the song again but can't remember a single drumbeat, so I guess they are as \"good\" as the rest of the song. The lyrics are your typical Soulfly; \"So why the fuck am I lonely, there’s no one inside I can call\" - Our fellow Neo-monkey's trademark. \n\nI was pretty shocked after hearing this track. \"Repressed” is, without a doubt, the single worst moment in Apocalyptica's history. \n\n\"Path Vol. 2\" - one of the songs that made them famous in the first place - some pretty good instrumental work, with female nu-rock vocals on top. Her vocals are passable, but nowhere near exciting or even good, so better listen to the instrumental work more closely. \n\n\"Betrayal\" is supposed to be a thrash metal track, but falls flat on the bad sound of the chellos. Yeah, it's fast and considerably brutal, but lacks finesse and direction. The best part is the calm outro, which reminds of older Apocalyptica moments (\"Cult\" comes to mind). This outro leaves a bitter taste in the mouth, since it clearly shows what Apocalyptica were capable of once, but nowadays their creativity seems to have dried in the dust.\n\nThere is absolutely no reason for having this single. All songs but the title track were released elsewhere at least once or twice and the actual new material is best forgotten.\n\nAvoid at all costs.\n",
        "\nApocalyptica became well-known solely for their Metallica covers. Even after years and several albums of other kinds of music, they are still known as the group of cellists who play Metallica songs, and many of their later works have not gained the recognition they would have deserved. Before the Metallica-era, they released a curious little Christmas single. It has gone virtually unnoticed, but seems to fetch considerable prices on EBay regardless.\n\nThe single contains two tracks, and has nothing to do with Metallica. The first track, Oh Holy Night, is a very traditional and beautiful cello version of the classical christmas song, with absolutely no metal influence whatsoever. Four brilliant young cellists simply play a beautiful and peaceful tune with skill and classical training, and the result is good enough for your mother-in-law on Christmas Eve. Try it if you don't believe.\n\nThe second track, Little Drummer Boy, is a french Christmas tradition, although most non-French people would have serious difficulties in finding the connection to the christian feast without a little help from Wikipedia. Nowadays the song is internationally known, however, and of the two songs on the single, Little Drummer Boy is the one to give an appetizer of the things that could have come.\n\nThe song is recognizable. There's no question about it. They just never play it the way it's supposed to be played, but turn it into a sinister, dark tune instead, with an ominous atmosphere. It suddenly explodes into a brief speed metal interlude, fades into very heavy ambience, and finally continues as a doomish dark metal song, eventually ending in dark silence with final moments almost resembling a fade-out. Dark, ominous and definitely heavy, and still, the theme of the song remains as the central idea throughout.\n\nLittle Drummer Boy made a promise the Metallica cover album could not cash. The band rendered the celebrational song into a dark, aggressive and gloomy combination of emotions and styles, but the Metallica songs they played on the subsequent albums turned the whole concept into a gimmick. Perhaps the gimmick has sold a considerable pile of albums, but it also meant Apocalyptica would carry the Metallica stain from here to eternity. The artistic ambition the second track on this single contains was lost when they embarked on the road paved with covers, and a great promise was left unfulfilled, a promise of a deep, dark art that could have been. That promise found a way to briefly manifest itself on a french christmas song, and that alone makes this single worth hunting for.\n",
        "\nYes, this is a very strange little project. A metal cover band (at least for the time being) that covers brutal songs from bands such as Metallica, Pantera, and Sepultura with string instruments. This is very similar to the infamous String Quartet group that does those shitty tribute albums to Linkin Park and U2. But this is metal. You would at first thought think this sucks. Well actually it’s quite good and in certain cases these covers are more enjoyable than the originals. For instance, you wouldn’t think listening to One, one more goddamn time, would be interesting. Well replace the guitars, drums, and Hetfield’s dumbass with cellos and you have yourself a trip. The album is overall good but it has its ups and downs.\n\nOn the previous album it was nothing but Metallica covers. Starting with this album they began to write more and more original material and straying away from covers. But like everything they had to start off small, with just 3 originals. Harmageddon begins very softly and then busts into some cool cello “riff” interplay with a third melody played over it. Many disagree with the fact that Apocalyptica rules at writing originals but yes. They do. This song is very badass and goes through several stages and time changes. The music really makes it seem as if you’re listening to a metal song, which I’m sure is what they were going for. It starts to slow down 3 minutes into it but comes back with a “chorus” like part that’s pretty emotive giving you a dense atmosphere. It definitely fits its name. M.B. is the second best track on the album. I don’t know what the name means but oh well it kicks ass. Like I said, these guys can fucking write riffs. Like in Harmageddon they have the duel riffing cellos with a cool melody/solo cello belting out leads. Listen to that middle section; you can almost taste the atmosphere. Toreador however is a very boring track. Skippable at best.\n\nThey still have 4 Metallica covers but they throw some weirder shit in like a Faith No More cover, some Sepultura covers, and a Pantera cover. Not being a fan of Faith No More, their cover is the only song I’m not familiar with but it sounds kind of dull when Apocalyptica does it. The gems of album are the Sepultura covers. Refuse/Resist sounds just as fucking heavy as the real song. The way they mimic Max’s vocal pattern is musical gold really. I have to give the soloist a hand. This is the only song that they don’t tack off a couple minutes off of as well. Inquisition Symphony, the title track, was the best track on Schizophrenia and they cover it beautifully. I was amazed the first time I heard them shredding like that on cellos. Highlight of the album. The Pantera cover another track you can skip on the album. Pantera and cellos is something that should never be mixed… ever. Domination is a wonderful song but you can’t reinvent the aggression of Phil’s vocals or Dimebag’s leads. Also the “drums” get very annoying.\nWe’ve all heard these Metallica songs so there isn’t much to comment on except a few highlights. You think Fade to Black was full of emotion? Well Apocalyptica has it in spades and put it to good use in both this, One, AND Nothing Else Matters. I guess they figured it’s easier to use cellos with more emotional music than groove metal. \n\nThe covers are good but Apocalyptica, probably realizing it was time to become a real band, starting putting out the excellent stuff after this album. If you like this, definitely check out Cult or Reflections. Or if you only liked the Metallica covers you can always take a step back with the debut.\n",
        "\nWell this is much better than the debut if you ask me, now they got the metallica songs I really like and also some music from bands I've only heard of and never heard thier music including some originals, treat! I mean the cellos are a nice touch on metal covers but I think it's about time we heard some originals from everyone's favorite cello quartet. \n\nThe album starts with an Apocalyptica original \"Harmageddon\", sounds quite psychotic with all the screeching in between (and in some parts it sounds like Danni Filth from Cradle of Filth wailing in the background), but it is moody and melancholic, and there are some parts that sound like Priest-ish octaves, which gives a nice touch. Quite a pleasing track all round. \n\nThen comes \"From out of nowhere\" now this is a cover for Faith No More, a band I haven't heard to date, but this song is giving me a good impression. It doesn't sound really heavy compared to the other tracks on the album, but I like it's pace. \n\nNow for another Metallica cover, \"For Whom The Bell Tolls\" is one of the more moody tracks on the album, I haven't heard the original, but this quite good. \n\nAfter that comes the favorite \"Nothing Else Matters\", which sounds billions of times better than the original, the cellos give more atmosphere and mood than what metallica did. This track would make any metal hater think twice. \n\n\"Refuse/Resist\" comes next, a Sepultura classic or so many sepultura tell me. I haven't heard much of Sepultura (not needing to mention that I'm not much of a thrash metal fan myself). it's one of the heaviest tracks in the album, where the cellos sound like grinding machines in some parts, which does give an interesting touch. \n\nAnother original by Apocalyptica comes next, strangely called \"M.B.\", man-butt, mostly-bull, major-bull, mentally-boring, megabeth... I really don't know what it stands for. it's not really a bad track, I just don't like the first part of it, but halfway it suddenly turns into some creepy quite melody that quickens up. half a classic I'd say. \n\nAnother favorite which surprisingly is a sepultura cover, the title track of the album \"Inquisition Symphony\". I really like the solo in this, wonderfully played, though I haven't heard the the original to this, but I doubt it comes any better than this cover, it's very aggressive and moody, one of the heaviest tracks in the album aswell. \n\n\"Fade To Black\" is next, another Metallica cover, wonderful intro that gives it a good melancholic mood at the start. then it picks up beautifully in the end. \n\nand now for something completley different, a Pantera cover, \"Domination\" is a nice track, if you ask me, it sounds quite strange in the beginning. but it's the only track in the album that sounds alot like the stuff in the debut album done better even without the drums. \n\n\"Toreador\" is the last of the originals in this album, it's the best of the three, it's heavier than the first two. The aggressiveness in this is nice and it's very steady. Beautiful is the only word to describe it. \n\nTo conlude this album yet anothe metallica cover, \"One\", one of my favorite tracks in the album, and once again much better than the original, yes believe me, the even the solo sounds better here, and the intro to this absolutley beautiful and it smoothly gets better as it changes, the heavy bit of the track sounds awesome. \n\nOnce again an album that's done without any precussion whatsoever, but this sounds miles better than the debut, Apocalyptica has improved greatly with the release of this album, if you didn't like \"Apocalyptica plays Metallica on four cellos\", give them a second chance and give this a try, you won't be dissapointed. \n\nTip: listen to Apocalyptica with a bass boost on thier music for the ultimate Apocalyptic experience\n",
        "\nI was like \"hey, Metallica songs played on cellos, now that's something you don't see everyday\" when I first saw the album, and that's what it is exactly, Metallica classicals played by a cello quartet, looking at the album list, it didn't really have all my personal favorites.\nBut that was also a problem in the album, it was only played on four cellos, there wasn't any drums alongside them to give them that impact, some songs like \"Enter Sandman\" sounded very weak without that drums, \"master of puppets\" is okay, then comes a very retarded sounding \"harvester of sorrow\" and it sounds really REALLY bad (I stopped listening to the album after the album thinking I'll give it another chance some other time after I listen to something else)... The \"unforgiven\" doesn't sound that bad from what I think, in fact it does sound quite atmospheric, but I think Apocalyptica made a big mistake wasting thier time covering \"Sad but true\", not only do I personally dislike the song, but even for a cover it doesn't make it any better. \"Creeping Death\" has the same issue about sounding weak without the drums. the last two songs \"Wherever I roam\" and \"Sanitarium\" though are probably the best two songs in the album, sounding wonderfully moody.\n\nMaybe the album doesn't really come to my appeal because I'm not really that much a fan of Metallica, from what I think there are 3 solid tracks out of 8 tracks while the rest is either really bad or mediocre. If you are a hardcore Metallica fan and have an open mind for something somewhat different, then this would be a nice piece for your collection.\n",
        "\nThe first thing you'll probably think upon listening to this album is \"what the **** were they thinking?\"\n\nFor the first time, Apocalyptica have chosen to include a vocalist on a couple of songs on their album rather than wisely limiting them to singles and bonus material for special editions as they have previously. Not only will this upset a few of their fans, but for some obscure reason they thought it was clever to employ The Rasmus' whiney singer. Oh dear. Life Burns would be a semi-decent track without him, but no, they had to open with this travesty...\n\nLauri also features in fourth track Bittersweet, a ballad which isn't a bad piece of music, but is far better when performed live without either him or HIM's singer (yes, HIM...)\n\nBetween these two vocal tracks lie two fairly average Apocalyptica pieces. Along with Misconstruction, they sound pretty much like average tracks from Reflections. Not bad, but not great either.\n\nThis album certainly shouldn't be dismissed though, because what's to come is the band at their best.\n\nThe bizarrely named Fisheye is the first hint of what's to come, a faster, heavier song with an interesting structure and a damn catchy central riff.\n\nIt's followed by Farewell, possibly Apocalyptica's best ballad yet. It sounds quite classical for the most part and has a beautiful melancholy chorus, but is underpinned by a low chugging riff emanating a distant sense of menace.\n\nFatal Error is faster and heavier than Fisheye. For the first time since Cult, Apocalyptica seem to be attempting to write thrash metal again, rather than just fairly average sounding heavy metal that happens to be on cellos. If that's their aim, they succeed magnificently with Betrayal/Forgiveness\n\nBetrayal/Forgiveness is not merely probably the best track on the album, nor even merely one of Apocalyptica's finest monents. It's an astounding piece of thrash, all the more incredible for the lack of involvement any kind of an electric guitar, bass, or anything. The introduction lures you into the song and slowly builds up to the most ridiculously fast fast cello playing, which continues as the song continues to build up into the most amazingly heavy piece of...thrash metal? death metal? It's hard to say. One cello chugs away somewhere close to the speed of sound whilst another plays cleanly over the top, and somewhere underneath it all there's the deep scraping sound of the third cello being tortured. Oh, and Dave Lombardo plays the drums, which should give a decent impression of the speed this thing is going at on at least one level...somehow there's about two different tempos going in the song, a faster one and a slower one, yet it works. The verse-chorus-verse structure is totally abandoned in favour of wildly twisting and turning instrumentalism. Towards the end a clean cello slips smoothly out of the chaos and the song is brought to a soft conclusion.\n\nThe last two songs on the album are, surprisingly, pretty soft too, but none the worse for it, and hardly the kind of ballad featured earlier on the album. The reflective cellos of Ruska are underpinned by a skeletal piano riff, and Deathzone is dark and saddening.\n\nOverall, something weird happened to the first part of this album, but buy it for the second part. Unless you're a fan of cello covers (in which case the band's first two albums will appeal) get this one after the masterpiece that is Cult.\n",
        "\nThis right here is the definition of a novelity band. A band that makes music for the novelty of it, in this case a band that does covers just to have people listen to them say 5 times and say \"how interesting\". While there is nothing wrong with being a novelty band...they are rarely good and there lasting appeal is about as long as mayonaise left out in the sun in mid july. Well this band follows the trend of a novelty band, making music thats interesting and the coolest thing in the world for about 5 days, then you forget about it and go back to your metal. For a novelty band they are good though, they did something different. Covers are nothing different, but a band covering 80's thrash songs and some 90's heavy metal songs with chello's and still making them sound metal is different. This certainly makes for a better experiance that listening to modern Metallica.\n\nThe music on this album is indeed interesting and enjoyable for sometime. The band seems to hit there high notes when they cover the slower songs like The Unforgiven. Here the chello sounds more classical and smoother, producing more emotional notes. For the 80's thrash songs they cover like Creeping Death and Master Of Puppets the chello's do sound pretty metal. They are fast, deep/heavy, and played very well. They give the songs a more Apocalyptic feel, like the world is coming to an end. Like I said this all sounds so cool at first...but then you realize these are just imcomplete songs. They are just 4 chello's, imagine Metallica trying to play their songs with 4 guitars...its just lacking. \n\nI give the band credit for being unique and making everything from the black album by Metallica sound better(really, the black album played on chello by theses guys sounds much better than played by Metallica) and also making their other works into something different and scarier. If you can find this for cheap buy it, its a nice novelty album thats pretty light for metal but also dark and apocalyptic. Buy this if your into novelty bands or chello's. Its most certainly the worst work of Apocalyptica, but not horrible, just average, maybe slightly above average.\n",
        "\nThis is a huge step up from Inquisition Symphony. Here we have the band doing their own material, and doing it well. I think the band does good covers(despite choosing horrible songs to cover)..but its obvious they have talent, and at this point in there career...they are ready to tackle an album with their own material.\n\nIt starts off strong with path, the guest vocals are pretty good on here, but the strenghts of this song are, obviouslty, the great chello playing. The album then goes steady with Struggle and Romance...slower songs that are quite nice. Afterward the band picks it up until albums end, but never capturing or duplicating the first track which is the best. The chello's are played nicely, the songs are written well, and the fusion elements work nicely. I like how the band switched from pure chello to a mixture of metal instruments and chello for this release.\n\nOf course the band did need to include covers...how else would anyone notice this obscure band? The best of the covers is Hall of the Mountain King for the simple reason that the man who wrote it was a classical music genious, and the band plays classical instruments. The next two Metallica covers are allright...until sleeps was a bad song to begin with..and its not made much better here. They did do a nice cover of Fight Fire With Fire, it definatly sounds better than the origonal...if you can compare the two songs since they are played on two different mediums. This is a huge step up from the last album...but I can see the band getting much better, they just need to develope their song writing skills a bit more. For any fan of classical instruments that play in a \"metal\" style.\n",
        "\nThis album reaches its high points in their covers, which there are plenty of. The highest point of the covers are the metallica ones. The sepultura covers are the second best, followed by the Pantera then Faith no More. All the covers are better than the origonal material preformed by Apocalyptica. Its my opinion that the band doesn't have very good song writing skills of their own, thats why at this point in their career stuck to the covers...that and to be labeled as metal and to get people to notice them.\n\nThe cover are done very well, I would choose to listen to these covers over the origonal songs any day. In part because I have heard the metallica songs a million times, and in part they suck when played by Metallica. It seems when this band plas the covers of Metallica they sound different and unique, they really do well in converting them from their orignal purpose as thrash metal songs into neo-classical metal songs, that in itself seems to take some thought and talent. I was never much of a fan or a fan at all of the other bands, so the other covers songs and their orignals were not well known to me. For that reason they come second to the metallica ones, also to me they seem less interesting, but I can't blame the band for that, since they didn't write it, that fault goes to the original writers of the songs.\n\nThe origonal material has nothing to boast about. Its boring and nothing happens in it. I would just blame this on the bands inexperiance, and up to this point I would label them a cover band because their origonal material is bad, like the stuff of early cover bands. The best songs on this album are the Metallica covers Nothing Else Matters and One. I think they should have chosen better songs to cover to make this album great. As it is its more of a novelty album, rather mediocre. Their are 4 good Metallica Covers, and two decent other songs, so I gave 10 points per listenable song.\n",
        "\nThis shit rules.\n\nIn case you haven't read my other reviews, let me re-emphasize what's so cool about Apocalyptica. Apocalyptica is a group of cellists who have a drummer and a bass guitar and play Heavy Metal. They started out as a unique Metallica tribute band, but they have evolved into a genuine Heavy Metal band that writes their own songs and just generally kicks a lot of ass. The cellos are hooked up to amps and can slam out riffs with the best of them, and the skill of all the musicians involved is enormous. This band is a novelty; true, but unlinke many novelties, it has a lot of replay value. In short, Apocalyptica is a band with a unique and original idea that took that idea and turned it into something really amazing.\n\nThe band continues to produce quality music in their first completely original, cover-less album, Reflections. The quality of the cello playing is at an all-time high in this latest endeavor, and they have branched out in terms of their sound, so that while Cult may have tended to get a little repetitive, Reflections is a varied collection of amazing music. Plus the cover artwork is really cool.\n\nHighlights are all over the album. The band starts off by kicking ass immediately in the Prologue (Apprehension) with a huge riffage opener than comes down into a solo cello playing above the other cellos, who hold a really awesome and steady beat that will have you headbanging in no time at all. Then we get into No Education, which has a very simple yet amazingly catchy melody that is played over a constant steam of riffs by the rhythm cellos. I should mention that the drumming is great; it's always noticeable, but the drummer never overpowers the cellos and knows when to back off and let the intese soloing through; either the mixing was very well-done, or Dave Lombardo really knows his shit (which, given his history, is what I would go with). Regardless, the next song is Faraway, which opens with a piano solo that leads into an absolutely haunting cello solo that completely gives me goosebumps every time I hear the damn thing. It's that good, and that beautiful; we're talking about really sappy and intense playing from the soul. Pass the cheesewhiz if you must, but I mean it; this is what makes a band like Apocalyptica such a great idea. Anyway, next up is Somewhere Around Nothing, which brings us back into more thrashy headbanging. Drive features a very unique middle section with some rather odd noises coming from the cellos, but it is very tastefully done and doesn't degenerate into some sort of wankery festival. All the songs on here have different riffs and beats, and the album never really gets boring, but there's no point in me listing every individual song. I should mention Toreador II, which is a really fast song that has a REALLY FUCKING FAST cello solo section and a cool little trumpet part that makes it sound authentically Spanish.\n\nIs it worth the money? Absolutely! The band has really progressed since the days of Plays Metallica, and they have now developed into a fully mature, coherent sound that is the equal or better of 90% of the bands out there. As I said, stop pining over the missing guitars and go buy this right now. You won't be disappointed at all.\n",
        "\nThis band is Heavy fucking Metal!\n\nCult marks Apocalyptica's first genuinely original album (it only has a few covers), and I must say that it is really awesome. The use of cellos with amps and the addition of the drums and bass makes for some really awesome music. These guys may be classically trained, they they know metal, and their rhythms and hige riffage factor make for music that you can't help but headbang to. I've said it before, but in addition to having plenty of style, these guys really have some skills. They are all excellent cello players; mimicking the extreme sound of Heavy Metal using cellos is no mean feat, and the sounds that come from these instruments are simply awe-inspiring, coming from a fellow strings player (I'm a violinist). Granted, I just got through reviewing St. Anger, and compared to that piece of filth, the sound of me puking in the toilet would be amazing music. But this is genuinely good stuff here.\n\nHighlights. Struggle starts out with the high-pitched glissandos (string slides) that are in Scream (the movie), and then it goes down into a steady beat with an amazing variety of sounds coming from the cellos. Romance is a ballad-style song, and the cellos playing the modly sounds nothing short of amazing, especially with the great undercurrent of backup cellos and the occasional entrance of the drums. In Memoriam is the best song on here; it starts out with a minute of slow, beautiful cello playing, and then it FUCKING EXPLODES INTO A RAGING BALL OF HEAVY FUCKING METAL THAT THRASHES YOUR ASS OFF before settling back down into a minute or two more of beautiful cello playing. It's really cool. Hyperventilation is absolutely brutal, with some riffage in there that sounds like it came straight off a Black Metal album. The rendition of In the Hall of the Mountain King by Grieg is really cool and it highlights the intensity of the classical song while thrashing it forward with some killer metal riffage. Finally, Fight Fire with Fire is a great cover . . . well, it's hard to describe, but I like it better than the original. It's incredible.\n\nThis is good stuff. If you're willing to take your head out of your ass and admit that you can have a metal band with cellos instead of guitars, you should definitely pick up a copy of Cult. If you aren't . . . well, buy it anyway. You may just change your stubborn-ass mind.\n",
        "\nI would probably have rated this better, except there are too many covers on here to really warrant an 'A' rating. I would also have rated it worse had it not been for the fact that the challenge of playing celo covers of some of the more ass-kicking songs in metal and still managing to beat the shit out of the listener is handled very well by these very talented gentlemen.\n\nThe covers are a bit more diverse on the album, and the amount of sound produced by the cellos is increased, both of which contribute to this album's higher replay value than Plays Metallica by Four Cellos. The playing is more aggressive (neccessary for the Sepultura covers on here), but there is also a lot of beautiful ballad playing on a very romantic instument (the cello) as well.\n\nThe most brutal stuff on here is without a doubt the two Sepultura covers and the Pantera cover. Out of these, the most successful cover is Inquisition Symphony, which is extremely well-done and will have you headbanging in no time (I won't really review the actual song, but the general idea is a slow, quiet buildup into a climax and then several minutes of non-stop thrash). The other Sepultura cover on here, Refuse, Resist, has all the intensity of the real thing, although my favorite part of the actual song (the opening back-and-forth playing of the guitars and the conga drums [or whatever they are]) is only reproduced fairly well (the cello players slap their instruments to mimic the drums). The Pantera cover, Domination, just doesn't really do it for me (it's really hard to reproduce Phil Anselmo's rather unique vocals on any instrument, let alone a cello).\n\nApparantly sensing that the most successful song on the last album was The Unforgiven, Apocalyptica has decided to do covers of Metallica's two other classic ballads (Fade to Black and One), and they both sound fantastic. The haunting opening of Fade to Black is well-reproduced by a combination of light pizzicato (string plucking) and a beautifully played reproduction of the opening guitar solo. The cellos blend really well with each other, and the effect is incredible (and the \"vocals\" played by the lead cello, in my opinion, sound much better than Hetfield's rough voice in the ballad). The other ballad, One, lacks the really poignant opening sounds of war that are in the actual song, but is again well-reproduced with a combination of pizzicato and beautiful playing. Every note is on, and the musicians know exactly what to bring out and what to push back. This is excellent musicianship combined with beautiful songs; a really great combination.\n\nThe three original songs on here are pretty good, but Apocalyptica doesn't really get their shit together in terms of original songs until the next album, Cult. This album has some incredible covers, though, and it is really worth the money.\n",
        "\nSure, it's only a cover album, but I'll bet you wish that you had thought of it.\n\nApocalyptica introduces itself to the world with their first album, an original cover of the best Metallica songs (you know, when Metallica was a real metal band, as opposed to the dog shit they are today) played by four cellos hooked up to amps. And you know what? Cellos can play some pretty awesome riffs when they want to. There aren't any vocals on the album (instead, one of the cellos plays the melody being sung), but the classic melodies are there and any old-school Metallica fan will soon be headbanging to their favorite tunes.\n\nGranted, Apocalyptica's work is more of a novelty than that of an actual band, at least with this first album (the band exapns its sound in later albums to include original works and eventually adding some more traditional metal instruments, i.e. drums, guitar, etc.). But it's very entertaining, and the sound of the cellos provides a unique twist to many of the songs. As a violin player who works with a lot of cellos, I can attest to the skill with which these guys play their cellos, and the idea of playing Heavy Metal on a classical instrument goes off very smoothly in the album.\n\nThe highlight of the album is the cover version of The Unforgiven, one of Metallica's more mournful, ballad-type classics. It's a beautiful song, and it sounds really great when played on the cellos with long, flowing sounds and great uses of dynamics to accentuate the stylistic beauty of the song. Other songs that come off really well are Master of Puppets (the cello playing the melody is raw and ass-kicking, just like Hetfield's vocals), Creeping Death (it just sounds so . . . so damn cool!) and Welcome Home (Sanitarium) (excellent use of pizzicato [plucking the string instead of bowing it] to contrast with the melody).\n\nNot all of the covers come off without a hitch, however. Enter Sandman is interesting, but it doesn't really mirror the feeling of the opening part of the song very well at all, and Harvester of Sorrow is done a bit too slowly, and just doesn't have the power required to play the opening (and the rest of the song sucks even when Metallica plays it, so there's really no point in anything except the opening 1:30 or so). In general, however, the covers are true to the melody and the feeling behind the songs.\n\nThis is something that any Metallica fan should have, as well as anybody who thinks classical instruments are sissy and can't play any *real* music.\n",
        "\nNow this is unique. A band of cello players that owe as much to Mozart as to Metallica. Their first album was sort of a Metallica tribute album (like those \"String Quartet Tribute to _____\" albums. It showcased their ability to adapt heavy metal songs into post-classical, or \"Heavy Cello\" instrumental tunes, with one cello filling in for the vocal spot. Their second release, Inquisition Symphony, showed more of their roots (Pantera, Sepultura, Faith no More) as well as their ability to write their own songs (three of 'em, including the opener, \"Harmageddon\"). Inquisition Symphony also showed a more aggressive Apocalyptica. But it is on Cult, where their songwriting and aggression peaks. The songs are a lot heavier than on IS, while their slower songs are masterful and well-arranged. And speaking of arrangements, two more instruments have been added to this \"cult\": Acoustic Bass and orchestral percussion. The majority of the album is original material, however there are three covers. Grieg's \"Hall of the Mountain King\" is done here, and with great results! The aggressiveness of Apocalyptica and the complete mastery of Grieg's piece makes for one killer track! Of course Metallica covers are here, too (as always). However at this stage, they don't fare quite as well as their versions of \"Fade to Black\" or \"Enter Sandman\". \"Until it Sleeps\" is probably the better of the two, but it's nothing compared to the original version or even the S&M version. \"Fight Fire with Fire\" doesn't have enough bite or edge to it, due to the bass. There's a live version of the song on Apocalyptica's web site which fares better than the album cut. The band owes their name to the heavy metal giant, but do they really need to include 'tallica covers on every album? As for the original tunes, in terms of heaviness \"Struggle\", \"Path\" (without vocals) and \"Pray!\" rank amongst my top choices, while \"Kaamos\" and \"Romance\" please my lighter side. Definitely pick this one up, it's worth the moolah. You don't have to worship this band to join the cult, but it always helps.\n"
    ]
}