{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "San Diego, California",
        "Status:": "Active",
        "Formed in:": "2000",
        "Genre:": "Metalcore",
        "Lyrical themes:": "Christianity (early); Relationships, Inner struggles",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2000-2014,\n2017-present ",
        "Number of Reviews": 50
    },
    "Band Reviews": [
        "\nShaped by Fire is the seventh studio album by metalcore band As I Lay Dying.As I Lay Dying features Tim Lambesis(unclean vocals), Phil Sgrosso(guitar), Nick Hipa(guitar),Josh Gilbert(bass, clean vocals), as well as Jordan Mancino(drums). Shaped By Fire was was released on September 20, 2019, through Nuclear Blast and the album was also produced by the band themselves. It is also the follow-up to the group's sixth album, Awakened which was released in 2012 and was the final record before the band went on hiatus in 2014 when the lead singer Tim Lambesis was sent to prison and was sentenced to six years for soliciting the murder of his estranged wife.\n\nAs I Lay Dying have seemingly done the impossible and have made a brilliant album. Everyone had thought this band would never play again together, no one thought Tim would be back in the business, but if there is one thing heavy metal is about it is about acceptance and giving second chances, and I for one am glad we did because the metalcore genre have missed these legends. While overall the band have maintained their sound that has made them famous, they have definitely upped the aggressiveness and this is arguably the heaviest album As I Lay Dying have released to date.\n\nOne reason this album has been a success is Jordan Mancino, he may be one of the best drummers in metal, and not just in metalcore. His ability is on full display and I feel this is the best we have seen him, the heavier the better he is. On top of that Tim was able to sound like he was never gone, and sounding the way he does after that many years off is truly remarkable. You can feel the pain in his voice when he is screaming his lyrics, to me this album feels very personal to the band. While that's not to say any other As I Lay Dying album wasn't personal they just did not have the pain and relief attached to them as Shaped By Fire does. You couple that alongside the guitar work by the always amazing duo of Nick Hipa and Phil Sgrosso you are destined to have an amazing record. And adding the cherry on top of that is the melodic vocals of Josh Gilbert which blend perfectly with Tims screams.\n\nAs is with any album there are always going to be the tracks that stand out above the rest, and my personal picks on this album for different reasons which I will explain are Only After We've Fallen, My Own Grave. Only After We've Fallen is a great track which really shows off Tims vocals and his screams and why he is one of the best unclean vocal singers in the business, while Tim may front and center the rest of the band is definitely not asleep at the wheel, they all bring their strongest efforts on this track. Now My Own Grave is a totally different animal, it is the first song that was released by As I Lay Dying. It is a perfect metalcore song, containing harsh but melodic screams, perfect clean vocals as well as blistering guitars, and some of the best drumming metalcore have seen. Also the lyrics are also very personal and very deep.\n\nAs I Lay Dying have been one of my favourite bands for many years since I first heard them in high school. I am so glad they have made a triumphant return to a genre they helped mold into what it is today. Im glad they are moving forward and showing that people make mistakes and can sometimes redeem themselves, Tim will always have a black cloud follow him around, I just hope he can keep it at bay and continue making more amazing metal, we need him around. This is a must own for any As I Lay Dying fan and any fan of the metalcore genre.\n",
        "\nThe ebb and flow of trends seems almost cyclical in nature, even in present age of the internet where barriers separating audiences from their preferred music are seemingly absent. In the peculiar case of America's more controversial contribution to the modern metal paradigm in metalcore, online outlets have been musing over the alleged demise of said musical movement since the early 2010s, with Killswitch Engage front man Howard Jones prophesying the end of its commercial hegemony as far back as 2006. This sentiment was not without some degree of truth given the demise of several high profile acts associated with the scene such as God Forbid and Chimaira several years back, not to mention the lack of output by the style's early pioneers Shadows Fall and As I Lay Dying. The latter's case would become a matter of infamy when vocalist Tim Lambesis found himself imprisoned for attempting to solicit the murder of his wife, in the very midst of the overall scene's mid-2010s malaise no less. Yet even when discounting these coinciding events, there is a case to be made that they style itself had a shelf-life given its heavily formulaic nature and limited potential for expansion, and by the end of the previous decade it could have been argued that the sub-genre had softened itself to the point of becoming a mere extension of the broader pop/rock crowd.\n\nWhile the question of metalcore's rumored death remains an open one, if one wishes to treat its decline as a full fledged passing, the closing months of this decade might be signalling a rebirth is in the works. Following an amped up return to form out of Killswitch Engage earlier this year in Atonement, the recently reformed As I Lay Dying have unleashed what could arguably be dubbed their greatest offering in over a decade in 2019's Shaped By Fire. True to the implicit image of a phoenix rising from the proverbial ashes, this is an album born of a furious passion more befitting a band of youthful upstarts crafting a raw, intense debut; yet with the poise of seasoned veterans who have been around the block and memorized all of the landmarks within its borders. It isn't so much a reinvention of the style, nor does it really even seek to color that far beyond the accepted borders of melodic chorus fanfare, harsh and impact-based verses, and a heavy Gothenburg melodeath-oriented template to tie it all together, but rather a concentrated dose of everything that originally made metalcore work in its early days, refined into a massively produced final package. It retains the commercial accessibility that has generally come with the territory since the mid-2000s and comes in a compact formula, but the intensity factor has been kicked up something fierce.\n\nAs with a number of recent albums to come out of the broader metal scene, this album kicks off on a cinematic note with a massive sounding instrumental prelude in \"Burn To Emerge\", setting a looming tone with a massive drum sound akin to the march of a grand army. The resulting segue into the thrash-happy cruiser that is \"Blinded\" is seamless, showcasing a band that one would not guess had been broken up for several years and had not done much together since 2012, not to mention one that knocks how to tie in a fast-paced riff nod to In Flames and a technical edge with a syrupy sing-along romp of a chorus. The sheer ferocity of Lambesis' vocal assault speaks to a man who is channeling both Tomas Lindberg and Corpsegrinder with the best of them, and Josh Gilbert's cleaner singing provides a solid melodic foil while not being overtly whiny or thin, but the ones who completely steal the show are Hipa and Sgrosso with their masterful 6-string sorcery. Pummeling thrashers like \"Undertow\", \"Gatekeeper\" and \"Redefined\" showcase a duo that know how to chug and shred like its going out of style, not to mention up the ante in just how aggressive metalcore riffing can get. That said, even on more moderated and catchy numbers such as \"Torn Between\" and \"Take What's Left\", the riffing factor is still quite animated and the brief guitar solos prove technical enough to rival the mainline death metal crowd.\n\nSay what one might about the baggage that this band may now carry due to the past exploits of their front man, this is about as clear cut of a case for Voltaire's famous quote of needing to separate the work from the man as any in recent memory. If there is any flaw to be pointed out in this otherwise amazing example of metalcore's potential, it is that it betrays the stubborn limitations in the style itself. For all its sheer energy and fury, it finds itself conforming to the cliche verse/chorus formula that has largely dogged the style since its inception, to the point of each of these songs being extremely predictable. Having said that, the sum of this album is a veritable sonic colossus that hits the listener with the intensity of a sledgehammer, and any trustee of old school melodic death metal would be hard-pressed to deny that this showcases about as faithful of an emulation of those consonant heavy metal melodies typical to In Flames and the high-octane thrashing character that typified the early works of The Crown. It may not win over many new converts given its largely orthodox demeanor, but any self-respecting old school fan who first took to metalcore because of albums such as Beneath The Encasing Of Ashes and Alive Or Just Breathing will want to hear this.\n\nOriginally written for The Metal Observer (www.metal-observer.com)\n",
        "\nAfter Awakened was released, Tim was busy doing other projects such as his death metal band, Pyrithion; releasing their debut EP a year after Awakened, as well as his satirical, Arnold Schwarzenegger-based project, Austrian Death Machine which he started after An Ocean Between Us. Even Josh Gilbert, the bassist, joined that project. But that project, as well as Pyrithion, AS WELL AS As I Lay Dying all came to a halt, as Tim was prisoned.\n\nTim was sentenced and prisoned due to attempted murder of his then-wife; hiring a hitman. That's not something you hear often, especially from a genre like metalcore and its musicians. But the man really stepped up his game and took responsibility, which ultimately had him released sooner than expected from prison. From what I've read, had he not been released sooner, then he would've stayed until next year. He went to find his relationship with God or whatever he believes in; his religion to be precise. He also went to help others in need, like donations and such. Trying to rekindle his friendship with his bandmates which finally ended this long hiatus, when the band released their first single off Shaped by Fire, My Own Grave in 2018, followed by the second single, Redefined. And just a month and a week away from the album's release, the band released the title track and Blinded as the third and fourth singles, respectively.\n\nYou can only wonder the lyrical content and how the music has changed after seven years and what the band went through in making this long-awaited successor to Awakened. Said album was their latest best record since Frail Words Collapse, as far as I'm concerned. Hopefully, whatever drove the band to record something unique after all these years will be something new, fresh, unpredictable, and perhaps better than anything they've released.\n\nLet's start with the four singles: Burn to Emerge is just a prelude. That's all I have to say about that. Maybe pointless, but it is what it is. Blinded, which is the fourth single, melodically sounds a bit like melodic death metal, but the guitars are quite explosive, as the drums are blasting. The vocals sound great and somewhat improved. I think the band went to a more technical approach, too, while this song, in particular, reminds me of Frail Words Collapse. Followed by the title track as the third single, it's heavy, all right, but heavy in the djent kind of way. Just a fun song, really and thankfully it's just one djenty song. The song that reignited and truly shaped this fire: My Own Grave exceeds all expectations. It's groovy, heavy, and in the band's unique sound - take notes emo bands. And the second single which features Jake Luhrs (who also appears on the song's music video) from August Burns Red; another known Christian metalcore band: Redefined is rather angry on the vocal department, though that doesn't stop the drums going crazy, the guitars fulfilling even more with the melodies, and the clean vocals doing their respective part.\n\nAs for the rest of this masterpiece: Undertow showcases bone-chilling melodies and clean vocals, while Tim steps down to more growly unclean vocals, and there's even a weak keyboard sample in the background. There's also a sick and original breakdown. Just an awesome song! Torn Between is more standard to the band's quality, yet didn't disappoint. Definitely more fresh than the 2005-2010 records. Gatekeeper is more drums-orientated which fueled the song with sheer heaviness. Just listen to the guitar solo that's backed up by the blast beats. This is a great example that the band is surpassing their expectations. The Wreckage, which is the longest song starts with a soft guitar melody and clean vocals until the song's heavy side kicks in brutally. Rhythmically, it's melodic. It has more of those annoying gang vocals that I despise, but I digress. More catchy melodies and heavy vocals in Take What's Left, as well as the meaningful clean vocals in the chorus. The drums are blasting even more here. Only After We've Fallen contains more and more heavy and powerful musicianship on all departments. And the last track in this quite-perfected record: The Toll It Takes concludes in yet more heavy playing, though the chorus, which mostly contains the clean vocals made the song more impactful.\n\nI'll be damn if this isn't the band's best album after six full-lengths, in a total of about eight original releases, and existing for almost 20 years. It almost feels like it's not even As I Lay Dying anymore, but a whole new, different, and unique band. Arguably, I still dig the first two records the most, while Confined from Shadows Are Security is my favorite song from the band and is yet to be beaten. Shaped by Fire is definitely the best record metalcore has to offer in 2019 and perhaps on the chart for the best record of this year, too. \n\nI hope this is the direction the band will take onto their next record and beyond. It seems like the repetitive and unoriginal style of the band's sound and music is gone. I always liked the debut, while the sophomore album had a promising direction, but all that never happened for a long damn while until now. As the first reviewer for this album, I hope the band will take notes and give the fans even more impactful albums. Now for the best songs: Blinded, Undertow (being the best song on the album), Gatekeeper, My Own Grave, Take What's Left, Redefined, and Only After We've Fallen.\n",
        "\nI'm thinking to myself at this point, As I Lay Dying is just another repetitive metalcore band with nothing refreshing but radio-quality music and something that isn't mind-blowing or impressive, let alone memorable. However, maybe after seven years since Shadows Are Security they finally managed to put together something that's better than their last three full-lengths, or should I say... awakened. Maybe that's the meaning of this album.\n\nAlready talking about refreshment, Cauterize is heavy in the metalcore sense and not blending any thrash metal or death growls (which aren't bad). It's melodically great, surprisingly has a great breakdown, and the vocals all-around sound good and that's the quality the band should maintain. A Greater Foundation isn't any different but more prominent with the clean vocals, as well as a strong bass tone. Also, the extended version of this song isn't really extended, so ignore that. Resiliently groovy, Resilience mostly has catchy guitar melodies and a powerful chorus when it comes to the vocals. Wasted Words sounds like a thrash metal behind the kit, but still managed to keep that influence away for original metalcore sound.  Overcome is yet another melodic track with heavy riffs. Defender is widely melodic when it comes to the guitars, yet also very groovy. I don't know why Unwound didn't just end up as the 11th track and instead labeled as a b-side demo, but it's clearly one of the better tracks. Tim's unclean vocals sound explosive, the guitars vary when the melodies are exposed, and the drums are quite blasting.\n\nWhispering Silence is one of the easier songs, in terms of the lack of heaviness and more melodic. Not the best I've heard. No Lungs to Breathe has a very triggering chorus, while the rest of the track sounds forgettable. Washed Away is the interlude to My Only Home, which is just a minute of a slow guitar melody. As for the actual song, it's also more around that radio-quality of musical substance. Same can be said for Tear Out My Eyes. It's surely heavy and fast, but not in the caliber of throwing you away from whatever awesome music was created.\n\nIt looks like a long record considering the portion for the songs is above four minutes. I'm not sure if it was a length thing, but Awakened is a great record and the band literally woke the fuck up. Of course, had Tim not been on the incident he created there could've been at least three more records (including the recent Shaped by Fire. Didn't end in a bang, but this record, before the band's hiatus due to what happened with Tim, was fresh and fun to listen to. The best songs are Cauterize, Wasted Words, Overcome, and Defender.\n",
        "\nDecas looks like full-length rather than an EP. Nevertheless, this 12-track EP features three original songs which are the first three tracks, followed by three covers from Slayer, Judas Priest, and Descendents, as well as a re-recorded medley of the band's entire debut album, Between the Encasing of Ashes. The final four tracks are remixes of The Blinding of False Light from The Powerless Rise, Wrath Upon Ourselves from An Ocean Between Us, Confined from Shadows Are Security, and Elegy from Frail Worlds Collapse.\n\nParalyzed sounds like an old school song from the band. Nothing new and it pretty much got everything from the likes of Shadows Are Security. Great guitar melodies and vocals. From Shapeless to Breakable - moderately extreme. Very strong thrash metal with blast beats. Once again, though, the length says it all, and the song is clearly inspired by the offerings of The Powerless Rise. At least the third and final original track is in the right direction. Moving Forward is mostly melodic. However, it sounds like a radio-quality song.\n\nLet's see what the covered songs have to offer: starting with Slayer's empowering War Ensemble, this version doesn't sound any different than the original - and quite frankly, when a metalcore/thrash metal-inspired band covers a Slayer from the early 90s, it's literally more modern and trying to sound heavier, with heavier vocals as well. I'd rather stick with the original.\n\nFinally, the medley of Beneath the Encasing of Ashes didn't have its raspy and raw/primitive riffage. It sounded like the band was trying to recreate their debut as if it's the same music as the band's later full-lengths. They played like 85% of the album anyway, cropped under four minutes. Going back and listening and comparing the songs I liked from their debut versus what was played in this medley - the debut album CLEARLY tears this garbage apart. Then we have both Hellion for the interlude for Electric Eye by Judas Priest. For obvious reasons, it'll sound like Judas Priest when it comes to the vocals, but there's also additional death growls. I don't know how the original song sounds since I'm not a fan, but this cover is just really, really bland. And the 40-second Coffee Mug by Descendents - the 40 second tells you all about it...\n\nI'm skipping the remixed songs because they don't even sound like metal to begin with, but that doesn't take away from what the rest of the EP has to offer, in terms of its questionable quality. Maybe if you like remixes in general or metal songs that are remixed (like you have Fear Factory's Remanufacture album), then I suppose it wouldn't worthless. But in my case, metal, as a whole, that's been used to industrialize its origin to fit modern, mainstream music is a waste of time, not to mention that the four remixed songs are rather ruined anyway.\n\nDecas was showcasing remixes of old songs, a medley of their debut album, three covered songs to reveal what inspired them as musicians, and three original songs all cramped to a pointless release. The three original songs should've been released as an EP or bonus tracks to Awakened. I'm not even saying this is a disappointing release but rather effortless without value. Just listen to Paralyzed (or don't)...\n",
        "\nKinda ironic how the album suggests the word 'Power', yet it sounds like the band's declining EVEN MORE. It seems like with every release the band's quality is declining; probably crossing the border with An Ocean Between Us. The Powerless Rise is heavier than the last two records, featuring periodic blast beats with overall amazing drums performance that falls behind by the generic heavy music.\n\nI guess it's one way to start the album, in another thrashy pavement of Beyond Our Suffering. While it has some death growls and the music SOMEWHAT sounds technical, it was a bad impression. More hardcore orientated behind the kit, Anodyne Sea is surely a groovy metalcore track. The music is definitely different and the clean vocals sound a bit different from the band's predecessor album. There's still not much of an improvement other than sounding different to some extent. Without Conclusion is a no-no. The drums, for the most part, are great, though the music is nowhere to back it up. Condemned is mostly a catchy song with nothing new to offer. Upside Down Kingdom is in the caliber from the quality of songs of the likes An Ocean Between Us featured, yet wasn't the best. And while The Only Constant Is Change sounds decent and in the quality of other tracks on the album that features great melodies and depth, this one wasn't at that range. It's repetitive compared to other songs.\n\nAs for the songs that didn't disappoint: Parallels doesn't sound any different than the songs with more quality in An Ocean Between Us. Overall, it's standard. Gradually, The Plague is heavy in the sense that it's not like the first three tracks. It's got the death growls and blast beats that sound modest and not pretentious, while the song itself is simply groovy. Tim did a great job with the death growls. Anger and Apathy balances well between the new heavy introduction to the music and the clean vocals performance, while the music sounds alright. I loved the guitars' from Vacancy. Rhythmically, and overall enjoyable.\n\nThe Blinding of False Light, being the last and longest track on the album, is the winner for the best song. It's got a great groove, death growls, awesome drum patterns, and more range. While this album didn't exactly change anything to a significant level, it was decent enough - but still around the quality of the last two records. Disappointing nevertheless, but has its moments. With the aforementioned last track being the best song, additional ones that are worthwhile would be The Plague, Anger and Apathy, and Vacancy.\n",
        "\nAn Ocean Between Us might officially be the album that defined the band; or in other words, it's their best release. I believe what justified this album to become what it is was because of the production and how strong the essence in the music and the band's belief in Christianity were used. The latter may not mean anything relevant, but knowing the band also settled in a lineup that carried with them since without any more changes could mean they perfected their sound.\n\nFirst, I'll start by saying the band went to work with Adam D., whom I credit as the best metalcore producer; most definitely bringing out more out of the band, as well as more life out of the music. I'm also under the impression that the music and lyrical themes are stronger than ever, still performing under thrash metal influence - which since the band's debut this might be their first mature record.\n\nJust to showcase the tracklist, this is the first record that features entirely original tracks without any re-recordings. Still releasing a 12-track record, An Ocean Between Us has a prelude and an interlude tied with the other ten available tracks. The prelude, Separation doesn't really sound unique and features some slow guitar melodies. As for the interlude to the song Wrath Upon Ourselves, Departed features faster and catchy guitar melodies, yet isn't any more different.\n\nNothing Left is overall a catchy, cleaner metalcore track. The weak background melody in the chorus complements the singing very well. That's just one aspect of the song, while it's standard at best and not bad for the album... so far. The title track is mostly groovy, yet standard as well. But the addition of the clean vocals in the chorus sound great, which didn't make the song sound typical. While it's the longest track on the album, Forsaken showcased a different style of riffing and sound that comes from the guitars that stand out from most of the album's offering. The clean vocals sound fantastic, too, so are the drums. It's funny how on my Frail Worlds Collapse review I mentioned that Distance Is Darkness resembles Deftones, yet the opening of I Never Wanted sounds like Deftones's famous song, Change (In the House of Flies. Anyway, I Never Wanted's length gave the song more depth on all instrumental and vocal aspects. The clean vocals, especially, were pretty powerful during the bridge/outro.\n\nWithin Destruction I think it is the first song from the band that truly sounds like thrash metal. The problem with this song, despite the influence, is how unoriginal it sounds. Another annoyingly thrash metal song is Comfort Betrays. Hell, even its length says it all. Not any different than the aforementioned thrash metal song. Bury Us All was more like it, meaning it didn't feature that worthless thrash metal influence. However, it's just a generic, short metalcore track. The Sound of Truth sounds predictable, structure-wise. Compared to the songs in the paragraph above, this one pales in comparison. Wrath Upon Us surely sounds like an improvement in terms of the thrash metal influence, but again... nobody really asked for it. It's funny that even the clean vocals sound bad. This Is Who We Are sounds like what the title suggests which means overall, the song didn't sound as bad but not great either.\n\nWith the bad thrash metal influence and following the same direction from Shadows Are Security but ending up worse, the music hasn't changed or sounded any different, let alone improved. The so-called claim that this is their best album sounds like a slap to the face. Sure it's more melodic in one way, but I believe there was room for a wider range within the music. And no disrespect towards Adam for his production, but I wouldn't count this as a quality work to his credit. Best songs are Nothing Left, Forsaken, and I Never Wanted.\n",
        "\nShadows Are Security unveils eleven new and fresh tracks with the twelfth one being a re-recorded version of Illusions, featuring Jason Moody of No Innocent Victim, which is another San Diego based hardcore/metalcore band from the early 90s. Control Is Dead features the legendary Daniel Weyandt from the pioneering band, Zao. It's no surprise that Tim is inspired by him based on what's been heard in the band's debut album.\n\nAs for the music, I think Tim found his mark when it comes to his vocal range, not to mention how the music is strongly influenced by thrash metal, yet it's more polished and more of the \"melodic metalcore\" direction but some hard extent. The guitars are definitely more melodic than before, the drums are more sonic, and some of the heard clean vocals sound much better. From what I gathered, this is where the band founded their solid lineup.\n\nI believe it's one of their more famous songs to play. Meaning in Tragedy doesn't sound any different than what Frail Words Collapse sounded in the past, yet the music still sounds fresh enough. The rhythms melodically sound original. Confined unleashes more brutal drumming by Jordan, while the music is more melodic with the addition of some great-sounding backup vocals. Pretty bone-chilling. The Darkest Nights generally contains more melodic rhythms and prolong clean vocals, compared to Confined's short but impactful cleans. Repeating Yesterday has quite the experimental intro, which sounds like the band's early dark work. As the song kicks in its riffs and heavy approach, it succeeded to stay true and original. Plus, it has a piano outro to complement the experiment. Through Struggle, thankfully, continues the melodic approach with additional vocals, which at this point is always welcomed. The only tiny problem was the breakdown outro: not only it sounded bad but very unnecessary for such a great song.\n\nLosing Sight mostly sounds catchy and very repetitive. The vocals by Tim, especially, sounded annoying. Not sure for the reason behind such songwriting, but this was bad. Empty Hearts in one of the heavier tracks on the album that sounds entirely different, which means the band isn't repetitive as it might as one might think when it comes to their overall musical approach. However, this song is no different than Losing Sight when it comes to Tim's vocals. The music, too, wasn't that impressive. Reflection also follows the same path. Although it's more melodic and had a sweet melodic death metal-esque opening and remained heavy, the band was doing much better in their stronger melodic approach that was heard in the first two tracks. The amount of heaviness that's being heard is very repetitive, not to mention how similar it sounds to Losing Sight. The Truth of My Perception I believe failed to deliver because of how personal it sounds, compared to anything else this album offered. At this point in the album, the music doesn't transition to something fresh (like you've heard it all). Hoped to hear something huge, but Control Is Dead with Daniel Weyandt didn't deliver anything. The music is mostly the same as before. Morning Waits sounds very different during the verses, but the chorus and bridge aren't any different than what you've already heard. At least it has potential. It shouldn't come to a surprise when Illusions sounds better than the original version, but it's labeled like Empty Hearts; where it doesn't offer anything other than repeating riffs. I guess it's also simply just a bad track.\n\nExperimental is one way to label this third approach by the band, but very repetitive is more suitable and accurate. Whatever the guys were writing or wanted to shine down upon the world, it was badly approached. I was quite intrigued with the melodic rhythms and the clean vocals, as well as Tim's screaming and unclean vocals, compared to the repetitive heavy riffage and lower unclean vocals. I can only hope the majority of this weak release by the band isn't going to be their direction. The best songs are Confined, The Darkest Nights, Repeating Yesterday, and Through Struggle for pretty much being the most powerful songs.\n",
        "\nFrail Words Collapse is what started the band's trend and beyond, with their moniker skull logo and more thrash metal influence within their already-established metalcore sound; departing from their raw and depressing music from Beneath the Encasing of Ashes. The Christian themes are still relevant within the lyrics but not as much, as the band later focused on the overused \"inner struggles\" themes - not that I'm in any position to judge. That being said, the band re-recorded three tracks from their split album with American Tragedy, as well as re-recording their supposedly best song from their debut album which is the last track, Behind Me Lies Another Fallen Soldier.\n\nThe opening track, 94 Hours showcases the very essence modern metalcore, in terms of production and song structure, as well as the prominent palm-muted riffs and simple melodies, the drums work and the very heavy use of the double bass, which was executed well. Pretty decent opening track. Falling Upon Deaf Ears respectively has some great drumming, perhaps the best on the album. Although the music may sound generic, it wasn't that bad. Collision comes off very predictable, yet the music didn't disappoint. The riffs overall are great, so is the double bass. Distance Is Darkness UNPREDICTABLY produced a more chaotic approach to the music. It brings in the raw power from their debut album which is an automatic win - when you thought this album might be entirely different. As for the vocals, not only you have short death growls but also Chino Moreno-like clean vocals (and the ending riff sounds exactly like White Pony; speaking of Deftones). The longest and final track on the album: Elegy's length shows more depth in the music and writing than the rest of the album's offering. The outro melodies are great, despite their simplicity.\n\nAs for the four re-recorded songs: Forever sounds as good as the original version, but obviously sounds better because of the production; though the clean vocals don't aren't as good like the original. Behind Me Lies Another Fallen Soldier clearly sounds more mature and belongs to this album, whereas the original version from the debut sounded quite undeveloped. The Beginning comes off as the most catchy song on the album, and annoyingly so. And when the re-record version didn't manage to be good either, this song is simply not good. Much like Forever, The Pain of Separation doesn't sound any different and as good as the original version and only sounds better because of the production.\n\nUltimately, a song like Undefined is the most metalcore you could squeeze out of this record, but it didn't manage to deliver. Same can be said for the shortest track on the album, A Thousand Steps. The length isn't even an issue, as the band managed to write songs below two minutes that were explosive that was heard in the band's debut. The amount of simplicity is what made these songs bad. Song 10 starts with what almost looked like an instrumental track until the vocals entered (excluding the whispering one) more than two minutes after. The music was also generic at best.\n\nFrail Words Collapse is another example for an album that starts off great in its first half, while it progresses into its other half it becomes bad (excluding the last two tracks for some redemption). Despite how the music came off as a bit generic in some of the songs in the first half, it's still a slightly better album than the debut, yet more mature. My favorite part is how Tim returned the death growls to some of the songs, learning that the band hasn't entirely revamped their sound from the debut album. The best songs are Distance Is Darkness and the two re-recorded tracks, Behind Me Lies Another Fallen Soldier and The Pain of Separation.\n",
        "\nAlthough released in 2006, A Long March: The First Recordings contains the entirety of the band's debut, Beneath the Encasing of Ashes, while all the re-recorded tracks (expect Reinvention) are available in their latter two releases, which are Frail Words Collapse and Shadows Are Security, respectively. The Beginning, The Pain of Separation, and Forever are available at Frail Words Collapse, while Illusions is the only re-recorded track available at Shadows Are Security. That being said, the re-recorded tracks and their original versions are reinstated from their split with American Tragedy; released in 2002. So that tells you where the original versions of said songs come from and where ORIGINALLY the re-recorded versions of said songs are available.\n\nOn one hand, you might find this compilation worthless because you may ask yourselves why is there a compilation that includes the debut album, the split, and some songs that are already available in Frail Words Collapse and one song in Shadows Are Security, when you've probably heard all of them individually. Maybe they're trying to market released songs for profit? On the other hand, though, this compilation album showcases the band's early and raw work as Frail Words Collapse pretty much established the band's sound from that point on, therefore seeing something right in such compilation. So I think it's a good deal if someone wants to listen to the band's early raw work in one single album.\n\nAs I already stated in my review for the most part, Beneath the Encasing of Ashes is a raspy record that contains simple, yet effectively heavy riffs, nice melodies, a reverb bass that helps with that heaviness, and decent drumming. Tim's vocals are powerful in their raspy fashion and the addition of death growls was great. And in this album's case, it's one of the better debuts compared to most other metalcore debuts. Although it's a pretty short record, yet has twelve tracks, most of the shorter tracks were very effective; when you hear songs like Torn Within and A Long March.\n\nMy purpose for this review is to check both versions of Reinvention and check the original versions of Illusions, The Beginning, The Pain of Separation, and Forever since like I said above, the re-record versions of these songs are already available in the aforementioned records and it's only right to just speak about them in said records.\n\nReinvention is the longest track. It starts with a catchy melody and only progresses with the song with an extra melodic layer. You can tell how different is the band's sound than from their debut. The tones are deeper and Tim doesn't sound raspy anymore. Obviously, the re-recorded version would sound more refined than the original version, which not only sounds better but the band brought more out of that song than they've had with the original. I expected The Pain of Separation to have the heavy tones I was looking for. For the track's entirely you get those heavy riffs that you can even hear the strings being palm-muted. Simple in one way, but fine on the other. Forever features some clean vocals for the first time, sang as backup vocals by the other band members. The rhythms sound great and compelling.\n\nIllusions also starts with some simple catchy melodies until the song heavily kicks in with the band's old high-pitched riffs and strong bass tones. It sure sounds like it belongs on the debut... but it wouldn't be exactly a good song. The heavy riffage sounds tempting, yet repetitive. Even more catchy melodies can be heard during the intro of The Beginning, which makes for these cocky melodic metalcore song. At least after the first chorus, there are some sweet heavy riffs, but that doesn't change how unoriginal the song turned out to be.\n\nIf you think this compilation album is worth getting because it showcases the band's early raw work, then I don't see the hesitation at doing so. I think it's worth the money. But if not, then it's no different than checking the debut album and the split album individually (if you also want to try the other band, American Tragedy. The best songs are The Pain of Separation and Forever.\n",
        "\nThe San Diego, California based Christian metalcore band, As I Lay Dying are one of the older bands in the genre that in some shape or form developed it. As a fan of the Massachusetts scene, the scene or bands in California, let alone As I Lay Dying never really caught my attention, having the impression maybe they're one of the many other emo-based metalcore bands, or in some way developed to become such. But nope. Learning about Tim Lambasis, the singer's tragic story and how he's overcoming past mistakes kinda inspired me to be interested in the band and Beneath the Encasing of Ashes is one of the better metalcore debuts I've heard.\n\nThe album is three seconds away from being a 30-minute record, which nonetheless surprises me the number of tracks was recorded for this album and their overall length. You only have about two songs which are above three minutes, while the rest of the album is below that, and some portion of the album is below two minutes. Maybe it's one of those albums that bands just want to release it in their lowest quality so record labels will offer them a deal, but as I said... this debut is one of the better ones I've heard.\n\nThe title track's beginning sounds like a sample they took from a film which I have no clue of, but as the actual song starts to kick in it's blasting at you with raw power that later develops to catchy riffs. Tim sounds very raspy, which is one way to help the music. Later he sounds a lot rawer by adding death growls of his own. You can tell there's a lot of simple, hardcore-essence based music and great drumming, but it also reveals unpredictable songwriting. Torn Within is the first track below two minutes. It showcases some nice tunes from the guitars, as well as more angry drumming and unclean vocals. As the song progresses, there's a very strong reverb from the bass, and as it's accompanied by the repetitive guitar riffs it brings a lot of thrill. As a long Demon Hunter fan, and although As I Lay Dying was making music before Demon Hunter, Forced to Die sounds a lot like My Throat Is an Open Grave from Demon Hunter's self-titled debut album. Speaking of Forced to Die, the song's progression focuses on more easy melodies and rhythm that complements the song's meaning. A Breath in the Eyes of Eternity is one of the more brutal songs the album has to offer. For the most part, it's got heavy riffs and prominent death growls with even raspier unclean vocals. When This World Fades is melodically atmospheric, while it still contains this heart-aching sound and vocals. I liked how desperately Tim interpreted the lyrics. The third track below two minutes, A Long March also showcases catchy riffs but also that amazing reverb bass sound that makes the music even heavier. The Innocence Spilled is the first out of the two longest track of this record. For obvious reasons, it showed twice the substance as this entire record had, yet its approach was progressing into more atmosphere and desperation within the music. And the last, longest track on the album: Behind Me Lies Another Fallen Soldier has a few whispering vocals, while the unclean ones are very powerful in their delivery. The music fashionably is simpler than before, but it delivered.\n\nThe song track below two minutes, Blood Turned to Tears has very annoying riffs, yet simple as well. While it has death growls, the music was bad. Worst song on the album. The Voices That Betray Me, although has nice long power chords during the chorus, as well as the slow melodies, this song already shows you basically get the idea of the music and doesn't present something different. The final track below two minutes has an interlude called Surrounded, which has nasty and creepy unclean vocals. I think it should've been within said track which is called Redefined by Your Embrace. This song has more double bass and cymbals in effect, but the riffs are underwhelming and badly catchy.\n\nPretty interesting debut to say the least. Beneath the Encasing of Ashes varies between it's force-fed heaviness and melodies, as the bass helps to perfect it. Tim's vocals are as powerful as I imagined, and the band executed the drop C tuning just the way I like it. I know the direction has changed - maybe drastically, but had the band continued with their debut's approach I might've liked it a lot more, thanks to the production and writing. The best songs are Torn Within, Forced to Die, When This World Fades, and A Long March.\n",
        "\n*FIRST AND FOREMOST*: This review will be focus specifically on the song itself, and will not discuss in any way the controversy over Tim Lambesis.\n\nHearing AILD come back is a bit bittersweet. Considering the band's situation, one could expect any new output to go two ways: either this band simply has lost all creative energy and a comeback seems hopeless, or they've pulled themselves together to pour all of their energy into their strongest material yet. And going off of a mere two singles since last year, it would seem that the second outcome is definitely in question for As I Lay Dying. The first thing I noticed about the previous single, \"My Own Grave\", was just how emotionally powerful and cathartic it sounded. It was the sound of a band that's not just coming back, they're coming back swinging. My expectations for new material has just skyrocketed since they released what is hopefully the second single from an upcoming full length, \"Redefined\".\n\nSo what's going on in the song that points to some of the best metalcore heard since 2005? Well, it's that this is truly a more metal-ended song than core. AILD are taking on an almost 'post-melodeath' approach to their songwriting, and so you're getting something musically a bit more serious, and lyrically a hell of a ton more mature. Predicting that the band will go full-on melodeath on a full-length possibly is, to say, a bit of a jumping the gun on my part, but there's something about the way \"Redefined\" is handled that just shows so much musical growth and focused riff-writing that I can't quite put my finger on, but here's my best attempt at a description: imagine you've got a well-aged 90s hardcore band playing covers off of Dark Tranquility's Character but tailored to fit their own personality, and slap some very honest, self-aware lyrics about inner guilt and struggle. This is the sound that As I Lay Dying is going for these days, and oh is it glorious.\n\nFrom a composition point-of-view, there are riffs that pull no punches - verses with tasty melodeath riffs swirl-mixed with a generous helping of contemporary breakdowns that build up as much momentum as possible before the entire thing explodes into a massive, defined chorus that layers clean and screamed vocals. The choruses, much like in \"My Own Grave\", have a very thick coating of atmosphere to give the catchy melody a whole new level of depth production-wise that might remind one of \"Forsaken\" (from An Ocean Between Us, 2007). While this very intricately designed chorus stands extraordinarily well on its own, the real treat here is still the speed-focused riffs in the verses in the vein of An Ocean Between Us's title-track or (oddly enough) some of AILD's mid-late 2000s disciples like The Devil Wears Prada and Miss May I.\n\nSo, I say to everyone still onboard with As I Lay Dying: the new album is probably going to be one of their best yet, if not one that completely topples all their past material - which of course, is something that a band like AILD would have a hard time doing. The closest early release I can think of that really sounds like this new and improved AILD metalcore would be the aforementioned An Ocean Between Us, but like a much heavier, more grown-up reimagining of that album.\n",
        "\nAt this point in their career, As I Lay Dying have become the most controversial band in recent memory. Their lead singer, Tim Lambesis, was sentenced behind bars for solicitation of murder of his ex-wife (that ultimately failed). From there, the fate of the band seemed to be stuck in limbo. The irreversible toll it would take on the future of the recently formed supergroup Wovenwar was inevitable. Hell, it was unavoidable. The constant comparisons to Nick, Josh, Phil, and Jordan's former band and references to their jailed lead singer wouldn't help the band very much as they tried to escape the shadow of the person who harmed so many people close to him. Now they're back, with the line-up they've had since An Ocean Between Us, and there's been no shortage of opinions from people like Jamey Jasta to Dino Cazares.\n\nIf anyone has the time, please go and watch the thirty minute video where the band discusses why they decided to get back together and the process of how they ultimately forgave Tim. It's a very moving video that anyone who calls themselves a fan should at least watch once.\n\n2018 was the year that As I Lay Dying returned to the studio to record a brand new song. The appropriately titled \"My Own Grave\" is almost anthemic. It's very personal and reads as a very bare naked reflection of Tim's spirit, as he stands as a man who did wrong, knew he did wrong, and genuinely accepted responsibility of his actions. It's clear of that from the beginning as it fades in with a soothing acoustic lead while Tim's screams linger in the background, then burst to the front in a very direct display of righteous anger. It's been six years since Awakened and Tim's voice has grown significantly since then and I love hearing it like this. It's a lot deeper, gruffer, and more pronounced; not to mention the delivery of his vocals are absolutely phenomenal throughout the song. I'd argue his performance on this single is as good as it was on The Powerless Rise. \n\nHow about the others? Amazing. They've not dulled a second in their time away from the band. Jordan Mancino's performance here is very much a continuation of what he did on Awakened with exquisite fills, some great drum rolls, and a militaristic pacing that sounds a lot like a soldier march at some parts, while Nick and Phil deliver that duality they mastered so fluently they did on The Powerless Rise. I have to admit that I feel sorry for Josh. I'm sure that he has some really good bass lines, but I can't ever hear them because the guitars are always so incredibly loud. But he can sure sing, though. His cleans only get better and better and, much like Tim's gruff screams and vocalization, are certainly the best they've ever been now.\n\nOverall, this single is solid. It's safe to say that I am excited for a new album. If you're a fan who lost hope in AILD after Tim's conviction and stopped listening to their music, which is understandable, I would understand why you wouldn't care about this new song or the new album that might be on the way soon. This song, though, is meant for everyone. It's meant at the end of the day to be an apology to every person he's wronged. Fans, friends, his bandmates, his family -- everyone. That's all. And with this amazing song, and that video on their YouTube channel, I think I'm willing to let go and forgive the man.\n",
        "\nAs I Lay Dying is one of the most credible bands within the metalcore genre. Like it or not, they have been at it since 2001 with their borderline hardcore punk debut album \"Beneath the Encasing of Ashes\". It wouldn't be until their next album that they really found the sound they were looking for and would pretty much retain until their current hiatus. Unfortunately, while they are one of the more credible metalcore bands, they really don't sound too different from other bands in the scene. This album is not their finest work, but it's probably number three for me, with \"The Powerless Rise\" being first and \"Frail Words Collapse\" being second. I'm not a huge fan of this band but I really dug them seven years ago when I was entering high school and, even now, I can listen to them without cringing too much. \"Shadows Are Security\" is AILD's third album and was released in 2005. \n\nThis album is obviously guitar-driven. The riffs go from heavy to melodic and extremely catchy. There are plenty of metalcore breakdowns and chugs to go around. The band begins the album with a no bullshit introductory song, \"Meaning in Tragedy\". This song doesn't start with a spoken word intro or an acoustic one, like a lot of metalcore bands tend to do, but rather a Gothenburg-esque guitar riff. Most of the riffs here follow the same pattern and unfortunately do very little to differentiate themselves from one another, which is a major gripe I have with this album. These guys really would have done better here if the breakdowns were reduced drastically. You really don't need one in every damn song, which is one gripe I have with metalcore overall. If some of these breakdowns were replaced with solos, this album would be far more impressive. \"Empty Hearts\" has a solo in the latter half of the song and although it's fairly generic for the most part, it is still a welcomed addition that should be incorporated more. But hell, even this solo leads into a breakdown. \"The Truth of My Perception\" also contains a solo but these two songs are really the only proper examples of this. The beautifully melodic \"Repeating Yesterday\", which is probably the main highlight of this album, doesn't even contain a solo, and it really could have benefitted from one. Most of these songs just feel incomplete. Aside from \"Repeating Yesterday\", \"The Darkest Nights\" is perhaps my other favorite song from this album. It's really catchy and not all that special, but for nostalgic reasons, I'd put it up there as one of the best offerings from this band overall. Really, if you took out the breakdowns and added solos, you would have more of a melodic death metal album than a metalcore one as influences of Swedish melodeath and even a tad bit of thrash metal are fairly commonplace here.\n\nI swear Tim Lambesis has to be one of the most generic vocalists to ever come out of metal. He uses the same scream throughout the entire album with little to no variation, except to change from a lower growl to a higher pitched scream. This takes away from a lot of the emotional atmosphere this album could have possessed. There are some average to decent clean vocals provided by different personnel but they sound generic and have become a very common trait in modern metalcore. I will say Tim is a talented musician who has utilized his talents much better with his solo project Austrian Death Machine, which would be conceived three years following the release of this album. His vocals are just too bland to me and take away from the music rather than adding onto it.\n\nUnfortunately, this album is really nothing more than average. It has moments of real promise and creativity but of course, these moments become overshadowed by boring vocals and breakdowns. I still enjoy this album a little due to nostalgia but that's about it. Oh well, we all have to grow up someday I guess.\n",
        "\nJust as the title says this is nothing new. If you've ever heard any metalcore band from the early to mid 2000's then you have already heard As I Laying Dying's \"Shadows Are Security\". This album follows a pretty predictable formula, down tuned guitars, breakdowns, tons of double bass drumming, and harsh/clean vocals. Thankfully the cleans on this album are to very small parts.\n\nA big issue I have with this album is not the generic formula and the overuse of breakdowns, but the lack of bass on this album. The only time you seem to hear any bass work is when it drops just before a breakdown which is sad, I love to hear the bass in the mix. Another Big issue is the vocals.Tim Lambesis tries his hardest to sound \"brutal\" but it just doesn't cut it for me. It feels to cookie cutter \"extreme vocals\" kind of feel, it feels emotionless. \n\nNow onto the guitar work. Any backbone to a good metal album should be killer riffs, but does this album deliver? The answer is no. But this not from a lack of trying. The guitars play at fast tempos and are down tuned and sound heavy, but it seems after just a minute or so into the song they lose all steam and lose all the energy. This might be forgivable if every song didn't suffer from this, and given the length of the album all the songs just seem to blend together. Even the drumming falls victim to just fading into the background. Not to give it credit, it does try to put into the songs, but the issue is it all sounds the same. So just like the guitars the drumming fades out, and it just gets hard to tell when songs end and began. I wouldn't recommend this album unless you happen to be a fan, but if your not a fan of As I Laying Dying then feel free to pass this album up.\n",
        "\nI distinctly remember hating this album the first time I listened to it. I thought that it sounded generic, tried too hard to be brutal, and that the vocals - particularly the vocal rhythms - were atrocious. Have I changed my mind? To be honest, I rarely listen to this album because metalcore is not my favourite type of metal, though I have a tolerance for the faster-paced variety that bears more similarities to melodic death metal. One thing you can certainly say of As I Lay Dying is that they never wimped out and went for the emoting clean-sung chorus on every song, nor do they skimp on riffs. This album sits closer to melodeath, and maybe even death metal, than any of the pathetic post-hardcore bands that are essentially Avril Lavigne songs with a screaming singer, so it's all up to content as to whether the band triumph here.\n\nThere's a small triumph for As I Lay Dying, but no greater reward. They do have a good riffing style that is reasonably intricate, which includes all the standard chuggy parts and beatdowns you would expect from a metalcore band. What annoys me is that this style doesn't have a lot of merit in itself: I don't want to listen to more than a couple of BOOM-BOOM-lick riffs or chug-chug-chug-chug-slightly different lick riffs per album and this album has about that quantity on each song, so I get tired as fuck by the time I'm halfway to the end. There are, however, some melodies that borrow strongly from the In Flames template and they give the songs more fluid rhythms and individual identities. 'The Darkest Nights', for example, uses one such melody almost from start to finish and, although there isn't much progression in ideas, ends up a lot more satisfying than the following 'Empty Hearts', which goes for \"brutal\" mode and sounds insanely repetitive, barring an aggressive thrash/death solo that shows up towards the end. The drumming style ditto, because there isn't anything going on to keep me interested, wherein lies my biggest complaint with metalcore - the rhythms are so, so predictable that I feel the song can't go anywhere unexpected. I assume that the bass player is similarly half-assed, because I don't recall hearing him do anything at all on this album.\n\nNow, let me come back to that thing about the vocals. Many would say that Tim Lambesis is a decent metalcore singer, because he has a sufficiently good scream and rarely uses cleans, thus clearing up a common problem in the genre of only sounding semi-serious about metal. In my opinion, he comes up against an entirely different problem - namely that he isn't very good. There's a reason why Killswitch Engage got to be leaders without their instrumentalists ever doing anything spectacular and that's because they had good vocalists who were the focal point of every song. Howard Jones had a good range of different styles, so could bring emotion to the lyrics, while Jesse Leach always sounds more desperate and alive than your common metalcore vocalist. Lambesis has an almost mechanical delivery that neither pulls at the heartstrings nor makes me raise my fist in salute, but rather makes me wish for a guitar solo sometime soon. His lyrics are often indecipherable and seem unsuited for such an inhuman, roaring style, since they are about faith and struggle. His rhythms are horrible, with a very slow, stressed delivery on many songs that chops up the already chuggy style even more and leaves the album with zero momentum, added to which his cleans are weak, so even the rush of a melodic section loses its appeal.\n\nI'm not even going to bother looking at the songs, because they all sound almost the same - forced and featureless. My technique for listening to this album is to find a riff I like (usually the melodeath parts, but a few metalcore ones) and concentrate on that until a melody or solo gives me something to actually enjoy. Ignore the vocals, ignore the drums, ignore the bass, ignore the generic parts; just focus on about ten minutes of mediocre melodeath. Sounds great, right?\n",
        "\nAfter the monumental and genre defining Shadows Are Security, As I Lay Dying was poised to make the naysayers choke on their own harangues. Sadly, An Ocean Between Us rehashed many of the same stimuli and structures, coming off as a half-baked exercise in pandering to the expected. Although I still miss Evan White's style here, Sgrosso and Hipa have already proven themselves in the past, and thankfully much of it comes together (albeit not in the expected aspects) on The Powerless Rise, during which we see the band accepting an accretion of outside influence on the way to logical evolution and in the end, a memorable final product.\n\nDespite opening in a fairly standard way with \"Beyond Our Suffering,\" snippets of \"Anodyne Sea\" exhibit the proliferation of something greater going on within. Specifically, the song structures have moved away from the near-total emphasis on breakdowns, and out of the other end comes some welcome variance that helps The Powerless Rise mitigate some of its shortcomings. Signs of refreshing adaptation first arrive on \"Without Conclusion,\" during which the band adopts something close to a death/thrash slant, all the while never disposing of the always-memorable melodic element that pinned down their earlier appeal. Frankly, it doesn't even sound like the same band anymore at many junctures, and somehow this avoids being the critical failure one would expect it to be. That's not to say there aren't effective hails back to times past, as \"Parallels\" is an exercise in the searing, spindly leads that made tracks like \"Morning Waits\" standouts on Shadows Are Security.\n\nThe biggest single plus to these ears came during \"Anger and Apathy,\" which espouses everything of the divergent tonality suggested by the title. It opens with and revisits a wholly uncharacteristic and undeniably classic-sounding lead interval that was new, risky ground for the band at the time. The song coherently alternates between this and more standard metalcore posturing punctuated by Gilbert's cleans, and in the end I can candidly find few faults in the approach. To touch on Gilbert, he still fails to reclaim the luster applied during the spectacular \"The Darkest Nights\" (which coincidentally featured a guest vocalist at the time), but he eeks out an acceptable performance. His timbre is somewhat thin and undeniably whiny, but his cleans are used structurally well in the context of the songs, so from this point of view the flow of the record is by no means hindered by their inclusion. Alternatively, we still get down and dirty with quick mosh-igniters like \"Condemned,\" which has plenty of balls and wholly takes advantage of yet another spectacular choice in guitar tone along with all of the other merits on the production end. The pinch harmonics are a nice touch, as well.\n\nThe near-brilliance of the first half of the record is put at risk on the waning end, if only due to a reliance on more of the band's typical fare. The remaining tracks are relatively standard As I Lay Dying numbers, and while this damaged much of An Ocean Between Us, the band gets more mileage out of it here thanks to Lambesis' ability to finally mix up his delivery. Nearly all of the earlier material suffered from a rather monotone performance vocally, but Tim certainly draws from a wider swath here, and it helps some of the weaker cuts like \"The Only Constant Is Change\" scurry out alive. The soloing is also spectacular this time around, perhaps better than it ever was at any other point for these guys. The best single example is on \"The Plague,\" which simply expands the already intimidating arsenal the Californians are working with this time around.\n\nIt can't dethrone Shadows Are Security, although I certainly didn't expect it to. Instead, The Powerless Rise sees the band moving away from their earlier metalcore leanings with just enough force to open the back door to venerable outside influences. This paradigm has felled many bands in the past who originally started with a superior product, but at the end of the day As I Lay Dying delivered the goods here. The appeal is somewhat limited, as expected, but for a subgenre that gets a lot of flak hurled in its direction, this album may just be the one to deflect much of the barrage.\n",
        "\nMay I say that As I Lay Dying may not be a terrible band in and of itself, but this album is far too overrated and definitely not that great. I hesitate to suggest that Tim Lambesis might have been sitting in a corner telling all of his band mates - \"I are going to write good album.\" Big deal Tim, Big deal. This album is in my opinion just a polished metalcore album combined with some fancy riffs. To be wholly honest, this album sounds like a regurgitation of Demon Hunter and some melodic death metal influences added on the side.\n\nThis album starts off with and instrumental, and then the track \"Nothing Left\" which in my opinion is pretty solid, however a distorted guitar and a few catchy chords doesn't really scream \"awesome,\" considering the absolutely terrible lyrics - I find it hard to find out what hell it even means. Oh yes, I am pretty sure lyrics are not THAT important in this case making a catchy song with shit lyrics is important, since it would be deceitful to set forth such an impression if that's all you're doing. If this is the case, I think Tim and his back up vocals should have shut up if they wanted to avoid this.\n\nThe rest of this album is filled with pretty basic melodic metalcore songs, the only problem is it is filled with the same kind of stuff. You have \"An Ocean Between Us,\" which gave the album its name -- unfortunately it was sort of annoying, it was a some riffs and typical -core moments and then choruses, and it repeats itself with \"Is this your salvation?...\" Oh yes, sounds like Demon Hunter regurgitated. What's worse is \"Within Destruction\" which is just \"Nothing Left\" repackaged with new lyrics, yes you heard me. The rest of the album was metalcore shoved up in your noses, with the most annoying persistence. \n\nI must admit however that I enjoyed \"The Sound of Truth,\" which was pretty good. It begins with some decent melodic riffs, and then growling lyrics complemented by clean vocals, climaxing with a guitar solo besides that I think that I think the drumming was good too. It sounds pretty sick. However the entire album was boring, and felt to me as if this band should be renamed \"Demon Hunter 2.0\" or something to that degree.\n\nNot something I'll easily listen to again.\n",
        "\nAs I Lay Dying are probably one of the most widely debated metalcore acts since the genres inception. A band promoting Christianity openly, they formed in 2000, and have released 6 albums, the best of which is unquestionably 2007's An Ocean Between Us. Comprised of 12 tracks and clocking in at 43 minutes, this album contained four singles, and was released to high critical acclaim, with HM Magazine considering it to be \"the best metal album this year\".\n\nThe five members of this band are exceedingly tight on this release, with the star performance going to Nick Hipa, the lead guitarist. Throughout this release, he puts on a strong show, with a particularly good solo on the song The Sound of Truth, the second single off of the album. The dual vocals from Tim Lambesis and Josh Gilbert are very nicely one on here, with the very intense screaming of the former playing off the beautiful harmony that Gilbert creates. Lambesis even takes clean vocals on the songs Nothing Left and This Is Who We Are, and is surprisingly good at them.\n\nThe rhythm guitar work from Phil Sgrosso is very well written, with some fantastic riffing found throughout this album, in particular on the songs Within Destruction and the title track. The former is a thrashy number with great screamed vocals, and the speedy riffing on the title track is the highlight of that song. The bass work is nearly inaudible, but when it can be distinguished, it appears to do its job very well. Jordan Mancino is also a very talented musician, laying down some exceedingly fast, complex patterns, far above the standards that the metalcore genre would indicate.\n\nThe best song on this album, in my opinion, is I Never Wanted. This is far different from the rest of the album, being played at a much slower pace, with some absolutely heart wrenching lyrics that really do create the feeling of an absolute void inside the vocalist's head. The clean vocals and screams are performed simultaneously to begin with, which creates a truly unmatched sound. Of every metalcore song i have ever heard, this is undoubtedly the best i have ever heard, with some great instrumentals found as well.\n\nThe opening two songs, Separation and Nothing Left, truly do their job perfectly. Separation is an instrumental only, with some great guitar work, that creates an atmosphere of longing, and Nothing Left has a fantastic staccato riff, that really kicks the album off properly in superb style. Once again, the lyrics on here are top notch, the drumming is great, and the vocals are fantastic. This is one of the two tracks in which Tim Lambesis takes all of the vocals, and whilst his clean vocals may well not be as powerful as Josh Gilbert's, they still fit the music very well.\n\nThe title track is a fast, aggressive number that features an unrivaled rage throughout the metalcore genre, that goes so well with the flow of this album, and speeds things up some more after the fantastic Nothing Left. The clean chorus absolutely screams regret, and takes the cake as one of the finest moments throughout the album, standing right out among the rest of the song. The drumming is the main focus point on this song, however, being highly technical and well performed by Jordan Mancino.\n\nThe Sound of Truth is home to the best guitar work on the album, with some great riffs topped off by the most amazing solo the band has ever written. The vocals are utterly chaotic, and the drumming is as powerful as the rest of the album. The lyrics are truly amazing, and this is another one of the best things about the album on the whole. The lyrics to this album are really well thought out, and clearly had a lot of effort put into them, conveying a multitude of emotions.\n\nThe production on this album is not the best the music scene has ever shown, but is clean enough for an album like this. The bass could be a little louder, and i feel the rhythm is far too loud in the mix, but other than that, the production is fine. The drums sound absolutely pristine, and there are no really flat moments that detract from the overall package, which is nice to hear from an album by a band of this caliber.\n\nUnfortunately, this album also seems to drag on for too long. The songs Bury Us All and the second instrumental, Departed, seem to break up the flow of the album, with the first one being a typical metalcore song that fails to do anything new, and disappears among the quality that is found throughout this album. Departed merely is a build up to the amazing Wrath Upon Ourselves, but manages to completely kill the buzz carried over from The Sound of Truth.\n\nWhen compared to the past work by this band, and what would come after, i believe this is fighting for the top spot with Frail Worlds Collapse. Both are marvelous slices of metalcore, with great instrumentals. Each album had killer songs, with Frail Worlds Collapse having Forever, which tops everything off of An Ocean Between Us, but much of AOBU is better than what is on Frail Worlds Collapse. In the discography of this band, however, it is a good step forward, as it evolved the drum patterns and lead guitar and lyrics, the three core areas the band needed to step their game up in. For any fan of the metalcore genre, or just anyone wanting a band that is highly proficient with well thought out music, this is a must, but is not perfect.\n",
        "\nMetalcore is a bit of an awkward genre to write reviews for. Even though it is a fantastic style of metal, there are few things that make each band unique from one another (not the fault of the bands it is just a very limited genre). 'Shadows Are Security' however is one of the few metalcore albums that stands high and proud above the rest, along with Caliban's 'The Opposite From Within' and Killswitch Engage's 'The End of Heartache'. Never mind those records though, I will explain to you why THIS album is in the top 3 of metalcore.\n\nKicking things off we have 'Meaning In Tragedy' which sets the mood for the rest of the album. After hearing this with its dual guitar harmonies, furious screams and breakdowns, I had a good idea of what the entire record would sound like, and I was right. It follows into 'Confined' with the same formula, which is an awesome formula that keeps the rest of the album catchy, heavy and sometimes beautifully melodic. Some of the tracks on this record have guitar riffs that are really profound. 'The Darkest Nights' has some axe melodies that are very brutal yet strangely uplifting. There are some extremely heavy moments that even stray away from metal core and into thrash and occasionally death metal (check out the intro to 'Empty Hearts').\n\nThe drums on this release are phenomenal, with endless assaults of double bass and blast-beats. Very rarely does Jordan Mancino stop pummelling the kit and it is his constant fury that keeps us hooked, meaning that we never lose interest during the album. Inevitably there are many breakdowns here, as is tradition for metalcore. These veterans know where to put them though, so after a brutally catchy chorus all instruments come together for a ground-shaking headbanging session. Even if you are on your own you will feel the need to smash inanimate objects and play air guitar (I did). \n\nAnother reason this album stands out are the growls of vocalist Tim Lambesis. After listening to the album once you really notice the anger and emotion in his screams, which is what metalcore should be about - emotion. The production is absolutely flawless, which is very important in metalcore as it amplifies the emotional, heavy and melodic aspects of the album. 'Reflection' is the albums strongest track as it combines every type of song the band have, with heaviness followed by moody, melodic riffs and breakdowns. Epic stuff.\n\n'Shadows Are Security' is something of a holy grail in a world of good but predictable metalcore albums. Every song is excellent and the production quality is about as clear as it gets, resulting in a record that always sounds fresh when you listen to it, and never becomes old. If you feel like you need to let off steam then this is the album for you. Pure pit-worthy anthems. \n\nMake this the next metalcore album you buy folks.\n",
        "\nDo you remember the last time where a band has put out six albums and every single album was better than all the albums before it? I mean, I can think of Death, and... that's it actually. When you think about it, even classic bands by album six have had at least one misstep somewhere along the way. I mean, even Megadeth had “Youthanasia.”\n\nAs I Lay Dying is a band that came into their own amidst the metalcore scene around the turn of the decade. A handful of great songs on their Metal Blade debut (and second album altogether) hinted at promise, and when next disc “Shadows Are Security” came out, the first real example of where the band was headed was already here. When “An Ocean Between Us” came out, it was heralded as a bonafide metalcore classic and truly established the band as a group that had staying power and that was evolving further from it's -core roots and embracing the heaviness. “The Powerless Rise” was a full-on blasting blitz through it's eleven tracks and is easily the band's most “metal” disc. So now the question is where can the band evolve to now?\n\nAnswer: they can slightly devolve and make it sound fresh again! The downright brutal aggression is still here, and so are the thrashy sections that Tim Lambesis has gotten so great at writing and Phil Sgrosso at refining and performing over the years. What came back are the breakdowns, for starters. And we're not talking some weak-willed, deathcore/pseudo-djent breakdowns like the de rigueur as of late...no, we're talking about brick-to-your-face drum and guitar synchronicity, riding that crash cymbal with the sickest groove you can imagine, getting a slow headbang going, and for the listener hoping to god you don't put your fist through a wall before you realize “it's only a song...it's only a song.” Another element adding to this excitement is the band's seeming commitment to utilizing the ever-improving voice of one Josh Gilbert, the band's bassist since 2006. Possibly due to input from new producer Bill Stevenson (producer for Rise Against, ex-drummer for Black Flag and The Descendants) there's far more and far catchier chorus parts on this disc than ever before, and they are friggin' golden. You can't help but sing along with Tim and Josh on tunes like the powerhouse “No Lungs to Breathe” where that awesome call-and-response toughguy vocal phrasing of “With no lungs to breathe – I had almost lost everything!!!” come in and just layers over that sick groove so perfectly. Jordan is still a drummer that is almost inhumanly tight and versatile in all styles metal, and thus provides the perfect counterpoint to the sometime straightforward, all guns blazing riffage being spewed out. Speaking of guitarists, I really have to say that Nick Hipa has become the perfect guitar hero that all metal kids of this era should aspire to be. It's totally the trend these days for some 22-year-old to get up there on a 7-string and rip the same sweep arpeggio 8 times before going to a different sweep arpeggio for another 8 times and call it a solo. Meanwhile, we have Nick...who has so many weapons in his arsenal as a guitarists ranging from the sweeping, the tapping, the spot-on and fluid legato, and even some cool whammy tricks, but all those merely serve a purpose to add flair to MELODIC solos...solos that you can sing along to just as much as those awesome chorus parts.\n\nWhat's next for As I Lay Dying? I'll be over here, on the edge of my seat, patiently waiting. At this point I can be really sure that my mind will continue to be blown.\n",
        "\nI have listened to Awakened 4 or 5 times through and this is a difficult review to write. Not because the album is complex and difficult to explain, no its much worse than that. As I Lay Dying's album Awakened just...isn't that good. As a big fan of this band it is just hard to admit, but there it is. Awakened isn't by any means a bad album but the band made what I would say are a few mistakes in the process of its creation and they stick out like a sore thumb.\n\nOn a review I read of the album on another site someone mentioned how AILD has created the first \"retro metalcore\" album. I think that description is apt, and I also believe that is what takes this from what could be a great album, to just ok. The riffing is a lot more choppy reminiscent of your generic metalcore band. It contains a lot of the stop start guitar parts which sap the riffs of their strength and just makes thing a tad boring. Still the fellas can still shred and Wasted Words is a thrashy tune for the most part. Another track that stands out and being good is A Greater Foundation which has probably the most memorable chorus of the album.\n\nVocally Tim Lambesis even sounds like he kind of phoned it in this time around. His performance on Awakened almost reminds me of the vocalist for another christian metalcore band, Mychildren Mybride. In fact the album holds more than that in common with said band. And you know, Josh Gilbert's clean vocals never really bothered me too much. But on Awakened they annoy the living hell out of me. I'm not sure if he sings more on this album than the previous two or what. But it seems to rub me the wrong way, like how when he sings it just pops out above everything else.\n\nOne of the highlights of the album has to be listening to Jordan Mancino's drumming. It's always a treat to hear him behind the kit. The album seems to even be pretty much driven by the drumming, perhaps a little higher in the mix than the other instruments. Mr. Gilbert's Bass is of course back in the mix, its there but barely discernible. The production is well done at least. Its clear and clean without any noticeable sonic blemishes.\n\nOn Awakened AILD have seemed to of mixed their style on An Ocean Between Us and the Powerless Rise with their older more generic metalcore style. This hurts the album. As soon as I heard the breakdown on Cauterize I knew something strange was up. Like I said before, Awakened is not bad by any means but it is not up to par with the last two albums. There is too much whiny singing, and the riffing at times can be a pain. Musically this album may have more melodies, but it is somehow less memorable overall. If you are a diehard AILD fan you may be on the fence about this album like me, otherwise if you are new to the band just pick up The Powerless Rise or the seminal An Ocean Between Us. Hopefully Awakened is a grower.\n",
        "\nAs I Lay Dying are one of the very few metalcore bands I can actually stomach. They've always had...something that keeps me coming back for more. I don't understand it. This style of overly melodic, formulaic metalcore usually turns me right off. You know, the bands where every song is a half-arsed melodic thrash riff (probably copied from Metallica or Slayer), followed by a clean vocal bridge, repetitive breakdown and a lazy solo (Bullet For My Valentine, i'm looking at you guys). However, AILD have always managed to play this style, without it sounding forced or being annoying/unlistenable.\n\nWhen I heard they had a new single out, I was intrigued. AILD have a habit of releasing their best songs as singles (Parallels, Nothing Left, 94 Hours), so naturally I thought this would be the same, and I was right. This is one of the best songs i've heard all year. This is very much in a similar vein to The Powerless Rise. In your face straight away with a great scream, a very catchy riff and solid drumwork. The clean vocals manage to avoid sounding really wimpy and the chorus itself is every memorable. The breakdown that hits at 2:14 is brief and heavy. This is followed with a very enjoyable solo. This isn't exactly anything new to AILD, but it's always worked so well for them, and i'm highly anticipating a future release.\n\nA great single from a great band. I can't wait to hear some more new stuff. Fans of the band will no doubt love this song. Even if you don't like the band and/or metalcore, you should still check this out, because it is a major step up from their older work.\n\nThe single also has a remix, and like the remixes on the Decas compilation it's not worth anyone's time.\n",
        "\nRarely has a band released a compilation that truly holds its own among their past discography. On the latest As I Lay Dying release Decas, they have done just that. For a Christian metalcore band to have accomplished so much was rare to see back when they first started in 2001. Nowadays, almost every modern Christian metalcore band has to give As I Lay Dying thanks to popularizing the genre and making it more accepted, even among non-Christians.\n\nBasically a heavy breakdown of a song with progressive elements, “Paralyzed” is an awesome track to add to AILD’s awesome repertoire. Definitely a stand out track, it’s full of chunky guitar riffs, metalcore progression, all while adding in an ambient overhanging guitar part that really sets it apart from most tracks. The melodic chorus fits the overall song structure perfectly, though it’s filled with the very familiar AILD song writing we’ve all come to know and love.\n\nFirst we have the aggressive but mostly melodic song, now we head into a fast and furious song with a slowed down yet extremely heavy bridge. It’s a pretty awesome stand out track in their catalog, especially for its haunting guitar riff at the 1:15 mark. It’s also structured differently than most of their songs, with no set chorus line. Definitely should be included in their live set from this moment on as it has the potential to really get the crowd moving. Also recommended as a show opener.\n\nIt’s a little off-putting to see a Christian metalcore band covering a Satanic thrash band. Case in point, AILD covering “War Ensemble” by Slayer. Regardless, this cover is done very well. It sounds much cleaner and more refined than the original, yet it keeps together all of the elements that made the original a classic. It stays true, with the rapid barrage of riffs, intense drumming, and even the awesome solo, Slayer would be proud.\n\nThrowing in not one, but two Judas Priest covers (“Hellion” and “Electric Eye”) helps keep the band close to their ties. They also keep these faithfully close to the originals, going as far as switching up the clean singing style to match Rob Halford’s. You rarely ever see a band that’s been around as long as AILD to go back and re-visit their debut album, yet they do so with a re-recorded version of “Beneath The Encasing Of Ashes.” Obviously for those who have heard the original, this version is much better.\n\nEDM prodigy Big Chocolate has lent his talents for a remix of the classic AILD track “Elegy.” He keeps it dubstep with a slight mix of drum and bass that retains the energy that was present in the original track and makes it more upbeat similar to the style seen on the Hilion EP, specifically the track “Praise 2011” in terms of the dirty electro sounds that are used.\n\nDefinitely one of the best compilations ever released by a band that sums up their incredible history in the music scene instead of just recording a few brand new songs and releasing them in a greatest hits package like 99% of bands like to do.\n",
        "\nOstensibly speaking, As I Lay Dying holds the unique distinction of being one of the few Christian-themed metalcore bands to receive something close to acceptance in metal culture. This can mainly be attributed to the consistency and quality of their second large-scale release, Shadows are Security. Frail Words Collapse, however, bridges the gap between anonymity and fame with decidedly mixed results.\n\nAt first blush, even amateur ears will notice that this album suffers from poor production. The final product boasts a remarkably thin and bass-deprived core, with the drum kit's cymbals and offensively tinny bass drum triggers taking center stage. The leads are audible, but the rhythm section gets drowned out in what can only be called a mess of a mixing job. Tim Lambesis' vocals have always been one dimensioned, following the same tired rhythm with his screams and offering little to accent certain parts of songs. His presence throughout the album never wavers, except when cleans are introduced. Sadly this doesn't come often enough to make much of an impact.\n\nThe early line-up of the band featured guitarist Evan White, who was a main cog in the band's early work. His guitar leads helped form the signature sound the band used for many years to come. Songs such as 94 Hours and Falling Upon Deaf Ears are real highlights. Most songs, however, fall short; often opening with strong, catchy lead sections but reverting back to Lambesis' wailing as the songs lose steam and simply sputter out of existence. Forever is perhaps the album's best track, as it breaks the mold and evolves into an emotive mini-ballad that sticks with you unlike the other songs on display here.\n\nJordan Mancino is an affable drummer, and despite the production shortcomings displays impressive speed and dexterity. This, however, isn't enough to save Frail Words Collapse from mediocrity when viewing it in a larger scope. Still, as a representative of their sub-genre in the early 2000s, you can't get much better than As I Lay Dying.\n",
        "\nWhen most people think of As I Lay Dying what do they think of? A bunch of emos probably, as if appearance ever effected the music. Believe it or not there was a time when the band was actually death metal. Metalcore seemed like the last place the band would even bother going. Well, that's this album here. \n\nI'm going to point out the production quality first, it may not be the best recording quality out there but it's actually really good for a debut. There's some clarity, it's not absolute but it's still fairly clear. It seems the band set it up as the vocals in front, the guitar barely behind the vocals, the drums behind them, and no bass sound at all except in the song \"A Long March\" when you can hear shoved all the way to the back. The guitars do the one-guitar in each ear so you get the lead in one and the rythym in the other.\n\nThe riffs are well constructed on this album. Some of the riffs seem sort of close at times but it really isn't enough to be bothered with. The riffs do seem strange for a death metal album but no one ever said there's a specific way to playing death metal guitar riffs. They are modern sounding so those who hate new and change shouldn't bother because the date of release would scare them off, if the band name didn't already, in close-minded horror. There seems to be no soloing on this album but there have been songs that are still good without solos. This album is full of them. The leads add a nice touch to the rythym when it strays from the rythym. They seemed to know what they were doing to make a lasting impression on listeners.\n\nThe drums do add a nice touch to the album as well but the song \"Surrounded\" confuses me. In \"Surrounded\" it sounds like a drum machine was used in that song, but it opens the next song \"Refined By Your Embrace\", in which it sounds like the song didn't really change, and the drums go back to sounding human. It's the only confusing part about the album because the drums are still well executed regardless of \"Surrounded\".\n\nThe vocals are truly something different for the band. I say this because they now use semi-typical, generic metalcore vocals. The vocals make use of death metal techniques that sets this apart from the album released in the past year. It's actually death metal. They may be a little gravelly but it's still death growls. There's very limited instances where clean, more of talking or whispered speaking, vocals are used. They aren't used directly after a verse of distorted vocals to lame sounding clean. In the final track, \"Behind Me Lies Another Fallen Soldier\", they switch between the distorted vocals to spoken lyrics but it was used well and it wasn't lame like other metalcore bands dare I name a few, or many.\n\nThis provides a well thought out atmosphere where the music gets you to feel something while the vocals contrast it. It's not just mindless playing or chugging. They try to make you feel something which is rare since you don't see many releases like this one. Effort was put into these songs, it really shows too.\n\nEnjoying this album isn't hard to do. It's a short album filled with twelve short songs. The atmosphere is good. Instrumentation is unique and unlike what you'd in later AILD releases. The vocals and instruments share the same value. AILD did good on this album. Too bad it's been pushed into a realm of irrelevancy and finding it would take some digging. Something not many people seem to do. Trying to get AILD to play something like this live would be like trying to get a man to survive on the sun, it wouldn't happen. So I recommend you listen to this album, ignore what you think of the band for half an hour, and enjoy.\n",
        "\nAs a record goes, this one feels to have been produced to be more along the lines of an EP, with nothing left and the sound of truth playing the part of the start and end of a story.\nWhilst the album sounds much like an EP, it also possesses some very much commercially oriented tracks, again, nothing left and the sound of truth, both in rhythm and lyrically, with a very much *emo* chorus to both, but this is more than made up in part thanks to the instrumental beginnings to both; technical, and a delight to listen to. If anything, these 2 tracks make the whole album gain a few marks from me, where as the third third (other release) off this album takes a much less aggressive stance, with an almost acoustic feel to it.\n\nThe rest of songs off this album aren't exactly noteworthy, but they're not poor either, very few memorable riffs to talk of, largely because they feel to have been used as an accompaniment to the vocals, laid down thick and fast by Tim, with a few lighter choruses thrown in for good measure, much like pretty much every other metalcore act going at the moment, so they're not breaking the mold or anything.\nThe guitarists are clearly very skilled, albeit, appear to be wasted producing this album, largely through to the vocalist taking centre stage, as opposed to the other way around on other bands' releases as of late; this being said, what's being played is very respectable, with regards to complexity and ensuring the album's listened to from start to finish.\n\nWere this album untitled, you could be mistaken for imagining it to have been released from a metalcore giant, Trivium, as it shares both the same form of vocals, and drumming throughout the more melodic songs off Ascendancy being comparable to some of the other songs off this album. That being said, this album feels to have been given more consideration, and would therefore need to become mainstay in any metalcore listeners' CD bank, as this would be a difficult album to top, both for AILD, or any other metalcore act to follow, for that matter.\n",
        "\nIf you do not like metalcore, you will not like this album. You can stop reading this review now and go pick up some Last Days of Humanity or Burzum or whatever it is you listen to. I'm totally fine with that and I'm sure As I Lay Dying is as well.\n\nThis is going to be a very, very long review. You can either read through all of it or skip down to the very end for a very brief overview.\n\nThe bulk of my rating decision will deal with individual songs and lyrical themes. The first part, which is directly below, goes over the musical aspects in general. The rating for the first part is 14 out of 20 points.\n\nAs I Lay Dying has always been a controversial band. Many people consider them true metal. Many of those people who consider them true metal also listen to revolting things like modern Underoath, A Day To Remember, Miss May I, and the rest of the scene bands. I will agree with you \"true\" metal fans in your opinion that modern Underoath and all of the bands like them do not deserve any part of the metal title, even if they are metalcore. However, As I Lay Dying is a different story. If you can't see the metal in As I Lay Dying, then you don't understand much more than the most extreme metal out there. I will do my best to describe my opinion.\n\nTim Lambesis is one of my favorites when it comes to the vocal department. A lot of the reviews I've read say that he sounds whiny. I don't understand how anybody could think that. Screamo is whiny. Tim is not. Tim's lyrics are intelligent and powerful, offering a faithful perspective instead of bashing other people. If being uplifting is whiny, then my definition of whiny needs to be updated. Tim's range has also been steadily improving ever since Frail Words Collapse, which is when I started listening to the band. I recently saw the band live and Tim's highs were so much better than they are on the album. He is a very powerful vocalist and by no means whiny. This album has his best As I Lay Dying vocal work and I prefer it even over his increased range in Austrian Death Machine's \"Double Brutal.\" This gives the album 5 points towards the rating.\n\nJordan Mancino has always been one of my favorite drummers. Ever since the speed I heard in 94 Hours, I've been hooked. I know he's not the best drummer out there. I know he's not the most technical drummer out there. However, he is consistently powerful and has been improving on each record. This music doesn't require 300 BPM blastbeats. Jordan plays perfectly for As I Lay Dying. To all of you who say he is offbeat or doesn't synchronize with the band right, I've never heard that. I own Frail Words Collapse, Shadows Are Security, An Ocean Between Us, and The Powerless Rise. His drumming has always impressed me. I've seen the band once live. He sounded fine. This album is also where Jordan shines the most. This gives the album 5 points towards the rating.\n\nThe guitar parts are fine. This album is much thrashier than the previous album and much, much thrashier than everything before that. I'm not a fan of thrash metal at all besides Megadeth, but this album works. The guitar parts are nice and melodic, though not technically demanding. They give off a nice sense of beauty while still being heavy. One thing new is the increased amount of guitar solos. Several of them feature quite a bit of shredding. Since I'm not a guitarist, I have no complaints. This also covers the bass guitar. I'll give this part 3 points towards the rating because aside from the solos, nothing is really all that memorable. Nothing is bad, though.\n\nMy only complaint in the musical department is the clean vocals. I can barely listen to them in this album. The cleans were so much better in Shadows Are Security. When people say As I Lay Dying is whiny, they usually are referring to Tim Lambesis. I hope they realize that Tim is just the harsh vocalist, because the only whiny aspect of any As I Lay Dying album is the clean vocals. They were great on Shadows Are Security and were okay on An Ocean Between Us, but if they continue to be the way they are now, then that will knock a few points off of any future releases. The cleans are even worse live, but As I Lay Dying is still worth seeing. This part really bothers me and the band takes a hit here, taking a single point in this section. There are some places where the cleans are not annoying, giving it just a little bit of redemption in this category.\n\nThe next section is about the songs. This section gets 20 out of 30 points for having good, successfully written music despite its unoriginality, some annoying clean vocal parts, some unmemorable songs, and a bad conclusion. Everything else makes up for it, though.\n\nThe songs on the album follow a very predictable pattern. After the first three songs, you can pretty much predict when you'll hear a heavy song and when you'll hear a melodic song. All of the songs on the album have elements of both, though. Several of the songs also follow a very similar structure. While Intro-Heavy Verse-Melodic Chorus-Heavy Verse-Melodic Chorus-Solo-Melodic Chorus-Melodic Chorus might get annoying after a while, these guys pull it off pretty well. It works. It isn't groundbreaking, so don't expect it to be. The strength of this album isn't in its technicality. It is in its spirit and passion.\n\nThere are several very nice solos throughout the album, ranging from shredfests to melodic solos with a lot more feeling. This is a very welcome addition to As I Lay Dying's arsenal. It adds a new layer to the mix, though the solos aren't nearly as long or complex as classic metal or power metal solos. Then again, they don't need to be. The shredding solos are nice, but my favorite one is the melodic one in Parallels.\n\nThe album does drag at some points if you try to pick apart each and every single aspect of the record. If you don't try to pick apart each and every guitar riff, it'll flow fine. Just listen to the music and it shouldn't really bother you.\n\nAnother interesting addition is an extra vocal line in some of the choruses, functioning almost as a choir. I assume the clean vocalist recorded an extra track of him singing \"aahs\" for whatever chords were being played. It gives those sections a pseudo-keyboard feel, which, while odd for this band, worked surprisingly well. Then again, I love having massive amounts of keyboards in most of the music I listen to, so this could be one of my biggest biases. I would love for As I Lay Dying to put some simple atomspheric string parts in some of their songs.\n\nThe lack of deathcore breakdowns in this album is also a huge plus. There are breakdowns throughout the album, as with the rest of As I Lay Dying's discography, but they aren't nearly as annoying as the standard chugging you hear with bands like Suicide Silence. While As I Lay Dying's breakdowns aren't incredibly technical, they are done tastefully. They aren't thrown in to give off a false sense of brutality. Those brutal breakdowns are only decent at live shows. As I Lay Dying's music is great in the album and at live shows.\n\nFor the songs themselves, my highlights are Anodyne Sea, Without Conclusion (which does sound like Within Destruction pt. 2 [AOBU]), Parallels, The Plague, and Upside Down Kingdom.\n\nThe last section of this review is for the most important part of this album. If you hate the uplifting messages of true Christianity, you shouldn't listen to this album. If that doesn't bother you, then you can apply the lyrics to a secular lifestyle as well. Tim doesn't write from a holier than though priest standpoint. He writes lyrics as a man who struggles through the same things that everybody else struggles with. Look at it that way and you might gain more respect for the album. That being said, the lyrics make or break this album. If you are not a Christian and think Christianity is a garbage religion that teaches false doctrines, then leave my rating at 34. \n\nThe album is said to revolve around a central theme in their song, \"Upside Down Kingdom.\" This theme is that the current world is in a broken system and there is something better out there. Letting go of the broken system can help people find true freedom, true happiness, and true peace. Honestly, this is one of the most purely metal themes I've ever heard of. This is a theme that casts aside popular culture, casts aside broken and corrupt systems, and tries to find something new and something better that most people look away from. In a secular sense, this is the philosophy of heavy metal. In a Christian sense, which is what Tim wrote from, this is Heaven.\n\nThe first song attempts to cast aside the \"every man for himself\" attitude that seems to plague much of modern society. The message of the song is that helping other people out can also solve personal problems, leading to a greater healing effect. It's a very simple song, but the message is powerful. \"It seems our problems solve themselves when we look beyond us to those truly in Hell.\"\n\nThe second song speaks about being different and being an individual. Rather than be comfortable in life, we should try to do something greater. We all will fade away with the dead before us, anyway. We should our lives count with what we have been given. The message of this song is that people need to step out of their comfort zones to be the change that they want to see.\n\nThe third song talks about people who are searching for more in the wrong places, looking past the beginning of their path that could lead them to finding the conclusion they are trying to discover. This song is one of the ones I understand the least, so if there is another meaning, forgive me. The same goes for each of these songs.\n\nThe fourth song brings up an interesting contradiction with the line \"overfed and undernourished.\" When I hear this line, I automatically think of people who continue to look for more and more material wealth, only to feel more and more empty with each new thing. This is a very Christian view, so if you don't share it, then skip the lyrics here. Us Christians believe that material wealth is worthless.\n\nThe fifth song continues off of the theme of the fourth song by talking about people looking to false leaders of any type for salvation and redemption only to recieve a spiritual plague in return. Whether or not you take this as retaliation against corrupt religious systems, politics, or anything else is up to you. I think Tim leaves these songs open on purpose so that people can incorporate them in their lives in their own ways.\n\nAnger and Apathy talks about helping out others in a different way than Beyond Our Suffering. It is most likely referring to Orphans and homeless people. Many of them sit by every day and recieve no help when there are plenty of people with the ability to help out. Of course, many homeless people begging on the side of the road are just too lazy to get a job and aren't homeless at all, but that doesn't mean they should be turned down. I think Tim is trying to say that helping people out, no matter what they do with the help, builds a better future.\n\nCondemned continues off of Anger and Apathy's theme.\n\nUpside Down Kingdom is the next song, but I already talked about that.\n\nVacancy is a song that talks about letting go of all the things we enslave ourselves with and starting again. We enslave and snare ourselves with empty things that create more emptiness, hence the title. The more and more stuff we focus our efforts on, the more vacant we become.\n\nThe Only Constant Is Change is another hard one to define. I think it is used to show people who live in their comfort that comfort is always changing and that there really is nothing in this earth that is constant. I don't think there's much of anything presented in here besides that statement. I think that Tim used those lyrics to try to help people see that their miserable comfort zones won't last and that they have to keep moving. I think Tim is telling us to keep living our lives. Comfort zones create anodyne seas of sorts. Anodyne is a painkiller. In this album, anodyne refers to numbness.\n\nThe last song, The Blinding of False Light, offers a solution to all of the previous problems stated. This solution is in the line, \"in our weakness we are freed.\" This can refer back to the Bible verse that states \"the meek shall inherit the earth.\" This album is trying to teach humility.\n\nAn interesting thing I found out after researching the lyrics is that the album follows a very similar pattern to the way most songs are set up. Most songs present a problem, have a radical, contradictory, or powerful statement that defines the overall theme of the song, and then end with a solution of sorts. Tracks 1 through 7 show several problems. Track 8, Upside Down Kingdom, shows the overall theme. Tracks 9-11 present a solution. I found this to be a very brilliant way of setting up the album. It almost feels like a concept album based on the problems of a broken system. That's why this album gets 50 out of 50 points for this section and why it is such a good album.\n\nMy personal rating for this album is somewhere around 90 to 92%, though that's because of my Christian bias and because of how much respect I have for Tim. I tried to review this the best I could to find its weak points. It doesn't have many musical strengths, but it also doesn't really have any weaknesses. After doing some serious reviewing, I barely was able to knock off any points. That means that this album, if you like the style and lyrical themes, is truly a keeper. While the music itself isn't amazing, it is still very good. It isn't brilliantly technical, but it doesn't need to be. It doesn't need to be Fleshgod Apocalypse meets Origin or Stormlord meets Summoning or Mors Principium Est meets Scar Symmetry. It simply needs to be As I Lay Dying. The lyrics are incredible, powerful, poetic, and deep. The album's theme is also incredibly deep. The album's true strength lives in its deep theme. Everything else is just icing on an already awesome cake. I don't know many people who don't like cake. Take a slice, let it sit for a while, and come back. This album requires a lot of listening to for it to really grow on you, but once it does, you won't be sorry.\n",
        "\nAfter the exceptional An Ocean Between Us As I Lay Dying are back with The Powerless Rise. Automatically you can tell the band has gotten a little heavier musically and vocally. Or maybe they haven't even gotten heavier musically, perhaps just more consistent in their heaviness.\n\nGilbert’s vocals remain as they did on AOBU, not whiny but not terribly gruff either. He finds a medium and sticks with it which does the album ok. I think it would offend far less of the “true” metal heads if he took a more aggressive stance vocally. Tim’s vocals are more extreme than the last album. His highs are better I would say and his lows used much more while going into death metal territory.\n\nJordan Mancino is excellent on drums. I especially like how he throws blast beats into tracks pretty liberally. They are scattered throughout the album on songs like Without Conclusion, The Plague, and Condemned. He has become one of my favorite drummers in modern metal.\n\nThe riffs are all around great. My favorites would have to be the one that starts Condemned, Upside Down Kingdom (especially during the chorus) and The Only Constant Is Change which has the most epic chorus on the album. But The Only Constant Is Change is also full of good riffs in its entirety. In fact if I had to describe the riffs on this album in one word it would be emotion, they all contain lots of it.\n\nLets talk about the solos! There are some nice smaller solos like in Beyond Our Suffering and Without Conclusion. Even though its not my favorite song, Parallels has the best solo on the album and in that way its sort of like The Sound of Truth from AOBU.\n\nAnd hey the bass can actually be heard! He (Gilbert) even has some nice bass fills and lines. Just check out the start of Upside Down Kingdom or the start of Condemned where its very audible. His bass also is a little more easily heard this release which is sweet. \n\nWhen all is said and done this album sets a new bar by which the band and others in melodic metalcore will be compared and criticized. The production is just downright perfect, the instruments are played with serious talent, the vocals are heavy and it all is combined to create one great album.\n",
        "\nYou know the common gripes that metalheads have about metalcore? Too many breakdowns, the whiny clean vocals, the pop song structures and the shameless repetitive Gothenburg worship? Well, the main strength of this album is it largely avoids these pitfalls and creates a solid listening experience.\n\nProduction wise, it's squeaky clean as you would expect from any metalcore act this mainstream. As usual, bass is nowhere to be found. The only thing really out the ordinary is the amount of delay present on the drums, it's enough that you can still hear a bit of each drum hit by the time another comes up.\n\nStructurally you either have a standard verse chorus format or a more melodeath influenced song setup where a handful of riffs largely are the driving force of the song. Guitar work consists of one guitar playing disjointed, stop-start melodic death type riffs consisting of single notes on the high end of the scale, occasionally developing a minor variation on the riff but usually opting for hammering one riff into your head. The rhythm guitar usually plays breakdown-esque chugs. Sometimes both guitars abandon this format and instead fully utilize their potential to create dueling harmonies such as in 'Meaning in Tragedy' and the simultaneous tremolo lick around the one minute mark in 'Morning Waits'. Unfortunately, soloing is largely forgone on this album, a short solo popping up in 'Empty Hearts' and 'Truth of My perception';sadly the solo work is mostly aimless wandering around the scale without too much direction. The strongest moments of the album are where the band steps out of the confines of the metalcore genre and experiment a bit, like the tech death like riff in 'Truth of My perception' and the brooding tremolo intro in 'Reflections'.\n\nIt wouldn't be a metalcore album without those dreaded core elements, but for the most part they actually help the album rather than hurting it, as I don't believe the album can stand up purely on it's metal elements alone. The guitar work is too limited and repetitive, with a sense of disconnect and a lack of groove (or catchiness) resulting from the fragmented riffing. The drum work is also fairly basic, without a lot of interesting fills coming from the fact that the drums usually follow the rhythm guitars. \n\nFortunately, the (post) hardcore elements prop up the weaker metal portion of the sound. The lyrics are either generic Christian themed prose or your stock emo lyrics, but the vocalist manages to deliver his growling with enough conviction and anger that it doesn't hurt the album. The choruses in some songs using clean vocals are keep the riffs from getting stale, as do the breakdowns, which are used sparsely enough and built up to properly so they have their intended intense crescendo effect rather than being a chore to listen to. The hardcore elements also bring in a bit of variation in melody, such as the mathcore like riffs in 'illusions' and the melodic climax in 'Repeating Yesterday'. A slight problem is results from the stupidity of the lyrics in that song when a robotic Stephen Hawkings like voice repeats what sounds like bad emo poetry. Similarly in the opener 'Confined' the whiny chorus is somewhat cringe inducing with the lyrics 'How quickly I forget that this is meaningless'. As I said before though, the cliche metalcore elements don't show up too often and ultimately thats what makes this a rare specimen: a good metalcore album.\n",
        "\n......I realize I have to change (albeit slightly) my rating of this album. After more spins, this recent AILD offering has grown on me. And suddenly I found myself enjoying it a bit more. Furthermore, I shall erase much of my former's review unnecessary long (and possibly boring) introduction.\n\nI had high hopes for this one, since I really enjoyed their last album, An Ocean Between Us, a metalcore masterpiece in my opinion. And to be honest, The Powerless Rise is kind of a let-down, but not entirely. Not because it’s worse than its predecessor, but because it adds nothing new to As I Lay Dying’s musical offering. The usual photoshoped skull on the cover is the first sign that things haven't changed much. The songs are on the same level as AOBU, in the sense of ass-kickery, but they’re less varied. Here you won’t find an equivalent to the melancholic introduction and the short but emotive guitar-tapping instrumental “Departed” on said album. Nor another calmed song in the vein of “I Never Wanted”. It’s all metalcore pummeling. However, it's a pretty balanced album, discarding experimentation for an even level of quality. For there are no weak tracks here. Perhaps, only the opener is a bit weaker than the rest. I wonder why they choose \"Beyond Our Suffering\" to start the album.\n\nAll the signature AILD elements are here. The thrashy riffs, and excellent pounding drums of Jordan Mancino, one of the best in the metalcore realm, cool melodeath-like melodies and the acquired taste screamed vocals of Tim Lambesis (which I do enjoy), along with bassist Josh Gilbert’s clean ones. So after three years, I had hopes for them to experiment a bit more and explore the new elements used on An Ocean Between Us, which was a great improvement from Shadows Are Security. They didn't, but instead brought us a nice collection of modern american metalcore. From the fast-riffing, old-school thrash worship of \"Without Conclusion\" to the mellower but still lead-heavy \"Upside Down Kingdom\" it's AILD sharp and refined material. \"Anger and Apathy\" is the perfect description of itself, conjuring metalcore angst with a slow and melancholic pace driven by the crashing of Mancino's plates.\n\nThe lyrics haven’t changed much, but I have to give Lambesis well deserved credit, since here he’s being a bit more mature and varied. I particularly enjoyed the lyrics about alienation and contradictions in “Parallels”, one of the strongest tracks here, if not the best. But the usual topics are exploited here: unity, inner stength and determination versus resignation and herd-like mind stupidity and conformism.\n\nI also have to add that the production is of slightly less quality than its predecessor. It's just a tiny bit less crisp. Is not bad by any means, and it’s a strange thing to say actually, since Adam D. of KsE produced both. Perhaps is the fault of the helping hand of Daniel Castelman, but that’s just a thought, it might be unfair to point a finger not knowing for sure. Anyway, I find the production of TPR a bit muddy in parts. \n\nNonetheless, this is a pretty good album. Long gone are the days of blunt and mediocre metalcore with more \"core\" than \"metal\" for this band. They've perfected their sound and are pretty confident in it. If you enjoyed the bands last two records (which are the ones I listen to) you’ll surely love this one. Highlights include neck-breaking \"Without Conclusion\", “Anodyne Sea”, the excellent “Parallels”, and “The Only Constant is Change”. The other songs don't stray far in terms of quality. emotion and brutality.\n",
        "\nI’m going to be honest here, although As I Lay Dying is my favourite band, I really wasn’t a fan of their previous album (Shadows Are Security). It just seemed as if they hadn’t put much thought into what they were writing and produced a generic metalcore album that would shut the fans up for a time. I didn’t buy this. The main problem I had with it is that most of the songs just sounded the same! There were only three notable tracks (The Darkest Nights, Reflection and Through Struggle) and although they’re truly great tracks, there weren’t enough to really bring it above a 4/10 mark. So when they announced their new album I was hoping that they were going to be able to pull the rabbit out of the hat, as it were, and unleash the beast that As I Lay Dying can be. With An Ocean Between Us they certainly have...and some!\n\nWhen you first start up the album you are first introduced to an intro track (Separation), which is something As I Lay Dying haven’t ever done before. It’s a nice little tune to get you into the mood for listening to music. But once this track is over, you’d better fasten your seatbelt, because it’s about to get rocky!\n\nStraight after this almost peaceful intro, you are thrown straight into the deep end with the simply savage ‘Nothing Left’. This is truly a stunning track, and in my opinion the best track of the album! It’s just that raw, savage energy that’s given off by the powerful main guitar riff, which makes you want to bang your head like nothing before. It’s not only just the amount of energy that this track creates; it’s how God damn catchy it is! With the combination of the savage guitars and clean vocals and to this song, which you are certainly going to hear yourself chanting as you go through your day, makes for a stunning song! This one song sets out the layout for a good part of the album (tracks 2-6). In all these songs As I Lay Dying has used the effects of savage guitars or incredibly catchy clean vocals to their advantage. These effects are displayed prominently in the song ‘Forsaken’. The vicious guitaring, which is enough to make anybody turn in their grave accompanied with catchy clean vocals and you have yourself quite a song!\n\nHowever, in these songs there is something that I never expected to hear on an As I Lay Dying album. Thrash. Yes you heard it right, Thrash. The track ‘Within Destruction’ shows a real different side to As I Lay Dying, which proves that they aren’t just trapped to one style of music. They can expand and adapt to what they want. It’s not Slayer or anything, but it shows the stronger more aggressive side to As I Lay Dying. I personally (being a big fan of Thrash), welcome this change. This will draw in more fans from a wider audience, which can only be a good thing.\n\nAlthough As I Lay Dying have changed a fair amount as song writers so far with this album, however, the apple never falls far from the tree and we are reminded of this with the song ‘I Never Wanted’. This is a tradition spanning back from Frail Words Collapse. In about the middle of the album, there is a much slower song compared with the others on the album. In the last album though, I really felt that it wasn’t needed, it really broke the flow of the album and suffered because of it. However in this album the song has had a lot more thought pit to it and it doesn’t just sound like a breakdown with some vocals added for fun. The song is well structured, has good chanting style vocals and in my opinion it’s a crucial part of the album, because it gives you a break from madness of the previous songs. \n\nAfter the calm break that was ‘I Never Wanted’ you are presented with the heaviest song on the album ‘Bury Us All’. More often than not As I Lay Dying’s lyrics are about relationships and inner struggles, however ‘Bury Us All’ is an exception to the rule with brutal lyrics such as ‘leading us into an unmarked grave’ (this style of song is also repeated in ‘Wrath Upon Ourselves’). Again this is something that As I Lay Dying has never done before. As the song is so heavy (for As I Lay Dying) it seems only fitting that the lyrics would be changed accordingly and As I Lay Dying have managed to pull it off very well.\n\nThe next notable track of the album is ‘The Sound Of Truth’, which in my opinion is the second best track of the album. The song is structured in a similar way to some of the early songs on the album (i.e. ‘Forsaken’), but this time it’s more technical and with a solo that seems to be from the heavens!\n\nAs the album starts to draw to a close, you are introduced to the song ‘Departed’. This song is similar to ‘Separation’ but this time it’s just less than 2 minutes of pure guitar solo and it’s heaven. Finally as the album actually does draw to an end, As I Lay Dying presents you with ‘This Is Who We Are’. A more Thrashy song which is similar in ways to ‘Within Destruction’ however, this time it has a clean vocal chorus. ‘This Is Who We Are’ also features an unusual piano ending. Although it’s something never heard on an As I Lay Dying album, it’s a nice tune which lets you reflect on the album as whole.\n\nIn conclusion, An Ocean Between Us is a stunning, fantastic, amazing album, there are simply no flaws in it (in my opinion). From the savage riff of ‘Nothing Left’, to the clean vocals of ‘The Sound Of Truth’ it’s just non-stop brilliance!\n",
        "\nThe metalcore scene, with its melodic death and groove metal inspirations married with the horrid concept of screamo/emo dual vocals, was one that became stale all too quickly. Even those who brought the genre into the mainstream, bands like Killswitch Engage and to some extent Hatebreed, eventually become tired and uninspired. This also introduces waves after waves of mindless clones, most of whom can't help but fall as soon as they rose. Interestingly enough, one band who I thought I'd never really care much for, As I Lay Dying, breaks the mold a little bit. Don't expect anything mind blowingly awesome here, for we are still firmly planted in the world of metalcore.\n\n\"An Ocean Between Us,\" which isn't exactly a title you'd expect on a metal album as the title itself hints at the emo scene (and sounds like the typical nonsense emo band name) manages to score a position above most carbon copy bands of the 21st Century. Yet As I Lay Dying apparently knew that metalcore was fast dying and went about throwing some additional influences and styles into the mix. Unlike the now out of control deathcore craze, meshing these influences together was done with cohesion, instead of technically impressive gibberish with no form of structure. I applaud As I Lay Dying for this, and perhaps I judged them a little too quickly. \n\nAfter a pretty pointless intro, we get into the first proper song in \"Nothing Left.\" While I had expectations of something \"different\" from your standard metalcore (as was promised by frontman Tim Lambesis) \"Nothing Left\" is basically standard metalcore. It manages not to dive into vapid tedium like most of the genre, but its metalcore nonetheless with its hardcore inspired riff and the usual barking vocal style. The title track breaks away from this some, giving the listener some emo-inspired vocals. Believe it or not, I did not have to puncture my ear drums over the emo vocals here. The chorus vocals (where the emo influences come out) have been pushed back and the guitars brought forward, where they should have be with any metal band. \"Forsaken\" also dives into emo-land, a little more so than the title track and while undoubtedly catchy and sure to be a fan favorite, that song is just too sappy for my tastes.\n\nNow the real exciting part of this album comes with \"Within Destruction.\" Now, As I Lay Dying are not a thrash band, nor is \"An Ocean Between Us\" a thrash album. However, \"Within Destruction\" shows some thrash influence popping up, albeit with some odd breakdowns thrown in. Still, it manages to catch the listener's ear, and is a welcome change from the usual breakdown infested boredom that accompanies most metalcore bands. \"The Sound of Truth\" also throws in some good moments, though nothing really compares to the effort put into \"Within Destruction,\" probably the best song here.\n\nAs with most bands of this caliber, you can expect a good number of these songs to run together. Once we drop past \"Forsaken,\" things get too same sounding which then runs into tedium which then runs into an album of forgettable stuff. None of these songs were utterly revolting, which is more than I can say for the majority of metalcore albums I've heard out of the U.S. and beyond. \"An Ocean Between Us\" is a decent listen for the most part, even for me, someone who usually avoids metalcore like the plague. I still wouldn't advise fans check into this simply based on the thrash influences of \"Within Destruction,\" because those looking for more thrash than \"core\" will be sorely disappointed. Its still metalcore as we all know it, even if Tim Lambesis is manlier than most of the emasculated whiners in the genre today, emitting some halfway acceptable hardcore inspired barks. \n\n\"An Ocean Between Us\" does offer some good moments and as far as I'm concerned probably the best the genre has to offer in terms of mainstream output. Fans of metalcore will definitely find something to like here, though others who generally wouldn't look this album's way might want to consider seeking it out in the discount area. The steep $14 price tag I've seen slapped on this baby at most retailers is just too much for the average metal to shell out given the quality material they're given.\n",
        "\nThis album is the best effort by As I Lay Dying, but it still lacks any overall sense of being a good album. The guitar work on this album is much better than their previous albums, The Sound of Truth even has a pretty good guitar solo. The drums sound considerably better on this release, meaning they don't sound like someone is beating one of those little bongos you find for sale at tourist shops. As for Tim Lambesis...not much improvement on the vocals. \n\nOne big improvement on this album is speed. There are some songs that actually have a considerably fast tempo to them, such as Comfort Betrays and Within Destruction. Meanwhile there are less songs on this album that have that continuous droning of the downtuned guitars. Yet they are still present and become overly monotonous. \n\nAlong with the sound of the drums improving, they are actually in sync with the music most of the time. There is better bass playing by the drummer as well, alternating his patterns of kicks rather than continuous double bass followed by a couple of regular kicks before he dives into his continuous bass again. \n\nAs for the vocalist I don't know who beat the shit out of him as a child but he may be the most whiny vocalist in metalcore. The extent of his vocals ranges from deep screams hardly distinguishable from the next shitty metalcore band, to his whiny fucking \"melodic\" sounding sections. His screams are very monotone and boring, hardly even a scream. Still just as bad as every other album by this band. \n\nThe only standout song on this album is The Sound of Truth. The lead riff is actually mildly catchy, and the drumming is decent on this song. The most standout part of this song is the guitar solos, which are actually respectable, and make the lead riff better when it comes in after them. Other than The Sound of Truth this album is just another weak semi-metalcore album that is a little better than the bands previous releases.\n",
        "\nAh, yes, the infamous \"As I Lay Crying\". I came into this album with the preconception that I'd leave it with an aching head and a disappointed musical appetite. What with the silly haircuts, stupid lovesong album title, and artwork that looks like it should be a TapOut t-shirt, could I really expect anything good from this album? No. I was wrong. \n\nThis band is obviously a very guitar heavy one. The guitars have a great tone, the sustained power chords seem to simmer with energy and distortion, and the riffs slam against the ear like a train against a pidgeon. Aha, yes, there lies the salvation of the album. The riffs. This album is loaded with great thrash riffs, such as on \"Within Destruction\", \"Comfort Betrays\", \"Bury Us All\", and \"Wrath Upon Ourselves\". This is a collection of great, high-intensity, lowend thrash riffs. And therein lies the problem. The best riffs are the low end ones. The songs are often riddles with unnecessary, \"melodic\", higher riffs overdubbed during the choruses and such. These riffs take away from the power and weaken the album significantly. \n\nAnother example of the \"melodicism\" getting in the way of this album is in the clean vocals. These are also found in the choruses. There are often quite brutal and great growls under these, but these All Time Low-esque, autotuned drones take away from the experience also. The only example of a song using these two things to its advantage is \"The Sound Of Truth\". The higher pitched guitar is actually really catchy and great, and it actually compliments the song, instead of dragging it down. The solos on the album are pretty good too. They could definitely be better, but they work. \n\nThe drumming is not anything to get excited about. It's very generic, metalcore drumming. Nothing special about it. Double bass, slow blast beats, ect. Occasional 12ths to throw you off guard, but nothing too rhythimically displacing to make it interesting. Oh yeah, and the bass was absent during the recording sessions apparently.\n\nOverall, an okay album. The ones I mentioned are the only ones worth getting in my opinion. This might have gotten an 80, but there was too much repetition and filler to warrant a B-. \n\nStandout Tracks: \"Comfort Betrays\", \"Bury Us All\", \"The Sound Of Truth\" \nRecommended to: Metalcore Fanboys, people who love softcore guitar porn, and a few tracks recommended to fans of thrash metal, as long as the crappy \"melodic\" parts don't detract too much\".\n",
        "\nOn As I Lay Dying’s third full length Shadows Are Security they change their style in the direction of melo-death with the occasional metalcore break downs and a more melodic sound. Fortunately Shadows Are Security is heavier, more entertaining, and much more mature than on Frail Words Collapse. The average length of each song is longer and the choruses are much better especially on Confined, The Darkest Nights, and Through Struggle. The tempo is somewhat faster than on Frail Words Collapse though most songs are still mid-tempo.\n\nThe songs themselves are much more entertaining and to the point than they were on Frail Words Collapse. The albums production is clearer and adds a heavier sound to Shadows Are Security. The two guitarist leads, riff writing, and song structure is more mature and definitely more metal. The harsh vocals are more sinister and the clean vocals are definitely in the metalcore style fortunately they work really well on Shadows Are Security providing great choruses. The bass is audible but like on As I Lay Dying’s most recent album An Ocean Between Us just provides rhythm. The drumming is just as solid as it is on all of As I Lay Dying focusing much more on fills and double kick bass than on hand drumming.\n\nThe weaknesses of Shadows Are Security unfortunately take away a lot of points. First off Shadows Are Security like most metalcore/melo-death albums has very few solos I talking about maybe four solos at the most for the entire album and they are always very short. The second half of this Shadows Are Security is much weaker than the first half only having one standout track Through Struggle. The final weakness is that on the album closer Illusions it opens with over a minute of pointless static then starts one of the best opening riffs on the album unfortunately the rest of the song doesn’t live up to the greatness it could have achieved.\n\nOverall Shadows Are Security is a very solid album fortunately As I Lay Dying would improve upon this release with their most recent album An Ocean Between Us. Best songs are Meaning In Tragedy, Confined, The Darkest Nights, and Through Struggle. I recommend this to fans of As I Lay Dying and melo-death metal.\n\n-5 points solos are almost non-existent\n-7 points weaker second half of album\n-3 points Illusions could have been a much better song\n",
        "\nIn my opinion As I Lay Dying hasn’t been a metalcore band since before Shadows Are Security, on that album they introduced a more melo-death based sound with breakdowns. On An Ocean Between Us As I Lay Dying has now incorporated thrash metal into their brand of melo-death. It works exceptionally well on An Ocean Between Us where most songs while thrashy are very melodic and breakdowns are still present. Another new thing for As I Lay Dying is the presence of an intro song and an interlude (both being guitar based).\n\nThe songs themselves range from all out melo-death/thrash to more mid paced melodic numbers. Solos are frequently placed throughout the album instead of one or two solos on previous albums and each solo is somewhat melodic. The production is top-notch, nothing to complain about there. The vocals are good in both there clean and harsh forms. Drumming is solid out of the ordinary it just provides the rhythm. The guitars are obviously the highlight of An Ocean Between Us because they provide great riffs, leads, and harmony throughout. The bass is audible for the most part, but like the drums just provides rhythm.\n\nThe downside to An Ocean Between Us is that the second half’s material is weaker and loses some of the momentum of the first half. The breakdowns while entertaining don’t fit well with the faster paced material. Finally the album closing track This Is Who We Are ends with a quiet piano part which just doesn’t fit with the rest of the albums songs.\n\nAn Ocean Between Us is an excellent album and it will be very hard for As I Lay Dying to top this album in the future. Don’t believe what many of the As I Lay Dying bashers believe judge this album on its musical qualities not its reputation. Best songs are Nothing Left, the title track, Forsaken, Comfort Betrays, and The Sound Of Truth. I recommend this album to fans of As I Lay Dying, and melo-death.\n\n-4 points weaker second half\n-2 points breakdowns were not needed\n-2 points piano part on This Is Who We Are doesn’t fit on this album\n",
        "\nShadows Are Security is ALID’s third full length album, and it’s their best effort to date. It contains a mix of brutality, emotion and atmosphere I have never heard before. \n\nThis album contains a lot of variation. It’s his main quality. You don’t feel like you’ve been listening to the same song for 43 minutes. It’s like a song sorted out in 11 tracks, with each of the tracks visiting a different atmosphere. This concept makes the album very stimulating. As I Lay Dying found an interesting way to write metalcore. It’s far from typical generic stuff. It has sort of a melo-death influence in the musical structure.\n\nTim Lambesis must be at his best. His vocals are very powerful and aggressive on this album. In other words, he seems to be utterly pissed on every track. The vocal rhythmic patterns always seem to fit into rythm of the songs. Some choruses contains catchy clean vocals but they are overdubbed by growls.\n\nThe guitar work on this album is truly interesting. It seems to contain technical aspects that are rarely found in the metalcore scene. The lead guitars are very melodic and catchy at some points. Needless to say, the solos are goddamn average and lack of presence. That’s a pretty sad fact because the rest of the guitar work was written with effort. The rhythm guitars are chuggy, but in a limited way. It’s just a filler. Rhythm guitars often harmonize during these chugging parts.\n\nThe drums are insanely pounding and aggressive. At some points, the drums are highly energetic, giving a drive to the track. They aren’t taking up too much space in the songs, their presence seems to be perfect. The bass drum usually follows the guitar chugging, emphasizing the chugging and exposing the harmonization and leads.\n\nIf you’re a fan of metalcore this album is for sure a work of art. I believe it is a unique kind of effort that is rarely found in the metalcore scene.\n",
        "\nAs I Lay Dying is your typical metalcore band with poor song structure, bad lyrical themes and lyrics, and poor playing ability. Sometimes people put up amazing bands like Opeth, or Novembers Doom. Other times they put up bands that are more hardcore than metal which is what As I Lay Dying is. Why they are on this website is really a smack in the face to all true fucking metal fans. Here are some of the many reasons why this band blows more ass than the guy on YouTube who has the song titled as \"What what in the butt\".\n\nBad song structure is always a way to get a good rating on this site . . . NOT! This band literally starts off with some random static or some cheesy simple rift that a monkey could play. Then after that they literally try and play other bands rifts so I’ve heard. They don’t even play the rifts to the best of their ability. They sound like every typical metalcore band out there. Nothing is unique comes out of this band. Every song of theirs sounds EXACTLY the same; it’s like a fucking headache. \n\nSecondly their lyrical themes and lyrics altogether is just agonizing. I mean really I could write better lyrics than these fucking idiots and I' am a drummer. Not to mention they are Christian and metal and religion just doesn’t work in my book. I' am agnostic if you didn’t know and this band in my opinion DESTROYS Christians all over the world it puts shame to Christians everywhere. Sorry for being so harsh but I don’t think metal and religion should be put together.\n\nLastly they play very poorly. They play like they are a brand new band just coming out from under a rock. But honestly I would rather get killed by a rock than listen to their shit. My friend who hates this band more than I do says this. “The screamer sounds like he is choking on something, and quite frankly I wish he would just choke and die.” I would have to agree with this quote a billion times over.\n\nAll in all this band sucks at lyrics, have the worst song structure I have heard in awhile no wait Hawthorne Heights is worse at that, and are poor with playing ANYTHING! So next time when you listen to a band like this instead of trying to like it just break your CD; Trust me it’s for the better. In the future I hope every band that sounds remotely like these guys just gives up and find new hobbies.\n",
        "\nI was very apprehensive to give this disk a listen. Between the songs I had heard in the past, those god-awful emo-esque haircuts they often sport, and the majority of the crowd who enjoys this band, I was very afraid that this would be some pseudo-metal, hardcore, punk-ish amalgamate of crap. However, the interesting introduction of ‘Separation’ kept my interest long enough to get to the awesome song ‘Nothing Left’, giving me faith in this disk.\n\nOverall, the guitars sound great. The cleans, the distortions, they all have great tones, and the riffs are pretty good. There are certainly some standard metalcore breakdowns, but thrashy riffs like the intro to ‘Nothing Left’ and more melodic riffs like ‘The Sound of Truth’ keep the tempos varying, and sound great. The bass tends to blend in with the guitar - but is that much of a surprise in modern metal bands? Their drummer is solid, and his parts have a great precision to them. Personally, I like the double bass with the chugged riff sound a lot, which is used pretty frequently. The cymbals could use to be mixed a little better in my opinion, but overall the drums certainly do a good job on this disk. However, the place where I thought I’d have the most trouble enjoying, and still do, is in the vocals. Tim’s screams sound more like a hardcore band’s vocalist trying to bust out a raspy scream. It doesn’t do much for me, as it sounds fairly forced - the type of scream where as soon as you hear it, you can imagine the singer with a comb over. I don’t mean to play stereotypes, but those of you familiar with a lot of up and coming bands in metalcore can likely understand the point I’m trying to make. What pleasantly surprised me were the clean vocals. There are some great clean parts such as the chorus of ‘Wrath Upon Ourselves’, and also are pretty catchy in ‘This Is Who We Are’, however, songs like ‘I Never Wanted’ watch them falter and fall into a far-too-soft, out of place feel on this disk.\n\nIn my opinion, anyone into metal could find a lot to enjoy in these riffs. They are heavy, well-produced, with some great rhythm in the drums and bass to back them up. Where you’ll find your grief is in the vocals. Even in songs like ‘Forsaken’, where I really enjoy the riffs and song structure, the clean vocals can get sounding a little too happy and cheesy for the song. It’s a type of sound you’ll have to hear for yourself to decide if you can tolerate them or not.\n\nSo here’s what we have so far: well-written, thoughtful riffs that show melody over self-fellating technicality, precise drums that do great justice to this disk, and semi-tolerable vocals. However, this album certainly has some downer points. ‘Within Destruction’ is a full thrash-fest, and I find it disinteresting because the song comes off as trying to be too heavy. Ironically, there’s a great part where you hear some solid blasting from the drummer right in the middle of the song that sounds excellent. ‘Comfort Betrays’ is a similar styled track, very heavy and bidding temporary farewell to the melody that seems to run through the rest of the disk. This one isn’t quite as bad, the riffs have a little more variance, but still is a relative low point of the disk. Following that track is ‘I Never Wanted’, the worst track on here which really is the type of song I was afraid of hearing on this disk. The soft, over-dramatic intro, with that awful chorus of singing and screamed vocals that are mashed up so horribly, and even the screams sound terrible over this song. The whole thing feels mashed up and is definitely one worth skipping on every listen. I wish their heavier songs I mentioned before were more like ‘Bury Us All’ - still in that heavy vein, but with a lot more groove that can grab your attention and make you aware it’s a heavy song, without trying to force it with generic thrashy riffs.\n\nIn spite of those flaws, I still enjoy this album a lot - especially since I was afraid to listen to it at first. It has a lot of great songs on it, with a nice intro song, and the interlude ‘Departed’ is pretty interesting to listen to the first few times, though loses it’s ethereal novelty after a while.\n\nTop Three Tracks: ‘Nothing Left’, ‘Wrath Upon Ourselves’, ‘Bury Us All’\n",
        "\nNot bad at all. For some reason As I Lay Dying really lost something after Shadows are Security and failed to replicate the scintillating fusion of unrestrained melody and choppy rhythm passages present here. This album basically takes all of what made Frail Words Collapse enjoyable and seriously beefs up the production values, all the while streamlining the overarching approach and going straight for the jugular as opposed to inveigling the listener with experimental departures like \"Forever.\" While that does signal some concern due to the memorability of some of the atypical elements present on Frail Words Collapse, it doesn't necessarily matter much in the end here.\n\nLambesis' barking aside, the emphasis is almost universally on the surge of the melodic lead. This is where the higher production values are felt most, as the leadwork features a razor-sharp, slicing aural edge that cuts to the forefront of the mix with ease. While the rhythm is more subdued and lacks punch in comparison, the band has the wherewithal to crank it up during the few fleeting core intervals or breakdowns that sporadically surface. \"Confined\" features a real neck-jerker of a breakdown near the end that proves on it's own that this style has potential. \"Through Struggle\" is a bit more refined in it's approach, but follows a similar path. For some reasons many of the breakdowns are accompanied by an accentuated bass drop, which has always struck me as interesting. Seems like this is one of the cases where the band that did it first did it best. Shame it spawned such a menagerie of inferior coattail-riders...\n\nAnyway, the vocals are more of a mixed bag. Lambesis is pretty tolerable on the whole, but recycles the same vocal patterns over and over again. It grows rather tiring by the midway point of the album, even while I found myself constantly coming back for Shadows are Security's melodic element. The guest vocalists who contribute on the chorus of \"The Darkest Nights\" make it a highlight on it's own, and more clean vocals would have gone a long way to establishing this record as a modern classic rather than an isolated snapshot of the best a sub-genre has to offer. I also really dig the atmosphere during a lot of these songs. I know, atmosphere on a metalcore album? It happens, especially later in the procession on tracks like \"Morning Waits\" and \"Repeating Yesterday,\" both of which summon a gloomy slant that finally equals the anguish of Lambesis' lyrics. \n\nAll of this considered, \"Meaning in Tragedy\" is the song you should track down if you want to see if Shadows are Security is your cup of tea. It contains all of the great elements: the biting leads, the crunchy breakdowns, a great melancholic passage (around 1:40), and manages to fit it all in just above three minutes. This is a very accessible album, and proves that there was great potential in As I Lay Dying's formula. I can't believe that a chance encounter of me finding this CD lodged behind a couch at a college house party kicked off my association with the band. The first two records are good stuff, but they definitely lost something afterward. As I Lay Dying's (and metalcore's) best.\n\n(Revised/Updated 6/2/14)\n",
        "\nAs I Lay Dying seem as though they will always be in the middle of the pack. They don't suck, but I don't think many people consider them their favorite band either. With the release of An Ocean Between Us, the band has tried to stray slightly from their purely metalcore sound as have many others such as Unearth and All That Remains, to a slightly thrashier Bay Area kind of sound, and I think it works.\n\nThere are less breakdowns and chug-a-chug riffs than before, with just as many squeals and short runs. A few riffs sound like they could have been taken straight out of Ride the Lightning, the opener \"Nothing Left\" being a good example of this. Tim Lambesis' vocals are awesome, that is one thing I really have to give these guys, they get things done in the vocal department. Although the cleans are very very clean and sugarcoated, it does not detray the feel of the songs in which they are put. In fact the title track \"An Ocean Between Us\" has a very memorable melodic chorus.\n\nThis is just a very predictable release with a bunch of pretty good riffs. As I Lay Dying are definitely not trying to reinvent the wheel, but rather they just try to be good at what they do. And although this release doesn't stretch any boundaries whatsoever, I'll take this over Trivium any day of the week.\n",
        "\nMetalcore is never an easy genre to review. Especially nowadays when most of the new bands keep insisting on mixing the breakdowns typical of the hardcore genre with riffs \"borrowed\" from an At the Gates or early In Flames album. As I Lay Dying made that task a little easier with An Ocean Between Us. It's a metalcore album sure, but this isn't run-of-the-mill metalcore. It’s a lot more thrashy, heavier, and especially more varied than their 2005 release Shadows Are Security. While Shadows Are Security was a good album, it lacked that special something that made their Metal Blade debut Frail Words Collapse a great album. An Ocean Between Us shows the band improving in both technical abilities and songwriting, especially on the guitar work. Phil Sgrosso and Nick Hipa surprised me on this one with their thrashy riffs and melodies/solos, especially on the first single \"Nothing Left,\" the title track, and \"Forsaken.\" Tim Lambesis is great on the vocal department, as I expected. I've always considered him one of the best screamers of the genre. The new bass player Josh Gilbert sings some clean vocals here and there, creating a nice contrast with Tim's screams. As always, Jordan Mancino excels on the drums. To conclude, this is As I Lay Dying's best work so far and probably one of the better modern metal releases of 2007.\n\n(originally written for Pivotal Rage)\n",
        "\nFirst off, I’m not really a fan of As I Lay Dying’s previous two albums. However, this album is a slightly a step forward from those earlier efforts, but retains the As I Lay Dying sound. \n\nThere are several small details that bring this album up a lot in my mind though. First off, the drumming is higher in the mix than usual, which is very good for this band because that is one of their stand-out features. There are more parts where the double-kick drum goes fast and long which is great sounding. Specifically the drumming in the track ‘Control Is Dead’ is superb, and makes the song sound more Melodeath than Metalcore at some parts, which I like.\n\nAnother improvement for AILD are the vocals on this album. Of all the features of Metalcore that I dislike, it’s probably the vocals that get me the most. Usually it’s this monotone yelling thing that is neither high nor deep, just kind of…. there. While AILD does this on most of their songs, this album switches it up a little bit. I mean it isn’t completely different, and they do their generic style most of the time, but there are parts where he goes a little higher than usual and it adds a nice accent.\n\nHowever, this album still has the same shortcomings that AILD has always presented. The guitar lines are pretty generic and interchangeable. And while the vocals are better, they still aren’t great. Also, what is with that last track that starts with a few minutes of fuzz? It’s a real annoyance, especially since the actual song is pretty good after the fuzz.\n\nSo, over all, if you liked As I Lay Dying’s earlier output you will like this album. However, I also recommend this album to fans of Melodic Death too, because it has it’s parts where it could honestly pass as Melodeath. If you’re looking for powerful vocals or soaring guitars, this isn’t the place to look though.\n\nSome “stand-out” tracks from this album are: ‘Confined’, ‘Reflection’, and ‘Control Is Dead’.\n",
        "\nAs I lay Dying's second full length album \"Frail Words Collapse\" is a well written and performed attempt by the band. The songs come together and convey the big message of depression, but longing to hold on to whatever is left in hopes that it will become better one day. There's a lot of questioning in their short but complex lyrical themes; they lead to the strong undertones of Christianity, and the strong message that suicide is not the answer, and that depression is a common emotion that everyone goes through. \n\nThe vocals are mainly screamed by the vocalist Tim Lambesis. There is a sense of sorrow in his voice, and it fits almost perfectly with the catchy guitar lines, and the heavy drumming and bass. His vocals go along well with the music, and though he mainly screams, there are a couple of lines in the song \"Forever\" which he showcases his singing.\n\nIn the song, \"Behind me Lies Another Fallen Soldier\" the mellow guitar riffs, the screaming vocals, and the occaisonal spoken words come together and are a perfect example of As I Lay Dying's musicianship as a band, and their song writing skills. \n\nThe songs are all under five minutes long, but still impact the listener with their heavyness, emotion, and their musicianship as a band. As I Lay Dying's Frail words collapse is an exceptional release, and it is a good example of Christian heavy metal music. The cd is a great example of today's metal bands, and shows that they aren't just another metalcore act that no one will remember in a couple of years.\n",
        "\nI was a little attaches to their earlier release, Frail Words Collapse, so I thought I would give their newer release a try. Upon first listen I really, really hated it. The biggest problem for me is the sound, it tries too hard to produce it differently and have the infamous \"wall of guitars\" sound to it. They fail to pull it off, the sheer sonic fury can only be realized as the bands best effort to drown out all other sound. The guitars are what can be great about songs, the riffing and solos and with metalcore the occasional breakdown. However with the production you never can truly pick out notes or who is playing what once the songs get going. This gets to be frustrating for me, as I often enjoy throwing on a CD and playing along with it on my own guitar. The drums as well just sort of blend in to the rest and are often too quiet and lack any sort of punch or musical dynamic to them.\n\nSuch a pity, too. I had hoped for this release but it turned out to be the most expensive drink coaster I'd ever buy. I will admit that after selling the CD off to a friend and later getting it back about 5 months later I gave it another chance. All things aside the sound of the disk is still a major problem but now I feel as if the best quality of the album is the vocal work, it is the only thing that really sticks out. It has energy to it and really seems to be top notch compared to other metal core releases.\n\nStand out tracks are few but still worth a bit on their own; \"Through Struggle\", \"Confined\" and \"Reflection\". In very small segments this album can be worth it, however it's not the sort of of disk you'll find yourself going back to time and time again, the tracks are just too insipid and not very memorable. \n\nBottom line, if you are just getting into the band, get this release last and pick up any one of their other efforts.\n",
        "\nThere used to be a time when you could spot a Metal Blade band a mile off. There were bands that just exuded all of the traditional ‘metal’ qualities necessary for a contract with the much-loved label. They still have those bands – Amon Amarth and Chinchilla come to mind. However, in a continually fluid heavy music scene, Metal Blade have seen it necessary to sign acts that would represent their ‘slice’ of the market. Furthermore they have also signed up some more impressive newer/younger acts that actually strays from the labels more ‘traditional/well established’ philosophy. Detroit’s ‘The Black Daliah Murder’ is one such act. ‘As I Lay Dying’ is another. \n\nAs far as progressiveness on the Metal Blade roster, I reckon ‘As I Lay Dying’ represent the labels most forthright statement (nah, The Heavils don’t count). You see, ‘AILD’ are not a traditional metal act, they don’t play nu-metal, nor do they play Melodic death metal. And that’s where the rub lays punters. AILD are a ‘new sound’ for the Metal Blade label and one that should do well for them.\n\n‘AILD’ were formed in Feb 2001, and released their debut disc ‘Beneath the Encasing of Ashes’ on Pluto records in that year. Signing with MB after a split release with American Tragedy, the band recorded ‘Frail Words Collapse’, their second disc, at Big Fish studios with Steve Russell (POD and Blindside). \n\nWhat do they sound like? Well, theirs is actually a bit of a conglomeration really and while that sounds messy, it’s quite the contrary and it also works. For description purposes, AILD could be termed as emotional death-core. And what the fuck is that you ask? In an attempt to remove any ambiguity, try this – AILD’s music is based on the screamy ‘Hardcore’ blueprint – the real hard edge material. Add a small accessible death metal element (blast beats especially) and a well-entrenched emotive, harmonic component (both vocally and musically) Hopefully, you just might get the idea. \n\nInitially, I was a little skeptical as to where this band was going with it’s ideas and while there are other doing similar things, As I Lay Dying have written some interesting and certainly less than typical music. It must be stated again, that ‘AILD’ are a very abrasive act – their riffs are a combination of choppy, stop start effects and sharper, melodic and more angular lead riffs, which are well layered over the top of the main rhythm. It gives rise to an often-complex sound that threatens to derail at times, however, with some smart song writing, AILD have been able to keep their progressiveness in control.\n\nThere are some who have lumped AILD’s sound in with a host of ‘metalcore’ acts like ‘Hatebreed’ and ‘Congress’. I’m not quite convinced that this is the case and certainly you will find that pace wise ‘AILD’ are a little more varied, they don’t employ massive breakdowns and the more ‘emotive’ quality captured in the vocals are major differences between them and the aforementioned MC groups. \n\nVocally, Tim Lambesis works on about an 80% harsh v 20% clean vocal approach. His aggressive rasp is most impressive – not as thick as it can be, but nonetheless he carries through well. His clean vocal is probably the most distinctive part of this band – and although it is used sparingly, it is well placed. I like the way he uses it as an expressive tool to create power and emotion (‘Forever’ and ‘Distance is Darkness’) rather than being a typical clean chorus break just for the sake of it. I’m also impressed with the way Lambesis employs this style in conjunction with the harmony laden guitar lines that crop up throughout this 12-track disc.\n\nMy one main gripe is with the drum production. In particular, the double bass mix. It has one of those real clicky sounds that is quite overbearing at times, especially when drummer Jordan Mancino throws in his double kicks. It is perhaps one of the first things you notice about the production of this disc – for me, its been overdone and placed way to high in the mix. Sure to be rectified next time. \n\nOverall, I have found ‘Frail Words Collapse’ to be a most interesting album. It is a particularly well constructed album – well paced and varied enough to distinguish between songs. AILD have been able to put together dynamic combination of styles – harsh and confronting, yet melodic and emotive when required. There is much more to come from this band in the future.\n",
        "\nAs I Lay Dying's most recent effort, \"Frail Words Collapse,\" is an excellent mix of hardcore and metalcore. There is one slight problem with the album, though....\n\nThe band doesn't waste any time with melodic or artsy introductions on this album, instead opting to have about 5 seconds of static and then diving head-first into it. Personally, this track seems to be more hardcore than metalcore, but I'm one of those weirdos that loves punk, metal, and everything in between, so to me this track is absolutely fantistic. Stay away if you don't like hardcore, but then again if you don't like hardcore it's unlikely that you'd buy a metalcore album anyway. The track has some pretty nifty double-bass interludes, and incorporates some nice clean vocals in spots as well. All in all, an excellent track. \n\nBut that's it. Out of 12 tracks, there is not a single unique song on the entire album. You can practically listen to the first song and put the album away. Every song is extremely good, don't get me wrong, but it's all the same. I find it far too easy to get lost in the album, forgetting if I've listened to a song or not, because they sound so much alike. If you like hardcore, buy this album, because it is good. But don't listen to it all at once, because if you do, you will soon realize that you've heard pretty much the same thing over and over again for 12 consecutive tracks.\n",
        "\nA Split with two of California's best metalcore bands, starting is As I Lay Dying with their five tracks of fast and brutal metalcore with a melodic edge. They play really heavy and devastating Hardcore with brutal mosh and death metal riffs, and sometimes they add melodic riffings to this. \n\nAs I Lay Dying play in the same league with bands like Zao. This band really kicks ass and this is heavy as fuck, with a singer who is screaming at the top of his lungs. On their last song \"Forever\" they throw in clean vocals as well. Good stuff!\n\nThe second band is American Tragedy with six songs, their attack is introduced by a track with weird voices and noises and what follows is even more brutal than As I Lay Dying's songs. \n\nThese guys mosh you down with pure aggression and precise playing with a lot of overrunning passages and evil breakdowns. But American Tragedy offers even more because their second track begins with melodic guitars (Shai Hulud-like) and clean-singing choirs and after almost one minute they start again with these heavy mosh parts. \n\nThis inter-changing becomes the special thing about them because they switch over and over again between brutal and harmonic parts and it's the same with the singer because he changes as well between screamed and sang vocals. \n\nMy absolutely favourite is \"Porcelain Angels\" because besides mosh riffs and screaming, one guitarist plays this sick recurring melodic riff. They are like a more brutal version of Shai Hulud! Awesome split!\n",
        "\nFirst time I read that these boys signed to Metal Blade, I wondered, this \"Christian\" band on the same label with god-hating bands? \n\nBut in the end this doesn't really matter at all and for As I Lay Dying it was the best move they could make because \"Frail Words Collapse\" is the best they've ever done. I really liked the American Tragedy/As I Lay Dying Split last year and compared to it, As I Lay Dying really improved their style. \n\nThe mosh parts are more devastating, the melodies even sweeter and the metal riffs are faster. The opener \"94 Hours\" is a straight ahead and fast smasher with one guitar playing a cool melody guitar and the other plays moshy riffs! The fast passages are just the best melodic death metal, and even hardcore-fans will love their brutallity. \n\nI guess that's one reason for their success, As I Lay Dying's music contains lot of metal but they always throw in typical mid-tempo passages that shouldn't be missed! \"Forever\" is one of their best songs, a hard-hitting mid-tempo metalcore track with very special vocals because they range between hopeless screaming/shouting and awesome harmonic singing. \n\nThey also did a ballad called \"Behind Me Lies Another Fallen Soldier\" that starts with calm guitars and spoken words and continues with screamed vocals and slow rhythms. The ingredients to their music are simple but As I Lay Dying will also make your ass move because they developed this mixture of melodic metal and heavy hardcore to perfection. What should I write more? This is just heavy shit...go and get it! See them in show, be converted!\n"
    ]
}