{
    "Band Information": {
        "Country of origin:": "Australia",
        "Location:": "Brisbane/Gold Coast, Queensland",
        "Status:": "Active",
        "Formed in:": "2009",
        "Genre:": "Technical Deathcore",
        "Lyrical themes:": "Science fiction films, Video games, Literature",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n\n2009-present ",
        "Number of Reviews": 2
    },
    "Band Reviews": [
        "\nAversions Crown is one of the bigger modern bands of Australia, among titans like Psycroptic and Disentomb. Much the same as those bands, it’s usually a good few year wait between albums so Hell Will Come For Us All is a much welcomed release to fans of sci-fi death. At the very least, there are many improvements over their 2017 album Xenocide. Gotta love the Burke work though.\n\nThe biggest improvement here is the drumming, to me it felt a bit mechanical on Xenocide but on this album there’s more of a chunkiness to it. They also use drums as emphasis a lot in the song writing, often scaling back everything else to let the kit thump a few times before heading into the next segment. We also get some sick triplets in here and there too for parts that typically get left to palm muting guitars. I like the thickness of the kicks. I don’t know anything about drumming, it sounds good to me. The vocals have always been pretty good and that remains, it’s the kind of death vocal that has a lot of theatrics which isn’t easy to pull off.\n\nThe production could have been better on the pummelling parts and carry more of a presence. The heaviness isn’t always felt, like yeah technically it’s always heavy but it doesn’t always resonate or quite make your face pucker like a butthole. I’ve felt this way about a lot of Nuclear Blast releases though, just a tad over produced. Where they do shine is the sci-fi elements of the sound and the way the vocals often fade in and out of the mix. The atmospherics and breakdowns are fantastic, I think this style of production just works better on heavy parts that are preceded by quieter parts.\n\nIt’s a rare kind of album that gets better as the tracks go on, perhaps due to the strong storytelling element that begins with an earthly perspective and shifts towards a cosmic one around halfway through which brings with it more atmosphere and vocal expression. The story is a very misanthropic one about an alien deeming humanity undeserving of life due to the never ending self destruction and pettiness. So this alien commits xenocide and sends us to a death on prison planet where we line the walls. It’s a trip that is well presented with the album cover by Adam Burke. Reading the lyrics it appears each track is sequential with the final track being this alien alone in existence killing itself to prevent himself from rebuilding humanity, of which he has the power. So it’s really the ultimate fuck you to us.\n\nOriginally posted by Carcassbomb at noobheavy.com\n",
        "\nI was slightly familiar with this band and one of my friends was repping the new album and suggest that I finally listened to them. I was worried they were going to be too much on the death core side which, don't get me wrong, there are plenty of breakdowns but there's enough meat on them to savor and still make well-rounded songs. This for sure won't be for everyone but if your PTSD has subsided from the mid-2000s death core wars then give this one a shot.\n\nAs I mentioned, there are breakdowns here so there are some core elements that people will struggle with. The vocals is in that vein but for some reason I don't hate these. They did take a moment to grow on me just like with Rivers of Nihil vocals. The breakdowns that are there are about 50-50 on whether I like them or not. Some are run-of-the-mill and are only interesting for offering a simple change of pace. Your average break down needs to have more than that and about half do. Each and every song has one solid moment with some having multiple. \"Caught in the System\" has one of these traditional and boring breakdowns that has no place here. There's another at 2:40 on \"scourge of Violence\". Overall, there are not specific tracks that are solid the whole way through, but rather have a few shining moments. Fortunately, there are plenty of legitimate compositions that don't rely on these cheap tricks. The entirety of \"Sorrow Never Sleeps\" is thoughtful, morose. room-filling, dynamic, and overall a well-written track. Also, there's nary a breakdown to be found!\n\nThe guitars can be ferocious when they want to and I would really like more of that. The guitarists really shine when they have blistering tremolo sections and quick changes but really suffer in many other sections on the rest of the album where the guitars must be subdued. There are some ferocious riffs that catch the ear as well. Like the on at 0:50 on \"Paradigm\". Also, see 0:42 on \"Scourge of Violence\" The occasional lead section proves interesting but it's not too common to get one of those. The title track had some interesting lead guitar work but not having solo I feel like there was some untapped potential. The lick at 1:10 on \"Scourge of Violence\" is also ear-catching and melodic. It helps the track when it is used. The rhythm guitar later emulates the pattern but with chords and using the upper strings.\n\nI really do enjoy the sound of the drums as the individual elements that each piece makes and then as a whole the works and is enjoyable to listen to. They're played very tight and the production facilitates that. As far as the intricacy and writing go, the lack of variation, other than decent fills, leave me wanting a little bit more from the percussion department. My favorite drum song is \"Caught in the System\". On that one, there's plenty of variation and a few passages that are quite unique which definitely stand out.\n\nFavorite tracks:\n-Born in the Gutter\n-Sorrow Never Sleeps\n-The Soil\n\nTechnical skill: 53% Song writing: 68% Production: 77% Originality: 49%\n"
    ]
}