{
    "Band Information": {
        "Country of origin:": "Australia",
        "Location:": "Melbourne, Victoria",
        "Status:": "Active",
        "Formed in:": "2004",
        "Genre:": "Melodic Death Metal",
        "Lyrical themes:": "Nature, Paganism, Greek mythology, Philosophy, Fictional stories",
        "Current label:": "Napalm Records",
        "Years active:": "\n\n2004-present ",
        "Number of Reviews": 20
    },
    "Band Reviews": [
        "\nAfter five years of productive silence, the calm before the storm came to fruition with the Australian masters of the modern melodic death metal scene Be’lakor releasing their fifth full-length album titled Coherence. Characterized with the same commanding strengths of storytelling qualities and breathtaking capabilities as their previous works, the Melbourne based metal group centralize their efforts on the established musical aspects and contemplative concepts that they diligently formulate. Leaning more towards Finnish melodeath and spicing it up with progressive metal elements, the band once again pledge their loyalty to their habitual recipe; to an encapsulating sound that have become synonymous with their respected name. As with every Be’lakor album, the music engulfs you and places you in the daunting sky beneath a chilling atmosphere conveyed ever so skillfully with virtuosic piano pieces occasionally taking the role of a breathing space in-between the meticulously composed overload of riff driven assaults, harmonizing leads and ethereal melodies. The above-mentioned archetypal forefront is fortified by an indispensable background section of precise drumming and earth trembling growls. This isn’t anything remarkably new to what you usually get from these guys, yet there’s always plenty of diverse parts to dissect and a multitude of spectacular moments to grasp. To put it in much simpler terms, it’s classic Be’lakor. \n\n“Locus” launches the album with typical Be’lakor fashion, swirling from one monument of thumping riff variations to another with an unmatchable signature guitar tone. Cementing a grand desire to be a single, the powerful track gets reconciled being Coherence’s opener, projecting assertive tremolo riffing and gritty screams in its final minutes, culminating the slowly brewing tension of the song in the best possible outcome. The following track “The Dispersion” is a piano interlude that identifies as a symphony of anticipation. It can be considered as a minor repose that partially warms up the icy wind spread throughout the album. Out of the three potent singles, “Valence” offers the distilled points of the record strongly; the third single presents vital reflections of a mix between the group’s cinematic journey of 2016’s Vessels and the aeronautical punch of 2009’s Stone’s Reach, executed with the same grandeur. In addition, the piano breaks between the dense riffing, the vivid narration, and the torrential melodic leads grant the single an epic conclusion and nominate it into becoming a future Be’lakor stalwart. “Foothold” is a powerhouse of riffage, supplying the best and most varied riffs and hooks. Leaning the most on progressive tendencies with its subtle time signatures, its upbeat melodies that condensate into positive sensations has the ability to lure power metal fans in. Across every section of the album, proficient musicianship is easily found, convoluted in blistering magic of zealous guitar technicality and dreamlike melodies that shift from a symphonic cacophony to another. The sound furthermore gets amplified via its subjection to thrilling atmospheric territories, primarily belonging to the realms of atmospheric black metal with acts such as Agalloch and Enslaved appearing as indirect influences. \n\nThe modern melodeath movement of decomposing the aggressive speed and in-your-face intensity of its Gothenburg-style execution while adding more accessible elements such as clean vocals, refined production and symphonic elements has arguably revitalized this 90s birthed scene. Though what makes Be’lakor stand out from groups like Insomnium and Omnium Gatherum is their uncompromising identity and distinguished sound. They increasingly tear apart the constituents of this subgenre in order to direct it into 7+ minutes of complex structured progressive metal and majestic melodic death metal matrimony. And instead of going down the clean and harsh singing permutation, rhythm guitarist and vocalist George Kosmas chooses to stand out in his unique and patented performance, with an exchange of intimidating and unique grunts and growls alongside innovative eerie whispers, carefully fitting in the back of the mix and working marvelously in carrying the mystique energy of the music, all while continuing the soothing ambiance that the intricate guitar harmonies and contemplative piano notes started. The Australian outfit pertains to a stupendous level of progression and dynamism, consequently causing the beginning, middle and ending of the same song staggeringly different, switching between epic string and keyboard build-ups paving way to mid-paced heavy and melodic riffs that ebb and flow and vary in a staccato sense, accentuated by calculated and precise drumming that cleverly utilizes multiple combinations of kicks, cymbals and snares, interjecting poignantly into the melody and adding some compelling thickness to the mix. Of course these rhythmic layers and musical textures play out in definitive unison and cohesion, letting all the parts methodically interconnect with each other. This full of vim and vigor feature strongly reinforces the storytelling nature of the lyrical content, helping the listener go to an imaginative celestial voyage filled with excitement and tranquility. \n\nWith Coherence, Be’lakor confirm their successful endeavors of a path heading down to a legendary status. Stone’s Reach was released more than 10 years ago, yet all their LPs following their magnum opus affirmatively establish the Aussies’ impact and ever-growing legacy. While I may place its enjoyment behind Vessels and company, their evolving maturity in song arrangements and dynamic composition that renders the record leaning towards more progressive aspects in comparison with their previous work can only be praised and admired. And that’s evidently includes the fact that Be’lakor songs are amazing growers, only rivaled against progressive metal leaders. Alas, the relatively shortage of vocals and ambitious songs left me with a few itching cravings. Needless to say, the instrumental tracks “Sweep Of Days” and “Indelible” lacked that special oomph that Kosmas provides. The compositional aura and recurring themes of “Sweep Of Days” in particular felt like a straight continuation of its precedent track “Valence”, and the interlude-like acoustic strumming dominated “Indelible” could have been more effective serving as the intro that sets up the last song, thus I would rather have these two tracks merged with the others for a more enchanting musical experience. And that’s not to disregard the Australians’ longest track to date, the closing tune “Much More Was Lost” radiated with polarizing ambitions, converted through a beautiful interplay between piano keys and guitar leads that pour out multifaceted emotions from sorrowful introspection to uplifting motivation. From an objective point of view, the album closer competes with the group’s biggest songs, yet personally it felt like a try hard attempt to restore jaw dropping moments from glorified songs from the past like “Venator” and “Withering Strands” among others. Ultimately, Coherence is a coherent -pun intended- and logical piece of art that solidifies the ingenuity and consistency of Be’lakor’s music, amidst few weaknesses and minor errors. Maybe with more time, patience and repeated listens I’ll have a change of heart towards the seemingly negative sides of the LP, but for now after a two months of sonic inspection I am yet to be convinced. Perhaps I let my expectations make this experience less satisfying, as it’s a bit hard for me to accept that there isn’t going to be another hallmark of a release like Stone’s Reach or Of Breath And Bone coming out anytime soon.\n\nFFO: Insomnium, In Mourning, Opeth, Amon Amarth\nOriginally written for HeadbangersHaven.com\n",
        "\nFar from being a one-trick pony, melodic death metal has proven a high diverse sub-genre and veritable movement unto itself that has spawned a number of interesting variations. Arguably the most interesting of the lot is what one might call the dream variant, pertaining to a more atmospheric and drawn out take on the original Gothenburg-born style that rose to prominence courtesy to the mid-2000s efforts of a number of Finnish outfits such as Omnium Gatherum, Insomnium and Eternal Tears Of Sorrow. Curiously enough, while this niche is most readily associated with bands hailing from Northern Europe, the Australian quintet Be’Lakor could be seen as the band that has taken it to its logical conclusion, injecting a more adventurous, progressive flavor into the template to further accentuate it’s otherworldly character, and their latest and 5th studio effort Coherence proves to be no exception in taking its audience through an elaborate world of vivid imagery.\n\nThe highly abstract cover art might appear to contradict the meaning of the album’s name, but in reality it points to an album that flows much like an impressionist painting, presenting a series of concrete stories and visuals in a unified yet hazy manner. Naturally this analogy only tells part of the story, as this album’s time is divided equally between the nature-based subject matter common in impressionism and the more fantastical themes common to metal lyrics. Musically speaking, it lives up to its title by displaying a consistent expression of cold and biting metallic riff work and a misty assortment of keyboard ambiences, along with some piano and acoustic guitar passages that often resemble the dreamy handiwork of Insomnium. However, the overall presentation proves to be a tad more aggressive and epic in scope, to the point where any individual song clocking in at less than seven minutes in length is an instrumental offering that functions more as a short divergence into even more abstract territory.\n\nFrom its very inception, this opus erects a series of elaborate structures from a very basic principle, both lyrically and musically speaking. The grandiose opening number “Locus”, it’s very title referring to a location of great significance, gradually emerges from a dense, hazy atmospheric prelude topped off with a droning harmonized guitar line into an explosion of raw intensity, spearheaded by the deep guttural roar of vocalist/guitarist George Kosmas and his elaborate six-string interplay with lead guitarist Shaun Sykes. But even more impressive than the radical shifts in dynamics that occur is the brilliant transitions in rhythm and feel, as the bulk of this song seesaws between a blasting fury and a driving march, yet finds itself occasionally veering into more nuanced territory. Somewhat shorter yet equally elaborate successors such as “Foothold” and “Hidden Window” mirror this running the gamut of tempos and contrasting timbres in a similarly through-composed fashion, the former coming off as a tad more chaotic and ferocious, while the former delves deeper into the band’s progressive tendencies and vacillates between up tempo metallic fury and a grooving, quasi-acoustic balladry.\n\nFor the most part, this series of extended anthems feels like an all-encompassing experience that could almost be treated as a singular one-hour song, but beneath the freely stroked brushings of color is an implicit line that separates one chapter from the next. Particularly with the longer offerings this separation becomes more apparent once the introductory material elapses, though it’s interesting to note that the consistently driving shuffle of “Valence” almost sounds like a restatement of the larger middle section of “Locus”, albeit denser and more elaborate. On the other hand, the closing 12 minute melodic slough “Much More Was Lost” contains a highly distinctive recurring guitar hook that is impossible to mistake for anything heard prior, and the contrasting segments that round out its structure are noticeably more disparate than any previous song, closing things on a highly climactic note. Ultimately the greatest points of contrast prove to be the shorter instrumental works, and the standout among them being the brilliant merger of howling lead guitars and acoustic jamming “Sweep Of Days”, further solidifying Be’Lakor’s honorary status as a Finnish melodeath band in exile.\n\nWith rock solid performances turned in by Insomnium and Omnium Gatherum, this year has already proven to be a boon for the melodic death metal faithful, and Be’Lakor’s entry could be likened to the elaborate design that adorns the top of the proverbial cake. It’s the sort of album that announces its prowess at its very first, yet due to its highly involved and complex nature, has enough staying power to keep even the most obsessive of listeners busy for the remainder of 2021, if not well into the next year. The balancing act that goes with remaining accessible to the same audience that originally fell in love with 90s classics such as The Jester Race and The Gallery while also delving into the sort of progressive territory that is often reserved to the likes of Ne Obliviscaris and Persefone is by no means an easy one, but this album might fool most into thinking otherwise. Consistency doesn’t necessarily imply either simplicity or complexity, and in this band’s world, simplicity and complexity function more as partners rather than adversaries.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nCoherence, or the quality of being consistent, is among the virtues I cherish the most as it is often synonymous with balance and strong character. However, when applied to art, namely music, it may prove to be a double-edged sword, for while it can mirror stylistic consistency, it could also reveal creative stagnation. As a fan, I like to think Be'lakor belongs to the former niche. Although there has been a clear evolution since their debut album, The Frail Tide, the Aussie lads have always remained true to their musical foundations, rooted in bands like Dark Tranquillity, Opeth, or In Flames. Their multifaceted melodic death metal formula has gained new chromatics without ever losing touch with their origins. With each new step revealing growing musical maturity. 2016's Vessels represented the last stage of this evolutionary process, both chronologically and artistically. Its incursion into progressive grounds and ethereal surroundings placed the collective in new territories, pushing the boundaries of a genre often too rigid. This artistic boldness proved to be fruitful as it blossomed not only into the band's most ambitious release to date, but also into one of the best albums of the past decade.\n\nAs the title suggests, Coherence pursues the same familiar trail, but contrary to my original hopes it doesn't begin where Vessels left off, rather acting as a synopsis of the band's legacy. As if the boys were camping on a mountaintop, enjoying their life's journey. In fact, this imagery does have some contact with reality as the album's concept takes place on a mountain, where each of the songs explores the story of a different person on that very spot. Although it is not a linear narrative, with a beginning, middle, and end, as in Vessels, it is still an idea that ties all musical moments together, giving them a common ground. A song such as 'Hidden Window' somewhat mirrors this sense of past journey given its more straightforward nature that brings it closer to an album like Stone's Reach than Vessels. Its main palm muting syncopated riff evokes this old spirit while simultaneously embodying much of Be'lakor's trademark features. I would say Coherence is more riff-oriented than its predecessor whilst retaining some of its atmosphere. Although more diversified, 'Locus' and 'Foothold' also share this type of riffing so characteristic of the band. Which brings us back to the album title and what it musically represents.\n\nDespite this bridging with the band's primordial foundations, Coherence features a number of \"larger than life\" segments that catapult it into sensory stratospheres. The epic endings of 'Much More Was Lost' and 'Valence' as well as the latter's main riff are the pinnacle of this majestic side, being among the best moments the band has ever recorded. The harmonic layers of 'Indelible' or the black metal-ish blasts in the opener and closing track are also among my personal highlights for different reasons: the former due to the sumptuous guitar interplay and the latter ones because of the contrast with the midtempo soundscape. Blast beat sections are something the band should use more often as they lend greater dynamism to a formula that rarely strays off the comfort zone. And as it turns out, it is indeed possible to introduce more rhythmic variation while maintaining stylistic coherence.\n\nJens Bogren's full-bodied mix is also somewhat of a throwback as it gives the album a fatter sound, closer to Of Breath and Bone, thus contrasting with Vessels' flat mixing. The robust sound engineering also boosted the rhythm section which is now more solid than ever, with 'Much More Was Lost' being its brightest moment. As expected, the quintet works in a perfect symbiosis, just like a team of old acquaintances where each one knows perfectly how to effectively contribute to the whole. This strong chemistry between a line-up that, with the exception of the drummer, remained unchanged since its conception is the band's X-factor and the reason why the album title makes perfect sense, whatever interpretation one might put on it.\n\nCoherence is somewhat of an exercise of introspection on the band's journey. A moment of self-contemplation that gathers both past and present through a collection of familiar stories set on an imaginary mountain. While it doesn't take us into new territory, it is an ode to consistency. A delightful new chapter that deserves our utmost attention, as it is part of an epic tale that illustrates some of the best soundscapes the genre has ever produced.\n\nOriginally written for www.sputnikmusic.com\n",
        "\nBe’lakor seems to find joy in taking melodic death metal in a challenging direction. I’m not referring to technical ability, either; their songwriting mechanics are more emotionally detailed than the Black Dahlia Murders who all linger creepily around At The Gates and others. It is relieving that Be’lakor willingly avoids the artistic pitfalls of melodic death metal altogether, and thus, they’ve been able to map out their own oasis within a creative wasteland. “Vessels” takes the torch from “Of Breath and Bone” and runs further into the fog of what has become Be’lakor’s rich and introspective style. “Vessels” invokes a journey of magic and self-discovery amid isolation and tragedy, far from the juvenile, insipid nonsense that usually takes on this musical blueprint. \n\n“Vessels” is an expansion of the “Of Breath and Bone” paradigm, a solid move considering there is still much to discover within its sanctuary. Rather than continue milking the formula applied on its predecessor, “Vessels” ventures beyond the set musical perimeter by exploring its inherited musical philosophies. The ethereal, atmospheric components are rich with soothing guitar notations and poignant melodies, creating a dualistic soil in which the songs are planted. The courses of the unhurried melodies give a sense of buoyancy to anthems that attract a congregation of musical sections; these tracks are fairly long, obviously. Be’lakor often jumps from the floating force of their cloudy melodies onto more electric parts, such as blast beats and up-tempo melodic death metal surges. The contexts of their identity create plenty of imaginative exploration.\n\nAn important feature to mention is Be’lakor is easily identifiable. The low, cavernous growls are a vital piece of the Be’lakor machine, a big surprise to the uninitiated given how much depth they provide in a setting that is almost contradictory to such death metal vocals. I’ve always been astonished by the band’s rhythm section, which is more adept and involved in the general goings-on than the average melodic death metal squad. The bass lines and undertones help set and control tempo shifts while maintaining its integral part in the voyage, be it violent or dreamlike. “Vessels” provides familiar antics, but Be’lakor’s natural inclination to spice up their multifaceted, meaningful melodies with death metal motifs makes for a bottomless well of magic, a sound in chains given a free soul. \n\nThis review was written for: www.Thrashpit.com\n",
        "\nBe'lakor is nowadays a fairly known band among melodeath enthusiasts, like myself, thanks to a couple of amazing releases, 2009's Stone's Reach and what I consider to be on of the genre's finest gems of the last 10 years; 2012's Of Breath and Bone. But in 2007 these Australians were practically nobodies. I guess they had been playing some gigs in their Melbourne area in those formative years, until they finally launched their debut, The Frail Tide. This is a strange case of an album for me, since it already displays Be'lakor's well known traits; long songs with multiple sections that never try to sound “progressive” or display virtuosic playing, instead focusing in creating an emotional flowing of melodies and arrangements, chiaroscuro compositions that fluctuate between calm sections with piano and acoustics and more forceful, though never particularly heavy or aggressive, mid-paced melodic death metal. However, in this first material, the formula is a bit hit or miss. \n\nThere are only six songs here, but the album manages to break the 40-minute mark. Opener “Neither Shape nor Shadow”, over seven minutes in length, is a good example of the typical Be'lakor sound. It starts with a clean power metal-ish melody that advances mid-pace for a while, until some piano starts a different, slower and heavier section and then George Kosmas's blunt growls finally appear, so the song is transformed into their distinct melodic death metal. Pace is accelerated and decreased here and there, as different sets of riffs come and go. The use of acoustic guitars and especially piano is a constant in all songs of the debut, more so than on following albums. Therefore, Be'lakor's music might be accused of being “soft” for the hardened death metal fan, but it can hardly be called monotonous or predicable. One never knows what’s coming next in one tune. These guys always manage to hold one's attention throughout their entire compositions, and this is a forte that's even true here, in their flawed debut. \n\nSo what are these flaws? Well, for starters there's indeed too much piano here, even enough for open-minded metalheads to become a bit sick of it by the end of the record. There's even a six-minute all-piano tune, “Paths”, which could have been easily abridged into a third of its actual length. Steve Merry obviously knows how to use the keys, but this is just too much. He'll add more varied sounds and effects from his keyboards in future compositions. Also, on the rest of the songs, the rhythmic section is a bit too basic, another correction that would be made in the future works from the Australians. And finally, the production, while not bad, it’s not exactly crisp either. The guitars lack punch and so does the bass guitar, at times pretty difficult to notice. The riffing is ok and functional, and while stellar riffing has never been Be'lakor's main characteristic, it would be definitely improved, along with the finesse of the fluctuation between sections in their songs. \n\nThe Frail Tide is a decent melodic death metal offering, but it was indeed nothing too special in 2007 to get these guys noticed, sounding like an elongated, piano-infested, slower version of Finland's Insomnium. It remains an album I wouldn't recommend to most metalheads, except for the curious who wanna know how this band started. Two years from its release, the sophomore Stone's Reach would change all that doesn’t quite work here, by perfecting their formula, upgrading their production and overall aesthetics, giving us the Be'lakor some of us really appreciate.\n",
        "\nBe’lakor’s music feels a lot like the hallowed retelling of some kind of cultural story. The lyrics deal in the exact same sort of archetypal imagery that thrives in mythology, and their general atmosphere is one that instantly evokes a tribal peacetime storyteller rousing idle crowds by spinning tales of past conquests. At its best, this musical feel can be as engaging as the aforementioned storytelling ritual. At its worst, it feels a lot more like a B-grade historical documentary. Be’lakor’s music has so far consistently erred on the side of quality, but even so, the approach they take has some inherent limitations. They take the power and primal impact of mythological archetypes, but entirely forgo any chance that the listener might actually feel like they’re there bearing witness to any of the stories being conjured.\n\nBe’lakor’s primary strength, however, lies in rousing riffs and melodies. On Of Breath and Bone, their excellent third release, they come in thick and fast. They are gleefully aware of their talents. In spite of the haughty, drawn-out compositions that inhabit Of Breath and Bone, a moment rarely goes by without a gripping guitar line. \n\nThis sort of ear for melody is almost a hard requirement for good melodic death metal, but Be’lakor drive it to what may very well be its endpoint. The tracks on Of Breath and Bone average at about 8 minutes long, and they’re all almost exclusively built out of the melodic riffing style at which Be’lakor excel. Luckily, however, in spite of how lengthy and stylistically unrelenting Be’lakor’s compositions are, they rarely ever meander. Each track has an omnipresent sense of purpose. The band expertly manoeuvre spry guitar riffs through commanding melodic centrepieces, carefully weaving forward but remaining tied to consistently pervasive themes.\n\nAs skillful as Of Breath and Bone is, it’s far from flawless. Most of its lyrics – and, for that matter, pretty much all of the lyrics in Be’lakor’s discography – follow the same rhyme scheme. As powerful and instantly evocative as some of these lines are, (Until his bones and thoughts were old /and feathers burnt and lost and cold) the general experience of reading and perceiving the lyrics is seriously marred by the relative lack of variance. The instrumentation suffers from a similar issue. Over 8 tracks – almost 57 minutes, Be’lakor seldom ever let up from their melodic, elegant mood.\n\nOf Breath and Bone doesn’t make any massive stylistic changes to the formula established by the albums that preceded it, but why would it? Be’lakor have risen to mastery of their craft, and they really have no need to experiment. It does, however, feel constantly more urgent and aggressive than either of the albums that came before it. The revered storyteller of previous releases is still here, but this time something’s different. This time, he can hear the muffled pounding of a war drum in the distance, about to forge another batch of blood-wrought stories.\n",
        "\nBe'lakor is an alluring figure. If melodic death metal were a nuclear family, these Aussies would find themselves notched up to other successful groups within the sub-genre like Insominium, Dark Tranquillity, and Omnium Gathernum—they take a lot from these bands, in fact. Be'lakor began making waves back in 2007 and 2009 when they released \"The Fragile Tide\" and \"Stone's Reach,\" respectively, to critical acclaim and oceans of praise, paving the way for the band's third album, \"Of Breath and Bone.\" Without getting too bloated, this is pretty damn good. Be'lakor's style of melodic death metal is incredibly rich and dynamic, building each of its towering anthems (none lasting shorter than six minutes) with intricate layers of harmonized guitar work and song structures which run beyond the usual bargain-bin melodic death metal uniformity.\n\nSimply put, Be'lakor and \"Of Breath and Bone\" are fantastic alternatives from the norm this habitat tends to offer. Be'lakor writes songs that are ridiculously complex and layered, boasting multitudes of melodies, harmonies, riffs, and transitions which reek of progressive influences crashing smoothly into Be'lakor's atmosphere within each piece. Although an approach like such often leaves a lot of repetition or redundancy, \"Of Breath and Bone\" doesn't have problems. The band tends to churn out many sections and chapters per song, yet everything comes with a sign of vitality: that what they're doing is necessary, and the album wouldn't feel as whole had certain parts been removed. In essence, a lot happens, and it's a long record, but there's a point to it all; not a lot of groups are ambitious and successful like Be'lakor.\n\nThey often spend time producing captivating lead guitar melodies hovering over rhythm sections before exploding into standard melodic death metal riffs and then evaporating into interludes that are soft, chilling, and introspective, perhaps. It's actually a fairly formulaic record at its core, although the whole configuration is, of course, boasting several worker bees per hive, so to speak. \"Of Breath and Bone\" is enjoyable throughout, but the final songs (especially \"By Moon and Star\") are equal parts mythic and harsh, making Be'lakor's sense of loss almost tangible—they are overall fantastic. The guttural vocals are sufficient, not quite reaching the level of ingenuity and elegance that most of the album preaches, but they are, as I said, sufficient; they do what they need to and nothing more. \n\nAlas, Be'lakor has forged an album that feels like an ethereal journey through the depths of emotion, captured by the group's incredible ability to inject somber, emotional passages into the strident infrastructure of \"Of Breath and Bone.\" The equation used has a lot of flexibility, and every track comes out with its own skin and mask, showing that this elongated support can justify the essence of Be'lakor. I personally find the record a remarkable changeup from the expected melodic death metal output; it's definitely more parallel to Opeth in spirit or Insominium than The Black Dahlia Murder clone #35345634632342323. A sudden oasis in an asphyxiating wasteland, \"Of Breath and Bone\" has summoned Be'lakor into the royal court of melodic death metal. It's a long way to the throne, but we all have to start somewhere, right?\n\nThis review was written for: www.Thrashpit.com\n",
        "\nBe'lakor are a soulless Dark Tranquillity clone who have managed to suck all of the life out of melodic death metal. They use a template of the general sound of more recent DT mixed with the slightly atmospheric, doom-tinged emotional approach of Insomnium. They're best compared to those Finns, since their style is to make plastic-sounding, lame melodeath that sounds like the skeleton of Dark Tranquillity after having the meat stripped from the bones and the soul swallowed. This is boring, uninteresting melodic death metal. \n\nThe vocals are monotonous death growls, lacking inflection and passion. One thing that makes this type of music stand out is a vocalist who exudes passion and character like Mikael Stanne, where the delivery and enunciation of a growl deliver emotion and feeling. This vocalist has none of that, only a slight enunciation that makes each syllable almost intelligible and occasionally dragging a word to indicate that he knows that growls can be more than mere barking, but he never does otherwise. The same problem with delivery comes through in the guitar riffs - there's no feeling in the phrasing, rather the emotional atmosphere seems to be conjured in production, and it just doesn't feel right. There's a riff at the end of \"Fraught\" that clearly shows the Swedish influence, but it's presentation falls completely flat - it's repeated many times with no variation and quickly turns around the feeling of potential as it goes nowhere. Even a slight tail-end variation could improve it, a lesson they could take from In Flames' \"The Jester Race\", but they keep driving these riffs hard, playing them too many times without a feeling of variation, not even the natural shift in feeling of production that isn't excessively polished, layered, and edited. This feeling similarly hurts the production - it's implying a feeling, but the music doesn't reflect that. There are bands who go for the same feeling, mostly melodic death/doom, who nail it in both the music and the sound, but Be'lakor lack the edge they need in production and the feeling they need in the music.\n\nThe songs are long, not out of necessity to deliver their message, but because it seems like the band wanted to play each riff twice as much as it needed to be played because they couldn't figure out how to write enough transitions in the first place. This feels like a collection of riffs assembled from tablature. There are clean parts that are starved for anything but mechanical perfection, but they're so dry that they might as well be a nicely-toned synthesizer rather than an actual guitar. The pursuit of mechanical perfection in production is a bane to music that tries to capture and deliver the emotion of a performance, any passion in these performances is lost and carpeted with a synthetic, somber, solemn sadguy feeling that comes only from mixing the ambiance of the guitars in production. \n\nThere's a certain, essential part of melodic death metal that this simply lacks. It's not diminished, it is simply nowhere to be found. The key section from \"In Parting\" that loses the emotion like a MIDI version would suck the life out of the keys in Dark Tranquillity's \"Cathode Ray Sunshine\". This music is plagued by the synthetic feeling of the recording and the lack of passion delivered by the performances in the final product. This has already been done way better by many others, so there's no reason to listen to this album instead.\n",
        "\nThe realm of melodeath has been changing monarchs ever since its inception. From the magnificence and perfection of Heartwork-era Carcass, to the reign of the three Göteborg kings during the mid to late 90’s, then the irruption of the melancholic Finnish hordes at the turn of the Century, with Insomnium at the helm, and then the hegemony of the Viking overlords Amon Amarth in this more recent era. There have been some non-Scandinavian contenders to the throne, at least in my history book, like barbaric Dutchmen Callenish Circle, but there’s no arguing that the capitol of that musical kingdom has always been situated in Europe… until now. A tribe of Down Under marauders collectively known as Be’lakor has been patiently stalking in the shades, ready for the ultimate strike. And that’s precisely what their amazing third album, Of Breath and Bone, is. The melodeath throne might have a new regent. \n\nIt’s not that surprising actually, as the Australians have been steadily marching towards greatness ever since their formation. Their solid if somewhat unimpressive debut The Frail Tide already showcased their progressive tendencies and extended but compelling compositions, though they improved greatly on their sophomore, the outstanding Stone’s Reach, which laid the strong foundations on which this album stands. Their style hasn’t changed at all, but it has now been perfected, as I found Of Breath and Bone a notch tighter and more fascinating than its predecessor. The tracks remain long and complex, bearing multiple changes in pace and mood, seven of the eight pieces of music here lasting six minutes or more. But whereas some songs on Stone’s Reach felt a bit uneven and patched, all the compositions here show direction and cohesion, the transitions between different sections flowing beautifully.\n\nEven the cover artwork here is superior to the ones used on past albums, not that I have anything against the iconic Benvenuto Cellini’s “Perseus with the Head of Medusa” sculpture. But there’s just something inherently captivating in this Red Riding Hood portrayal, the bread-bearing girl confidently smirking at the menacing mongrel at her side. A classy and eye-catching cover image, probably my favorite one among albums from this rapidly dying 2012 year. Sophistication and good taste is also found in great measure on the music here. The guttural vocals, riffs, guitar patterns, vast array of keys, drum fills and bass plucking might not be the best ever, not overtly innovative, but everything here is combined in a highly effective way to create epic pieces of melancholic, absorbing melodeath. Perhaps the rhythmic section is a bit shy compared to, say, the battering of Amon Amarth, but it works fine, bringing variation and a sturdy backbone for the excellent guitars and tasty keyboards on top. There’s A LOT going on in each song; great harmonies, calm pianos, acoustics… even narrating grunts. The accomplished clear production works amazingly for this style.\n\nYou can’t go wrong in listening to the whole album from start to finish, but each and every song here is a lush world to explore on its own, even if they share the same style of chiaroscuro expositions of emotional and musical endeavors. The lyrics are another highlight, most of them abstract forays into the mysteries of life and death, night and day, sorrow and joy, the universe and the mind. A notable exception is my favorite track of the bunch, “In Parting”, a tale of two sibling birds separated by fate and reunited in a tragic end. Excellent stuff, as the music it accompanies. Opener “Abeyance” and “The Dream and the Waking” are also personal favorites, but I don’t think there are weak tracks here. A bit of trimming and a more climatic ending could have been applied to the closer, “By Moon and Star”, but it has a great deal of interesting moments. Even the interlude “To Stir the Sea” works marvelous as a midpoint in the album, as well as a moody introduction for “In Parting”.\n\nPerhaps to call Be’lakor the new and undisputed kings of melodeath is going too far, as there are several styles within this genre. So if your preference of melodic death metal is more of the über-brutal, blunt and, to me, ultimately dull The Black Dahlia Murder-type, then you might not appreciate this that much. It is also not too technical or flashy, as something by Arsis or the like. On the other hand, if you enjoy Insomnium, Noumena, In Mourning or similar bands, this one’s definitely for you, my fellow metal brother or sister. For me is definitely one of 2012 highlight’s, my favorite melodeath album of the year. And yeah, I do consider now Be’lakor the band to beat, as the last releases by both Amon Amarth and Insomnium were a bit underwhelming. I totally recommend you to get this!\n",
        "\nI might draw the line at describing Be'lakor's 2009 sophomore Stone's Reach as an iconic masterpiece for the ages, but there's no question I enjoyed the hell out of that thing, and found it one of the better examples of its class of post-Opeth, progressive-tinted, Scandinavian influenced melodic death metal in the past decade. The Australians more or less continue this theme through their latest, Of Breath and Bone, and once again it's festooned with a dichotomy of surging, triumphant moments and tranquil, almost folkish segues that invoke an adventurous landscape upon the listener. Granted, a lot of folks are pretty spent on this sort of hybrid, but Be'lakor performs it as well as just about anyone, and those seeking a more graceful, grandiloquent alternative to Finns Insomnium or Viking brutes Amon Amarth will find this a shore worth conquering.\n\nIt almost stuns me how effortless these gentlemen imbue the surges of chords with constant, meandering melodies, almost as if they were just cutting their wrists and letting it flow out naturally. They generally favor pretty long tracks, around 8-10 minutes, and there's quite a lot of composition in each, to the extent that I'm impressed they can keep all of these melodies in their memories for performance. I'm not normally a staunch proponent for such excess, and Be'lakor might be better served in clipping off some of the appendages, but overall they do a decent job of not boring the listener throughout each excursion. The folksy, classically inspired pieces are well written and provide a welcome counterbalance to the harder passages, though they don't always forge themselves into memorable terrain. The instrumental interlude \"To Stir the Sea\" is a good example, with flutes, acoustics and synthesizers that are cutesy but hardly hypnotic in structure. No, the Australians are far better when meting out miles of moody melancholy through a duality of chords and ringing melodic architecture which is well on par with their Swedish and Finnish forebears.\n\nThough I enjoy the clean production of the rhythm section, and don't find the pair lacking in terms of their prowess, I do feel like they're constantly being outclassed by the guitar progressions, pianos and other atmospheric glints peppered about the corpulent 56 minute run time. Considering the band's sheer sense of extravagance, it'd be a positive to let these two experiment more, because as it stands I felt like I was too reliant on the guitar's melodies to really rip through my memory, which only happened about half the time I was listening through them. The guttural vocals are quite a contrast to the music, because they lack the sense of intricacy and overpower you with a gruff inflection quite familiar to those who enjoy Johan Hegg, Taneli Jarva (from his later Sentenced recordings) or Niilo Sevänen, and while this is not a huge problem, they're often too similar to other bands to really hold their own for long. The lyrics are quite good though, with a surplus of thoughtful, introspective imagery aligned to the sad emotions of the guitars.\n\nThere wasn't a song among these eight without something interesting happening somewhere; but I'd point out \"Fraught\", with its Amon Amarth-like melodic death/thrashing tensions, and \"The Dream and the Waking\" with its triumphant, twilight haze of guitar harmonies as particular standouts here. They definitely have a Scandinavian sensibility inherent to their more exotic note sequences, though I would say that they should attempt to branch out a little further, because there is some degree of predictability to how these bloated pieces play out. Of Breath and Bone is a very consistent album, with oodles of riffs through its course, but they tend to remain within a certain safety zone. Added dissonance, wilder percussion, or a more alien architecture threaded through the melodies, would contribute greatly to some of the melodic choices and provoke something far more than a Melbourne mirror to Northern Europe. All told, Of Breath or Bone hung a little lower on my attention span than its predecessor, but it's still worth hearing if you've held out hope for this niche, or if you crave more along the lines of Across the Dark, One for Sorrow, Twilight of the Thunder God, Morningrise or even mid-to-late 90s Katatonia.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nOf all the great albums this year, I have to say Be'lakor is my favorite. The whole album flows together like Pure Holocaust, if my Gogear didn't take a second to change tracks it would sound like one big medley, and a great one. Filled with astounding riffs and (apologies for the continuous Immortal comparisons) the clean parts sound even grimmer than the icy interludes of Blashyrkh and Tyrants. This ultimately is a classic of the melodic death metal genre, running neck-and-neck with Amon Amarth's Twilight of The Thunder God for catchy doom-esque death metal.\n\nThe guitar work on this album is phenomenal, sweeping together hard riffs, mournful strides, and clean intervals. I love the Gothic short stories in all the songs, sounding morbid enough to be a poem by Edgar Allan Poe. The drums also follow greatly, pounding and blasting like thunder, and adding it's own flourish. To go back to my point on the guitars, the main riffs in Abeyance are the most memorable and wonderful riffs I've ever heard, ascending over even Tyrants/Kashmir and Black Sabbath in their brilliancy. This album is a bipolar whirlwind, going from lightning fast to a progressively slow Evoken-like plod. Be'lakor takes a true step forward in their career with this album. Not recycling from Stone's Reach, but building on that to make something much better and new. I'm already lusting for Be'lakor's fourth album.\n\nThe only real (and small) problem I have with this album is the bass. It's greatly played, but it's too low on the mix at times and seems to do that awful buzzing when you play too close to the fret bar every now and then, or maybe it's just too muddled for my novice ears to really hear. But in conclusion, this is a grand album that one will never tire from.\n",
        "\nBe'lakor present us in \"Stone's Reach\" with the epitome of progressive death metal. In the years to come (and I write this just a couple of weeks before their next release is scheduled to hit the market), I believe that it will be VERY difficult to top this effortby anyone out there in the progressive, melodic death scene.\n\nThere are several reviews out there for this cd that fault it for the length of the tracks and its progressive tendencies which appears to be to be missing the point entirely. This cd is a masterpiece precisely because of these features. Each track delivers to us so many different facets of metal as to make description difficult. If you have any love for progressive metal and can handle the low, growled vocals, this is for you.\n\nFor me, this cd has the best of all worlds. The vocals, provided by George Kosmas, are very low and dark and fit the lyrics fantastically well. Instrumentally, it doesn't get any better than this: massive riffing, haunting melodies, copious tempo changes, and superb drumming. There is variation to be found everywhere one looks. One particular feature to highlight is the use of keyboards and piano in each track, providing a great deal of somber atmospherics.\n\nThe cd is nearly a full hour in length, yet only contains 8 tracks, and one of those is a 3-minute instrumental. Needless to say, the other 7 tracks average out to be around 8 minutes each, which is yet another indication of the progressive nature of this effort.\n\nWhile it is very difficult to pick individual favorites, the 9-minute song \"Sun's Delusion\" may characterize the cd as a whole with its gorgeous, classically-inspired outro which is preceded by several melodies that will rattle around your head for days to come.\n\nThe track \"Ventator\" that leads off the cd tells a dark fantasy story with the superb use of the dark growls playing the role of the lead character in the story, and the music and cold atmosphere provide a chilling backdrop for the outstanding lyrics. Every time I listen to this track, I am transported to that dark, cold cave - truly a great experience.\n\nThis is one for the ages. Their next effort doesn't even have to come close to still being excellent, and if we are lucky enough to be treated to similar fare, we are all in for a special treat in 2012.\n",
        "\nIt's hard to dislike Be'lakor but lavishing praise on them is pretty difficult, too. It's got a very Amon Amarth-ish vibe, which is fine, it's a pull-all-stops-out attempt at being as epic and massive as possible, and that's admirable, but it also borrows a lot from the Opeth school of awkward transitions and overlong songs, which isn't really good news. There's a lot of moments- the big riff of the opening track, the pretty cool, dark power metal vibe of \"Sun's Delusion\"- that suggest this band could be very good if they were willing to keep it a bit shorter and just smash us over the head with riffs for four minutes, as opposed to eight minutes of well meaning but misguided epicness. \n\nI think maybe the problem is that the songs don't really come across as through-composed, or whatever the term is; the flow is usually descent, but the linear song progressions often come across as more of a \"fit riffs in a same tempo back to back\" combined with a lot of repetition of certain themes; most of the songs don't really seem that well thought through and thoroughly composed, which for songs of this length are pretty much vital. There's also resorting to a lot of quasi-breakdowns for \"dramatic\" parts of the song, a bunch of false endings where it seems almost like two songs where tacked together (Sun Delusion), and a few extremely similar riffs that appears a few times throughout the whole thing. All in all, these guys have prepared a 500g steak and tried eating it one bite; it's a worthy effort but didn't work too well for them.\n\nWith repeated listenings this gets harder and harder to take. You've heard that riff in Aspect a hundred times before on the album, you've heard far better mellow bits before, you've heard that melodic, proggy-ish lead bit in a hundred other vaguely epic metal bands. You've heard that 'spiky' palm muted riff a million times, in this album and every other album of it's kind.. And there's a lot of this epic, melodic death/power metal-ish stuff around.\n\nNot to say this is really bad, though. There's nothing here I would describe as \"rubbish\", the band are great at their instruments, the production is chunky and more then adequate, the vocalist won't set your world on fire but he's decent enough, and has a knack for writing strange but evocative and somewhat interesting lyrics. Overall, though, that's the problem with this album; there's nothing that's terribly bad, but there's just nothing that holds your attention to it. And really, why listen to 60 minutes of competent but completely inaffecting music? You don't need this album unless you're a massive Opeth/Amon/Nuclear Blast 'tard.\n\n(originally written for www.heathenharvest.com)\n",
        "\nI haven't had much luck in hearing decent Australian melodeath these past years, in fact I can't ever remember a standout band of this sub-genre to emerge from that corner of the world. Be'lakor is out to change this, and Stone's Reach, their sophomore album, is both immersive and entertaining. I am reminded of a mix of Opeth's more exciting, progressive death moments and the veneer of Dark Tranquillity when listening to this. There are a few cases of the familiar and throwaway melodies, but these are vastly overshadowed by the overall quality of the release. This is also one of those albums you want to listen straight through, it's quite a moody journey.\n\n\"Venator\" eases you into the somber skies of Be'lator's world with a tasteful, flowing acoustic intro, before lifting into the strong dual guitar work. One guitar is always counterbalancing the other with the proper string of chords, or plucky melody, and this persists throughout the album. George Kosmas has a brutal if average growl, but it's mixed just right and justfully anchors the sad dreaminess of the compositions. \"From Scythe to Sceptre\" opens with a big, beautiful string of melodies, almost like a stone monument being built through the grace of its guitars. If you like anything in the 21st century Dark Tranquillity discography, you will enjoy this. \"Outlive the Hand\" has some nice progressive death flourishes, the pianos well integrated with the chords. \"Sun's Delusion\" is simply glorious, the dual guitars once again impress with their constant, busy companionship. Other strong moments on the album are the angelic acoustic instrumental \"Husks\" and the epic, sweltering \"Countless Skies\" with its memorable melodies.\n\nThere are few if any flaws to this album. The production is fantastic, all vocals and instrumentation fit perfectly across all tracks, as a single one hour work the album is a travel worth undertaking. As mentioned earlier, some of the riffs and melodies may seem as if you've heard them a thousand times before, but they simply do not hinder the impressive whole of Stone's Reach. Be'lakor have crafted the very best melodic Australian death I have heard to date. The lyrics and titles are introspective and interesting, and the band sounds like they've been at this for a decade minimum.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nGaining masses of popularity in their local scene after the release of their debut record, Melbourne’s Be’lakor are back in 2009 with a stunning second release showcasing a matured and creative sound from the band – ‘Stone’s Reach‘. Recorded at Pennydrop Audio in Melbourne and mastered by Crystal Mastering, the band consists of George Kosmas (Vocals/Rhythm Guitar), Shaun Sykes (Lead Guitar), Steven Merry (Keyboard), John Richardson (Bass) and Jimmy Vanden Broeck (Drums).\n\nFirst impressions are always critical, and with the acoustic introduction to the opening track ‘Venator’, the band sets the landscape on which ‘Stone’s Reach‘ is built on. It is consistent with the bands ideals, that of nature and its struggle between life and destruction. And it is this ideal that the band enforce in full throughout the album. Epic melodies, acoustic passages and well placed atmospheric key sections are beautifully countered by faster paced marauding distortion riffs.\n\nThere are many highlights on the album, and if tempted I could easily go through moment by moment and treat all fan boys and girls to a orgasm on every musical memory here provoked in this review, however for a broader view on the album, the band has shown some foresight into the melodic death metal genre. Critics could easily say “Look, the band has clear influences such as ‘x’ and ‘y’ bands”, and while I agree to some extent, it is the vision into the future that makes the Be’lakor so appealing. ‘Stone’s Reach‘ is where Amon Amarth should go next… it is a vision that sits equal to the Enslaved direction, but most of all, it is vintage Be’lakor, through and through.\n\nPersonal favourites of mine include ‘From Scythe to Sceptre’ which has probably the most interesting guitar section on the whole album (see 1:40 into the song), while other tracks such as ‘Sun’s Delusion‘ (6:11 = wow) and Countless Skies hold epic melodies to the core. The production of the album is also of stellar repute with Kosmas’ vocals the only critique from me, and only because they get somewhat lost in the powerful duel guitar mix. The only other slight downside on the album is a couple of rough segues which are frustrating because aside from these tiny glitches, I hear next to zero flaws on an album that could well be the pinnacle of 2009.\n\nExperiencing these songs for the first time in a live environment was bliss, and on my arrival home and subsequent listening to the recorded version of Stone’s Reach, it is very safe to say that I am one very happy man, along with all the other Be’lakor obsessed metal heads out there! \n\nReview by Brendan Amos - www.metalobsession.net\n",
        "\nReview originally published at http://www.teethofthedivine.com by Erik Thomas\n\nHow in the fuck is a band like Be’lakor not signed to a decent label? (In the US anyway) Not only did they deliver a stunning self released debut, The Frail Tide in 2007, which was universally acclaimed, they have followed it up with a tighter, better produced follow up. All a label has to do is license it, slap a sticker on it and distribute it, like Candlelight Records did with Martriden’s excellent self released EP back in 2007.\n\nAnyhow, on Stone’s Reach Australia’s Be’lakor (named after a Warhammer Game character) improve on their formula that’s a somber form of synth laced, gruff melodic death/doom metal that culls most obviously from Insomnium, Slumber, Novembers Doom, Rapture and Garden of Shadows, and it’s amazing.\n\nStarting with some Opeth like acoustics and subsequent rumble, “Venator” gets out of the gate with some simply gorgeous solo work immediately highlighting the bands improved tightness and delivery, then around 6 minutes in, the band launch into a truly stunning, somber bridge that will please fans of all Finnish melancholic metal. “From Scythe to Spectre” is pure, blissful, despondent melodies wrapped in deep but eloquent Finish doom/death vocals and a more uptempo pace with a mid song acoustic break and subsequent symphonic climax to die for.\n\nI could go through each top notch song individually, but I’ll try to keep you, the reader somewhat interested. After the excellently expansive “Outlive the Hand”, the rest of the album picks up the tempo a bit, though still flocked with rending harmonies bouncing around the back bone of the music as “Sun’s Delusion”, “Held In Hollows” and “Aspect” show with a deft mix of double bass and sublime melodic layering. The crown jewel of the album though has to be 10 minute closer “Countless Skies”, which initially returns to the more somber hues of the first two tracks with a piano flocked intro that’s just mesmerizing. But then the track evolves into truly epic melodic death metal track with some of the most gorgeous riffs, atmospherics and time changes you’ll hear in a long time.\n\nHow truly brilliant bands like Be’lakor, Gywnbleidd ( I hardly think Blackcurrant Music can be considered a real metal label -no disrespect meant), The Fifth Sun, The Pax Cecilia and such remain unsigned while Century Media, Nuclear Blast and Metal Blade (generally) churn out rehashed mediocrity astounds me. Will someone step up and reward this talented act with a damn record deal?\n",
        "\nIn an age of rapidly shifting metal genres, melodic death metal in its purest form is mostly a lost art. Any band brave enough to walk this path faces a minefield of mistakes made by their forefathers. Be'lakor, hailing from Melbourne Australia, have managed to negotiate that no-man's land and craft a solid, memorable and compelling album of classic melodic death metal.\n\nA clean, proggy selection opens that album with a sound straight out of Damnation. This lulls you into a brief sense of calm until the riffage kicks in. Make no mistake, this path has been walked before by Dark Tranquillity, In Flames and many others. The thing is, Stone's Reach quenches a thirst I didn't even know I had.\n\nMelodic death is only as interesting as the riffs make it. Be'lakor bring the riffage. They also bring a nice sense of dynamics and songwriting. Unlike some recent albums in the genre (the last Dark Tranquillity and Insomnium albums, to name a few), Stone's Reach holds my interest and doesn't put me to sleep. There is plenty of rhythmic and melodic differentiation to stave off any sense of monotony.\nI am frequently struck with the involuntary urge to bang my head as I listen to Stone's Reach. Score. I hope folks don't mind if I squeeze some invisible oranges on the train.\n\nI love the vocals. The low-end death growls border on Johan Hegg territory and help prevent the descent into cheese that has doomed many a band.\nThe drumming is on-target and there is audible bass in there somewhere. There are some excellent keyboards and piano that successfully add to the atmosphere without setting off my cheese-o-meter.\n\nThe production is a bit on the compressed side, but hell, it's still stellar compared to the stuff that comes out these days. The guitar-centric sound helps to focus the attack and hold your attention.\n\nOn top of the never-ending riff parade there are fantastic leads and flourishes to the guitar work. Repeated listens bear out new details and reveal the real quality here. The disparate melodies weave together in a frequently maidenesque dance. The acoustic interludes often make me shed a tear for the days of The Jester Race.\n\nIf you venerate the holy houses of Gothenburg, then you should seek out Stone's Reach with a quickness. This is my kind of metal.\n",
        "\nThese... songs... are... too... long!\n\nThat’s the first sentence that comes to mind after having heard this album for the first time, and that’s also the first sentence that will come to mind after having listened to it for a dozen of times – because frankly, I can’t say this little wonder of Australian melodeath is memorable. Oddly, it reminds me a bit of Mägo de Oz’s Gaia, even if the two bands are far from playing the same kind of metal: the basic ideas aren’t bad, but the final product just drags on until reaching complete boredom. A pity as the musicians, the guitarists especially, otherwise seem to show some indubitable qualities.\n\nI can fully see where it’s coming from, though. Be’lakor obviously wants to play the let’s call it progressive card: long songs with complex structures, several tracks devoting a prominent place to piano, a good deal of purely instrumental parts and a piece of Renaissance art on the cover – Benvenuto Cellini’s Perseus, at least the guys must have some taste – everything points to the same direction. Of course I’d still value this kind of approach over the 113th Dark Tranquillity clone which still hasn’t understood there’s no hope of doing better than the original. But the key objection nonetheless remains: in spite, or because of its progressive ambitions it ends up sounding terribly flat. Tracks aren’t particularly fast, and while the total amount of riffs used is pretty high (I haven’t bothered to count them all) there isn’t a single one sticking durably into the listener’s head. The same could be said about the often very melodic leads; while they don’t sound bad at the time (the opening minute of Sun’s Delusion, for instance, is simply splendid), the moment after they’re all already completely forgotten. The drumming mostly sums up to vapid double bass. And if the vocals are exclusively harsh, they fail in carrying any feeling of any kind. \n\nFrankly, it’s even hard to single out better or worse tracks even after the tenth listen of this rather frustrating album. I can’t prevent myself from thinking had the tracks been constructed differently, there could have been at least a couple of majestic progressive/melodic death metal anthems here. Outlive the Hand makes a very clever use of the piano, Suns’s Delusion has this great opening already mentioned, most songs in fact feature at least a little something which isn’t totally unsalvageable, but often lost in an ocean of mediocrity. The only totally unworthy track is the acoustic instrumental Husks, which only consists in the repetition of the same three bars for almost three minutes. See what I said about uselessly long songs? While this could have constituted a hardly thirty seconds (still useless, though) interlude on most recordings, here the band extended it to five times this length. Even if musically this track hardly reflects the rest of the album (as there’s overall little acoustic guitar to be heard on it), its treatment is symptomatic of the plague cursing most of it.\n\nListening to this release one can’t get rid of the impression the bandmembers initially set their ambitions very high, most probably spending a huge amount of time writing those tracks, recording them and finalizing the production, which could be referred to as an example of both clarity and simplicity: all but overdone, with no synth abuse, sound effects, vocal distortions, to sum up free of any modernist germ, that’s probably the best point here. That I can’t seriously consider the final output as anything else than mere background music is thus a pity but sadly, that’s what it is.\n\nHighlights: Outlive the Hand (?)\n",
        "\nAt a glance at the bleak, sepia landscape that adorns the front cover of The Frail Tide, a prospective listener would be led to believe that the music or Be’Lakor reflects the mood of the cover, dark and sombre. From the very opening notes of Neither Shape Nor Shadow I realised I couldn’t have been more wrong, the CD is underpinned by beautifully produced soaring melodies and progressive song structures rather than the abrasive black metal bombardment I expected.\n\nThough I was wrong about the style of metal I expected Be’Lakor to play, I was indeed NOT wrong about deciding to review this CD. The Frail Tide is a fantastic debut from a young band with a bright future. I almost hesitate to compare the young Aussies to Slovakia’s 5 piece melodeath figurehead, Depresy, not because I don’t believe Be’Lakor measure up (quite the opposite in fact) but more because the bands are only sonically similar on one level, that is when they are playing straight up melodic death metal. Be’lakor go much further than this. \n\nIt is when the band turns the volume down that things get more tricky, and on the flip side, more interesting to listen to. Influences are worn on the sleeves, but are so diverse and widespread that there is never any sense of deja’vu. Desolation of Ares features an interlude that would not seem out of place on a Haggard CD, immediately followed by an outro that sounds as if it belongs on Opeth’s Still Life. A Natural Apostasy builds up to a wonderful duel between semi-distorted guitars and flutes that gradually grows to a crescendo. Grand piano is also used to its full extent, not just in the slower breakdowns, but frequently alongside electric guitar as an equal rather than being tucked behind or obscuring other instruments, a rarity in modern metal, indeed, pianist Steve Merry gets his chance to shine on Paths, a 5 minute piano instrumental.\n\nThe guitars themselves sound fantastic and use a wide variety of effects and tones to suit the moods of the various sections, melodies are kept refreshingly simple and catchy rather than seeking any technical approval before seeking musical effectiveness. However, this leads to one of my only gripes with this CD, the fact that some of the catchy melodies may be a bit too catchy. The most prominent example of this would be the opening track, which continually revisits variations of the same riff. The riff itself is very listenable and very catchy, but I feel that the level of repetition used in this song doesn’t fit the album particularly well.\n\nThe vocals are entirely growled, a decision which I personally think works very well as it allows the softer sections to be purely instrumental, vocals over these parts I believe would detract from the great compositional skills that this band possess. Vocal performances throughout the CD are consistently good, there is little variation, but in a band where the focus is very much on melody and song writing, this isn’t really a major issue for me at all.\n\nFinally I come to the production, which leads to my only other problem with the album. Yes, the production is fantastic, it is never easy to master for a band with so many different tones and instruments going on at the same time and I can safely say that the clarity of the disc is excellent, everything is perfectly audible, however I get the feeling sometimes the that mix is a bit too thin and favours the drums over the guitars a bit too much, this leads to a bit of a dry feeling which is perfectly common in band’s first releases and is to be expected.\n\nOverall, this CD is a wonderful listen and is very much a strong foundation for a successful career to be built upon, I had to look very hard to find any minor things wrong with The Frail Tide, and the pickiest little decisions I’ve made about a generic riff here and there or a slightly thin production should be taken with a pinch of salt for the sake of constructive criticism, you WILL enjoy this album if you are a fan of any form of metal that is a bit eccentric or out of the ordinary, BUY IT NOW.\n",
        "\nOkay, at one point you realize that human tolerance for the world works in a pretty narrow spectrum. Because of the way we're built, there are many more negative things than positive things. In the same way, there's many more dissonant and atonal melodies than there are 'normal' melodies (though I'm not saying that dissonance or atonality are a bad thing). So it goes as a result to say that 'normal' melodies are getting pretty goddamn exhausted over thousands of years of human civilization and musical craftsmanship. I say this because Be'lakor has proven that theory dramatically with 'The Frail Tide'. This is an album that rests solely on melodies that we've all heard a thousand times before, and the pleasant tingle of familiarity is hardly enough to keep any of us interested in this stuff anymore.\n\nThis album is really, really boring, even if it is rather professionally played and composed. Every note of this is something I've heard elsewhere and in at least a moderately interesting fashion. Be'lakor plays melodic death metal, but it's a really tepid and overly moderate form of it that doesn't really do anything. It's all so tied to what the audience expects, or what the audience would like that it has absolutely no personality of its own. Melody after sugary, easy to digest melody flies through the music, each less memorable than the last, and while each is pleasant enough while it's there, it offers nothing. This album is actually less than the sum of its parts. Everything is capable; the playing, the writing, the production, everything. But put it into action and it's just unbelievably stale all the way through.\n\nThere's a LOT of piano in these songs, so much that there apparently needs to be a six minute track dedicated to it. I think that I'll say now that unless you're Archaic, there is no circumstance ever where, on a metal album, a six minute piano track is necessary. Nor do we need more dramatic violin accompaniments over medium fast double bass and melodeath that just boils down to the same rock and roll conventions the genre has been rehashing ever since 'The Gallery' was stillborn onto the scene back in '95. It all feels uninspired, and above and beyond that, it feels, quite simply, very dated. I would expect this sort of thing seven or eight years ago, but I thought we got past this sort of obsessive conventionality a while ago.\n\n'The Frail Tide' isn't actively bad. There are many albums I would much less like listening to. But even those ones I don't like listening to would stick out in my mind as sucking, and Be'lakor doesn't stick out in my mind in any way. It just feels really, really lazy, and the band can easily do better.\n\n(originally written for www.vampire-magazine.com)\n"
    ]
}