{
    "Band Information": {
        "Country of origin:": "Finland",
        "Location:": "N/A",
        "Status:": "Active",
        "Formed in:": "2018",
        "Genre:": "Melodic Blackened Death Metal",
        "Lyrical themes:": "Occultism, Darkness",
        "Current label:": "Century Media Records",
        "Years active:": "\n2018-present ",
        "Number of Reviews": 2
    },
    "Band Reviews": [
        "\nWhile listening to the epic and dark soundscapes of Pantheon of the Nightside Gods you would never guess that it originates in a man's random doodling. I'd like to start by taking you on a little storytelling spree to make sure you understand the unique context that allowed Pantheon of the Nightside Gods to come into being. Belzebubs started out as a self-therapy idea for Finnish visual artist JP Ahonen, where he would just draw whatever came to mind when he would need to alleviate his stress. Turns out the stuff was too good to stay locked up in a drawer and it wasn't long until the world was introduced to Slöth, Obesyx, Hubbath and Samael, the characters that became the comic book black metal band Belzebubs. As the snowball effect brought more fans to the comics and more ideas to the creative mind behind it, even a whole Belzebubs book was released and it was only a matter of time until we all needed to hear what the four corpse-painted twats actually sounded like.\n\nNow whether you know the comic or not, you really have to shake off the humoristic expectation that it sets if you want to really relate to the music. This is top quality melodic black metal and if you didn't know where it originates, you wouldn't think for a second about chuckles and jokes. The album sounds the way Insomnium would if they decided to take a more black metal turn. It's loaded with epic soundscapes, menacing riffs and growls, virtuous guitar solos and a rich orchestral coating surrounding it all. Now the music is fictionally played by the comic book characters and God forbid should we know the real line-up but the sound references mentioned earlier could hint out towards real people... more specifically towards the elite vocalist from the aforementioned band whose growl is unmistakable . The instrumental also has me suspecting that he may not be the only member of the band involved in this project but I would dare to guess no further. But while we're on the subject of real people, you might be happy to hear of some exciting guest performances from the likes of ICS Vortex (Dimmu Borgir, Arcturus, Borknagar) and Lindsey Schoolcraft (Cradle of Filth).\n\nHaving set the expectation for the sound, lets get into more detail shall we? The album sounds dark and majestic and has a ferocious driving force pushing the songs forward. It's packed with energy and aggression and feels relentless and captivating in its power. However it's also very melodic and immersive with a lot of emphasis placed on creating the right atmosphere. I found this record tagged as melodic black metal but to me it sounds more like a symphonic melo-death record. This means there's a lot of room for the orchestral parts to shine and for some truly heart-melting guitar solos to make their way into the storm. The black metal influence is obvious though, adding that raw guitar sound into the riffs, some great tremolo picking sections and the uncompromising blasting drum section. Top it all with incredible growls, give it a progressive tinge, amp it up with Dan Swano's mixing and mastering magic and you're all set. That pretty much sounds like a bullet-proof recipe. But the twats don't settle there.\n\nStarting with the sixth track \"The Crowned Daughters\" the album takes an unexpected turn starting on a clean guitar intro. It also brings clean singing and it actually reminded me of Opeth's Sorceress album particularly the song Will O' the Wisp. The song doesn't fail to turn heavy but stays darker, slower, and soon flows directly into \"Dark Mother\". From this point forward the album keeps a black metal direction and is darker, more unpredictable and cinematic and overall more mature. Then the title track throws another curve ball with the somber piano intro and rich cinematic string section bringing the symphonic elements all the way to the fore-front. The surprise factor is through the roof, and they don't need to overload the music to get it done. It's all about timing, inspiration and giving the ideas room to breathe. Eat up another shock as the final two tracks unfold in full serene darkness of symphonic mastery without a hint of growls or metal instruments. I loved this direction that they took, kicking off out of a canon and shifting to an increasingly more symphonic and cinematic direction as the album progresses.\n\nCombining the fictional band context with the dark majestic music leads to this being the most original album released this year in my humble opinion. With such beautifully crafted music we don't even need to know the real line-up as the characters become more real than humanly imaginable. While the record streams, it's as if they evolve from the hilarious familiar figures and the music allows them to fully come to life. In just x minutes they completely won me over and I still have a hard time wrapping my head around how these seemingly simple black and white doodles could lead us on a journey of such epic proportions. I hope you can relate once you step inside the Pantheon and I wish you a pleasant Belze-listen as I leave the Nightside Gods to possess your soul!\n\nEnjoy!\n\nOriginally written for The Metal Observer: http://www.metal-observer.com/3.o/review/belzebubs-panthe…e-nightside-gods/\n",
        "\nAt first glance the musical project known as Belzebubs would seem completely ridiculous to most black metal and death metal enthusiasts; an album based on a comic that parodies black metal music and culture, complete with puns and jokes at the expense of the genre; in-jokes and Meta jokes. However while this project has had an unconventional origin (yes, even for black metal) the actual album spearheaded by J.P. Ahonen with the help of an impressive who's who of prominent metal artists which include I.C.S. Vortex (Borknagar, ex-Dimmu Borgir) and Lindsay Schoolcraft (Cradle of Filth) manages to be a derivative yet satisfying outing.\n\nThe album as a whole is a mix of melodic black/death metal inspired by Dissection with various progressive elements, the guitar work is fast, melodious and soaring, the bass is more subdued and the drumming is complex and layered. As a whole the musical chops here are all superb and do the job right. The vocal work is just as good as the rest of the performances and various sources and those with a keen ear have revealed that Niilo Sevänen of Insomnium fame is the voice of Belzebubs, he performs his usual raspy guttural growls albeit with a more forceful and aggressive delivery than his usual work in the latter band.\n\nThere’s a surprising amount of variety and experimenting on this album, which is interesting considering how much of a gimmicky novelty all of it seems, J.P. Ahonen spend no expense in giving his comic a good soundtrack, the album is at its best on the longer more epic tracks, Acheron and the title track have an operatic flair that reminds me a lot of the better Dimmu Borgir albums and Borknagar (made obvious by the fact that members of those bands show up here as guests) while still maintaining that sense of darkness shown in the previously mentioned Dissection influence, in those same long tracks there’s a lot of progressive elements like the sprawling guitar solos and the extensive use of keyboards, most of the initiated decry the use of keyboards in black or death metal but in here they’re used very well, they help in giving the epic and opulent atmosphere that this album as a whole was planned to have. The shorter tracks have a focus on speed and aggression to complement the grandness of the longer tracks, Blackened Call which was also the first promo single hits the right sweet spot of a black and death metal hybrid and in here the keyboards are much more subtle.\n\nAll in all, this is a well put together and excellently crafted album, however, that isn’t to say that this album is completely flawless, the first major issue this album (and potentially the whole project) has is how very derivative it is of other more iconic bands, I mentioned Dissection twice on purpose because the influence is very blatant, granted being influenced by Dissection is certainly a good thing but the con of this is that the album seems to lack an identity, especially if you aren’t familiar with the web comic that inspired this album, the same goes for the prog influence from Dimmu Borgir and Borkanagar, I.C.S. Votex’s feature make the song he appears on sound a lot like his work on the bands he’s known for, and that’s a problem. The main issue as a whole here is that this album isn’t all that different to distinguish it from the literal hordes of black/death metal, melodeath and progressive bands out there, this album doesn’t reinvent the wheel or try anything beyond its influences and sticking to what works and once the initial novelty of this being the soundtrack to a web comic there really isn’t much to come back to.\n\nThat being said while this album certainly falls flat past the initial impressions what I do commend about this album is how this project will work as the perfect gateway drug for any new metalhead who’s never had a taste of the more extreme side of metal, its well-produced and has enough edge to be niche while accessible enough for newbies to get into, I genuinely see this album and project working in a similar fashion to how Dethklok and the cult show Metalocalypse made death metal easy to get into. But I don’t expect this album to be heralded as a classic in any way, it’s good but I do recommend it in small doses.\n\nBest tracks: Blackened Call, Pantheon of the Nightside Gods, Dark Mother\n"
    ]
}