{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Reading, Pennsylvania",
        "Status:": "Active",
        "Formed in:": "2013",
        "Genre:": "Progressive Death Metal",
        "Lyrical themes:": "Philosophy, Nihilism",
        "Current label:": "Century Media Records",
        "Years active:": "\n2013-present ",
        "Number of Reviews": 10
    },
    "Band Reviews": [
        "\nPennsylvanian quartet Black Crown Initiate has become one of the best progressive extreme metal bands since the release of its excellent extended play Song of the Crippled Bull followed by the successful full length debut The Wreckage of Stars and the adventurous second output Selves We Cannot Forgive. New guitarist Ethan McKenna joined the band two years ago while the drumming position is still an issue but the band has been releasing five different singles over ten months leading to the release of Violent Portraits of Doomed Escape.\n\nThis third full length effort that comes four years after its predecessor is a logical continuation of the previous outputs. The band still combines calm and melodic passages based upon technically appealing guitar harmonies and emotive clean vocals with energetic outbursts around unchained harsh vocals, brutal riffs and a dynamic rhythm section. The instrumental work has become even more progressive over the past few years as even the most brutal riffs have complex chord progressions. The rhythm section has become more adventurous, experimental and playful as well. Despite a few shorter tunes, especially the song writing in the longer tunes has become even more ambitious than before.\n\nThese are the reasons why this album in particular needs a few spins to unfold. The complex opener ''Invitation'' with its numerous sudden breaks and the complicated ''Holy Silence'' would have benefited from a more concise song writing with less ideas and a more compact running time for instance. Especially the opener starts the album on a rather complicated note and would fit much better towards the end of the record.\n\nThere are no immediately appealing tunes such as ''A Great Mistake'' or ''Belie the Machine'' on the two predecessors but the band hasn't lost its ability to mix ambitious ideas with fluid songwriting. The atmospheric, coherent and structured ''Trauma Bonds'' flirts with post metal elements and fluently combines melodic parts with harsh outbursts. ''Years in Frigid Light'' similarly contrasts unchained growls breaking through noisy instrumental work with appeasing, calm and floating passages domineered by comforting, dreamy and fragile clean vocals without forgetting about instrumental transitions that keep the ambitious songwriting together. The latter song can be considered the album's highlight and has appropriately been chosen as first single.\n\nFans of Black Crown Initiate's predecessors should also like Violent Portraits of Doomed Escape. The band's ability to contrast brutal extreme metal outbursts based upon complex riffs and unchained growls with calm passages around acoustic guitar tones and dreamy clean vocals still shines on this output. Since the musicianship has become even more technical and the songwriting even more ambitious, the new tracks need even more time to unfold than usual. The record even includes a filler with the weird nerve-firing throat-singing interlude ''Bellows''. Still, the final result should appeal to fans of old date and Violent Portraits of Doomed Escape would also be an appropriate starting point to discover one of the world's greatest contemporary progressive extreme metal bands.\n",
        "\nThe nice reviews on previous releases can trigger several feelings, both within the band and the listener. While on one hand such situation can originate some anxiety and pressure in a band that is about to include one more item in their discography, not forgetting that this can also be an ignition to do even better and bolder things, on other hand the fans want the next work to be even better than the previous one, thus creating an expectation around what comes next.\n\nNow, this applies directly to Black Crown Initiate, a band that released the third album and had a leap to the mighty Century Media Records. But, and we'll see next, there's nothing to fear: “Violent Portraits of Doomed Escape” is a record full of creative, adventurous, balanced and intelligent sense.\n\nOver about 50 minutes, the group put on this album everything prog metal needs to win over the most demanding music lovers. The main aspect that we can take from here is the structural balance that inserts aggressiveness and smoothness in the same plane. That is, alongside complex guitars, which sometimes lead us to djent / modern metal, and horrifying growls that are generated from the singer's core, we're also invited to sentimental and melodic moments done by a bright guitar and clean vocals. It's as if Opeth and Enslaved on one side were composing with Pain Of Salvation and Borknagar on the other.\n\nIn addition to all this mixture of influences - which should be seen as a compliment and not as a copy, because Black Crown Initiate are very particular in what they do -, they expand their prog metal with the inclusion of brief and beautiful acoustic guitars in “Invitation”, exoticism in “Holy Silence” that reminds us of Jinjer and Leprous, some kind of throat singing in “Bellow” and a whole bunch of components in “Death Comes in Reverse”, the most strange, experimental and moving track of the album, working as some sort of space ritual mainly because of the alien keyboards, as if something was on our trail.\n\nWith an album that will only be fully perceived and felt when heard and not when read, “Violent Portraits of Doomed Escape” will perhaps be considered one of the best prog metal albums of 2020 and will certainly earn the respect of their peers and, most importantly, of music worshipers, whether they're new or old fans.\n",
        "\nI’ve heard of Black Crown Initiate a long time ago, but for years they were lost somewhere on my to do list, and I never got around to checking them out. In the aftermath of the devastation and havoc wreaked by their tempestuous new record “Violent Portraits of Doomed Escape”, I felt it fitting to get around to hearing what this band is actually about. After several listens of the band’s third effort, I have come to the conclusion that if the likes of Obscura, Archspire or the myriad of technical death metal bands signed to The Artisan Era decided to collectively go to therapy, the average result would sound more or less like Black Crown Initiate. “Violent Portraits of Doomed Escape” sounds like a mature and even elegant take on the adrenaline driven styles of progressive and technical death metal.\n\nBased on some quick spins of the band’s back catalogue, the new record doesn’t change much stylistically compared to the first two. However it does seem more balanced compositionally and better delivered sound-wise. Considering the four year hiatus, I expected more would be different, especially in such a forward pushing genre, but it seems the band’s journey was one of refinement and self improvement as opposed to one of experimentation. Born out of difficult times, this record could very well be a reflection of the life experience that each of the band members went through during the last four years, but most of all, it’s a loud, roaring and powerful end result. However this extreme side to the music is not obtained at the expense of sacrificing any musical expression, quite the contrary, this album is one of the most emotionally diverse records I’ve heard in the genre, balancing out the brutality with clean sections and a melancholic tone. Upon first listen I almost felt like if Opeth had decided to go technical death metal, this would be the result.\n\nThe band’s sound is a puzzle of yins and yangs, alternating in a beautifully cohesive whole. The extreme side of BCI relies on roaring guitar riffs and corrosive harsh vocals, backed by a drum performance that alone could replace a full commando squad. The riffs are very precise and punctuated, not always having to run around the fretboard, and the solos are also somewhat tempered. There’s also some slight use of dissonance creating tension in the guitar melodies.  The harsh grinding tone of the guitar is a key aspect that allows the music to be aggressive and hit hard without having to be ludicrously technical all the time. The overall approach is tasteful and balanced, fitting the mood of the songs primarily, and blowing holes in the listener comes as a lesser priority (though rest easy, you will be somewhat bombarded anyway). The drums instead are the primary drive of extremity on “Violent Portraits”. There’s some use of shattering blast beats but the most often used is the double kick pattern, however also coming in triggered spurts oftentimes, instead of just a constant grind. This allows for great dynamics and grooves to engage and captivate the listener, even from the first listen in some songs (see “Years of Frigid Light” or “Sun of War”).\n\nThe counterpart to the cathartic scream of this album comes in numerous clean sections both in the instrumental and vocal departments. Alongside frontman James Dorton’s roars, guitarist Andy Thomas delivers clean vocals that contrast nicely and effectively. Vocal dynamics are amazing and well adjusted to the changes in the instrumental. From the opener “Invitation” the bipolarity gets noticed as all heavy elements crash down on the listener simultaneously. The aforementioned “Sun of War” is a perfect display of the two faced musical identity of BCI. Clean guitar sections are also prominent here as they are on the likes of “Trauma Bonds” and “Holy Silence”. It gets even better when the two faces merge together with clean vocals over extremity such as in the beginning of “Holy Silence”.  Alongside the clean sections the bass lines become more obvious too, showing a similar approach to other techy contemporaries such as Ne Obliviscaris or even Beyond Creation. \n\nBy now you can probably tell that there are plenty of different stuff happening in this album, which makes it all the more admirable how orderly and well structured it appears. Again, the lack of utter chaos is somewhat atypical to the technical side of death metal, but it works for BCI and it doesn’t compromise the adrenaline shot, but arguably even makes the songs more memorable. It’s hard to say then, who would be BCI’s target audience. For modern tech and prog death standards, they appear to me less extreme than the norm, but for fans of any other genre, they are quite forward pushing, and the clean vocals in such a context are bound to be perceived with contrasting opinions. I find it more likely that not fitting into a category will increase the fan base rather than reduce it, because this album is just brilliantly written and executed. But better yet, you can test the water yourself. Try out “Violent Portraits of Doomed Escape” at Century Media, or stream it on YouTube or Spotify.\n\nEnjoy!\n\nOriginally written for The Metal Observer\n",
        "\nI only encountered this album through the recommendation of a friend. Perhaps I should listen to his advice more often. Black Crown Initiate were...initially...a band I wrote off as another stale deathcore band, mainly due to the moniker. Oh, how foolish I have been! This is not even their first release! The Pennsylvanians had previously been crushing skulls with their 2014 full-length debut \"The Wreckage of Stars\" - but 2016 sees the quintet grow in stature and maturity. \"Selves We Cannot Forgive\" is by no means a cheerful affair, but by the end of its 51-minute duration, you'll be asking yourself where the time went. \n\nWhat's on the menu here is progressive death metal a la Opeth, with a generous dose of Hate Eternal in the more extreme sections, and tinges of late-90s Death with regards to the lyrics and song structures. These are only influences however. In truth, Black Crown Initiate have carved their own sound with plenty of room for expansion. The dual vocal approach of James Dorton's growls and Andy Thomas' streamlined cleans is of their own making, for sure. Never blurring, they always hand the vocal duties to each other like a relay baton. Dorton in particular deserves praise for interesting word patterns that are simultaneously complex and catchy.\n\nProduction values are generally pleasing - though the sheer jump in volume between the quieter, acoustic sections and the surrounding death metal maelstrom is almost too much. This album thrives on its ability to switch between full-on blast-beats and soothing ambience without it seeming unnatural. The tranquillity of \"Matriarch\", leading into the tragic finale of \"Vicious Lives\" is one of the album's more beautiful moments.\n\nThe songwriting is flawless, and reeks of Chuck Schuldiner. The tertiary structure applied to most tracks means that each refrain is memorable. But there's enough space between choruses - chock full of intriguing twists and turns - to keep things progressing. Much like Death circa 1993, it's impressive to hear the bass feature so prominently, carrying melodies of its own. The middle section of \"Again\" is especially notable: hear how the bass plays variations on the main riff underneath the broken guitar chords? Genius. It's admirable to hear a band who pull of multi-textured songwriting in this way, whilst crafting songs that stick with you upon repeated listens.\n\nIf I had to pick any highlights, the moving title-track, along with the melancholy \"Sorrowpsalm\" take the cake. The mammoth \"Belie The Machine\" is also one hell of a voyage. Its 9-minute duration is no hindrance at all, as it swells and dips through different dynamics with ease (also, 5-minutes in, there's that bass work again!). The purest form of death metal can be heard in the vicious \"Transmit To Disconnect\" - which ironically took the most time to grow on me.\n\nIt's difficult to guess where this band will go next - though I hope they continue to expand upon the melodic ideas of this album. Try not to listen to one track in isolation, this record definitely works best as one coherent piece of art. The first half is an unhurried surge of volume, but by the end, the sheer dynamic range has left you breathless. The artwork may not be much to shout about, but Black Crown Initiate would have a better time crafting their image on their music. Technically en pointe and atmospherically immersive, \"Selves We Cannot Forgive\" is another contender for my exclusive 'Top 10 albums of 2016' list.\n\n\"Eternal, infernal.\nDesperate human alive.\nConscience cannot survive.\"\n",
        "\nOn its second full length release, American progressive death metal quintet Black Crown Initiate has further decreased its death metal roots to adapt a more progressive vibe based upon hypnotizingly melancholic melodies. Atmospheric instrumental parts and relaxed clean vocals dominate this intellectual record. \n\nMany tracks start with calm instrumental parts that can last more than two minutes before the tunes actually start to sound like extreme metal music as in the case of the very representative title song \"Selves We Cannot Forgive\". This track even features some beautiful piano melodies, jazz rhythms and post rock vibes. Still, the numerous introductions on this album never sound boring, exchangeable or pretentious and always add to the atmosphere of each tune. \n\nThe acoustic guitar and guitar solos even recall progressive rock groups of the seventies like Gentle Giant and Yes in tunes like \"Again\". It's not a coincidence that the vinyl version of this record contains a cover of King Crimson's \"Fallen Angel\" either.\n\nThe enchanting, introspective and melodramatic vibes are occasionally interrupted by efficient death metal outbursts with low growls or high shouts, thunderous riffs, heavy bass guitars and a technically stunning drum play that adds some welcome blast beat passages to an otherwise slow record as in the diversified album highlight \"Belie the Machine\". This masterpiece sounds much shorter than its actual running time of nine minutes. On a side note, this track's chorus is one of the most beautiful things I have heard all year long.\n\nA perfect example for the band's overall mellower sound described above is the album closer \"Vicious Lives\" that was streamed before the actual record was released. The tune takes three and a half minutes to build up an appeasing, natural and almost sacral atmosphere that recalls the calmer moments of bands like Anathema, Opeth or Solstafir. It takes far more than a minute before clean vocals kick in that remind me of Depeche Mode. Acoustic guitars and slow tribal drum passages slowly amplify the sound that leads to an emotional outburst with vivid drum passages, powerful riffs and liberated clean vocals for about forty-five seconds. The track then ends with a droning sound of static that goes back to the heavier opener to come full circle. In its structure, the tune recalls some more experimental tracks of contemporary In Flames. This kind of song might not be what death metal purists are looking for but anyone who likes profoundly emotional rock and metal music should recognize the high quality song writing behind this brilliant closer.\n\nDeath metal fans can still find a few heavier tunes like the diversified, engaging and very focused opener \"For Red Clouds\" where deep growls, passionate shouts and hypnotizing clean vocals harmonize perfectly. Still, even this heaviest tune on the album would have been among the calmer tracks on the predecessor. This opening track seems to go back to the band's roots for a very last time while the rest of the album becomes progressively calmer and ends with the smoothest tune that seems to indicate a bold future. \n\nEven though an obvious hit like \"A Great Mistake\" is missing on this sophomore effort, Selves We Cannot Forgive is overall slightly better than the predecessor because each song is close to perfection and follows a clear and coherent structure of emotionally driven melancholy. The album as a whole is a real grower and best enjoyed in a dark room with your headphones on. The more one listens to this release, the more sense it makes. This is definitely a big step in the right direction for this young band that already manages to craft a very distinctive sound. This record should be a rock solid candidate for the top spots on the lists of the best records of the year for anyone who likes progressive extreme metal.\n",
        "\nUp until listening to this album, Black Crown Initiate was never a band that managed to claim me as a fan. I always thought their music was good, but it never interested me enough to earn all of my focus. With that being said, \"Selves We Cannot Forgive\" commanded the entirety of my attention, and refused to let go until it finished playing. \n\nThe albums production is great; everything is balanced, crisp and pleasing to the ear. My only complaint is that the distorted guitars sound a tad digital to my ear at points, but that's far from a deal breaker and it in no way taints the listening experience. \n\nMusically, \"Selves We Cannot Forgive\" delivers exactly what a death metal fan could want with a refreshing, creative twist. The riffs are technical and interesting to listen to without being obnoxious. Each instrument is utilized in a cohesive manner as well as in a way that allows each instrument to speak with its own voice. No complaints here. \n\nWhere this album stands out is within it's dynamics. While Black Crown Initiate is outstanding at delivering the brutal metal goodness that we all know and love, they aren't at all afraid of the use of clean guitars and clean singing. For a progressive death metal band, that's no groundbreaking feat; however in this case it's done in a way that blurs genre lines and pushes musical boundaries. No moment on this album felt predictable or used, which is a difficult feat to pull off for most bands. \n\nWhat really sold me on this record was the vocals. The growls, highs, and cleans are delivered not only with precision and with excellence; but they are executed in a way that separates Black Crown Initiate from the rest of the progressive death metal genre. The vocal melodies and harmonies are astounding. Not only are they catchy, but they're emotional; and that emotion comes across so strongly that it draws emotion out of me. \n\nSelves We Cannot Forgive made me feel. A death metal record hasn't done that to me in a long time. It's familiar territory which is executed in a refreshing way with a creative twist. Listening to this album is a raw, emotional experience that carries the listener in a variety of directions. Not a moment is generic, dull, uninspired or without soul.\n",
        "\nThe problem with a lot of technical and progressive death metal bands is obvious: blatant skill show-off, while maintaining the traditional (but always same-sounding) death metal song structures. Although a good part of these bands save themselves with creative chord progressions, unusual rhythmic patterns, or simply - but most importantly - soulful playing (yes, those bands exist) - unless you're an absolute aficionado of technical music - you will find yourself trapped in a closed room with a present, monotonous smell filling your lungs. If you breathe it for long enough, you will possibly start enjoying even the most masturbatory and mindless noodlers such as Brain Drill. And even if you're not into that, even as a tech-death fan (I myself am one) you can agree with me that there aren't many absolutely unique bands.\n\nWell, this is certainly not the case for Black Crown Initiate. They have created a masterpiece with \"Song of the Crippled Bull\". The mix between in-your-face death metal, black-metal-esque atmospheres and contemporary prog works so incredibly well, maybe perfectly well. And we're only talking about the unclean parts now. The EP (namely the track \"Stench of the Iron Age\") starts with a clean 8-string guitar arpeggio, with the band joining in - including an absolutely orgasmic bass line - and beautifully executed clean vocals by guitarist and band leader Andy Thomas. So far so good, right grandma? Until the fucking mayhem of polyrhythmic death metal riffing and soul-raping blast beats happens. Fuck yes. But worry not, fans of soulful music, as you will be able to enjoy more ear-honey clean sections later on.\n\nWhile there are recurring motifs throughout the EP (particularly noticeable in the clean vocal lines and the solos), it is still musically very diverse. The structures are always different: no verse-chorus-verse or such to find here, the EP progresses like a classical symphony and remains interesting for the whole 21-minute run time, with the songs flowing into each other seamlessly. Lyrically, this album falls out of the death metal norms as well, standing in a line with superstars Opeth.\n\nThe only criticisable things about \"Song of the Crippled Bull\" are two. First, the pretty unextraordinary cover. There might be a hidden symbolism behind it, but with that enormous band logo exactly in the middle, I highly doubt it, or at least it's poorly showcased. Second, it's over way too soon. While 21 minutes isn't a particularly short runtime for an EP, it surely is for this one. If it was musically less captivating, it'd be OK. But we don't want that, do we? Had they prolonged \"The Mountain Top\" (3:30 minutes, really?) or maybe, maybe thrown in another track, adding up to almost 30 minutes, it would have been perfect.\n\nIt doesn't change the fact that this EP could be the pioneer of a new, yet unseen branch of technical death metal. It only lacks the right distribution and publicity.\n",
        "\nBlack Crown Initiate is a promising progressive death metal quintet from Reading, Pennsylvania that was founded back in 2013. After the release of the EP “Song of the Crippled Bull”, the band brought out its first full length effort “The Wreckage of Stars” in autumn 2014. Over nearly fifty-three minutes, the quintet meanders from calm and introspective passages with clean vocals, acoustic guitars and extended instrumental sections to brutal and expressive parts with powerful growls, furious blastbeats and punching staccato riffs.\n\nPersonally, I adore the band’s most progressive and varied tracks. The opener “The Great Mistake” is by far the best song on the entire record. It opens with hypnotizing sitar sounds that recall their Russian colleagues Kartikeya in a positive way. The track slowly builds up with a balanced mixture of almost doom metal inspired riffs and furious drum parts before unchained growls contribute to the menacing tone. The climax of these multiple influences is the addicting chorus performed by longing clean vocals. The quintet slows down the intensity in the numbing middle part with haunting spoken word passages that almost recall post rock influences before the track goes back to its more vivid tone and ends with the exotic sitar patterns from the introduction. In the progressive metal genre, you can’t ask for a better song than this and I sincerely hope the band puts out more tracks of this quality in the future.\n\nEven though the other tracks can’t match the excellence of the intense opener, there are still several outstanding tracks on this album. “The Malignant” and “Withering Waves” are quite similar to the opener minus the sitar sounds. They feature melancholic clean vocals, harmonious acoustic guitar passages and calm instrumental sections with almost jazz-influenced parts that meet throaty growls, technical blastbeats and distorted guitar sounds that wouldn’t sound of of place on a Voivod record. That being said, the drum play isn’t just fast and brutal. While some parts are dominated by blastbeats, the drummer always plays a slower second rhythm at the same time and also brings in efficient mid-tempo beats in the more longing parts. From a technical point of view, his work on this record is probably the most outstanding contribution. From an emotional side, I’m really falling for the melancholic clean vocals and the use of acoustic guitars or the sitars in the opener.\n\nTitle song “The Wreckage of Stars” is mostly instrumental and has a very technical tone where the ferociously fast drum play clashes with numbing atmospheric guitar sounds. Despite a length close to seven minutes, the track never gets boring and has a coherent atmospheric guiding line that reminds me of instrumental progressive metal band Unbeing. It's definitely an outstanding tune on an outstanding album.\n\nThose who prefer faster and more brutal death metal tracks will be satisfied with the pitiless stomper “The Fractured One” that really takes no prisoners in three and a half minutes. “The Human Lie Manifest” is one minute longer and heads in a similar direction but focuses more on the stunning guitar work by including a beautiful melodic solo section. Both more intellectual and more emotional extreme metal fans will find something they adore on this release.\n\nIn the end, Black Crown Initiate delivers one of the best progressive extreme metal releases in recent years along with the latest outputs by Voivod, Shining, Serdce, M.H.X’s Chronicles and maybe Atrocity. The mixture of sophisticated creativity and unbound passion in the most epic tracks that convince in both the calmer and heavier tones is truly spectacular. Fans of all bands mentioned in this review should immediately check this band out.\n",
        "\nIn the summer of 2013, I discovered Black Crown Initiate, an obscure but enormously talented triplet that released an EP titled \"Song of The Crippled Bull\". Only a year later, the band announced their debut, \"The Wreckage of Stars\", was available for pre-order - I almost couldn't believe it - I know it took about two years for the EP to be composed and released, and the fact that \"The Wreckage of Stars\" took less than a single year was worrying. Inevitably my concerns were justified, and I have come to the conclusion this is truly nothing like its brilliant predecessor. \"Song of The Crippled Bull\" was distinction, merging pure death metal with black metal and contemporary progressive metal - this album is just well written generic death metal. This is not a hasty judgement on my part, and there are multiple reasons to contribute to this disappointment. \n\nThis record is fast and heavy as hell, so prepare for an intense ear drum workout. If you're a fan of Nile, Behemoth, Vader etc. many aspects of this record will not disappoint. I generally found songs like \"The Fractured One\", \"The Malignant\" and \"This Human Lie Manifest\" to be pretty brutal and well written. The vocalist, James Dorton, is an excellent singer and much like his EP performance, he doesn't drown out the rest of the band. Unfortunately, clean singer Andy Thomas does significantly less clean singing on this record than the EP, but his cleans are so well done, they absolutely lift the record into the \"progressive\" death metal subgenre.\n\nComparing this to the EP, the production on this record is pretty atrocious. I have heard the EP was a bit too 'compressed', but I couldn't disagree more. The bass was actually audible (they're almost absent here) and the guitars sounded so thick and monstrous and the drum machine was mixed really well. However, considering this band uses 8 string guitars, this record sounds excessively bright and sharp - an aspect of the album I found extremely unnecessary. In addition to failing to capture great guitar tones, the drums are mixed far too loud, so loud they were more distracting than interesting.\n\nThere is another dimension to this record that I was not expecting. Founder/vocalist/guitarist Andy Thomas has adamantly criticized technical death metal, but much of this record overtly trespasses into tech-death territory. In fact, \"Withering Waves\" is pretty much an extended guitar solo, a classic tech-death gimmick. BCI is not Necrophagist or Obscura - leave the technical mastery to those guys. As both the EP and this record demonstrate, BCI are far more comfortable playing emotive, brutal death metal with spectacular songwriting. In fact, \"Withering Waves\" reaches its pinnacle halfway through before we finally get to hear some expertly written riff which is exactly what I was after for most of this record. Too bad the moment is so fleeting. \n\nA withstanding criticism I touched on earlier in the review was the production, in particular how loud the drums sounded on this record. Which brings me to the one musician I could not tolerate - Jesse fucking Beahler. Ok, this man has his strong points - he's a beast, can play extremely fast and pounds like it's no one's business.\n\nHowever, I can say Mr. Beahler played a large part in ruining this record for me. Take a song like \"Purge\" with it's beautiful clean section, articulate singing and nice guitar effects, almost perfect, except Mr. Beahler can't seem to shut the fuck up! What is he doing? Is that a beat? It's not \"prog\" if you sound like two hookers having sex in a trash can. He can't seem to groove or do pretty much anything besides blast the shit out of his kit - someone needs to send him a Hannes Grossmann DVD so he learns how to play prog AND death metal. \n\nI am fairly upset about this record, in fact if I can return it to iTunes for my money back to buy a sandwich that I'll end up shitting, I would. Unfortunately, I am stuck with this thing for good now. The record will definitely impress newcomers who enjoy straightforward death metal in the vein of Behemoth - but for me this is a mediocre album, albeit with some nice sounds and good song structure. In fact, while BCI set the standard for 'beginner' metal bands, I do not consider their long term success a forgone conclusion, not unless they write material that faithfully reproduces (or excels) the incredible songwriting from their brilliant EP.\n",
        "\nI have a hypothesis - every decade, you come across a handful of bands that outdo everyone else. BCI is one of those bands - these fellows are incredible songwriters, and have compiled/executed an album of perfectly listenable material. This record meets the aforementioned criteria with surprising ease. \"Song of The Crippled Bull\" is a masterpiece of a record, and over the past year has captured the imagination of fans and musicians alike. If you enjoy extreme metal, this is a must have, otherwise you should just try to give this a spin anyway. \n\nThis is not hyperbole, this record is modern death metal at its finest. First of all, the guitar tone on this record is crushing; 8-string guitars have never sounded less like Meshuggah and more like what they were intended to be, instruments of destruction. Although this is a \"prog\" metal record, the riffs/solos are fairly straightforward which makes this even more interesting, because its less about being virtuosic and more about how the songs are written. Additionally, the fact that the bassist was audible was icing on the cake, and although the drums aren't played by an actual person - they're written exquisitely. Death metal drummers suffer a severe ailment, they don't actually know how to play a beat and let the music breathe - but this record does not suffer from this subtractive effect. \n\nIt is easy to write a solid death metal record - play fast. BCI have not fallen into this trap of compromising lack of writing ability with shred, and thus this record takes it time. Sure, there are blast beats and double bass sections all over, but the true power of this EP is the emotion. The interesting part is that although this band was a 3-piece, only one man, Andy Thomas, wrote the entire album. He is as eccentric and interesting a guy as I've seen, sublimely talented, well-spoken individual. This record is a very personal reflection of this character, a person who by his own admission thrives on pain. \n\nThere are just two drawbacks I can think of. First, although the guitar solos on this album are somewhat well phrased, but fairly average. I'm not as interested in playing fast as I am hearing good phrasing, but this record has neither fast solos nor particularly good phrasing. The leads just exist, although they're pretty cool, it doesn't add much to the record. Secondly, the EP is a little too short, although this is a minor point because it was intended to be this way. \n\nIn conclusion, buy this album, it is worth every penny.\n"
    ]
}