{
    "Band Information": {
        "Country of origin:": "United Kingdom",
        "Location:": "Glasgow, Scotland",
        "Status:": "Active",
        "Formed in:": "2005",
        "Genre:": "Deathcore (early); Melodic Death/Groove Metal, Metalcore (later)",
        "Lyrical themes:": "Inner struggles, Negativity, Anti-religion, Failed romance",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2005-present ",
        "Number of Reviews": 10
    },
    "Band Reviews": [
        "\nFracture is the fifth studio album from the scottish metalcore band Bleed From Within. Bleed From Within is made up of Scott Kennedy handling vocals, Ali Richardson on the drums, Craig Gowans on lead guitar, Davie Provan on bass as well as Steven Jones handling the clean vocals and rhythm guitar. Fracture was released on May 29, 2020 through Century Media. \n\nBleed From Within are easily comparable to another amazing metalcore band, Bury Tomorrow. The similarities are very noticeable from the harsh vocals. They do manage to keep their own sound and stand out as a separate band through instrumentals and the pacing of their songs. Scott Kennedy's vocals on Fracture are fucking fantastic, having a very good harsh scream while also being very easy to recognize the words he is screaming is not an easy task.\n\nFracture in my personal opinion is one of the top metalcore albums released in the past 5 years. It has the makings of an OG metalcore album feel, sounding as if it was released alongside iconic albums such as The Poison, The Fall of Ideals or Killing With A Smile. Containing all the necessary makings of a great core album. Meaningful lyrics, blistering guitars with spectacular solos, crunching breakdowns coupled alongside brutal vocals and melodic vocals as well. \n\nI would like to discuss a track I feel gives the listener a track for gauging a general feel of what Fracture is. Night Crossing, a song that features the iconic frontman Matthew Heafy of Trivium. This song has everything a new listener as well as an old listener loves about Bleed From Within. Im not going to dive in to much about the song as I want the listener to go into this with an open mind and form their own feels, however I will say it is the best from a guitar fans standpoint. However my only concern with this particular song was not letting Matt show of his vocals as I feel they would have blended perfectly with Scotts screams. His solo is fucking crazy, not like anyone expected it not to be.\n\nWhile I only discussed the one song I would like to add that Fracture has all the makings to be metalcore album of the year, and quite possibly the metal album of the year. I feel like it's impossible to give this album the justice and respect it deserves the words. 2020 has been a wild year with a pandemic, protests as well as riots. However not everything has been terrible, it is shaping up to be an amazing year for metalheads with many great albums already released, and many more great albums in the pipeline, especially for metalcore fans like myself. I personally cant think of a reason why a fan of metalcore would not be adding this album to their list. 95%. Go give it a listen, trust me when I say you won't be disappointed.\n",
        "\nI don’t core-wise dwell very often but man is the occasional breakdown blast a real treat or what? UK’s Bleed from Within have just released “Fracture”, their blistering fifth record that may cause several neck fractures through their rather consistent fan-base. The metalcore maniacs have been active since 2005 and are no greenhorns of their craft. With a well-defined sound and mountains of energy this new record is evidence of both vocal and instrumental proficiency as well as consistent songwriting skills specific to their style. That is heavy adrenaline driven music that is both engaging and melodic, with hi-fi deep sound production.\n\nThe songs on this record deliver simple overall structures with catchy choruses, dynamic moving riffs and unsurprising nasty breakdowns. As often seen in metalcore, “Fracture” does follow a few prototypes and suffer from some filler, but there’s no actual bad content on the record. The execution and vocal delivery is impeccable and the x-factor for this record is at least for me, the gritty tone of the guitars and bass, clear and deep but encompassing a less processed feel almost with a thrashy edge to it. They have a certain growly bite to the way the guitars come across, very precise and punchy, hitting you in the gut with every new riff or transition. The broken apart cut off style of the riffs with even a djent tinge or proggy patterns seeping in at times delivers this feeling to the fullest. Pack up the solid drum impact behind it and the ruthless scream ahead, and you have a sound that barely ever gives you space to breathe.\n\nBut what keeps metalcore on the more radio-friendly side of metal is of course the melodic end. “Fracture” doesn’t slack there either with intense high soaring choruses where the leading screams touch some melody and are backed by a choral shouty layer. The opening mayhem of “The End of All We Know” is a stand-out example of said epic choruses, symmetrically joined by that of closing track “A Depth That No One Dares”. Echoing effects and lead guitar themes also find their way into the songs as well as all the build-ups and wavy rotary effects that blend nicely with the maelstrom of heavy riffs. With all these complementing the heavy component, I feel like Bleed from Within sound like a less radio friendly and more aggressive version of As I Lay Dying. Now one can’t conclude on a metalcore record without addressing the band’s approach on breakdowns. Yes, they are usually predictable, meaning that you know it’s coming, but the way it develops carries an element of surprise. The snare hits and expected beat is there, but sometimes joined by more intricate rhythm aspects and detuned chords which gives it a more refreshing feel (see Pathfinder).\n\nFinally let’s look at some highlights shall we? Probably the most atypical and if I may dare say so, the best song on display here is the title track. It doesn’t change the overall approach and structure much, but has a darker, more somber overall atmosphere due to more melodies, less growling guitars and darker vocals. It comes across as a more refined and imposing way of delivering the sort of aggression associated to metalcore. Next up one can’t leave out Matt Heafy’s (of Trivium) solo on “Night Crossing”, more melodic than anything else on the record. And the aforementioned “A Depth That No One Dares” wraps up this banger on a curveball being the most diverse of the lot. It’s another one with more melody permeating through the entire track, but also benefits from a death metal blast beat topped by a more death metal tinged scream over it. If your neck resisted thus far, this is where the it fractures. “Fracture” is available now at the band’s Merch Store and on Century Media Records.\n\nEnjoy!\n\nOriginally written for The Metal Observer.\n",
        "\nBleed From Within have had a past that from what I understand, has been mostly abandoned in favor of emerging trends in metalcore. Their last album was 5 years ago and it bombed pretty hard. Now they’ve returned with a very safe album that borders on plagiarism. I suspect fame is a strong motivator for the band.\n\nSomewhere in an infinite universe there’s a bar where Machine Head and Bring Me the Horizon are listening to Slipknot on the jukebox and decided to make an album. This is that album and it’s not as bad as that sounds but it’s not great. It’s metalcore that never goes too soft (ie not post-hardcore). I enjoy most of their styles (As I enjoyed Sempiternal) but it gets boring before even halfway through the album because it’s just the same two tracks copy and pasted. Bring Me The Horizon, whatever you think of them, at least made the majority of the songs memorable.\n\nThey have a good drummer and bass player. No matter what’s going on in the song, those beats are galloping around exhibiting a variety of styles as the songs shift between genre influences. The guitar certainly has its moments as well with good palm muting control you’d often hear from a melodic death metal track. They just suffer from playing the same song on repeat. I’d like the vocals to be heavier than they are a lot of the time, there’s way too much Machine Head style clean hooks going on and not enough impact. If there was a deathcore element to Afterlife then it would be a firm banger. I have my doubts as to whether the vocalist has those capabilities however. Or that they would want to take any such risks.\n\nThey did recreate Sempiternal, they lose creativity points there for sure. They at least mostly used the parts that I enjoyed from that album and made it a bit more melo-death. Still… they could have done a deathcore version and actually be good instead of just copying it 1:1.1. You could just put both in a playlist and it would be good for a workout or something like that but if I’m marking their value as artists then I can’t in good faith provide a reasonable score for these guys. \n\nThe high points of the album are blood pumping tunes that show a lot of potential but then that potential is dashed very soon after when they pull back instead of doubling down. Repeatedly. It’s like torture to anyone who IS creative and could see exactly where to take the music at every juncture only to have the song to defy that logic.\n\nThe score is 2% for each track on the album, 1 for production and 1 for the wasted talent of the rhythm section. Minus 7 because 26 seems too high now that I’m looking at it. #shade\n\nThe album art is nice. \n\nOriginally posted on Noob Heavy (2018 album archive): www.noobheavy.com\n",
        "\nWow, for a band so eager to escape comparisons to Bring Me the Horizon (for reasons that seem purely to stem from BFW's Scott Kennedy and BMTH's Oli Sykes' having very similar haircuts), they sure are following the exact same career path.\n\nStart with a melodic deathcore album - Check.\nUse more metalcore influences on the next album - Check.\nRecord a Slipknot cover - Check.\nGo full metalcore/post-hardcore by album number 3 - Check.\n\nIf this pattern is to continue I think this means we can expect album number four from these guys to be a rehash of Sempiternal.\n\nIt's really a shock to see this once incredible band take such a huge dive in quality. \"Humanity\" is an excellent debut, \"Empire\" was also pretty solid, but this is just bottom of the barrel bland metalcore shit for fans of Enter Shikari and Black Veil Brides (which is coincidentally the exact kind of fan base I've seen posting about this band recently, how shocking).\n\nNo longer are we treated to catchy Black Dahlia Murder influenced tremolo riffs, instead we're on the receiving end of bland chuggy metalcore riffs and bouncy djent grooves, because hey if you're jumping on dying trends you might as well go the whole 9 yards. And just when you think it can't get worse they pull out the most uninspired breakdowns I've heard in a long time. The sort that make Chelsea Grin's music seem relatively intelligent in comparison. Oh what's that? There's also some \"atmospheric\" interludes? Well, fuck me, this album has exactly every trope that goes with metalcore.\n\nScott's vocals are just horrible. A horrible yelpy shout and a painful fry scream is all he can muster, but let's be thankful for that, because any use of clean vocals here would promptly leave me with my head buried in my hands. On 2009's \"Humanity\" Scott demonstrated he can manage quite a guttural and powerful death metal growl, so why did he stop using it? Even Oli Sykes still pulled out his growls on newer BMTH songs. The lyrics are typical angsty shit as well. \"I hate this, I hate that, you fucked me over, now i'm real angry about it, listen to me whine!\" basically sums it up.\n\nThe drums however aren't complete shit. There are quite a number of solid fills to be heard, such as in \"I Am Oblivion\". However, a solid performance here isn't enough to save the album from being a total insult to anyone who actually paid money for it. On that note, for a few buckaroos more, you can get a special edition with a Papa Roach cover! That last sentence pretty much says it all really. Do not waste your money or your time on this album.\n",
        "\nTo be totally honest, I like these cute little EPs that deathcore bands put out before dropping their first full-length on the market through their big bad metal label that urges the kids in these bands to be as brutal and rockstar as they can possibly desire. Welcome to the Plague Year shows a young Bleed from Within with just the right amount of music too. This is exactly why I like EPs so much in-courtesy with deathcore. It's just the perfect amount of music; not too much and not too little. Unless the deathcore band is playing really good material, it can get really repetitive on 10 track LP listening to this stuff for a half hour. \n\nI also want to mention that this is Bleed from Within back when they were a purist deathcore band. Their debut full-length Humanity, I would say us about 60% deathcore and 40% meloldic death metal while their follow-up Empire is 30% deathcore, but 70% melodeath. And wow based upon the band's newest single that they released to get the hype on for their third album Uprising which comes this spring, I would say the band is a purist melodic death metal band now. What a change, it's like caterpillar into a butterfly that didn't bloom until the spring of 2013 if you look at it that way. But, let's examine the band at their roots before all this sudden sound change and induction of melodeath came about now, shall we? \n\nThis EP is a pretty good effort in the genre, it's relatively fresh (at least for its time) and the songs themselves could easily be compared to other pre-first full-length deathcore band EPs such as the self-titled EP by Postmortem Promises, the self-titled EP by Suicide Silence and This Is What the Edge of Your Seat was Made For by Bring Me the Horizon. But in some cases, this EP even surpasses the quality of those in some aspects. I mean sure you look here and you got all the deathcore characteristics: breakdowns, you have 'em; alternating scream/growl vocals; got those too, double bass and drop-A tuned guitars; check. But it also have some things that you don't usually see in deathcore such as slam riffs and even audible bass guitar. A real treat if you ask me. \n\nNow finally, the vocals, this is something I get into last in almost every review because unless the vocals truly compliment the music in some great way, they aren't important to me. But here, they shine. Scott Kenedy's voice on here is violent and brutal as ever. His growls are deeper than that on later releases but his scream is about the same as it is on Humanity but backed with heavier instrumentation and almost no melody, it's almost like an entirely more evil vibe. \n\nIf you're used to Bleed from Within as a melodic death metal band, hearing this may be a big surprise for you. I would definitely recommend this EP to fans of Postmortem Promises, Despised Icon and early I Declare War because the music here is just vivid for an extreme metal band during their first outing. The final track on here even ends with a really long guitar solo that fades out the entire thing. Such a shame this release went so unnoticed upon its outing.\n",
        "\nOkay so here we have the new single from Scottish melodic deathcore band Bleed From Within. When this band started out they were pretty enjoyable, if not fairly generic deathcore. This is pretty much the same style. It's generic, but it's not all that likeable.\n\nThe music is solid, but not particularly memorable or remarkable. The guitarists play some chuggy riffs mixed in with melodic harmonies, and there's only one breakdown on the entire track and it's not all that long. The bass seems to just follow the guitars and the drums play a basic pattern that doesn't change significantly throughout the duration of the track.\n\nDespite the pretty mediocre backing music, I find the real flaw to be the vocals. The vocalist has abandoned his guttural growl for a hoarse hardcore shout. It sounds so forced and unappealing. The lyrics are at an all time low as well. They seem to be focused on motivating someone who's given up on life. Maybe if they were well written they might be passable, but they're not. They come off as amateurish, whiny and quite teenage.\n\nIt's a real shame so many deathcore bands who were once great seem to be dropping mediocre singles and albums this year. Already i've been disappointed by The Contortionist, Thy Art Is Murder and Upon A Burning Body and now Bleed From Within can be added to that list. Most of them seem to be dropping the death metal side of their sound and going for a straight up hardcore approach, and that's not the style of deathcore I enjoy. Well, at least the new Rings of Saturn is shaping up to be awesome.\n",
        "\nI have mixed feelings about this EP. On one hand it is a solid brutal deathcore fare, but on the other this is Bleed From Within, who hooked me in by playing solid TBDM-esque melodeath riffs. Naturally, as an EP, this is where a band is just finding their sound. Obviously they were still looking after they released this. The material here is not bad by any means, but it's hardly a good representation of what was to come.\n\nThe songs on here are long, all of them being longer than any song that appeared on the studio album that followed it, which is not necessarily a good thing. The songs on Humanity were a perfect length. Short and sweet, whereas here they tend to drag on a bit.\n\nVocally, Scott's growls are at his deepest and his screams are at their raspiest. It's almost like a different vocalist than the one on Humanity. Unfortunately, his vocals aren't as charismatic here, and they get quite monotonous.\n\nThe riffs are quite slow and chugging compared to on later releases. They do what they have to do and keep the music going, but there was certainly room for improvement. The breakdowns on this release are quite different and somewhat unique. They aren't pit rhythm chugfests. They seem to be channelling brutal death metal like Suffocation or Aborted more than any metalcore band. Closer \"Let's Play God\" also contains a solo. It's reasonably skillful, and a welcome change to the chugging brutal death metal riffs and breakdowns. The outro to this song is also a brief, albeit most likely accidental, glimpse at their later melodic deathcore output.\n\nThe bass guitar, quite surprisingly, is there! It's nothing special and the bassist plays nothing that would make Steve DiGiorgio or Alex Webster jealous, but it's certainly a nice change to having it completely mixed out.\n\nThe star, as always, is drummer Ali Richardson. This guy certainly knows his shit and his interesting fills. His blast beats are solid, his double bass is tastefully used and he certainly keeps the breakdowns interesting.\n\nThis EP would certainly have benefitted from a better production job. I know it's an EP and only the band's second release, so I'm not expecting it to have a perfect production, but everything on it seems a little muffled and on very rare occassions the drums are almost completely drowned out by everything else.\n\nOverall, a solid effort, if flawed in places. I would recommend this to fans only who've heard both full-lengths and enjoyed either or both of them.\n",
        "\nBleed From Within's previous album, 2009's Humanity, was hands down some of the best deathcore to come out of the United Kingdom, and the whole genre in general. It was shameless Black Dahlia Murder worship that still sounded better than every other TBDM worshipping band.\n\nOn this album, BFW seem to be going for a more technical approach, and while it pays off in some areas, it certainly fails the album in others.\n\nThe riffs on this are still melodic and heavy, but they really lack the spark the riffs on Humanity had. They don't seem to click as well. Some of them, however, are still fine examples of the band's talent. Take the one from Emperor for example. There is another bonus, however. BFW now use SOLOS! In deathcore! Imagine that! None of those soulless DragonForce-esque solos, though. Real, decent solos. Again, Emperor is a good example of this.\n\nThe bass, like the last release, is mostly inaudible, which is a shame, as it could've given this album some more points.\n\nVocalist Scott's vocal style has changed drastically on this album. His growls now sound more like shouts, as opposed to the deeper growls he had on Humanity. In addition, his screams are nowhere near as high-pitched as they were on the last album. He still sounds decent, but his older style had more charisma in my opinion. His lyrical content has dropped in quality too. While Humanity seemed to about the sorry state of society, lyrics on this album are more personal, and by personal, I mean reasonably emo. Take the opening lines to \"The Healing\"\n\n\"If this was my last day on earth, would you even care? Would anyone notice?\nHave I made an impact on your life? What would it matter to you if I was gone?\"\n\nThat sounds like something you'd hear from My Chemical Romance.\n\nDrummer Ali Richardson hasn't changed at all. He's still providing tasty little beats on his kit, and is still avoiding extended periods of blast beats, which many deathcore bands (and death metal bands in general) do far too often. His drumming is definitely the highlight here.\n\nOverall, it's solid, but significantly weaker than their last offering. Get Humanity first.\nHighlights: The Healing, Last Of Our Kind, Emperor\n",
        "\nThis is one of the best deathcore releases I've ever heard. Ignore frontman Scott Kennedy's Oli Sykes fringe and this is melodic deathcore at its absolute finest. Consisting of 11 tracks (including an intro) and clocking in at around 35 minutes, it's a short but relentless ride.\n\nThe main influence here (as with most deathcore after 2005) is The Black Dahlia Murder. Scott Kennedy tries to emulate Trevor Strnad's vocal style, and while Kennedy is a good vocalist, he can't match Trevor's highs. He does have some brilliant low growls, however. He also throws in some shouted vocals now and again. These might annoy you if you dislike shouted vocals, but they don't last long, so you might be able to look past them. His vocals are more often than not understandable, which is always a plus for any harsh vocalist.\n\nThe guitarists are very skilled at what they do. The riffs are heavy and violent enough to make me bang my head, while still keeping that haunting melody that makes this record oh-so-sweet! The bass is there some of the time, but drowned by the guitars for the rest, which is a problem in not just deathcore, but modern metal in general. It saddens me when a bassist gets neglected like this.\n\nThe drum work is somewhat varied, but nothing truly amazing. Fortunately, Ali Richardson avoids using blast beats for the majority of the album, something that a lot of deathcore drummers do far too often.\n\nWith this being -core, there are a few breakdowns, but they're the quick, heavy crushing kind, not those long, droning pit friendly chugfests that bands like Emmure have in spades.\n\nAll in all, this is 35 minutes of furious Black Dahlia Murder worship, not that's a bad thing. This isn't ultra original, genre-changing, groundbreaking stuff, but t is a mighty fine release. Pick it up if you're a fan of melodeath influenced deathcore. You shan't be disappointed.\n",
        "\nI got this album a couple of days ago from a CD store and have been listening to quite frequently. It was a recommended buy from a mate of mine and I am quite happy with the outcome for 15 bucks. The CD starts off with news reports of disasters and a breakdown, although I try to stay away from breakdowns this one wasn’t to bad but it stretched on a bit too long. The production is a little tinny which can be annoying in some parts and the guitars pretty much cover up the bass guitar (played by Davie Provian) but you can hear it every now and then.\n\nScott Kennedy is the vocalist and I was surprised to hear the similarities between him and Oli Sykes (Bring Me the Horizon). Fortunately he can growl as well which is a bonus. Although he does sound like Oli Sykes, his screams are harsher and less raspy. The growls are frequent and are okay but he could do better. \n\nDave Lennon and Craig Gowans are the guitarists, they are good but they don’t stand out which was a hassle, they are quite talented with creating riffs which are big part of this CD, the breakdowns (which are in nearly in every song) are good, loud and melodic. I like these types of breakdowns because they aren’t distorted, haggard pieces of shit. One thing that did stand out quite a bit was the lack of guitar solos, which is definitely annoying to any listener looking for a good head bang.\n\nFinally, the drums are played by Ali Richardson, who is quite talented, he made the album that bit better to make a good album, and he plays his drums clean, fast and of course very well. During songs like “The Fall of Man” and “This Absence” his talent stands out, especially during the start of the songs, where he starts fast.\n\nThe CD is only 35 minutes which is quite short and they could of put a couple more songs onto there to make it a great CD, but you can’t have everything the way you want it, so you have to deal with what you have and wait for the next album and hope for something a little bit more spectacular.\n"
    ]
}