{
    "Band Information": {
        "Country of origin:": "Germany",
        "Location:": "Essen, North Rhine-Westphalia",
        "Status:": "Active",
        "Formed in:": "1997",
        "Genre:": "Metalcore",
        "Lyrical themes:": "Inner struggles, Society, Love, Relationships",
        "Current label:": "Century Media Records",
        "Years active:": "\n1997-present  ",
        "Number of Reviews": 16
    },
    "Band Reviews": [
        "\nWhatever your views on the oft-maligned style of metalcore may be, you cannot deny that Caliban have undoubtedly been one of the sub-genre’s unsung heroes. They pre-date the explosion of metalcore into the mainstream, have released 11 full-length albums since 1997, and look set to outlast pretty much all of the big ‘core’ acts who attained far more attention than them. The Germans’ output hasn’t been consistent of late. 2012’s I Am Nemesis was frankly awesome, but they lost momentum with the odd Ghost Empire in 2014 before 2016’s Gravity picked it up a little. Here in 2018, the Essen quintet keep the upward spiral turning with Elements; sticking with the minimalistic album artwork and logo from the previous album but upping the atmosphere and heaviness.\n\nProduction values remain pretty much the same. The kit might be just on the right side of ‘processed’ to provide a powerful punch without sounding fake and the rest of the instruments slot into place on top – special kudos to that beautifully thick guitar tone that loses no musicality. Andreas Dörner’s growls have aged like a fine wine, packing an emotional punch as always, and turning truly beastly when backed by the gang shouts. Track three, “Ich Blute Fur Dich”, exhibits the best of this area. Not only is it the token German song (a trait that has become something of a tradition), but the vocal texture created, both in the chorus and at the 2:29 mark (‘WAS IST DEIN PROBLEM?!’) is explosively huge. Opener “This Is War” provides the listener with everything they’ll need to quench their metalcore thirst: from raging blast-beats to monstrous breakdowns. You could even accuse the band of blowing their load too early, as the first four tracks prove to be the most interesting streak on Elements.\n\nAfter the unique “Before Later Becomes Never” (brave choice for a single!) impresses with an ethereal atmosphere and colossal guest vocals from Thy Art Is Murder’s CJ McMahon, the album takes a slight structural hit. Unfortunately, between tracks five and nine, there is a slight fizzling of energy which makes the whole affair become a bit of a slog to make through in one sitting. This, of course, does not include the bouncy grooves and creative riffs of the nu metal-esque “My Madness”. I can’t help but feel that Gravity also suffered from this affliction. Perhaps ten tracks are better than thirteen and would create a more cohesive package? Thankfully, the LP ends satisfactorily with some absolute hammers like “Masquerade” and the grandiose “Sleepers Awake”. I can’t complain about the execution, but some whole tracks could be considered fodder which would benefit from having the fat trimmed. It might be a bold statement, but sometimes I feel metalcore is just not the right genre to maintain attention for thirteen full-length numbers.\n\nCaliban’s clean vocals deserve the utmost praise for walking that fine line between triumphant and whiny – more often than not falling down on the former. Even on the sticky sweet melodies within “Carry On”, I feel as far away from wincing or cringing as if I were listening to Cannibal Corpse. On the whole, Elements will keep any fan of the band happy, whilst definitely catching a few new fanboys thanks to the immediacy of the opening songs. It doesn’t innovate or reinvent, but it further cements Caliban’s reputation as one of the most underrated but essential metalcore bands around today – and showing no signs of slowing down. If I were any more poetic, I’d say it feels like a calm before a storm – as if the Germans are just doing a lap of honour before blowing us away with a potential pinnacle in the near future…?\n",
        "\nI've always considered Caliban to be among the upper-tier of the metalcore crowd - on par with the best of Killswitch Engage and the ingenuity of Threat Signal. Although Caliban opt for a more traditional take on the sub-genre, they've always provided a freshness with each release. Whether their 2016 brand of 'freshness' has turned out favourable will be the main factor of this review...\n\nIf you're a fan of the band - this is basically \"I Am Nemesis\" - Part II. Nothing to complain about in this regard; they've still got the hugely layered gang-vocals, weighty breakdowns, buzzsaw riffs and melodic choruses - with just the right amount of malice to drive it along. Thankfully, the Germans have always managed to make metalcore choruses sound substantial, and avoid becoming whiny - such is the downfall of many metalcore acts (*cough*All That Remains*cough*). Littered throughout \"Gravity\" are great anthemic choruses, aching to be live staples - \"Crystal Skies\" in particular. Unfortunately, there are just a few aspects that keep this album from joining any 'top 10' lists any time soon...\n\nIn previous releases, the enormous gang shouts had been applied to only the most extreme circumstances - \"Edge of Black\" for example - in order to SPARINGLY create a colossal sound. Annoyingly, there is far too much 'trying' to be as loud as possible on \"Gravity\" that we don't really feel the full effect of this technique. This is especially annoying now that the band have introduced a chorus that are more akin to a football crowd than a metal band. This is the kind of shit that puts me off bands like Bring Me The Horizon. This is most notable on the utterly terrible \"brOKen\" (ooh, I see what you did there! 2edgy4me). Skip this track at all costs.\n\nHowever, there's so much to enjoy on this release, it's certainly worth tolerating the few duds that crop up. The first half of the album is, by far, the superior one. Kicking off with the furious \"Paralyzed\", they've struck gold already: \"You fucking prick! Drop dead! You make me sick! Blegh!\". One simply cannot argue with a chorus like that. Also, starting straight off with a blast-beat is a new method for Caliban. \"Who I Am\" and \"Walk Alone\" both boast gigantic choruses that DON'T annoy in the way previously mentioned; \"Left For Dead\" blasts open with one of the greatest riffs in the band's entire catalogue; and each of the first 7 tracks provide breakdowns a-plenty! What more do you want from a metalcore record?\n\nThere are some neat little surprises sprinkled across the album. Track 2, \"Mein Schwarzes Herz\" not only exhibits the band's hardcore punk influences, but displays how fluid they can sound when writing lyrics in their mother tongue. The guest vocals from Alissa White-Gluz are pleasant enough, but as they soar above the chorus of \"The Ocean's Heart\", one can't help but feel her talents are being underused. Also, the beastly chorus of \"Inferno\" is a monstrous wake-up call after a couple of fodder tracks. These few highlights ensure the Germans know how to keep things from stagnating.\n\nUnfortunately, the tail-end of \"Gravity\" is pretty lifeless. Sure, \"Hurricane\" starts out vicious - but it's too little too late after the weak tracks that precede it. Also: \"Like a thunderstorm, we're unstoppable\"? What is this, power metal? However, for the two thirds of this album that are vastly enjoyable, this is definitely worth the attention of any metalcore fan. Not destined to be a highlight of 2016, but a worthy addition to Caliban's impressive discography.\n",
        "\nFormed in 1997, Caliban is a German metalcore band that has released nine full length albums throughout the career. The band started out as a rather vicious example of European metalcore, combining scaled riffing a la melodic death metal, chugging palm muting and tons of melodic guitar breaks. Over the years the band began injecting more and more modern elements into their sound, progressively moving away from the vitriolic sound of their earlier albums. The band's last few albums sound more like some bastardized form of emo-core and indie rock, but their first two albums, A Small Boy and a Grey Heaven (1999) and Vent (2001) stand testament to what Caliban was once capable of.\n\nVent, the band's sophomore full length album, is long, as far as metalcore albums goes, clocking in at just over fifty-five minutes. Where A Small Boy and a Grey Heaven balanced out the length by placing short instrumentals and interludes throughout the album, Vent allows no apparent respite (although it is there, you just have to find it). The album features only two current members of the band, guitarist Marc Görtz and vocalist Andreas Dörner, while the rest of band was a rotating door until the mid 2000's. Most of the album shows off the collision of fairly standard breakdowns and fast paced scaled riffing with a healthy amount of trem riffing added in for good measure. Much like their brethren from the US scene, Undying and Darkest Hour specifically, Caliban's sound borrows heavily from Swedish death metal, sounding more like the later years of At the Gates rather than anything hardcore punk. The album starts out, after a short introduction, with the fast paced and crushing “Fire of Night” which bounces between scaled riffing and bonecrushing breakdowns, while vocalist Andreas Dörner brings his higher pitched screams, which sound rather desperate and maniacal, something that later releases lost.\n\nThe band places a ton of melodies into their sound, as guitarist Marc Görtz throws some decent lead work into the mix sporadically, like the trem riffing and chunky palm muting versus melodic arpeggios on “Love Taken Away” and the traditional metal inspired introduction to “Roots of Pain”. The rhythm section is solid, mostly consisting of rollicking, snare heavy percussion, with liberal use of a china crash, and thumping, chugging bass lines, especially during the breakdowns, but, like the guitars, it's the faster sections that prove their worth as the drummer kicks things into a fast, galloping style. Following the trend set on A Small Boy and a Grey Heaven, the band did nestle in some purely melodic moments, although they are much longer this time around; “Happiness in Slavery” with female vocals and mellow piano lines, most notably.\n\nAll in all, though, it's fairly standard metalcore fair; it's not as frenetic and nicely structured as their debut, but Vent is miles ahead of anything Caliban has done since. There really isn't a lot that points towards the abomination this band would become. Well, I guess you could count the goofy ass electronic, techno segment at the beginning of “My Last Beauty” or the offbeat modern elements on “Tyranny of Small Misery”. The biggest offender, and drastic change from prior work, is “Sycamore Dreams” which adds truly dreadful strained emo vocals along side some banal alterna rock. Really, aside from those few offenders, Vent is a truly enjoyable metalcore album and one of the better examples of the European scene in the early 2000's. It's just too bad they got really, really bad after this one.\n",
        "\nCaliban is a German metalcore group that was formed in 1997, when metalcore was just beginning to take root as a valid metal genre. As the genre received more and more validation via popular acts like Killswitch Engage and Shadows Fall, Caliban continued toiling away. The band's first two albums, A Small Boy and a Grey Heaven and Vent, released in 1999 and 2001 respectively, were solid chunks of melodic death metal inspired metalcore. Sure there were plenty of metalcore trademarks, such as huge breakdowns and the like, but, man, could these guys play some solid riffs. Both of those albums played like stage productions, with interludes and instrumental pieces to bring some form of continuity and cohesion. Those first two albums helped cement Caliban as forerunners in the German metalcore scene.\n\nI've followed Caliban since those early days; loosely followed, but followed nonetheless. After Vent, Caliban began dabbling with modern elements, seemingly moving further and further away from their metalcore roots. Fast forward seventeen years after the band's formation. Caliban enters 2014, bringing with them their ninth full length album Ghost Empire, released via heavy weight label Century Media Records. If you've just rejoined the party after hearing the band's debut album, you're going to be surprised, but if you've followed the band then you already know what to expect, as Caliban has been doing this for years upon years. Every album after the first two, starting with 2003's Shadow Hearts, has been steadily inject more modern influences ranging from alternative rock to progressive metal. While the band has been adding these outsider influences they've remained true to their metalcore roots, to an extent.\n\nGhost Empire takes the band's hints at modernity and takes off at a dead sprint. Featuring clean vocals that sound straight off the Billboard Top Ten Radio Rock Songs, hints of early 2000 era emo and indie rock, poly-rhythmic guitar chugs and various industrialized sound samples and keyboard flourishes. A majority of Ghost Empire still sounds like metalcore, albeit a bastardized modern form, but Caliban filled this album to brim with modern elements that will, no doubt, appeal to legions of Hot Topic regulars. Take a track like “My Vertigo”, which actually has a fairly ballsy melo-death lick and double kicked drums which builds into a completely flat melodic electronic segment that loses all steam the band built up and completely kills of with utterly lame clean vocals that could have come from the latest Linkin Park album. Unfortunately the entire album follows this pattern: awesome metalcore riffing and power and then everyone drops the ball completely. The band is damn good at playing solid metalcore riffs with fast paced drums and that all-so-needed pissed off angsty sound, but they shot themselves in the feet way too much. Seriously, listen to the beginning of “nebeL” with it's Every Time I Die styled southern swagger to the riffing, but again, two minutes in, here comes something that sounds like that bullshit “Headstrong” song by Trapt a few years back. Yes, that annoying.\n\n“Who We Are” skips the whole “awesome sections” part and is just laughable for the entirety. I mean the overarching melodic lead lick is kind of cool in a way, but the vocalist crooning “Can you hear my heartbeat” over and over and over again really makes it difficult for me to take it seriously in the least bit. Like I said, the band goes from what they're good at, metalcore, into some abominable form of modern, alternative rock. Seriously, just listen to “I Am Rebellion”. I can't tell if the beginning is AFI, Duran Duran or actually Caliban. I mean this is whiny, soulless alterna rock. Really, the ultimate kick in the face is the fact that band can still dish out some freaking solid riffs and some awesome metalcore, but they forget what they are good at.\n\nEven a few of the newer styled segments work in Caliban's favor, as sections of “Good Man” showcase some progressive flair in the form of djent-styled poly-rhythmic chugging juxtaposed over a countered guitar melody. That's the thing, though, it's still heavy. When Caliban stays heavy, they are solid and punishing. When Caliban gets all whiny, they are awful. Looking back at the destructive force of Caliban's first two full lengths, it's amazing that the have fallen this far down the hill. Ghost Empire has a few sections of solid metalcore but is otherwise filled to brim with worthless cash grabbing garbage. I really miss the days when metalcore bands played metalcore.\n\nWritten for The Metal Observer:\nhttp://www.metal-observer.com/\n",
        "\nBeing relatively new to Caliban and learning they were metalcore set my expectations pretty low. I only decided to listen to this album because their cover of \"Sonne\" by Rammstein was the best cover I'd heard of it. So imagine my surprise when I'm hit with a full force wave of crunching guitar riffs and vocals to make any metalcore artist tremble in their boots, and I like it, I mean, I've always loved German things, but I love this album to bits. Germany just got that little bit more awesome.\n\nI've never really been a fan of metalcore - apart from Killswitch Engage and Bullet For My Valentine - as I've always found it repetitive and boring, however this album is nothing of the sort. It's great that they managed to create a different sound for each track, I mean, not many bands can do that. Listen to the tracks \"We Are The Many\" and \"Deadly Dream\", you can tell they're very different, mainly because \"Deadly Dream\" is played at a much slower tempo than \"We Are The Many\". Also, Mitch Lucker's guest vocals on \"We Are The Many\" help establish this album worthy of praise, seeing as they managed to rope in the vocalist of the world famous Suicide Silence, renowned for their deathcore work.\n\nAndreas Dörner and Denis Schmidt do excellent work on the vocals (Andreas being the one who screams and Denis being the one who uses cleans), as they manage to create the perfect balance between screams and cleans throughout the whole album. The guitars manage to put in some 'djent' style riffs in the album, which of course helped it improve its standing in my eyes, as I am a huge fan of Vildhjarta and Meshuggah, who incorporate similar riffs in their music, and because of this Caliban appear to be more focused towards that angle than other metalcore like Killswitch Engage, who tend to use their guitars for more melodic work. The drumming is awesome, it pounds your ears; pounds them into submission, but not so much that everything else is inaudible, no no no. The bass line is well played as well, as Marco Schaller is able to keep pace with the fast guitar work very admirably.\n\nTo shrug this album off simply because its genre labels it metalcore is horribly prejudice; you would probably be very surprised at how much you actually enjoy the album. So throw off the constraints of prejudice, and join me and many other satisfied metal heads who listen to music because it sounds great and they enjoy it, not because it applies to a certain genre or movement. This album is great, and I sincerely hope Caliban can put out more material like this in the future.\n",
        "\nCaliban's early albums seemed to appeal to the metal crowd, earnings several B+ and A ratings, but something happened midway through their career and dropped the ball somehow. Their ratings sunk to D's and even F's. Well, now they seem to be back with another great album.\n\nThe album kicks off with \"We Are the Many\", a fast and wild start to the album that incorporates \na lot of melo-death elements. The vocals are particularly good in this song and guest vocalists Marcus Bischoff of Heaven Shall Burn and Mitch Lucker of Suicide Silence lend their voices\nfor this song. The song flows like water and deliver a fast, hammering experience. It introduces you to what is to come later in the album, which is more hard, hammering songs.\n\nAs with all metalcore, breakdowns are to be found, but unlike most metalcore, they are thankfully pretty brief. It's like Caliban knew that breakdowns were the \"metalcore thing\" to do and just put them in there for good measure. Fortunately, they are brief, but surprisingly well done. None of the breakdowns are the sort of scene kid 'HURR DO hXc!!', but more of\nan effect to back the vocals. All in all, I actually enjoyed some of the breakdowns, especially the ones in \"Edge of Black.\"\n\nAndreas uses his wide range of vocal talent to deliver different effects throughout the album. He uses his high vocal screaming right off on \"We Are The Many\" and uses \nhis low growls for \"Boogyman\", so you instantly get both tastes right off the bat. And then you get the clean vocals, which are by far some of the best clean metalcore vocals I have heard. Denis Schmidt, who does the clean vocals, can carry notes extremely well and knows how \nto harmonize with the music, most noticeably on \"Memorial\". Not only do we only get the two vocals pitches from Andreas like so many other bands do, but his voice kind of fluctuates between his two poles of high and low, keeping the songs from being too vocally boring. What annoys me in a lot of metalcore bands is they only stick with their \"signature\" vocals and never experiment (like Heaven Shall Burn does with their vocals). Andreas keeps it fresh throughout, but tries different types of screams, growls, and raspy shouts.\n\nThe bass is nothing stunning, but very solid work. I have noticed a lot of albums kind of just use bass as a filler, which might have been the intention here or just in general, but\ngood bass can make a song a lot stronger (see \"Demented Aggression\" by Cannibal Corpse). Bass is good, but not extremely noticeable in the majority of the songs here. However, on the other end of the spectrum, the drumming is extremely well done with very good double bass that isn't just playing as fast as possible and definitely fits the flow of the song.\n\nProbably my top non-metal album of the year so far. This stays true to Caliban's roots while still taking them to new areas. Definitely worth a listen.\n",
        "\nIf you have listened to Heaven Shall Burn and Caliban before you should expect something good coming up from this split album. And if you’ve never heard anything from both bands, you’ll not be disappointed! In some cases it’s really hard to release a split, specially because the tracks could just “don’t fit” (this is not a big issue if both bands are good, but usually fitting songs are better to listen to), but this is far a problem in “The Split Program II”. Of course the difference between the two bands is remarkable and the recording and mixing are kind of different, but this doesn’t affect at all the quality of the album. Actually the well constructed reefs and the “heart singing” style put these bands more close together than anything else could set them apart.\n\nAs expected, Heaven Shall Burn put some classical stuff among the songs that helps a lot to create a god atmosphere for the subsequent aggressive screams and heavy low tone reefs. All songs follow almost the same construction type that made them famous for, with relatively slow tunings among fast catches and some melodic constructions. If you have never listen to the bands that they do the covers, don’t mind about it… these songs perfectly sounds like original Heaven Shall Burn ones (not like the more recent one that they’ve released in Invictus). There’s one thing that will certainly get your attention: the vocals mixing. In some parts of the songs (especially in the beginning) you can notice that they have doubled the recording of the voice, and put a little delay in one of them, so you actually listen two voices singing exactly the same thing. They have used this strategy in many albums and the result is especially good in this one: tons of brutality! Finally, the first two songs of this album would become classic songs of the band nowadays… I guarantee that even the most stone heart could “shed a tear” listening to it!\n\nCaliban sounds more like their old stuff. Some parts even resembles their debut album “vent”, with some strictly metalcore power, but of course they added some more melodic stuff (and they have been adding this more and more over the time). The songs are really fast and powerful, and the vocals are aggressive in the right size. Not so many break downs as they do nowadays, but you should expect some rhythm changes. \n\nA “should listen to and should have it in your collection” album featuring two great bands, you’ll not be disappointed.\n",
        "\nThe Caliban play generic metalcore. The music consists of melodic death metal riffings, hardcorish screams, angry breakdowns, and occasional clean singing. While the production quality is high, and the musicians are competent at what they do, the music is extremely fucking formulaic. Every song has generic melodic death riff, breakdown, etc. Also, the luck of guitar solos pissed me off. And they steal riffs from At The Gates, old In Flames, and so on. This is not a good thing for a metal band. They sound like a pop group with heavy guitars. Besides, the music scene is overcrowded with similar bands. People, who really love brainless breakdowns, probably will enjoy Caliban. However, fans of \"thinking man\" metal may not bother. It is the music for 15 years olds \"rebel\" kids, who do the lame jerking off for generic br00tal breakdowns. In conclussion, Caliban plays music for the fake emo culture. American market will eat it up, but it is nothing special, my friends. It is the typical product of metalcore desease - lame melodic death riffing/generic breakdowns/whining/bullshit screaming cancer cells in the metal scene. Very bad.\n",
        "\nWhen I first heard of metalcore Caliban was one of the first bands I heard. And to be honest I didn't know a metalcore band could have this amount of hatred in a fucking album but hey. They do! Just check the song titles: \"I rape myself\"; \"Song about killing\", \"I refuse to keep on living\", that's more than I expected from metalcore.\n\nMusically speaking, it isn't as hateful as you would think. There are more fast drumming and melodic guitars than harsh vocals, and the singed parts, oh Lord, they are just annoying! Basically this album is made of that: fast drumming, lots of screams, fucking singing birds, and then, breakdowns! And it keeps going like that. I have to admit that I enjoy breakdowns, but only when they are not being abused of, and when they sound different from song to song. But when they decided to put breakdowns every minute it gets boring as heaven (hehehe because hell is fun).\n\nThis is one of those albums that you only like three or four songs, but after listening the whole you just get annoyed and you don't even like one song. Isn't that enough? If you try to concentrate and find a good thing after listening the whole you might even start hating metalcore...\n\nThe only good thing of it all are lyrics, oh yeah, and the Björk cover its just perfect. No matter what metalcore will always be metalcore...\n",
        "\nCaliban were introduced to me by a fan of Killswitch Engage and As I Lay Dying. Naturally I thought they weren't worth checking out at all, but this friend also happened to enjoy Between The Buried And Me and As Blood Runs Black. The latter are core bands too, but they have some degree of talent. He offered to let me borrow this CD and seeing as he liked a few bands I could tolerate, I accepted his offer.\n\nWell, they certainly aren't Between The Buried And Me. They aren't even As Blood Runs Black. They're just another piece of the gigantic puzzle of homosexuality we call mainstream metalcore. Screamed verses, sung choruses, breakdowns, and one chord riffs that sound the same. The clean vocals sound electronic, fake, and emotionless. The screams are average, and the riffs just get annoying after a while to be quite honest. The repetitive and predictable double kicks with the occasional snare run throughout the whole album. It's all just so overdone. I hate it.\n\nSo why does it even get 8%? I guess if I was drunk and was at a live concert with my little brother who digs this kind of shit, I'd enjoy them for half a minute. I'd have to be really drunk though. Then I'd just get pissed off at all their songs sounding the same and binge drink until I passed out to save myself from having to endure it. This entire CD is one endless passage. I'm struggling to find something to like about this CD, but as I write this review and listen to the album again, the score keeps dropping. I started at 28%.\n\nIn conclusion, avoid this album. It's just another piece of metalcore trash.\n",
        "\nThis split is amazingly heavy, it just crushes and destroys. The riffs have obviously been down-tuned a bit, but when it sounds this heavy, its no problem at all.\n\nThe second split from famed German Metalcore masters, Heaven Shall Burn and Caliban, this sequel is the victor as the production makes it actually listenable this time around. That's my one gripe with the early work from Caliban and Heaven Shall Burn, the production is god awful, like basement demo's from the early 90's.\n\nHeaven Shall Burn has the first at bat on this split and they pick up right where 'Antigone' left off. More Melodic Death with crushing core influences, but this sounds a bit more raw than Antigone, but also features another breath taking instrumental peice like Antigone had. It has the same theme melody as the others so it sounds like a sequel, but just as, if not more beautiful than than it's predecessors. Out of five songs, Heaven Shall Burn scores with high marks on three of them, the other two, dont have the force of the others. 3/5\n\nRecomended Listening: Unleash Enlightinment, No One Will Shed a Tear, Downfall of Christ.\n\nCaliban in my opinion wins the split, as they've managed to out-crush one of Metal's heaviest bands which is a feat to say the least. Also, aside from the lead off, Caliban seemed to have gone back to their classic sound, which the fans would like as they've criticized the band for being Killswitch Engages copycats. Caliban does similar to what Heaven Shall Burn does, lay melody down while at the same time crushing you with rhythm and force. They also lay down some haunting acoustic work which gives them even more points. Clean vocals only appear in one song on this split, the rest is chest collapsing metalcore from the country that does it best: Germany! 5/5\n\nRecomended Listening: All tracks.\n\nCaliban is the victor of this round!\n",
        "\nWhen word came through that Roadrunner had signed German Metalcore act Caliban, the alarm bells rang loud and clear. With Metalcore being the new ‘trend’ sound of the decade, most of the big metal labels have made sure that they have their finger on the pulse. Metal Blade has Unearth and Cataract; Century Media have Heaven Shall Burn and Shadows Fall – if you love this sound, each are killer bands to listen to. However, it is with the massive success of Killswitch Engage that has really seen this style become the giant that it is. Roadrunner knows this only too well – and to capitalise they have made sure to grab a slice of the next lot of up and coming Metalcore acts. Enter Caliban.\n\nCaliban has been one of Germany’s leading Metalcore acts over the last few years. ‘The Opposite From Within’ is actually their fourth studio effort. Most punters rate their ‘Vent’ disc as a truly killer European Metalcore album. Last years ‘Shadow Hearts’ disc split their fan base a little with the addition of a more melodic component to their sound. Personally, I rated that disc very highly mainly because of it’s authentic ‘euro’ sound and its slightly thrash metal orientation. However, it must be stated that those who were concerned with the direction of that album are going to be mortified with what Caliban have done on ‘TOFW’.\n\nAs a fan of Caliban’s previous material, I must admit to being a little disappointed in the direction of this new album. But make no mistake, with Andy Sneap (mixing/mastering) and In Flames Anders Fridén (producing) behind the desk for this album, ‘TOFW’ sounds absolutely phenomenal. Blistering riffs and frenetic drumming fly from all angles and with the acerbic vocal of Andreas Dorner tearing it up throughout, there is much to enjoy on this album. Having said that, there is no doubt in my mind that Caliban has changed. The less cynical might say that Caliban have ‘matured’ or become a bit more ‘adventurous’. And that may all be true – yet, from my standpoint Caliban have gone from being a EUROPEAN Metalcore act that embraced a more authentic metal vibe to one that is purely AMERICAN in sound. Their sound is a straight homogenization of what it once was. And it’s all Killswitch Engage’s fault.\n\nThe KSWE formula is all over this album. The songs on ‘TOFW’ all follow a pretty standard KSWE template. Sure, those killer staccato, stop-start chugging riffs and mosh part sections cannot be denied, however it is the ‘bleeding heart’ clean vocal elements that Caliban employ that reek of a an even more familiar smell. There is a track on ‘TOFW’ entitled ‘Certainty..Corpses Bleed Cold’ – listen to it and tell me that it doesn’t reek of KSWE ‘My Last Serenade’? Without question, a killer Killswitch track (among many others), but this is the type of band Caliban has become. If you know KSWE’s well-established sound and style, then Caliban are their TWIN brother - they’re that close!! If ‘Shadow Hearts’ polarized Caliban’s fan base, then I’d suggest there would be even more disgruntled punters are hearing this one. Conversely, there will be thousands of others worshipping the albums every note.\n\nAs much as I loathe the ‘Americanised’ direction of ‘TOFW’ I can’t help but revel in the overall quality of the album. It is a formulaic style of Metalcore that they now embrace, but it’s been done so damn well that it’s hard to ignore. Whilst Caliban isn’t quite as brutal as they once were ‘TOFW’ is still a heavy fucker of an album. The twist is that the hooks, the melodic vocal lines and breakdowns have become even more ominous. This material will go down a storm in the live setting. \n\nAlthough nowhere near as original and unique as they once, Caliban has now moved into major player territory. Sure to gain many more fans than they lose ‘TOFW’ is a massive sounding record. If you can deal with their blatant KSWE tendencies then you’ll enjoy this album immensely. But don’t say you weren’t warned.\n",
        "\nCaliban shopped around with their finished album that they've recorded with Anders Friden (In Flames) this January for some time and after several negotiations they've landed on Roadrunner Records. \n\nCaliban is beside Heaven Shall Burn Germany's hottest metalcore export; they also introduce a new member with bassist Boris Pracht (ex– Copykill). \n\nThe first thing that I recognized is that singer Andy improved his vocal style and comes along without too many shrieks, his vocals are more angry and rougher now without loosing the aggression and that's definitely an improvement. \n\nThey start off with \"The Beloved And The Hatred\" which is already available as mp3 for a while and before they start a moshing mid-tempo attack they warm up with a few calmer rhythms and before you get used to the following mosh-metal piece they add an emotional part with clean singing and it seems that this time vocalist Andy also did these clean singing parts by himself. \n\nOn last album the singer of Mournful did all these harmonic singing parts! They throw in such emotional parts between their blasting metal attacks. This is another impression of mine, of course Caliban improved their metal pieces especially there melodic metal leads but they offer even more emotional stuff than on the last record. \n\nThe second track starts with fast metal and is alternated by double-bass driven mosh till they slow down with another harmonic piece and clean singing. These parts are pretty cool because of the improved vocal work and the clean singing is really good but it's sometimes too much, I wish they would step on the accelerator more often and kick some Asses. \n\n\"I've Sold Myself\" is the way I like Caliban, fast and raw metalcore with straight up metal paired with rough vocals and moshing breaks although they add a few playfully riffs. Especially the end of the song is cool with a high-speed melodic metal part combined with their down-moshing hardcore. \n\nCaliban dhave made a step forward and it's their best album since \"A Small Boy And A Grey Heaven\" but from my point of view they should reduce those emotional parts a little bit, apart from that they perfected their own style of Slayer styled metal combined with double-bass mosh breaks and this time they also added a lot of melodic guitars. Good! but cut THE EMO SHIT!!!!!\n",
        "\nLifeforce has already done a lot of promotion for this new release but I had mixed feeling but since I have heard the two-song Promo-CD I knew that Caliban are back on track, stronger and better than ever! \n\nTheir last album \"Vent\" was good but really not my cup of tea but with this album they enthuse me yet again. Just take a look at the playtime, 10 songs (and the intro) in just 35 minutes! They go back to their roots and add some contemporary elements to thier sound to bring a new Metalcore classic to the world. \n\nTheir mosh-parts are more brutal and intense and compared with the straight forward metal riffing this is a killing machine. The whole band has improved their musical abilities, the drumming is also much better than on the past releases! Robert supports the evil mosh guitars in a perfect way and he also adds a lot of double-bass action. \n\nThe changing between the high-pitched screaming and the clean parts is awesome an rocks like shit! Also Markus from Heaven Shall Burn and Johannes from Destiny offer some guest vocals on \"Storm of Rage\". I already wrote about the guitar riffing but I emphasize that Caliban got away from those copied Slayer riffs to more unique and outstanding guitar works, of course they still use some but it's more balanced now! \n\nThe combination of all those improvements, the vocals, guitars and drumming make that album much more diversified! and evil!\nAMAZING!!!\n",
        "\nAll you Metalcore-freaks out there will know Caliban from their first EP which was released in 1998 by Lifeforce and this is their first album which is introduced by a short classical music track. \nSounds very nice but what I hear after that is even nicer! \n\nStraight forward played Metalcore with an essential portion of mosh and lots of Slayer-sounding Metal riffs! Yeah, that's the deal with Caliban, they combine furious Slayer riffs with the brutality of moshing Hardcore. The album has a very nice concept because the songs are interrupted by three interludes called \"Skit I\", \"Skit II\" and \"Sylca\" but these aren't boring intermissions, the tracks fit perfectly to the rest of the songs. \n\nThe main trademarks of Caliban is the variation of fast as hell Metal parts and heavy breakdowns and a singer who is really screaming his lungs out, mostly high-pitched but sometimes with grunted and spoken words parts! \"A Small Boy And A Grey Heaven\" has also a great layout and you must watch these guys live and scream to their anthem \"Intolerance\". Beside Heaven Shall Burn one of the best Hardcore/Metal bands from Germany. I dream of seeing thes guys \"live\"!!!\n",
        "\nExceptional intro (taken from \"Bram Stokers Dracula\"), that builds up a great atmosphere and drops into a great scream and a simple thrash riff (with good groove and tempo) on the 1st song (second track), \"Assassin Of Love\". The double breakdown on that song is literally brilliant. But after the second breakdown, the song seems to drag on a bit. All in all, the rest of the music is just basic and weak, pseudo thrash, Metalcore that is saved by the immense vocals. The riffs need to be sped up a lot more and need to be more tightly constructed, with faster and sharper changes. Nice intro on track 4, \"Sunday's Words\". But once again, this is a band designed for the people who prefer watered down weak Metalcore, that tend to stay away from true Trash. Not a bad cover of Heaven Shall Burn's old song \"Partisan\" though. \n\nThe same can be said for Heaven Shall Burn's contribution, although they are a lot more raw and generally are a bit better. But nothing great at all. The Heaven Shall Burn vocalist's voice is very good (great scream and the odd good low growl), but the terrible drumming and boring song structure spoils it. They need to a few lessons from real musicians and quit to this yawnsome Metalcore malarkey. \n\nMy final conclusion, real metalheads should maybe give this one a miss, but a must for those who enjoy Metalcore.\n"
    ]
}