{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Phoenix, Arizona",
        "Status:": "Active",
        "Formed in:": "2007",
        "Genre:": "Groove/Thrash/Death Metal",
        "Lyrical themes:": "Society, Violence, Wars",
        "Current label:": "Napalm Records",
        "Years active:": "\n2007 (as Inflikted),\n2007-present ",
        "Number of Reviews": 20
    },
    "Band Reviews": [
        "\nCavalera Conspiracy's crusty caveman craft couldn't court their comfortless coterie with crude, coprolitic curbstomps like Inflicted. They were, to put things charitably, the The Haunted to Sepultura's At the Gates: a passionless, thuggish substitute that could offer only the occasional spark of recollective genius. (Though I'll admit Revolver and The Dead Eye were both pretty tight.) Pandemonium was another such spark, appearing to have strapped Chaos A.D to the top of a ziggurat, cut out its heart and consumed it, thereby absorbing its power. To go from penning two incoherent, random piles of smoldering groove refuse, to a vivid treatise like Pandemonium was unlikely enough, yet along comes Psychosis to set the bar even higher.\n\nFull disclosure, I've gone on record saying this was the best album of 2017; an accolade earned in similar fashion to how Power Trip's Nightmare Logic earned everyone else's. Psychosis does not invent any new wheels, nor does it pile a stack of increasingly meaningless thrash riffs onto your head like an endgame Jenga tower, until the entire structure inevitably collapses. It simply takes hold of your shoulders. Rears its head back. And smashes its forehead into your own with the force of an anti-aircraft cannon. This album is angry, and it wants you in pain. And so presumably the question on everyone's pursed lips is \"Does it sound like Sepultura?\"\n\nI'm afraid there isn't a simple binary answer for that. Certainly the full-throttle riffs of 'Excruciating' and 'Terror Tactics' seem to have taken inspiration from Arise, though in equal measure they sound reminiscient of Sepultura's underrated Dante XXI. Unlike the soul-crushing efflux it was surrounded by, Dante XXI had no fear of high speeds, and at the whim of Derrick Green, some much-needed punk and hardcore sensibilities were injected into the nu-metal chugfest the band had become. Psychosis tells a similar tale, holding onto some valueless heirlooms of their groove heritage like a delusional hoarder, but allowing themselves to part with more and more junk, until all that remains in their possession are balls-out blitzkriegs like 'Insane' and 'Judas Pariah'. \n\nNow see, Cavalera brothers, was that so hard? I should specify that while Blunt Force Trauma had no problem going fast either, it was decorated with some of the laziest, most processed blastbeats in existence. Here, Igor sounds like a new man, pummeling the kit with astounding creativity and unrelenting force. Max Cavalera, too, sounds rejuvenated, bellowing into the mic like an enraged berserker fresh off the longship. 'Insane' is a particularly effective showcase of vocals, as there's a decidedly deranged approach to lyricism. If anyone can decipher \"Your name is call, I thee invoke\", you might be just as crazy as Max.\n\nSo about those flaws, then; surely you didn't think a Cavalera Conspiracy album could be without them. Considering the brutal, tribal aesthetic they've adopted, their defiant electronic exploration seems awfully misguided. Much like Pandemonium, there's an assortment of industrial synth sweeps, reversed drum patterns for the hell of it, distorted vocal filters, and a fair few songs degenerate into synthesized white noise. To frame things very generously, I feel they may have been trying to articulate a \"man vs machine\" narrative, where a mighty ancient civilization crumbles and becomes an emotionless, mechanized society. That's the only explanation I have for why the final track 'Excruciating' has such an excruciatingly boring, melodramatic ending, anyway.\n",
        "\nJust when I thought the 'Conspiracy' alluded to the Cavaleras enjoying kickbacks from big pharma after getting all their fans on beta blockers and Prozac, they release Pandemonium. Sure, it may look like it was dragged from the hoary schism of late-90's thrash/groove, and I'm sure many a tortured, Sisyphean fan expected nothing less. I was among them, arms lazily folded and a resonant yawn billowing from my lungs, even as Max Cavalera tittered \"I feel like writing a grindcore album!\" and \"We might call it Fuck that Groove!\" \n\nThen I heard the promo track 'Bonzai [sic] Kamikazee [sic]' with my own ears, and my, how my arms unfolded. My entire face unfolded. Igor's opening rhythm is sampled in reverse, correcting itself as soon as the tremolo thrash riff begins. The tightly compact drum rolls begin forming a stark contrast to the distorted, screeching guitar harmonics growing louder and louder, symbolic of rapidly descending Zero Fighters on their suicide mission. Finally Max Cavalera barks \"thrash!\" in a surprisingly convincing way, seeing as he hasn't wrote a note of thrash metal for about twenty years at this point. Then the song storms ahead in earnest, and single-handedly displays more creativity and songwriting brilliance than the previous two albums in their totality, combined.\n\nYou see, I never once believed interchangeable thug-a-thons like 'Burn Waco' and 'Rasputin' had anything to do with doomsday cults or lovers of Russian queens, but 'Bonzai Kamikazee' felt like it was deliberately written to reflect the subject matter. Riffs and blastbeats are not just violent, but carry with them a sense of frenzied determination. Similarly, 'The Crucible' begins as a slow, lumbering beast set into tentative motion by fear and paranoia, but storms into a flurry of arrogant rage as the Salem witch trials begin. The level of atmosphere and emotion is unprecedented for this flavor of mechanized, utilitarian, and unmistakably modern minded thrash metal.\n\nPandemonium is indeed modern - overly so, depending on who you ask - because it dabbles with electronic instrumentation. You may say that goes against their \"primordial tribalism\" ethos, and you would raise a good point. One wouldn't expect a track called 'Apex Predator' to be introduced with cold, mechanical synthesizer stings and an arp-like guitar lead, unless the song is about a robot crocodile with a keytar. Other likeminded shenanigans include the aforementioned drum sampling, and the very subtle synth additives applied to riffs and chord progressions throughout 'Scum' and 'I, Barbarian'. This is almost certainly down to personal taste; I feel the distorted electronic antics don't feel contrived, but don't feel terribly necessary either. Kind of like food coloring.\n\nFinally, you may have noticed I didn't mention either S-band yet, and that's because Sepultura or Soulfly comparisons aren't particularly apropos or warranted in this case. Cavalera Conspiracy has evolved into an entirely seperate beast this time around, merging all the brute-force pummeling of its predecessors, with a remarkably shrewd approach to songwriting. If you're desperate for a Sepultura comparison, fine, here you go. \"This is the album Machine Messiah should have been, but never will be, because Derrick Green is a sub-par vocalist who couldn't let out a convincing scream if he was being chased by King Kong Bundy through a hall of mirrors\".\n",
        "\nTo say Inflikted was anticlimactic would be to wrongly imply it had a climax at all. Its shapeless, writhing fury didn't have much of a start or conclusion, left us with more questions than answers, and although it was hyped to the moon and back, failed to leave a lasting impression on anyone but pre-existing diehard fans. So basically it was the metal equivalent of Final Fantasy. Three years of stone-cold silence separated those early-game jitters from their second crack at it, and what a crack it was. Ass crack.\n\nCarried over from the first album is an inclination toward brute strength, charging ahead with wild haymakers and lumbering clotheslines. Blunt Force Trauma makes its differences apparent, however, when the felonious grooves and rapid-fire chugging will suddenly yield to overtly melodic passages. These unceremonious shifts are most jarring in 'Rasputin' and the title track, reminding me of Dethalbum II and Dethalbum III, where even the most caveman riff will abruptly defer to non-sequitur melodic leads and solos. Just as the bulk of subject matter appears sourced from the 'Random article' button on Wikipedia, there's a distinct stench of randomness in compositions.\n\nOn the bright side, we're bound to tire of the grooves and comically aggressive chugging campaigns sooner rather than later, so the melodic sections can occasionally be a welcome change. The introspective guitar lead in 'I Speak Hate' is particularly impressive, sounding a lot like Massive Killing Capacity-era Dismember. The frantic, thundering solo that punctuates 'Genghis Khan' is also effective because the crescendo bides its time, faking you out with a tepid, dilatory intro. This is one of the many ways this album also reminds me of Slayer's passable (but still kind of crappy) Christ Illusion. A lot of \"meh\" album comparisons, I'm sure you're noticing.\n\nYou may have also noticed I've yet to make much fanfare over either Cavalera, and this is where things get a bit awkward. Igor Cavalera is stymied by both an abysmally plastic drum tone and an uncharacteristically shirking approach to blastbeats. There are fleeting moments where destructive polyrhythms dominate tracks like 'Torture', but quick bursts of mind-numbing snare hits is the only other thing on the menu. Max's delivery, meanwhile, is hindered by vulgar after-effects and that terrible machismo-drenched \"OARGH!\" delivery. You know the one. The most memorable vocals aren't from Max Cavalera at all, but rather Roger Miret's guest vocals in 'Lynch Mob'. And that's because they're terrible. The performance failed to invoke fond memories of Agnostic Front, but rather unfortunate memories of a time I voluntarily listened to Biohazard.\n\nBlunt Force Trauma attempts to replicate such a medical condition by jumping on your skull like it's a Goomba who just insulted your mother. But after it's done river dancing on your face, the album helps you to your feet, dusts off your coat, and drives you to the hospital with its melodic sections. That kills the mood when I was just getting into it. However, this peculiar mixture at least left me with a lasting impression, which is more than I can say of Inflikted.\n",
        "\nUtilitarian is a big word used by condescending pricks like Napalm Death to describe an emphasis on function rather than aesthetic beauty. My gray Honda, for instance, might be considered utilitarian, as it starts up every day and takes me to work without incident, but will never be featured in a Nikki Minaj video where giant ass cheeks are thumping on its hood. A real tragedy, I know. There are, however, plenty of better arguments against utilitarianism, foremost among them when talented musicians reunite and write a cheap, thuggish, unmemorable half hour of ugly, over-aggroed groove/thrash.\n\nSo yeah, in case you missed it, the Cavalera brothers set aside their bygones and formed a new band to serve as an extra-fizzy alternative to modern Sepultura and Soulfly. An 'alternative' to bands that, when the planets align, manage to write a few minutes of moderately passable music. What could possibly go wrong. I'll give Inflikted something right away; it's humble. It may sound angrier than a junkyard dog watching a poodle wag its bum at it from the other side of a chainlink fence, but you can tell that deep down, it's anxious about being the opening act for the touted \"spiritual successor\" to one of the most cherished thrash metal heirlooms of all time. Thus, song compositions are short, violent, and to the point, taking little to no risks.\n\nThis means efforts inevitably wane and bad habits take command. Inert groove drudgery like 'Black Ark' and 'Must Kill' are over-inflated by Max's unnatural barks, and 'Terrorize' sees Igor employing the same tried-and-tired quasi tribal beats. Bold strides in new artistic directions, I'm sure you're noticing. Every now and again, the rabid roars and rampant blastbeats manage to convey similar emotion to what was delivered throughout Soulfly's Prophecy, which is an album written during an aforementioned planet alignment. Whether this decision was rooted in prudence, anxiety, or laziness, Inflikted takes many cues from Prophecy, but with a greater respect for the listener's time. It chooses to pummel them into submission with quick bursts of two or three minute songs, bolstered by appropriately enraged riffs.\n\nDespite this, the fit and finish feels unmistakably clammy, enveloping everything in a cold and silicone-like atmosphere. Max's voice is routinely inflicted with goofy reverb and distortion effects, and more damning still, Joe Duplantier's riffs are always delivered in a contrived and overtly mechanical fashion, not helping the feelings of soullessness and over-simplification pervading through this entire album. If you think Soulfly albums \"have their moments\" but are too spiritual and air-headed, you have a decent chance of enjoying the polar opposite represented in Inflikted. Devout worshipers of classic Sepultura won't, but I hope you already knew that.\n",
        "\nIs it 1991 again? Because Cavalera Conspiracy’s new album Psychosis feels like something that’s as fierce as something we’d get from these Brazilian brothers in the early 1990s. It seems to revisit some of the biggest and loudest points in the careers of both brothers with the overall sound of this album feeling like an aggressive and warlike revisit of Chaos A.D. and Arise throughout with bits of Max’s old side project Nailbomb thrown into the latter half. Psychosis mixes all of this together into a bright-burning molotov cocktail of extreme metal that feels as though Max and Igor have been rejuvenated and acquired a lust for speed and bloodshed. Psychosis has the thrashing energy for real terror.\n\nDon’t expect a bunch of chugs on here. This album instead runs on speed and barrages of savage guitars. Even the groovier songs sound angrier, more ferocious, and downright hellish compared to what we normally expect from a modern Cavalera album. Rapid-fire drums and menacing riffs break you into the album and give you a hint as to the torrent of terror you’ve just entered. The first half of Psychosis is a ferocious volley of menacing thrash as the opening number “Insane” demonstrates quite clearly with its raw speed and rage. It can also handle groovier sounds while maintaining the menace, with “Spectral War” mixing groove riffs and thrash pacing to create a song that feels like being trampled under thousands of charging hooves. Max’s vocals are still as vicious as ever and make the atmosphere all the more chaotic. On terms of the musical backbone of Psychosis, It’s strong as rebar and covered in spikes.\n\nPsychosis sounds positively evil and does some calling back to the sounds of Sepultura’s glory days. It doesn’t totally match up to how iconic Arise or Chaos A.D. were. However, you can tell that Cavalera Conspiracy is trying to hit new heights rather than simply pumping another album out to stay alive. “Spectral War” is energetic, evil, and memorable, as are other songs on this album. They sound like songs that were written to be remembered and replayed like the band had channeled all of their fury into this. This album also stretches the boundaries a bit by using Nailbomb-esque industrial elements on some later tracks. These tracks aren’t especially mind-blowing, but the industrial elements mesh well with the music at large, and overall are still decent, just not as blisteringly savage as the earlier songs. It at least shows a willingness to still experiment even after all these years, and to make their experimentation go smoothly with their core sound. That is something that I find commendable from a band like this that tends to get brushed aside as a side attraction to Soulfly and Sepultura. They resurrect the old strong sound and infuse it with some new power.\n\nPsychosis feels like an album that took the best parts of the Cavalera brothers’ careers and decided to not only pay tribute to them, but revive them in such a way that they feel reinvigorated and just as crunchy as ever. This may not hold a candle to classic Sepultura albums, but it tries the hardest it can to get up to that level and delivers some pretty ripping songs in the process. Psychosis pounds, shreds and smashes while staying as menacing and vicious as one hundred clones of the warrior on the front cover. Whether it’s the manic thrashing songs, the imposing march-like groovier pieces, or even the noisy industrial bits, you always feel like you’re under siege from Cavalera Conspiracy’s assault. This album hit me way harder than I expected. It may not be a game-changing masterpiece, but Psychosis shows us that the bros from Brazil can still deliver super savage metal even after all these years and all the stylistic shifts. Granted, the outro narration on the last minute of the last track is cheesy, but after listening to the other forty minutes of this blast from the past, I think they can get a pass on that.\n\n(Originally Written for The Metal Observer)\n",
        "\nCavalera Conspiracy is a band I've always been frustrated by. While their first album Inflikted was good (even if too many songs had more of a groove feel for my personal taste), Blunt Force Trauma was a pure snooze fest for me. Repetitive riffs, even more groove, and even more generic songs (except for I Speak Hate & their cover of Electric Funeral). I'd been holding off from listening to this album for quite sometime after the bitter disappointment that was Blunt Force Trauma, but imagine my surprise when I actually really enjoyed this album. Gone is the groove, and gone are the repetitive riffs. Yes, the songs are still overly simplistic in nature compared to Max and Igor's earlier outputs in the Sepultura days, but for a pair that's made some of the best metal albums ever in my opinion, I can forgive them for making simplistic material. \n\nThe simplistic nature of this album actually works this time around, you can tell Max and Igor really pushed each other on this record, because I don't hear any signs of laziness from either party on this album. Every song has a distinctive riff and feel, that help the album have a much better flow overall as opposed to the sometimes dragging nature of Inflikted, and the absolute chore like feeling of Blunt Force Trauma (seriously, that album is BOOOOORING). Max actually wrote some pretty killer riffs for us this time around. Anyone on this website who has followed Max's career like I have knows that since say Dark Ages by Soulfly, Max either decides to give a shit about what he's putting on tape, and sometimes not so much (I.E 3 and Omen, and parts of Conquer). Here however, I'd go go as far to say that these are some of the best riffs he's written since Dark Ages. They're quite catchy and get the job done right. Most importantly, they feel complete! Scum is probably the best example of this. Carried by a riff that sounds like it came straightout of the Dark Ages era of Soulfly, this song features tons of headbanging moments accompanied by some simple, yet effective drumming done by Igor Cavalera that helps give the song a hardcore meets groove feel to the song. \n\nThat's another big plus towards this album, Igor Cavalera has improved TREMENDOUSLY. While his drumming was still solid on the first two CC albums, they always felt lazy at times, carrying the same simple slow thrash beat for every song, spare a few moments of the good old days. Yes,his drumming is still simple as all hell, but goddamnit, I'd be lying if I said it was terrible. Max said in an interview that he told Igor multiple times while recording this album, \"Fuck the groove! Thrash!\" And boy does he bring it on this album that's my biggest pro towards this album. It's still very simple in the overall structures, but there was a lot MORE effort put in to these songs than the previous album, and Marc Rizzo doesn't play the same EVH solo over and over again either!\n\nThis album is far from perfect, but it's the best album that the brothers have put out yet. I'm quite interested in hearing where they're gonna go from here, because apparently Max wants to make a grindcore sounding album inspired by shit like Nails for their next release. If that's the case, I think Cavalera Conspiracy is going to be okay from here on out.\n",
        "\nThe ever industrious Max Cavalera is back with his Cavalera Conspiracy project that includes his brother, Igor. With a release schedule that sees him releasing one album every year either with Cavalera Conspiracy or Soulfly, one instantly wonders whether Pandemonium will be a good album. After all, quantity does not necessarily imply quality. Indeed, the last few albums have seen a mixed response from the fan base and critics alike, which overall seems to indicate overall quality is at least inconsistent. \n\nThe first noticeable change compared to the band's previous effort, Blunt Force Trauma, is that Pandemonium is noticeably heavier. In fact it shifts the standard Max death/thrash formula to a more death metal style than the more classic thrash stylings of Blunt Force Trauma. There is an increase in the portion of old school death metal riffs over usual groove thrash metal ones and the solos are often less melodic than previously. The overall production is heavier and rawer and Max's vocals are heavier and occasionally closer to death metal bellows as practiced by Gorefest's Jan-Chris de Keoijer. This follows on from Soulfly's Savages, which was an attempt at a rawer sound. The comparisons with Soulfly are unavoidable due to the overall similar style and presence of both Max as well as Soulfly's second guitarist, Marc Rizzo in the band.\n\nAt times there's even a slight industrial edge - a nod to Nailbomb (Max's industrial band) perhaps? And there's even a nod to Roots/Chaos A.D. era Sepultura with \"Porra\" sounding like a mixture of acoustic songs like \"Kaiowas,\" \"Itsari\" and heavier stuff like \"Biotech Is Godzilla.\" And those acoustic guitars sound great especially when contrasted against an underlying heavy distorted guitar. It also lets Igor showcase some of his tribal drumming.\n\nThe riffs aren't as catchy as Blunt Force Trauma or Inflikted. Bare in mind that this means it's still quite catchy compared to many death/thrash acts though. And when they do get really catchy, like on \"Deus Ex Machina,\" it's head-banging bliss. The production assists in the overall heavier vibe but it does mean it sounds too muddy and unclear at times.\n\nWhilst the album doesn't really break any new grounds for Max, it's quite a decent listening experience. In many ways though, it is interchangeable with most of Max's recent offerings, be they from Cavalera Conspiracy or Soulfly, but then that's been the case for some time now. It's not going to appease the jaded Sepultura fans but for the rest of us it's a welcome addition in the Max Cavalera catalogue.\n",
        "\nMax Cavalera’s music has been in my life in one form another since I was, like, 13. I got into Sepultura with Roots, went back and fell in love with Chaos A.D. and Arise, and moved forward with Max when he launched Soulfly. Soulfly’s been hit-or-miss throughout the band’s career, and while there are some great tracks spread out from Prophecy to Enslaved, last year’s Savages was so tepid I never even bothered finishing it. The juggalo festival thing didn’t help much either.\n\nIn 2008, Max and his wayward brother, Iggor (also formerly of Sepultura) reunited as Cavalera Conspiracy, releasing the groovy, muscular Inflikted to considerable acclaim. They followed it up in 2011 with Blunt Force Trauma, an album I think is as close as possible to how classic Sepultura would sound if they’d never split apart and restructured. So far, Max has had a busy year. He wrote, played, and sang with The Dillinger Escape Plan’s Greg Puciato and Mastodon’s Troy Sanders on Killer Be Killed’s debut outing, and he logged a guest spot on Coma Witch, the new album from The Acacia Strain (my review of which can be found here). Now the Cavalera brothers are closing out 2014 with Pandemonium, and results may vary.\n\nIn all of Pandemonium’s associated interviews and press releases, Max has continuously stressed he and Iggor’s desire to write a “grind” record that departs from the groovy pace of CavCon’s last two releases. If you’re familiar with Max Cavalera, and you’re familiar with grindcore, this concept probably made your eyebrows arch a lot like mine. So, let’s kill this in the crib here: make no mistake, there’s nothing even remotely resembling “grind” on this album. But while Max might have his terminology a bit confused, he and Iggor have still put together a pretty sharp group of riffs. Rotten Sound it ain’t, but Pandemonium has sonic bite in ways the last two Cavalera LP’s felt a bit more subdued, and in ways that prove Soulfly has become completely toothless.\n\nJoining the Brothers Cavalera in this outing are Soulfly/CavCon mainstay guitarist Marc Rizzo (ex-Ill Niño) and bassist Nate Newton. Newton is known for his gnarly bass fuzz in hardcore stalwarts Converge and his anguished vocals in Doomriders and Old Man Gloom. Newton’s inclusion felt suspicious, like Max and Co. were just reaching for a notable name in a way to stay relevant or appeal to a fanbase that would otherwise have nothing to do with a Cavalera Conspiracy album. As it turns out, however, Newton’s playing adds considerable heft to these songs. His bass riffs are dirty and tight, and his hardcore sensibilities contrast pretty sharply with the bassists from past CavCon albums (Gojira’s Joe Duplantier and Stone Sour’s Jonny Chow, respectively). Instead of follow-the-leader low-end, we’re treated to Newton’s frantic, molten snarl. Let’s call that the record’s first strong check in the “plus” column.\n\nOpeners “Babylonian Pandemonium” and “Banzai Kamikazee” have been streaming online for a while, and they’re the clear choices for the world’s first introduction to Pandemonium. No riff featured in either of these songs would feel out of place on Sepultura’s Arise or Soulfly’s Dark Ages. “Scum,” “I, Barbarian,” and “Cramunhão” feature some sludgy depth-plumbing from Newton, as well as some of the most solid percussion work Iggor turns in on this record. For fans of Nailbomb, the oft-lamented ‘90’s industrial metal collaboration between Max and Fudge Tunnel’s Alex Newport, “Apex Predator” and “Not Losing The Edge” are the songs you hoped would be on Killer Be Killed. Max and Rizzo’s riffs bob and weave from hardcore chugs to death metal jackhammering, and the electronic element is prominent enough that it feels like the Cavaleras want listeners to make that Nailbomb connection. Fear not. The connection feels naturally made, and the songs’ structures aren’t so drastic a departure from the rest of Pandemonium that it feels like we’re listening to a mixtape. Newton-fronted “The Crucible,” as well as special edition tracks “Deus Ex Machina” and “Porra,” close out the effort with force, cementing the album’s penchant for variety with “Deus Ex Machina”’s dirgy doom and “Porra”’s Soulfly-esque tribal flair. Often times the urge for seasoned metal veterans to add variety to a record can backfire, but the changes of pace aren’t where this album falters. It’s the production, specifically the vocals.\n\nThe whole time I was listening to Pandemonium, I kept having St. Anger flashbacks, noticing a distinctive difference between past efforts and present output. When shifting gears adds dimensions, it’s best received when the new elements complement the songs without complicating the songs. Unfortunately, the production here is a problem. Based on Max’s press, I’m assuming aspects of this album were recorded in a way that was purposefully lo-fi, and whatever they wanted to accomplish by doing that, I’m not sure if they did. Max’s vocals sit lower in the mix than anything he’s been involved with since Beneath the Remains, and it’s not a good thing. Instead of making the music sound bigger, his placement just makes Max sound small and distant, like he stood too far from the mic or recorded his tracks in somebody’s yard. In addition to the levels, there’s this Scream-style voice-changer thing going on here that’s distracting at best, and at worst, downright comical. Instead of opting for more organic death metal-style lows, Max’s voice has been augmented to make him sound like Darth Vader in “Babylonian Pandemonium” and the kidnapper from Ransom in “I, Barbarian.” I respect Max’s willingness to try something different, especially this far into a career that no one can argue isn’t legendary. It’s a shame, however, that his new vocal approach just didn’t succeed in doing anything but hindering the project. Max’s best vocal performances on this album are the ones where these effects are the least noticeable, particularly on “Insurrection.”\n\nUltimately Pandemonium is not a failure. If you’re a fan of Max Cavalera’s other projects, there’s plenty here for you to enjoy. A few misguided romps into experimental territory may handicap the record, but it doesn’t stray so far off-course that the whole thing’s a bust. The mean thrash riffage of “Insurrection” stands against anything from Chaos A.D., and if you don’t wanna move your ass when “Not Losing The Edge” kicks in, there’s nothing I can do for you.\n\n(originally published on AudioPhix.com)\n",
        "\nHope arose among fans of the old Sepultura line-up when Max and Igor Cavalera reunited to form Cavalera Conspiracy in 2007. Previous releases were good but bland, almost content in their lack of originality. It is with Pandemonium, then, that the Cavalera brothers – along with new bassist Nate Newton and Soulfly guitarist Marc Rizzo – will hope to rekindle the old thrash flame.\n\nOpener ‘Babylonian Pandemonium’ is the perfect song to start things off. Far from the album’s greatest track, it still effectively kicks thing off fast and furious, featuring a Sepultura-esque down-tuned riff. The song is quite a blatant thrash throwback, and this is not a bad thing. Happily, Igor Cavalera’s pounding drums are still on point throughout, especially leading the way in ‘Bonzai Kamikazee’, a heavy thrash track featuring some brilliant riffs that form into an absolutely apocalyptic breakdown section around the three minute mark. This is one of the album’s most noteworthy flashes of brilliance, and Max Cavalera’s voice hits pitches deeper than it has in years on the track.\n\nThe faster tracks, ‘Apex Predator’ and ‘I, Barbarian’, are some of the best, and the latter features Rizzo imaginatively layering the thrash riffs throughout the verses, before colourfully shredding through a slower section and finally becoming the centre of attention on a simply stunning solo. The first real break from the somewhat endless thrash doesn’t arrive until the aforementioned ‘Apex Predator’, the speed only rises on the track after a electrolysed intro, but a clattering breakdown and some higher guitar tones make the track more than just another thrash tune.\n\nThough much of Pandemonium makes for refreshingly good thrash-metal, later tracks like ‘Insurrection’ and ‘Father Of Hate’ begin to show predictability. Though not bad songs, the songwriting becomes uninspiring, with structures being seemingly copied and pasted from track to track. In honesty, this really just makes the whole album more of a mission to finish.\n\nNevertheless, those who do see the album through will be treated to some moments of brilliance hidden within the album’s second half, with some of the brutal riffs in ‘Father of Hate’ and ‘Deus Ex Machina’ integrating perfectly with Igor Cavalera’s never-ending barrage of beats. Another strong point later in the album is the bass-work from Newton in ‘The Crucible’, a track which he also shares vocal duties on. This is needed, seeing as despite showing talent, Newton spends much of the album in the shadows. ‘Porra’ closes the album in a unique and surprising way, being the first track to encompass the Cavalera signifying flamenco elements that have littered much of the brother’s releases over the years. It utilises them well, but comes as a bit of an anomaly after 45 minutes of violent metal.\n\nUltimately, Pandemonium is a strong contender for the best LP either of the Cavalera brothers have released in a while. A solid thrash album, it constitutes a healthy dose of metal nostalgia with some enjoyable (though in places perhaps a little too much) brutality.\n\nOriginally posted on http://noisecannon.com/2014/10/29/cavalera-conspiracy-pandemonium/\n",
        "\nFew reunions were more watched and hoped for than the two Cavalera brothers burying the hatchet and remembering that there are better things to hold onto than past grudges. The resulting \"Cavalera Conspiracy\" was a light of hope for all sorts of folks hoping for the proverbial second coming of Sepultura, to which the outcome was...sorta there, more \"Chaos A.D.\" than \"Beneath the Remains\" than anything else. Still, each successive release was more solid and grounded than the one before it, single evolutionary steps towards what could very well be a potent, flowering future. But that's more up to the bros than us...\n\nYet for what it's worth, their latest, \"Pandemonium\", still maintains that level of promise, in its own way and within its own degree. The main feel of it is one big, multi-track jam session with all sorts of energy yet not a whole lot of creativity. I could lay the blame for the latter on all the years post-90s era Sepultura and the first half of Soulfly's existence adding rust onto and truncating the proper usage of a one-time riff machine (depending on how deep into the creative process Max is), but what's done is done. Regardless of that, I'll admit that this ended up being a pretty decent little number that still managed to entertain me. The senses of thrashing venom, lack of grooving elements and that single dash of death metal teeming from the otherwise submissive feel of the songwriting is really what makes it work; without it this could have ended up being another \"Root\" in the ground like so many that were thrust upon the listening public over the years, tiresome and avoidable. The general feel of the performance is spontaneous, as though each track was a single \"caught in the moment\" recording that didn't get, or even need, any kind of additional work/editing to get the point across. Every once in a while the inconsistency of the production values and missed spots are more noticeable than they should be, though what you're getting here is far more real than a lot of other albums of this ilk/style. Sometimes it's best to have the face blown off by strength beyond strength over careful construction, especially in the thrash world.\n\nWith all that said, an album can't really hope to survive on level of performance, piss and vinegar alone. The more basic arrangement schemes make for a good, easy listen, but someone wanting to be bludgeoned repeatedly with riffs and differing schemes won't be able to find a whole lot to take in. Part of me is annoyed by that, I'll admit, but maybe that's the point of CC as a whole; all the straightforward, one-direction intensity of a guerilla strike as opposed to methodical torture. Which is fine, yet if you want a slower pace to your violence that won't really happen here. As alluded to earlier, the jam-session-like appeal of the band itself doesn't lead to a lot of moments of creative muscle-flexing, resulting in few-chord riffings and simpler, more punk-like arrangement schemes that thankfully don't stretch the lengths farther than they should be yet only offering so much, not too unlike post-fuckupjumping Soulfly to be perfectly honest, only with a higher level of inspiration. As well, I could have also done without the rather predictable repetitive choruses that's been such a big part of the Cavalera method of lyricism for at least 15 years or so, as they only work every once in a while (the breakdown segment of \"Cramunhao\" is really the one time it gets under your skin like that). A minor complaint, yet still one worth mentioned if for no other reason than the consistency of its use over the years and albums.\n\nAll in all \"Pandemonium\" is a sucker-punching little number that will satisfy that urge for right-to-the-throat heaviness that's better than it lets on in the end. The chemistry between the brothers is still plenty strong, with a lot of energy to make up for the lack of stylistic dynamics, and if all you need is a single dose of metal you can't go wrong here. Just remember that that's all there is to it, though...\n",
        "\nI was pretty excited to hear that Max and Igor Cavalera were reuniting in 2008. Although Inflikted, their debut album as Cavalera Conspiracy, perhaps wasn’t their best joint effort and left me a little underwhelmed, it was an okay album with a phenomenal title track.\n\nLike its predecessor, Blunt Force Trauma starts off strong. The opening track Warlord is a typical punch-in-the-face metal song with some great riffing and Max is sounding as brutal as ever. The following song, Torture, is a short burst of energy – not even two minutes. It may not be the most creative song of all time but I find it somewhat refreshing; many bands often to the complete opposite and fill their albums with unnecessarily long songs, which might be one of the most boring phenomena in metal today.\n\nLynch Mob, the third song of the album, features Agnostic Front vocalist Roger Miret whose characteristic vocal style really lifts the song. It’s actually one of my favourite songs on the album – I can’t really explain why but they just nailed the small details with this one. Unfortunately the album loses a lot of momentum afterwards. Killing Inside, the first song to be released as a single from this album, has a pretty cool part after the guitar solo but other than that it, along with the following three or four songs, feel a lot like filler songs.\n\nThings get better by the end of the album, luckily. Burn Waco has some cool grindcore-influenced parts and a great guitar solo wrapping the entire song up. Rasputin is another okay song, but doesn’t really do much for me. The last song, moreover the title track of the album, Blunt Force Trauma is one of the strongest songs on the album and with the fading guitar harmonies at the end, I feel pretty good about the album.\n\nI like the different influences in the music – thrash metal, grindcore, hardcore punk, heavy metal etcetera – but I still get somewhat bored by some of the songs. I do however like that the record is just a little more than half an hour long – it fits this kind of music perfectly and makes some mistakes forgivable. Overall, Blunt Force Trauma is a good follow-up album and it makes for some pretty sick live performances this summer!\n\n\nOriginally written for www.metalcovenant.com\n",
        "\nNaturally, every metalhead got excited when they learned that the Cavalera brothers would start making music together again. Everyone was anxious to listen to some music done by them, and some were hoping that they would reach the same levels of perfection that they reached when they were in Sepultura. Naturally (again) many were disappointed; others were satisfied; some even loved it. When a couple of months past after the release of \"Inflikted\" and I had listened to it a billion times, memorized every single note, i was left begging for more. Finally my prayers have been answered and here it is, more music from the Cavalera brothers. The question is, is it good? Does it satisfy my needs?\n\nYes, but no. It depends on what your point of view is. I am satisfied for now, sort of temporarily. But there is nothing here that my ears will be begging to listen to again, a million times. It's not the most memorable piece of music these men have offered us thus far. It lacks long-term classics because every song sounds kinda over-produced. Choppy choruses and the whammy bar effect on every guitar solo is getting old. The songs on the album are brutal, but where is the grinding and pounding found on \"Arise\" or \"Beneath The Remains\"? I agree that every band has to progress and refine their own sound, but there is no variety in the new stuff. Where are the shotgun snares? Where are the groove breakdowns? Unfortunately every song sound quite the same, or really similar, particularly in the structure. Where is the individuality found on \"Roots\"? \n\nIn the end of the day though, Max and Igor are still the best brother tandem in metal so no matter what the band is, that's a fact. I wish they would have used a different lead guitarist on this album; Rizzo's leads are the reason Cavalera Conspiracy reminds me so much of Soulfly. If they had used a more raw-styled guitarist instead of a finesse player like Rizzo i think it would have been more complimentary to the aggressiveness of the songs on this album.\n\nOverall this is a really solid release and an enjoyable listen that is really headbangable. The problem is that not many tracks stand out and there is not much variation. The album is not really benefited by the really high-profile production and recording, as it reduces the raw feeling.\n\nHighlight(s); \"Killing Inside\".\n",
        "\nI must begin this stating that I do love and respect the brazilian brothers in question. “Classic” Sepultura was one of the vessels that led me to my first explorations of extreme metal. Therefore I was pretty interested in this project since its inception in 2007. In fact, Inflikted was amongst the releases from 2008 that I enjoyed the most, despite not being particularly innovative or original. Regardless of its faults, Cavalera Conspiracy’s debut had an undeniable dose of punch and power, which has not fully survived for their sophomore, Blunt Force Trauma. It’s like the aggression and passion has now been coldly calculated, and it feels somehow fake. But what most metalheads will perceive when listening to this album is the increased melody added to the band’s brand of post-deathrash (whatever that means!)\n\nNow, melody and aggression are no novelty. Kreator, Amorphis, the whole Gothenburg scene… the list goes on and on. However while some of those bands have merged those characteristics with varying degrees of success, the specific way this mixture appears on  Blunt Force Trauma  actually reminds me of a lot of polemic metalcore acts such as Killswitch Engage or All That Remains. I’m a fan of melodic metal and while I don’t entirely despise these bands as some do, truth is nobody really expected an album crafted by the Cavalera bros. and company to sound like this, that is, as if they were ripping-off DevilDriver or Chimaira. Not a good thing at all. Why do they choose to pursue this direction? \n\n“Warlord” is a not a great opener, decently brutal but dull. Things get better with next track, the brief “Torture”, one of my favorites here, a decent slab of cavalerian metal, featuring late 80’s deathrash riffage. “Lynch Mob”, featuring Roger Miret (Agnostic Front) on guest vocals is mildly interesting, but not much. Next dozen of tracks traverse dangerous waters of monotony and half-baked ideas. Songs seam to be (kind of) brutal for the sake of being brutal and intended to provoke moshing, but there’s really not much really interesting going on. Some good ideas appear here and there, like the catchy riffs and melodies at the first half of “I Speak Hate”. The beginnings of “Target” and “Thrasher” (what an original, non-cliché name! don’t you think?) also seam promising, but the first one ends in total metalcore-ish fashion and the second one actually becomes more groove than thrash. The Black Sabbath’s cover is also one of the better tracks here, obviously not superior to the original classic, but nicely performed and given the expected Cavalera treatment.\n\nAlso I have to point out that the guitar solos are a saving grace here, every one of them being interesting and not a carbon copy of each other. They’re thrashy, yet classically influenced and melodic. No surprise that Marc Rizzo is the man here. However, the riffs are not that interesting, most are recycled generic deathrash riffs, with hardcore punk influence and simplicity. The bass is mostly inaudible, and it doesn’t add much. And Igor’s drumming is simpler and well, blunt, but ultimately uninteresting. His tribal sensibilities and nice chops don’t show up here much. As for this older brother, his vocals are as harsh and powerful as ever, though I’m not that into his extensive use of effects. And his lyrics, while never known for their high degree of complexity, feel particularly uninspired.\n\nSomehow this album reminds me of the Nailbomb experiment, and it’s not a complete failure, yet I’m not sure that this is heavier than it’s predecessor. Certainly it doesn’t makes Inflikted sound like pop music, as Max stated in an interview. On the contrary, whereas the debut aimed to old Sepultura sensibilities mixed with modern flourishes, the approach of Blunt Force Trauma feels more blatantly mainstream, more into Killswitch Engange territory than Sepultura’s. Therefore, I shall only recommend it to fans of said music. The bruise caused by this traumatism is shallow and insignificant, like a consequence of entering the mosh pit, the place where these songs might be enjoyed more, albeit for the fun of it, not because they kick ass.\n",
        "\nThere is a conspiracy afoot here, a rather dastardly plan against one of the most obvious truths known to man of groove metal’s lackluster nature. This illuminati-like scheme has sought to take the least offensive aspects of the mid-90s bastardization of thrash and inject it with a fairly strong bit of death/thrash. This conspiracy bears the name of one of the most loved and hated names in thrash circles, depending on which era the name denotes; that name being Cavalera. Like a modern sledgehammer smashing stone into dust, it defies most of the established dogmas instilled by its namesake’s former outfit Sepultura and others such as Machine Head and Pantera, and brings something much more intense to the table.\n\nIf one were to attribute to “Inflikted” the description of being a “Roots” follow up, said person would do well to revisit said mid 90s album of horridness for a quick reorientation on the textbook definition of sucking, as well as to better reestablish the boundaries between nu-metal and groove metal. If anything, a comparison to the somewhat stronger “Chaos A.D.” would be better, though still pretty far off from the right picture. This thing relentlessly offers up pounding riffs with minimal studio toy sounds, avoids the goofy tribal nonsense, and somewhat resembles the direction that Machine Head took on “The Blackening”, although it comes off as less pretentious and avoids sounding like metalcore.\n\nIn spite of the positive things going on here, it is important to remember that this is not a return to the band’s early Death/Thrash pioneer days, or the high flying riff extravaganza of “Beneath The Remains”. This is a full out modern revisualization of a few bits and pieces of Sepultura’s past, and tends to emulate all of its various eras before Max Cavalera’s exodus. Sometimes they seem to be reaching back to that time a little in faster assaults such as “Sanctuary” and “Hex”, both of which have enough lead guitar detailing to almost resemble Arsis. In fact, apart from the vocals, which do tend towards a hardcore shouting character; a lot of these songs really seem to take a fair number of nods from recent tech. death bands, though the songwriting stays much more streamlined and in conformity with standards of accessibility.\n\nConsistently good is probably the best way to sum up “Inflikted”, which establishes Cavalera Conspiracy as a potentially serious player in the modern Metal scene. Whether they’re pounding out thudding Groove work with a tasteful and measured amount of tribal percussive additives in “Terrorize” and “Dark Ark”, or galloping and riffing into a modern variant on textbook Thrash in “Hearts Of Darkness”, things flow smoothly. This isn’t quite something that will wow everybody, being more like a good album with a few great elements rather than all out amazing, but it could win over a few older fans of death and thrash, along with roping in all of the newer generation who are more accustomed to an overtly polished production. In other words, not quite an essential purchase, but definitely something worth looking into if one is inclined towards fast and heavy music with fancy guitar work and raunchy shouts.\n\nOriginally submitted to (www.metal-observer.com) on July 18, 2010.\n",
        "\nThe collapse of Sepultura (when I say \"collapse,\" I mean the end of the Cavalera reign) was not an easy one for any metal fan to take, particularly those like me who held their thrash records in such high regard. More painful than simply watching this band disappear was watch it morph into a hardcore/tribal shadow of its former self, a route that Sepultura was quickly headed down with or without Max Cavalera as their frontman. Even worse, Cavalera formed Soulfly, which I'm sure was great for him to seek out his spirituality in music, but hard for the Sepultura fanbase to stomach.\n\nFast forward over a decade of time, basically a point in time when I had completely given up on anything worthwhile coming out of the Cavalera name. Cavalera Conspiracy helped to ease the disappointment that both Soulfly and Sepultura are, but is nowhere near the \"comeback\" of Sepultura's brand of thrash metal the way the media chalked it up as. Granted, its a little unfair to expect the Cavalera brothers to return to making something like \"Beneath the Remains,\" particularly since that had quite some time ago for both brothers and I'm not sure either one remembers how to write a thrash song. Regardless, \"Inflikted\" does manage to stand up as a respectable release, albeit one that falls short of the great expectations set for it by excessive media hype.\n\nThe way I see it, \"Inflikted\" is like a bridge connecting the worlds of Sepultura and Soulfly, the former in its various incarnations of post-thrash and slightly touching the thrashier music of that band. The latter pops up in Max Cavalera's vocal performance, which is decent enough but certainly makes one miss his growling of yesteryear. Of course, Cavalera's songwriting abilities aren't particularly amazing, nor are his lyrics. Unfortunately, most of the themes present on \"Inflikted\" are more of the same, mostly uninspired rehashes of subject matter that make up the bulk of Soulfly's lyrical content. His excessive profanity was a major turn off for me, as I don't mind the occasional expletive as it emphasizes a point, but too much sounds amatuerish and embarrassing to listen to. \n\nAside from the issues with the front man (who I was hoping to see return to former glory,) \"Inflikted\" is reliable yet unsatisfying music. It does give the listener a positive experience, the title track, \"Sanctuary\" and \"Bloodbrawl.\" All contain instances of good songwriting and not to mention snarling riffs that helps one to remember Sepultura of days past. Unfortunately, instead of fulfill the void, it instead makes the listener want to eject \"Inflikted\" and revisit some of those old Sepultura albums. To be stated plainly, this isn't what most people wanted out of a Cavalera reunion in that it isn't thrash metal. What \"Inflikted\" winds up delivering its audience is a cross breed between \"Chaos A.D.\" and Soulfly's later material. I am not a big fan of either of these, so while \"Inflikted\" has its moments, it also fails to capitalize on the magic that the Cavalera brothers had in their golden era.\n\nTo say this album was a disappointment would be exactly dead on, but I do think it is unfair to expect something truly invigorating and enthralling out of the Cavaleras anymore. We haven't gotten anything truly incredible from them (either together or individually) since 1991 so I can't see why it would happen now. However, for what it is, \"Inflikted\" is a quite decent listen. I found some of the songs to be endearing, aside from the obvious recycling of old Soulfly themes and concepts, minus the Brazilian influences. The biggest flaw in the album is its none too different from everything else going on these days, in that it holds your attention while its playing but you have little desire to hear it again as you seek out better music.\n",
        "\nI don't know exactly what to say about this album. I've heard better but I gotta say that this \"new\" band is the best band to come out in the last 10 years. \"Inflikted\" as an album ain't bad at all either. It's pretty damn good actually, also one of the better so far since the 2000s took off. Simply said, this is the legendary brothers and former Sepultura memebers Max and Igor Cavalera's new project and it's really great compared to todays metal scene.\n\n\"Inflikted\" starts off with a self-titled track and it sure is a killer, one of the best here as well. It's driven by an insane gutiar riff and Max insane growl. \"Sanctuary\" was the song that made me check out these guys and it's maybe the best metal song since Dismember's \"Casket Garden\" (1995!). It goes off with a weird Star Wars-alike sound and then just \"bang!\" and the hell's all loose. \"Terrorize\" and \"Black Ark\" is the first defenitive proofs of this albums groove metal influence as both of them has a touch of Brazilian jungle music or whatever. The rest of the album goes off pretty nice but too average compared to the first four tracks but the last song \"Must Kill\" is a heavy metal monster. There's one edition which features two bonus tracks, \"The Exorcist\" which also is pretty average and the awesome killer \"In Conspiracy\".\n\nThe production is great, sound a lot like Machine Head since it's their classic guitarist Logan Mader who's in co-producing with Max on this album. I've always thought that the early Machine Head and Pantera sounded a lot like how \"kick-ass metal\" was supposed to. This album also got some of those touches which makes it one of the better albums recently released.\n\nThe cast is surprisingly good. You can literally hear that Max and Igor have a passion of playing together and that it has been a long time coming since they did that. The lead guitarist and the basist are great musicians as well. Everything's sounds simply great on the bass parts and there are a couple of insane guitar solos that I just totally love. Max has once again made a couple of immortal metal riffs that you'll remember for days after listening to this. Igor's drumming has since the early Sepultura days grown to something that no other human could recreate.\n\nSo finally to my last comments on \"Inflikted\"....\n\nThere are both good and bad things with this album, I can start with the bad.\n\nThe bad things are not many but some tracks in the middle are a little too average compared to the rest which makes it all a little like a roller caster.\n\nThe good things is that something like this was created in days like these. I've not heard many great albums that have been released after 1995/96 or so and that makes this album particulary good for todays scene.\n\nThe best tunes here is: Sanctuary, Inflikted, Must Kill, Ultra-Violent and if you have the bonus tracks edition then you can count on \"In Conspiracy\" as well.\n\nThis album is defenitely worth checking out and I recommend it because it's great and I don't count on hearing much of this in the future either...\n",
        "\nFirst of all, this is not a return to the old sound of Sepultura. I'm getting a headache from all the wannabes who claim the Cavalera's have returned to the old-school. No, this is more of the same groove metal that they have been offering is for the last ten years. Think Soulfly, but more intense and a with a mild death/thrash influence (\"Hex\", for example). \n\nThis is not a missing link between two Sepultura albums; in fact it doesn't sound anything like a Sepultura album. It is, however, better than most of the post-95 work of the Cavalera brothers. Without a doubt, this is a huge step forward. Unfortunately, there are still too many flaws to make it a good album. If you are looking for thrash you wonâ€™t find it here and if you are looking for the old Sepultura sound you'll come back with a headache. \n\nThe sound is best described as a more intense version of groove metal, with the typical instrumental passages as found on Soulfly's Dark Ages. We can distinguish a small influence from metalcore on some songs, but less than I expected. On a couple of tracks there are also keys present, who provide some variation. Max sounds surprisingly good, but nothing spectacular compared to himself on Beneath the Remains or Arise. His rhythm guitar work is at times pretty bland and simplistic, while Marc Rizzo only has a handful of moments of glory. Rizzo simply does what heâ€™s good at: mindless shredding without any apparent purpose. \n\nJoe Duplantier's bass playing is simply put bad, though that's to be expected because he's not really a bass player at all. The only track with a good bassline is on \"Ultra-Violent\", where Rex Brown handled the low end. I expected something really spectacular from Igor, but that didn't happen. In stead, it's hard to tell he's the same guy that used to drum for the old Sepultura. Although the drumming on Inflikted is pretty disappointing, it doesnâ€™t really bother me that much. The production is crystal clear, which was to be expected from a Roadrunner release. I'm guessing a more raw-sounding production would have been a better choice. \n\nPositive highlights: \n- a couple of cool tracks, such as Inflikted and Sanctuary. \n- better than anything the Cavalera's have done after 1995. \n- if you like groove metal you'll like this. I donâ€™t like this genre, but Iâ€™m sure fans of it will enjoy Cavalera Conpiracy. \n\nNegative highlights: \n- the lyrics. Dear god, this is less inspired than yelling \"death! destruction! kill! die!\" for an entire hour. In fact, that's exactly what these lyrics are. Just look at some of the song titles to get an idea of how crappy the lyrics are. \n- the bass. Perhaps for the next album they'll get a real bass player ... \n- Marc Rizzo. Somebody please tell Max to get rid of this clown and get Jairo Fucking Tormentor in the band. Now that would be badass, even more so than getting Andrea$ Ki$$er to do a Sep reunion tour. Could you guys imagine Â¾ of the Morbid Visions line-up making music again? \n\nTo sum it up, this is basically a more intense version of Soulfly, nothing alike old Sepultura at all. Don't believe all the people who claim this sounds like thrash. Just don't.\n",
        "\nPeople who have been following Max and Soulfly have been aware a few years now that the amount of thrash (and fast music in general) has been increasing on the last two Soulfly albums Prophecy and Dark Ages. For those people this Cavalera Conspiracy album isn’t that much of a surprise. Those who left Sepultura behind around Roots and never checked Soulfly but heard some songs now and then, are in for a surprise.\n\n‘Inflikted’ is the ultimate blend between the last two Soulfly albums and Sepultura during the ‘Arise’ period. There is absolutely nothing new to be found here and no one really complains about this so far. The pressence of Soulfly guitarist Marc Rizzo gives the music an extra dimension since his leads obviously give the music a Soufly feeling at times but he does more than that and some of his leads even bring Marty Friedman and Chuck Schuldiner to mind! His work keeps lesser good songs like “Hearts of Darkness” alive.\n\nThe titletrack ‘Inflikted’, as we all remember, was written originally as a new Soulfly track and as such it does sound like a Soulfly song. The uptempo part with solo is simply mindblowing and Marc Rizzo shows he can really shred and write a melodic and memorable lead at the same time. People who claim to hate Soulfly but say they like this song, are clearly hyprocrites. This song is just as good as the opening tracks on previous regular Soulfly albums. Semi-thrasher “Bloodbrawl” also could have come straight from Soulfly’s earlier Dark Ages album and the second half of this song (the leads and clean outro) is simply beautiful!\n\nSongs such as “Sanctuary” are a return to the days of ‘Arise’ with a touch of modern Soulfly leads, solos and accompanying sounds. Überthrasher “Hex” even goes further and the riffs here are more technical than everything Soulfly and Sepultura have ever done before. “Nevertrust” mixes punk with thrash and features briliant work on leads by Rizzo. On “Terrorize” the mix between later Soulfly and Arise-era Sepultura becomes the most obvious. Superb song!\n\nThe intro and large sections of ‘Dark Ark’ could have come straight from Chaos A.D. I must however deduct some points because of the Celtic Frost/Hellhammer plagiarism on “Ultra-Violent” (which incidentally also is one of the worst songs on the album expect for the faster parts). Also the vocals on “The Doom Of All Fires” could have been better and more powerful. The rest of this midpaced song however is pretty good pounding thrash metal though and the up tempo part at the end is more Sepultura than Sepultura have been since ‘93. \n\nThe album could even have been better and one knows this ‘project’ was written and recorded quite fast. There could have been more faster songs on here so there would have been a better balance. Unfortunately the album slowly dies at the end with lesser good songs such as “Hearts of Darkness” and “Must Kill”. So even though I really love this album I know they can do even better. Of course I hope they will do so on the next album and therefor I cannot give more than 90 points.\n\nStand outs: Sanctuary, Terrorize, Hex, Bloodbrawl, Nevertrust\n",
        "\nLet’s get straight to the point: 80% of Sepultura group were the Cavalera brothers and their split was terribly painful. Since that day, Sepultura would not have been the same again. They went groove and sometimes too metalcore. The reunion was rumoured when Igor left definitely the historical band to join again the brother and play new music together once again. This fact was quite “epochal” in the metal scene and everybody was terribly curious about this new project and I was too.\n\nSo here I am, curious like a child when it’s Christmas day. The distorted guitars intro is quite odd and reminds me Chaos A.D. period and the following semi mid paced riff is nice but the use of some keys sound already bothers me a bit. The Oriental melodies in the guitars are something very strange and in general the atmosphere is quite gloom. Max’s vocals are always powerful as 15 years ago while the Igor way of playing here is a bit martial so it’s hard to describe.\n\nThe guitars riffs are hardcore worshipper and mostly influenced by Soulfly period with some paused chords. The production is clean and also for this, the riffs sound a bit sloppy and a bit suffocated by the rhythmic session. The patterns on “Black Ark” are typically hardcore/groove with tribal influences. Anyway, so far this album sounds better than Roots…definitely more metal oriented. Anyway what I dislike is the use of keys sound and the paused chords parts.\n\n“Sanctuary” is definitely more metal with good up tempos and more thrash metal sounds. The peaks of the past are difficult to reach again but this song is enjoyable and truly violent. The riffage here is far better. Quite forgettable the mid paced, groove tempos on these songs; only the few up tempos are quite better. Hard to stand a metalcore song like “Ultra-Violent” that seems to come out from Against album. \n\n“Hex” is surprisingly fast as hell with a punk oriented beginning and following thrash metal tempos and guitars riff. Here Igor does a really great job while the vocals are truly extreme. One of the best songs here. The other songs are constantly in balance between hardcore/groove semi mid paced tempos with speed restarts by the end(“The Doom Off All Fires”, “Hearts Of Darkness”) and total up tempos (“Nevertrust”).\n\nWell, what else can be said? This album could have been perfect in the period between Chaos A.D. and Roots and, exception made for few songs, it is mostly groove metal. I expected something really different but those are 2008 Cavalera brothers and now it’s your choice but don’t expect another Arise, for example.\n",
        "\nLet's face it, Sepultura wasn't Sepultura after Max left and while Derrick Green has a good voice and can write some cool riffs, he just isn't Max Cavalera. It's kind of like Van Halen with Sammy Hagar, he's good but there's no way that he can replace a legend and I became a Soulfly fan after Roots and the fact that Igor left the band as well is just the final nail in the coffin for Sepultura for me.\n\nNow that that's out of the way, how does Inflikted hold up as an album since it's just as much Sepultura as the titular band itself? Pretty damn well. Inflikted sounds like the missing link between Arise and Chaos A.D. with just the right amount of groove thrown in with the trash and even a few death growls put in to get even more out of that old-school Sepultura sound.\n\nThe title track that opens this album up features some kick-ass leads from Marc Rizzo that totally get stuck in your head and the album grips you from there. While some lyrics repeat in The Doom of All Fires which makes the song sound like it should have been saved for a potential second album, it doesn't detract too much from the album and there are a number of great moments that make up for it, like the incredibly thrashy Hex and the acoustic breakdown that ends Bloodbrawl that actually stands out in a musical environment that is oversaturated with breakdowns and doesn't sound contrived at all.\n\nIf you're one of those people who truly adores old-school Sepultura, then you absolutely need to hear this. It's got everything that made early Sepultura great while at the same time sounding fresh. It may not be the absolute best album of the year but I'll be damned if I said that it isn't buying.\n"
    ]
}