{
    "Band Information": {
        "Country of origin:": "United Kingdom",
        "Location:": "Rugby, Warwickshire, England",
        "Status:": "Active",
        "Formed in:": "2014",
        "Genre:": "Sludge/Doom/Post-Metal",
        "Lyrical themes:": "Misanthropy, Addiction, Nature, Folklore, Science, Misery",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2014-present ",
        "Number of Reviews": 1
    },
    "Band Reviews": [
        "\nThis album is something else and I've been listening to doom in general for a long ass time. As a teen I listened to November's Doom, Swallow the Sun, Amorphis and other similar bands and this album is right up my alley. 'Mire' has the strong death aspect to it that I've always enjoyed, sometimes even pushing the boundaries of what I would be willing to put into a purely \"doom\" or \"sludge\" playlist. This is faster and angrier than typical for the genre, it really is pushing against the boundaries in a good way. Even at its heaviest the overall feel of the tracks still conveys brooding and despair, it's not straight up bravado. \n\nConjurer are clearly taking inspiration from quite a few genres with this debut LP. It often alternates between black metal and death metal influenced doom with a healthy dose of metallic hardcore akin to Code Orange or Converge thrown in to keep it fresh. This might throw a lot of metal enthusiasts off, but it works really well, it reminds me of Neurosis or Centurions Ghost at times. \n\nThe vocals are solid, for the most part it's variations on death vocals, sometimes layered over each other to great effect. One of the biggest ways this release differs from the rest within the sludge/doom genre is that it's focus is on aggression. It does not want to let up and if it does, it's for a short amount of time to build up the power to rip your face off all over again. This is doom with blast beats and it's beautiful. \n\nA stand out track for me is \"Retch\", the shortest on the LP but it kicks like hell. It opens with an old school blackened thrash assault and evens out into a groove that sums up the whole album very nicely. There's no wasted time. None of the tracks go longer than they should, there's no intermission or filler. Every second of each song contributes to what is possibly the heaviest album of 2018. Not heavy in a noisy way, but like an iceberg... an iceberg with teeth and malicious intent. \n\nThis album is exactly where I want the future of sludge/doom to be going and I could not be more excited for their second LP.\n"
    ]
}