{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "San Francisco, California",
        "Status:": "Active",
        "Formed in:": "2010",
        "Genre:": "Post-Black Metal/Shoegaze",
        "Lyrical themes:": "Philosophy, Personal thoughts, Melancholy, Abstractness, Introspection",
        "Current label:": "Sargent House",
        "Years active:": "\n2010-present ",
        "Number of Reviews": 66
    },
    "Band Reviews": [
        "\nUuuughh, Deafheaven. When I thought Alcest were the best example of pretty boys using Black Metal to seem \"astmopheric\" and \"deep\" this comes out. This album makes Mastodon sound manly and WITTR look creative, it's the 124089th attempt at making your band seem like intellectual giants that can make something mind blowing and transcendental (Liturgy reference) but in the end, it just sounds like rhythmic white noise with grand canyon reverb and BMTH vocals. I think why every Indie Rock hipster blog type person praises this album is because of that, they want to seem like they can understand what's happening in this album and that they're smarter than you, which brings us to my next point\n\nSunbather doesn't seem like it's directed towards metalheads, it's moreso for the Indie Rock Shoegazer crowd. That also seems to be why so many metalheads hate it, I don't actually believe that metalheads hate this because of its sound, but for the fans and the people in the band. The people in the band themselves look like they would have an elaborate 25 minute long artisanal coffee brewing process every morning while listening to the New York Times podcast. In fact, most Black Metal fans or even metalheads in general hate Post-Black Metal/Blackgaze for this, it's a combination of 2 very different genres, but only the Shoegaze fans can enjoy it, this is also why Trap Metal and Metalcore aren't big things in the Metal community, metalheads don't want to accept a genre that combines 2 genres that are too different from each other. I've seen some metalheads even go as far as to say Deafheaven isn't Metal, they are Metal to me, but they're like Starbucks Metal, boring\n\nEven if I hate this album as much as the next person, I feel like this is the certain reason to why people don't like it, but that's just my 2 cents. Overall this album is bad, but not for the reason you think. I think if they were a pure Shoegaze, Indie Rock or Emo band, they would barely get an ounce of hate by critics. They make Black Metal accessible for the hipster blogs. They're also known as the band that pioneered \"Blackgaze\" and so obviously metalheads will go to hate the most popular band of a genre they dislike. I mean they were literally used in one of Apples iPhone 5c Keynote commercials, that's not Black Metal at all. So it's obvious why this gets so much hate imo\n",
        "\nFor the most part, I don’t think anybody is surprised that Deafheaven’s fifth album sees them go full on shoegaze. As well as 2019’s Ordinary Corrupt Human Love turned out, it was clear that the “black” component of their blackgaze style was getting minimized. The most extreme elements played a supplementary role to the more melodic instrumental segments and the rasps were starting to feel like something the vocalist had to do rather than something they wanted to. Change was clearly on the horizon.\n\nWith that in mind, it’s nice to see the musicians adapt well to their alternative rock influences completely taking over. The focus remains on the guitar textures, which maintain an almost suffocatingly dreamlike ambiance. The less frequent blasts allow the rhythms to take on a more abstract attitude. The vocals also maintain a distant spot in the mix, rarely shaping the melodies but still providing a reassuring presence.\n\nThe album’s real surprise comes with the songs themselves, which offer more rounded lengths that never reach the ten minute mark. While this would suggest more accessible songwriting, there still isn’t much priority placed on particularly memorable compositions. Great Mass of Color and The Gnashing are immediate standouts for their more active beats. It’s also quite neat to see a specter of their blackened past maintain itself at the climaxes of Villain and Mombasa.\n\nWhile Infinite Granite may fall a little shy of its ambitions, it still feels like a natural move in Deafheaven’s overall trajectory. Like all their past albums, its atmosphere is pleasant to lose yourself in and the structures are serviceable even if they aren’t overtly catchy. One could hope for the vocals to step up a little more in the future or the transitions fit to a more accessible mold in the future, but nothing can really deter the band as long as they maintain that signature vibe. This won’t replace your copy of Loveless or Souvlaki, but at least it’s giving it a shot in their own way.\n",
        "\nFrom what I've observed, it seems that reviews and thoughts on this record from this site and other places have, so far, mostly come from a place of being a fan of Deafheaven's most critically acclaimed works like Sunbather and being disappointed at what their new record has to offer. I come into this review with a rather different perspective. You see, I have never been a Deafheaven fan. I find their blackgaze/screamo/hipster black metal/whatever-you-call-it routine to be corny, bloated, and uninteresting. I believe that their real strengths are in their clean interludes, particularly \"Irresistible\" from the Sunbather album. So, naturally, when I heard the first single for this album, \"Great Mass of Color\", and the cleaner sound it had, my hopes were sparked for a good Deafheaven album for once, one that might be a style where they have more strength in. It was not to be.\n\nThis album is very much the logical evolution from Ordinary Corrupt Human Love, the band's 2018 album on which they added in a lot of material that was removed from heavy music, including entire songs that were decidedly post-rock and also featured vocalist George Clarke's first attempts at clean singing on a Deafheaven record. On Infinite Granite, heavy music and harsh vocals have more or less been thrown out the window entirely in favor of a cleaner style that is a mix of post-hardcore, A Rush of Blood to the Head/X&Y era Coldplay, and Slowdive. The latter two sounds show up the most, and like Slowdive but unlike Coldplay, there aren't many memorable, ear-catching parts. Not much songwriting going on (always a bit of a problem for this band). Just an abandoning of heavy music and an emphasis on creating a \"dreamy\" sound with lots of atmosphere and clean guitar melodies. The only time the band showcases the sound that most people think of when they think of Deafheaven is at the end of \"Mombasa\". Why they decided to only kick the speed and aggression into high gear at this final point, I don't know. Other that that, things never really pick up the pace. \n\nOne might think that with clean singing abilities now under his belt as well, George Clarke would be able to deliver a more varied and interesting vocal performance on this record after testing such a thing out on the previous one. However, hardly any such variation exists. Harsh vocals only make three brief appearances on this record: at the ends of \"Villain\", \"Great Mass of Color\", and \"Mombasa\". Otherwise, Clarke sings the entire record in a clean voice. His singing turns out to be just as one-dimensional as his screaming: no dynamics or emotion, stonefaced, and boring. Occasionally he slightly varies things with a whisper or two, but otherwise it's very dynamically flat wandering melodies that really don't have a hook to identify with, or even a real place in the music. The tone of his voice even resembles that of Slowdive's Neil Halstead a bit.\n\nThis is music that's just there. A vegetable. Not alive and breathing and active. It's serviceable and technically competent, that is for sure. But it just isn't special. Again, I say that \"Great Mass of Color\" was a promising single when I first heard it. I thought that, at the very least, it was going to be a power ballad of sorts in the middle of a heavy album, if not a straight-up cleaner-sounding album. Out of all the tracks on the album, it's the one that has the most songwriting and memorable moments going on. However, now that I think about it, maybe I only think that because it's the first single from the album and the style of Infinite Granite was only sort of cool the first time I heard it. Now perhaps it's all meant to drift past you and just be background noise, like I imagine a lot of post rock and shoegaze is. There's a time and place for that, but not if I want an engaging listen that I know is great the more I listen to it. Infinite Granite as a whole simply does not vary itself enough or put enough emphasis on songwriting along with the atmosphere for it to be anything but a bore. Ironically, the few moments where variation does occur (like the aforementioned \"Mombasa\" ending or the instrumental ambient piece \"Neptune Raining Diamonds) are among the album's most memorable moments. This is a problem consistent with Deafheaven music throughout their career, but this time they backed off on the distortion setting. Even the comparatively short track lengths (by Deafheaven standards) feel way too long. My hopes for a good Deafheaven album: not realized. Listen if you need background music for a long drive or something.\n\nOh, one more thing - what kind of album name is \"Infinite Granite\"? Why is there so much granite as to seem infinite? Is granite ever even mentioned or alluded to? And why do the song titles look like they came from games of exquisite corpse?\n",
        "\nBefore I start, I'm perfectly aware that a score of 70% is both too generous and far too low. Please hear me out before you tear me apart for it.\n\nI absolutely adore Deafheaven. They're one of my favorite bands ever, and I've even gone so far as to review the singles of this album even though I knew they would be on here. Still pissed that I missed the release date by a week, but eh, I've listened to it. We can very well talk about how they popularized blackgaze with Sunbather, but everyone and their mother refuses to shut the fuck up about that album, so I'm going to skip it.\n\nWith \"Great Mass of Color\", they completely flipped everyone's expectations on their heads- Particularly after the pure black metal murder weapon known as \"Black Brick\". They went full 90s shoegaze/dream pop in a way that's more reminiscent of The Jesus and Mary Chain, R.E.M., The Cure, and other bands. On a scale from Slowdive to My Bloody Valentine, the intensity and songwriting falls nicely in the middle. You can tell that these guys have an incredible love for and understanding of shoegaze, and they've managed to infuse some of the technicality taken more often in metal than modern rock and infuse it into shoegaze. If you ask me, they do it right, and they really have made a pretty good shoegaze album. With that being said, all of the songs are pretty good, but none of them truly stand out (i.e. \"Glint\", \"Luna\", \"Vertigo\"), maybe aside from \"In Blur\".\n\nThankfully, the only real low point in terms of vocals is \"The Gnashing\", which I've come to warm up to. I don't think the vocals here are good, I just like them despite them being bad, like Siren Charms and Device. If you know that band (Which you might, given it was a short-lived Disturbed spin-off that somehow aged better than the majority of their material), you know what I mean. Otherwise, Clarke is a damn good singer. However, this brings me to one of my two huge problems with this album: There are only four instances of screams. Firstly, the last two lines in \"Great Mass of Color\". Secondly, the last two lines in \"Villain\". Thirdly, two screams that don't even comprise of words in \"Other Language\". Fourthly, and thankfully substantially, the last two minutes and forty-five seconds of the closer, \"Mombasa\", which sounds so goddamn phenomenal. Those last two minutes and forty-five seconds of \"Mombasa\" does everything that Sunbather attempted to do (Save for the interludes) better than that album- And you can fight me on that, Sunbather's the most fucking overrated thing I've heard, even if it is decently good. Trust me, I'll get to that album when I actually want to listen to it, which probably won't be for a long while.\n\nThe guitarwork is mostly resigned to shoegaze-y stuff. There are a couple of metal moments, such as the end of \"The Gnashing\" and that last two minutes and forty-five seconds of \"Mombasa\". There are many more metal-tinged moments, but they are still more rock than anything. \"Mombasa\" also prominently features acoustic guitars, which is nigh uncharted for Deafheaven! While the guitarwork is pleasant and all overall, it's decidedly way safer than I ever could've feared Deafheaven going, even if it still has the same Deafheaven sound, charm, and structure-bending that they're known for.\n\nMaybe it's me just not remembering anything, but I don't think Dan goes past a brisk mid-pace in terms of his drumming. It never even really picks up twice, with the one time being relegated to, you guessed it, the last two minute forty-five seconds of \"Mombasa\". I should just be copying and pasting this at this point. As for the bass, it's awesome. It's audible, it sounds fucking nice, and the basslines are pretty good, which leads into the production. The production is really fucking good, somehow managing to layer everything (And there's a lot) in a way that not only sounds good and feels natural, but also leaves everything clearly audible. The vocals (Get this) also aren't fucked in the mix like how they are in Sunbather. I don't give a fuck if it's tradition in shoegaze to have the vocals be towards the middle to back of the mix, it's very fucking easy to get that wrong, and Sunbather really gets it wrong. Meanwhile, with Infinite Granite, the vocals are pushed a bit towards the middle, but they're just a bit towards the middle while still being in the front of the mix. Overall, it's the perfect compromise (At least for me), and I think this and RARE by Hundredth are how shoegaze vocals in terms of the mixing should be the standard in modern shoegaze going forward.\n\nAs I said, there's very little here that really stands above the pack, and the reason for that is because 1. It's all rather safe, and 2. It's all very similar. It makes for a nice shoegaze albums that flows well and all makes for a really listen, as the tone and atmosphere perfectly line up with what is to be expected. That being said, only the last two minutes and forty-five seconds of \"Mombasa\" takes any sort of risk at all, and that leads me to my second problem.\n\nThis is the safest take on an enormous risk I've ever seen.\n\nWhile the technicality and tinge of metal is nice, there is nothing done to distinguish this from the rest of the pack when it comes to both past and modern shoegaze. Unfortunately, I feel like RARE accomplishes the transition from heavier material with little to no prior clean singing to shoegaze much better, as the soundscape of RARE is much more dynamic, and because the simple fact that every song on that album stands out from one another and stands on its own. Infinite Granite doesn't really accomplish either of these, even if half the songs do truly come alive and burst out from simply being shoegaze in the last minute or two. It's the fucking 'A Thousand Suns' plague. Again, the overall sound is wonderful, but you come to expect more from Deafheaven, especially since they occasionally channel that here. Only the last two minutes and forty-five seconds of the fifty-three and a half minute album try to break out of the mold. I know, inverting the formula you popularized isn't anything exactly unique or revolutionary, but neither is what you did here. And while shoegaze is very much about putting the egos of both the artist and the listener aside, it doesn't mean that one should resign to complacency, and this album is the soundtrack of complacency. That reason is why I only have this album at a 70%. I'd love to rate it higher, but I just can't do so in good conscience. However, I will say that I happily bought some merch from them, and wouldn't regret the purchase of their album. I love it, my subjective rating for it is much higher than I have it, but I do have to bring a reasonable amount of objectivity to the table. While OCNH was an amalgamation of this sound and New Bermuda (Or rather a transition from New Bermuda to this album), I think it's preferable, even with its low points. I hope that if they ever try again with this sound, they get a bit more creative, a bit more metal, and have more screams. I may love this, but I want to see what could have been. Oh, what could have been.\n\nSongs to Recommend: \"In Blur\", \"Mombasa\" (I love \"The Gnashing\", but I can't entirely recommend it)\nSongs to Avoid: None. They're all pretty good, and I constantly cycle between which song (Save for the three above) is my favorite, but the sheer similarity of them all keeps me from making a decision there.\n",
        "\nI always love American bands who do not sound American. Deafheaven are one of these. The were called 'post black metal' once but we can forget that now. Because this album is pure shoegaze. Nothing new, nothing fresh. well, perhaps it is 'new' to those who have no grasp of musical history anyway. Shoegaze goes back to the late eighties with The Jesus and Mary Chain (Scotland), My Bloody Valentine (Ireland), Lush (England) and many more.\n\nI only know their 'Sunbather' album which was in essence already a shoegaze album but with blastbeats and harsh vocals. Now that was kind of fresh, an interesting mix of styles, when it was released back in 2013. But in all honesty 'blackgaze' (mix of black and shoegaze) was already happening since 2005 really, mostly in France, so Deafheaven were not quite the first but they did give give the subgenre a popularity boost.\n\nBut in all honesty, when the novelty of a subgenre wears off, only the quality of the music/songs remains. And after a few years I stopped playing Sunbather because I simply got bored by the vocals. (I did see them live in 2014 but the band simply did not convince in the middle of the day in the burning sun. Not very fitting)\n\nSo, now in 2021 they've gotten rid of harsh vocals (still some hints and small parts though) and metal drums. And....surprise! Only the shoegaze remains. Without those added elements, they now sound over 30 years old. No problem if the material is great. Is it ?\n\nWell, the material is entertaining enough. Good shoegaze is a soundscape which makes you espcape reality, Preferably late at night, and when alone. I never listen to shoegaze in the company of others. And 'Infinite Granite' does a good job providing such a shoegaze soundscape. It's not a classic album, it won't really go down in history, but it does the job. I've listened about 7 times to it now and no 'song' stands out because it is one constant vibe. Exactly what I want right now from such an album.\n\nJust don't expect something like Sunbather, that's all.\n",
        "\nDeafheaven is a band that I always respected more than enjoyed, it seems like yesterday they were one of the most polarizing bands in extreme metal for allegedly popularizing the whole “blackgaze” trend of the early 2010’s, much to the chagrin of black metal elitists and the die-hard fans of Alcest. However, over time the band developed their own cult following and even became “the one black metal band your obnoxious hipster friend who subscribes to Anthony Fantano and reads Pitchfork like a gospel won’t shut up about”, but I digress, in 2021, 3 years since their last record, Deafheaven came back with Infinite Granite, and this is the album that made Deafheaven click for me, for better or worse.\n\nFor starters, one of the elements that people praised and lambasted Deafheaven’s music for was their lush, shoegaze and alt-rock inspired leanings which they incorporated into black metal in order to create aggressive music that was also, for lack of a better word, beautiful, that was certainly the case with 2018’s Ordinary Corrupt Human Love, but for Infinite Granite, the band completely discarded their extremity and fully embraced post-rock and shoegaze in a very unabashed way. Infinite Granite is a shoegaze and post-rock album through and through, almost to its detriment because outside of the occasional brief moments of extremity which include the trademark shrieks of vocalist George Clarke in tracks like “Great Mass of Color” and “Mombasa” (which are two of the better tracks in the record), those tracks also have some aggro guitars and drums, but overall this is a shoegaze record, to make a tired and overdone comparison to Alcest, this is Deafheaven’s Shelter. The main issue is that while the band are very talented and have tight and consistent performances, this album doesn’t really do anything different or unique, its just a shoegaze record with brief, but few and far between moments of extremity.\n\nThat being said, I also think this is a solid album and what clicked with me is how Deafheaven are just doing what they want to do, regardless of what elitists and hipsters say about them, and for the music itself, this album is a distillation of the best elements of the previous record, for as massive as Ordinary Corrupt Human Love was, it felt like two albums meshed into one, that isn’t the case here, while the band’s execution of shoegaze is not particularly unique, they still do it with both precision and passion, its no secret the guys at Deafheaven love bands like Slowdive and My Bloody Valentine, and it shows, the music as a whole shows a deep understanding of shoegaze, because while this is not at all a metal album, the band still display a sense of depth and sonic intensity that’s still in line with metal even if the music is serene and psychedelic. The band achieved this like any good shoegaze through layered guitars, but a unique twist the band employed is having a more dynamic melodicism, its not just a wall of sound. The clean vocals of George Clarke are also surprisingly good, the perfectly match the music’s tone and atmosphere, and that’s also another aspect where the band succeeded, the music’s atmosphere has a distinct mysterious but also serene feel, like the band wants the listener’s to be calm but alert at the same time.\n\nOverall while Deafheaven didn’t reinvent the wheel on shoegaze, they also didn’t need to, the whole “blackgaze” trend died out as soon as it got momentum, and bands that stuck to it just got boxed into their niche without any way to grow or expand, Deafheaven decided to go on a different direction and only time will tell if they continue this direction or try something new down the road because they clearly do not wish to do Sunbather again, whether their fans and haters like it or not.\n\nBest tracks: In Blur, Great Mass of Color, Mombasa\n",
        "\nI love Deafheaven and I'm not afraid to admit that. From Roads to Judah to Ordinary Corrupt Human Love, this youthful act has turned black metal on its head with tranquil interludes and major key riffs, accompanied by a warmer tone that makes them more approachable than others within the genre. Not that they're the first to incorporate such elements, but the execution holistically is unique and hard to find elsewhere. You can argue they aren't black metal because of the way they represent themselves aesthetically, but their music has always had roots there nonetheless. \n\nThis is where I draw the line and make testament that they've lost their goddamn minds with this release. I was listening to a podcast recently where Bryan Funck was elaborating on how he doesn't believe Thou is a metal band. Aaron Turner of ISIS has made a similar claim before and I sincerely wonder what it takes for these artists to end up with their heads so far up their own asses that they deny the labels placed on them when they exist to help both them and us as listeners. As if they can't settle for what they've been characterized as in some desperate attempt to appear distinguished. My bet is that's what is happening here with Deafheaven, and unlike the aforementioned bands they've absolutely succeeded. Congratulations, everyone. This release isn't metal at all.\n\nBut here's the issue. I've believed in this band for a long time and there are plenty of others who've done the same -- because of what they already were! It's like they've forgotten they have a following. If I wanted to listen to Coldplay, I'd listen to Coldplay. Except now we've got Deafheaven's brand-new-take on Coldplay materialized into an album that nobody asked for. That doesn't make you unique, it makes you look clueless.\n\nThe low score isn't just earned by its intention. There are plenty of bands who've experimented with their sound before. The album itself features clean vocals almost in its entirety. The guitars work together to establish the signature wall of sound, the clean vocals don't contribute enough to override them, and blah blah blah it's shoegaze. Oh, wait. What's this? Just about every track ends in a near chaotic erruption that whispers of the kind of sound I actually want to hear. When I heard the first single, I wrote it off because I thought it was the first track. Surely the album gets heavier after the opener, right? Wrong. It doesn't. What a disappointment.\n\nAnd I even like shoegaze, but there's something missing here. It's stale. The melodies aren't memorable. The singing is nasally, but there's something else about it that I can't quite put my finger on. It just doesn't fit. You made post-black shoegaze before and now you make plain old shoegaze that isn't even good. Yuck.\n",
        "\nRemember when Deafheaven released \"Sunbather\" back in 2013 and become one of the most controversial black metal artists for the next couple of years? Well since the hatred for them has died down, a lot of people have been warming up to Sunbather as well as their other releases. I personally didn't jump into the Deafheaven hate bandwagon, as even with their weaker stuff, they still had a lot going for them. So when their latest album \"Infinite Granite\" was announced earlier this year, me and others had a lot of hopes for them, especially since this new album seemed to be moving in a more rock-orientated sound. Well after I gave the album a listen, I can't help but feel a little let down.\n\nOkay, let's get to the positives first. The instrumentation of Deafheaven has always been great, and Infinite Granite does have plenty of good instrumentals. \"Great Mass of Color\" remains a highlight for me as well as the best song in the album, as the melodic and heavenly guitar riffs and soft drumbeats give the track a very angelic and calming atmosphere, and is great for some soft shoegaze. \"Lament for Wasps\" is also another highlight for me, as the track goes for a more upbeat tone, which is executed well with its energized riffs and technical drumming. And the lyrics are also great, as they are simple and basic, but its execution works spectacularly with the atmosphere of the tracks.\n\nHowever, the main problem with this album is the blandness of some tracks, mainly with \"The Gnashing\". The more rock-based track should sound good in theory, especially since it has some decent guitar riffs. However, the way the track is composed makes it sound like every other generic shoegaze band right now, especially with the monotonous \"hard\" parts. Seriously, if you were to play this song in a café, I wouldn't even know it's from Deafheaven. Even with releases I didn't enjoy like \"Ordinary Corrupt Human Love\", it still has that special Deafheaven sound that I know. In many tracks, however, it's kinda generic, and that's not a good thing. Another example of this would be in \"Villain\", where it sounds like it's trying to replicate the sound of some of the other tracks, and the emo-like screams in the middle of the track do not help it at all. With Deafheaven moving into a more rock direction, it seems like they're sacrificing their signature sound, which is a bad sign for just about any musician.\n\nAnd speaking of vocals, this is easily the worst Deafheaven has to offer in terms of vocals. George Clarke can be a good vocalist, and even in this release, he still has some good vocal moments, particularly in the track \"Mombasa\", where his soft, melodic singing flows perfectly to the track's soft guitars and slow beats. However, where his vocals skills fail is not only when he screams in an emo-like tone, but it also fails in sounding like every other shoegaze vocalist. To see what I mean, take a look at \"In Blur\". This is one of the more stronger songs, especially in the instrumentals with a good transition from a soft tone to a more intense atmosphere. However, George's vocals sound very weak, as his singing gets a bit too soft and boring, almost like he's trying to sound like most other soft rock bands. And again, those emo screams do not help his vocals get better in some tracks. While his vocals still have some good moments, they can also be terrible with some emo shrieks and tedious singing.\n\nI listened to this album two times already, and I still can't give it a higher score than a 50. Yes, it does have some good moments, especially in some tracks, but the more dull instruments and worsened vocals make this album a disappointment for me. I mean, this is the same band that made Sunbather and New Bermuda. What happened here? While it is okay for those who are a fan of some general shoegaze, for Deafheaven fans, I recommend you skip this one.\n",
        "\nWell, I think this song pretty much sets in stone that, yeah, we aren't really getting any metal on Infinite Granite. Sure, \"Great Mass of Color\" and \"The Gnashing\" had some bits at the end- The former even having some screams there- but that's about it.\n\nAnd honestly, while I really do miss that and feel that a little splash of distorted guitars or screaming would give it that je ne sais quoi to top everything off perfectly, I'm not broken-hearted. The material we got is fantastic so far, save for George's vocals on \"The Gnashing\". In fact, I went into this song with the simple thought of \"Please just let it be good\". Those five words were all I could think when I saw that they released a new song. \"The Gnashing\" really scared me into fearing that \"Great Mass of Color\" would be the best we got vocal-wise. Thankfully, my fears were proven incorrect. George's vocals sound really nice here. They're good, they're pleasant, and although the band is going full-in on Shoegaze, his vocals are at the front of the mix, which I love. I found that to be a crippling problem in Sunbather, which most people just said was \"a staple of shoegaze, it's better like that\". No, it was a shit decision to mix them like that, I don't care if it was a staple of either subgenre, it just didn't sound good.\n\nThe guitars are more like \"Great Mass of Color\" than \"The Gnashing\", and they're the lightest and most shoegaze-y they've been out of the three singles. There are even what sounds like acoustic guitars on there. Towards the end, they take more of an old alt rock sound (Well, 90s or early 2000s, anyways), and while it doesn't pervade the mix, it adds enough to make quite the difference. It all sounds wonderful, especially when combined with the drums (Which are a midway point between Daniel's usual breakneck pace and the more relaxed drumming of the previous singles) and the bass, which sounds so fucking good here. It has a bit of a buzzing sound which rounds out the mix, and it elevates the sound so much. Like standard Deafheaven material, it goes through quite a bit of structure-shifting here, with the most obvious cue to this being the drums going from (For example) quick and cymbal-centric to slower and more tom-centric. The song, overall, is a mix of pleasant instrumentation and an overall wall of sound, with the former being both what draws one in and the staple of Slowdive-sounding shoegaze. The latter of which goes with the lyrics, being hazy, confused, and blurry because it becomes tough to comprehend everything unless one focuses on one thing in particular at a time. It makes for incredibly engaging repeated listens, and given that the song has many layers and fantastic musicianship, you don't feel drained by listening to it over and over. Even then, there's the one flaw of simply wishing that it had a bit of heaviness, metal, or screaming at some point, but the song doesn't suffer all too much from the lack thereof.\n\n\"Great Mass of Color\" made me excited for Infinite Granite, as I was all for the new direction, being a shoegaze fan. \"The Gnashing\" wowed me with the instrumentals, but it made me really scared about the vocals, since they were rather poor. \"In Blur\" has quelled me fears and has brought back the excitement in spades. I can't wait to hear the new album, and while I'm still holding on to hope for some screams and heaviness at times, it's pretty much confirmed to me that we won't be getting those. Still, I'm really happy with what we have, and I can't wait for more.\n",
        "\nI'm genuinely confused as to why both \"Great Mass of Color\" and \"The Gnashing\" are the two lead-off singles. By all accounts, they're fundamentally very similar songs on the surface. While \"Great Mass of Color\" was more bouncy and vibrant, this is rather melancholic, moody, and brooding. The harshness comes solely on the ambient side, and I think it works rather well. Honestly, everything sounds even better on the instrumental side, even if there isn't as much variety or 'structure-bending' as \"Great Mass of Color\" or their usual material. If anything, the song it comes the closest to structurally is \"Near\". The guitarwork very much scratches my Deafheaven itch, and the drums and bass are also pretty good, being a bit more in line with the frantic yet natural feeling of Deafheaven's usual work. There's a bit of a comforting feel to it, weirdly enough, and I find that in the elements that are more towards the back of the mix. This is excellent musicianship. So, if everything's great, why am I rating this so much lower than \"Great Mass of Color\"?\n\nIt's the vocals. We have to talk about the vocals. While I absolutely loved George's vocals on \"Great Mass of Color\", this track reveals a potentially fatal flaw for the upcoming album: He has *no* range here. While \"Great Mass of Color\" didn't have all too much range either, it did have some, and it was at least dynamic. Here... George's vocals just aren't really good here. Maybe it's because it's all in a lower key, but... He sounds like Brann Dailor from Mastodon (Singing on Crack the Skye and onward) if Brann was one-note in his singing- So pretty much what would happen if you took away everything that makes Brann a fantastic vocalist. Sure, it gets a little bit better on repeat listens, as I can grow to like it while still feeling that it's bad, but then again, I did the same with Ryu's vocals on Mozaiq (Blood Stain Child), and I've been an avid In Flames fan who enjoys all of the newer albums. And if you know In Flames, you know that Anders has a huge reputation for his vocals, which I personally find to hold up on Reroute to Remain and Soundtrack To Your Escape. I'll defend him otherwise, but not there. You can still like and enjoy something while recognizing that it's bad, and these vocals really aren't good. In fact, dare I say it, in some sort of parallel universe where there was a Brann Dailor feature on here, this track would be incredible, it would blow \"Great Mass of Color\" out of the water. Hell, I wish there was even at least one scream in the back of the mix or something to freshen things up a bit.\n\nI'm tempted to rate this a 70%, but I'm not too sure. On one hand, every other element is perfect. On the other hand, George's poor performance here (Which is especially disappointing considering \"Near\" and \"Great Mass of Color\") can not be excused. I'm a huge Deafheaven fan, I always will be, and I do love both of these singles. I already bought a bunch of merch from them including tablature books for Sunbather and New Bermuda. Hell, I'll probably listen to the new album a ton. With all that being said, it is absolutely imperative to recognize one's flaws and address them, no matter how much you admire them. And the beautiful part about it is that, as artists, they always strive to better their craft, so the criticism of their flaws is vital. There's actually one band I can compare Deafheaven to right now, and that's Hundredth, minus the whole 'delete our entire prior discography from our history and pretend like it never happened' bullshit. They used to be a hardcore/metalcore band who eventually changed to Shoegaze with their album, Rare. It was actually really damn good, and you probably heard all about it because it was huge back when it released. Then again, I only learned about it within the past year, so maybe you didn't hear about it. Just like with Deafheaven now, they had one or two songs with backing screams, and that was such a phenomenal fucking touch that should've been used more. Thing is, in terms of screams (And in terms of their prior discography), Deafheaven is absolutely superior, so such a utilization would be even better. However, I get the feeling that we'll only get that on \"Great Mass of Color\", and that's a wasted opportunity. If you're able to sing in different styles, it's only a boon to sprinkle in some variety, and I don't think they did. But only time can tell, and I'll be eagerly waiting for the album to release.\n",
        "\nDeafheaven's had a pretty extensive history of being quite the divisive band, with many adoring their blend of black metal and shoegaze/dream pop, and others thinking that they're just hipster trash. There generally isn't much of an in-between. So... After \"Black Brick\", a single that goes full-on black metal, what's next? The heaviest album of their career? Nope. 100% dream pop. The lightest album of their career, which has been stated to have the screaming and metal mostly absent.\n\nWait, what?\n\nI only found out about this song (And the existence of the album as a whole) today, so trust me when I say that I was completely thrown for a loop. To any of Deafheaven's detractors, this is the exact nail in the coffin that they've been digging for: An opening heavily inspired by The Smiths and a song that only contains two screams, one of which being of the very last line. However, it's actually pretty damn good, and the subtleties of the songwriting here, particularly in terms of how the exact instrumentation shifts rings true to Deafheaven's overall style, which tends to go unnoticed compared to their blend of black metal and shoegaze- A surface-level observation.\n\nThere isn't really all too much to talk about here. For once, the drumming isn't frenetic, the guitars are remarkably like how they were on Ordinary Corrupt Human Love's more dream pop-styled parts, the bass sounds damn good, and the clean vocals... Are actually really fucking good, like how they were on \"Near\", but more... Natural, softer-sounding, and overall delightful. The song's certainly not so pleasant in its lyrics, like most of Deafheaven's works, though it's not so much as angsty or scream-worthy as it is just... Dreamy (Or nightmare-y?). In a way, it rings completely true to what you'd hear in shoegaze or dream pop songs.\n\nMost will look at the stark contrast in the overall sound compared to their previous works, but in a way, this style of music emphasizes their musicianship and songwriting structure, which is the same as it's always been. They get quite a lot done in six minutes, but it doesn't quite feel like it as much on the first listen or so, and you only really get all of it on repeated listens. Taking into account the previous album, this furthering of direction isn't quite as surprising, but the fact that they fully stepped into dream pop surely is nonetheless. One of the huge pros here compared to Ordinary Corrupt Human Love is that they trimmed the fat of what really didn't on that album. If you've listened to that album, you'll know what I mean. And to any of their fans worried about this shift in sound, they're very much the same band they've always been, they're just trying something different this time, and if you don't like the direction, I doubt it'll be something permanent.\n\n\"Great Mass of Color\" is a song which I could very much find tranquility or fall asleep listening to, which is certainly not the case for most people with most of Deafheaven's works (Myself excluded, I quite love passing out to \"Luna\" or \"Glint\"). If you're a fan of Deafheaven, do give it a chance. Sure, I miss all of Deafheaven's trademark harshness, which is the biggest thing absent here, but it's a side to them I'm nonetheless excited to see. It's a continuation of \"Near\", if anything, and that was one of my favorite songs from their last album. \n\nLet's see how the album turns out when it's released.\n",
        "\nDeafheaven is an interesting band. Many attempt to box them into a specific category- black metal, blackgaze, post-metal, post-black, etc. While these all are certainly true in certain cases, there isn't really one subgenre of metal that encapsulates their entire discography. This is something that is not only remarkable, but also refreshing. They have such a distinct identity, and that's probably why they grew so popular. Many learned about Deafheaven through their breakout album, Sunbather, which was a pretty good album, though it certainly isn't their best, as they have greatly progressed over the years. I didn't learn about the band through Sunbather. In fact, I didn't even learn about them until last year. I would end up discovering them with New Bermuda and \"Glint\", which is from this album. While New Bermuda (Which is seriously underrated amongst the band's fans) had more of a post-metal sound with its melodies, Ordinary Corrupt Human Love goes for more of a \"dream pop meets black metal\" sound, which correlates well with the theme of yearning for love. Like the shoegazing elements of Sunbather, the dream pop elements of Ordinary Corrupt Human Love make for some of the most delightful and unique pieces of music I've heard in a while, especially when combined with the black metal sound. When it works, it's fantastic, and it showcases some of the best of Deafheaven's career. When it doesn't work, you get some songs which are lesser compared to the band's stellar heights.\n\nEverything sounds fantastic, and everything is mixed well. There isn't actually too much to say here. The band knows what they're doing, and it shows.\n\nThe best combination of these elements comes in the form of \"Glint\", which is the highlight of the album from the first few notes to the ending. While the dream pop sound isn't there as much as in the other songs, it is probably the best usage of the sound on the album, with exception to \"Canary Yellow\" and \"Worthless Animal\". Its intro is probably my favorite piece of music period, and the track as a whole is my favorite Deafheaven track- even being above others like \"Luna\" and \"Baby Blue\" (Both from New Bermuda) for me.\n\nThe definite low point of the album for me is \"Night People\". Although the clean vocals and female guest would typically seem conventional, this is admittedly very experimental for Deafheaven, and it's certainly worthwhile for them to attempt it. Although it does more than \"Near\", I find the George's vocals don't stack up to Chelsea's in \"Night People\", whereas they hold up well enough on their own in \"Near\". \"Night People\" will likely leave more of an impression for most people, and that's understandable. It sounds like the ideal single on paper, but it just doesn't work for me in practice. But who knows, maybe it'll work better for you.\n\nIf anything, \"Near\" is proof enough that repetition, lightness, and clean vocals can very well work for the band. It's a daydream and a longing put into music form, and it works remarkably well. There isn't all too much to say about it, other than that the directness and simplicity of its lyrics and song structure work. Still, I may be in the minority when it comes to this sort of opinion, and I'm sure that the majority of listeners prefer \"Night People\" to this song. The reason I keep comparing the two is that they're the only two shorter and lighter songs on the album, and they're both the only ones with George's clean vocals. They'll naturally draw a lot of comparison.\n\nOrdinary Corrupt Human Love is a different take from Deafheaven, and although I personally find it lesser than New Bermuda as a whole, there are some songs that absolutely bury anything from Sunbather and Roads to Judah. It's not to say that those are bad albums, it's simply to say that the songs that work well on this album are just that incredible. I can commend their attempts to experiment and to break away from their conventions at times, but their efforts are either bulls-eyes or they miss the mark entirely. The sum of its parts does make for a good album, but I wouldn't say it makes for as perfect/nearly perfect of an album as many might state, though it also doesn't make for nearly as shitty of an album as its detractors believe. Then again, it's something you'll have to listen to for yourself. It's somewhat tough to review Deafheaven's works here, since each track is so different, and each leaves such a different impression. It isn't that the tracks I haven't listed are decent or unremarkable- far from it- it's just that each person will have the tracks they love more than the rest and vice versa. Don't take my word or anybody else's as law. This is definitely an album that you should listen for yourself. Don't herald it nor write it off just based on the reviews. This can certainly be said for every Deafheaven album, but it's the most relevant with this one.\n\nCheers for the Grammy nomination, fellas. I'm pleasantly surprised they even still covered metal in 2018, though I doubt that'll last.\n\nSongs to Recommend: \"Glint\", \"Worthless Animal\" (An excellent song whose melodies, both dream pop and metal, are simply harmonious)\nSongs to Avoid: \"Night People\", \"You Without End\" (It's not bad, it just doesn't entirely click and slightly lacks cohesion)\n",
        "\nHere it is, the follow up to the divisive album Sunbather. It seems for the most part that everyone either loved or hated that album. The first thing that I noticed was the overall tone of the guitars sounded darker and heavier compared to Sunbather. They do not sound nearly as bright even in the shoegazey sections which yes are still there in pretty much every song in one for or another. But the guitar playing seems to be more metal like with some chugging sections which were surprising and almost tech/prog like at some points. The standard blast beat carnage sounds similar to what it did on their first full length Roads to Judah. Although this album proves that they are now far and beyond what they did on that album and its a good thing I think. Having full time drummer Daniel Tracy has really helped improve Deafheaven's sound and his drumming once again is very good on this album. Nothing disappoints with the drums. You will also notice that the vocals sound different yet again. Each Deafheaven album the style seems to change and now it is a slightly lower pitched scream but it is still grating and the vocals have always been my least favourite part of the band. One thing to add is that it feels like every song has to follow a certain build up sequence to some shoegazey break. It works most of the time but eventually as the album goes on I found that it got slightly tiring just because it felt so expected. \"Oh here we go again...\" Nonetheless these sections are still wonderful to listen and the seamless flow between harsh sections to the more ethereal is accomplished tastefully through the use of hooks and such. \n\nAlot of people were wondering what the follow up to Sunbather would be like. Some say it can't be topped. Others were worried it would be Sunbather 2. I can certainly say this isn't exactly a Sunbather 2 which is a huge relief but I will say that Sunbather still comes out on top by a slight margin.\n",
        "\nUnderstandably, I've had maybe 5-10 people recommend that I try listening to Sunbather. Which... given the irony of the genres here, is quite a task, because post-black metal to me doesn't read as my forte. That said, given the amount of praise (or, lack thereof, in some cases) with this album I keep getting, I feel... ever so more inclined. So... fuck it. This review is for you guys. You people who won't shut the fuck up about it. I'm nailing this down in the coffin. You guys deserve to know I fucking despise this record, and my job right now is to communicate to you why everything about this album reads to me like senseless dribble garbage garage fuck noise that I didn't need to hear.\n\nFirst of all, I can at least praise some aspects of this album: I can tell these guys care for their sound. As, given the direction as far as guitars and drums go, I actually quite like it for that. \"Dream House\" maybe has the most appeal for me in that sort of regard, given how... methodical it gets. That said, a lot of the actual \"sound\" that we want to call it is basic repetition - and most of the guitar work sounds like the same 2005 happy summer vibe shit I expect from a #totallyradical Summer montage commercial back on Cartoon Network or some shit... and if I wanted 2000s vibes, I'd be listening to American Idiot - which, honestly sounds like a much better time right now. It's... weird in a realm of metal to have that kind of \"happy\" vibe sometimes. This album... doesn't help itself in that regard. At all. It just tries to coexist. But it separates itself as this strange and malformed oily mush. Credit where credit is due, however - whoever mastered this did the right thing, making those particular areas of sound more pronounced in the record.\n\nOn the topic of \"pronounced sounds\", though... where the fuck are the lyrics? Where's the vocalist? Is he in the other room half the time when he's singing? Because it certainly sounds like it! The instruments practically drone him out half the time. It might be a much more personal thing for me, but I almost value coherence in vocals more than most things in life, and listening to this album makes me feel like I'm listening to auditory abortion. All I fucking hear is \"aaaaah, ahh ahhhh, aaaaaaaaaaaaaah\" half the time. I can't tell if I'm supposed to actually hear this shit or not, and it pisses me off. Notwithstanding the horrid lyricism as is - maybe I didn't need to hear the guy. The lyrics themselves sound like high school poetry. It's as if the vocalist got hit with a hardcore wave of depression after his crush rejected him and called him a nobody for wearing a Sum 41 t-shirt to a Matchbox Twenty concert. Now he writes post-black metal for spite. It's too bad that's shit too, I guess.\n\nGod, honestly, fuck this album. There's not a whole lot for me to say here - it's same-y. It's whiny. It's preachy. It's a generation late. It's fucking stupid. I'm surprised this is music. I'm surprised an album of this caliber is even liked around here sometimes. I'm surprised there's a fanbase. Me, though? I can do without. I'd rather get skin cancer.\n",
        "\nSince Reviewing \"Sunbather,\" the album went on to become one of my favorite metal albums of the 2010s. Its melancholic riffs, odd and ambient instrumentals, and melodic chorus guitar and piano is more than enough to have me come back to that album despite its bad production. For \"New Bermuda\" however, Deafheaven reaches higher in experimentation and execution with a much darker melody, more darker heaviness, and this time a more darker album cover. Many in the metal underground can argue that \"New Bermuda\" is the better album over \"Sunbather\" and have mixed thoughts about it. I still love \"Sunbather\" because it had much more melancholic riffs, but this album was definitely a much better improvement for a few reasons.\n\n\"New Bermuda\" has less melodic music than in \"Sunbather,\" but the overall heaviness of the album is still well executed. The production of this album is a big improvement where I can be able to hear George Clarke's vocals really well. His approach is more distinct than in \"Sunbather\" where its more powerful that it resonates with the heaviness of the music. The music itself has some great heaviness, less melancholic riffs, and even void of instrumentals as well. That not only makes the album shorter, but it also gave the album more self-identity that can make them stand out in the growing blackgaze movement. It still has melodic parts, because that also makes Deafheaven more distinct as a band that will help reach a broader audience like with \"Sunbather.\" The piano parts are great, and the atmospheric sounds heard in \"Baby Blue,\" and \"Come Back\" are soothing. While I would enjoy more of the melancholic sounds heard from \"Sunbather,\" \"New Bermuda\" is still a satisfying musical evolution from beginning to end and has a great amount of heaviness that will pleased both metal and non-metal fans.\n\nAnother complaint I did have about \"Sunbather\" was its complex lyrics. I couldn't fully understand what the Songs mean, and whether are not it was going for a dreamy direction or a depressing direction. In \"New Bermuda\" however, the lyrics are a little more understanding, and much shorter as well. Some of the Songs are going for the melancholic factor. Whether it be questioning one self in \"Brought to the Water,\" or imagining death in \"Gifts for the Earth,\" the album wastes no time in making things confusing nor experimental lyrically. The lyrics have more identity and understanding. It still has complexity, but never loses luster throughout the album.\n\n\"New Bermuda\" is Deafheaven's best improvement so far. It is considered to be the band's best work, but do I personally think it's better than \"Sunbather?\" Well as musicians, I think Deafheaven have gotten better, but I always go back to \"Sunbather\" for having more melancholic moments than on this album, and I personally love the ambience heard on that album too. I think that \"New Bermuda\" is better production wise, and lyrically as well. So I will definitely say, that I might come back to \"New Bermuda\" as well.\n",
        "\nLet's be honest here. Nobody likes to use the word \"Post\" next to a genre of music. While post-punk had released a lot of influential bands back in the 1980s and spawned new music like goth rock and alternative rock, \"Post\" is one of those words that is meant to alienate music lovers into thinking post something is a genre describing what the previous genre used to be. It's also extremely hard to pin out any characteristics when it comes to post-rock and post-metal. In recent years, an up and coming new style of metal is developing to become what might be the next mainstream metal style, post-black metal or what I prefer to call it blackgaze. When I first heard that term blackgaze I had no freaking clue on what it was other than it being a fusion genre of black metal and shoe gaze music. That is until I heard a song off this album called 'Dream House' where I found out how blackgaze sounds. It sounded pretty good and I thought it was gonna kill me. I will say that I will take this music over metalcore and deathcore any day. I also found it baffling to find out that 'Sunbather' is listed as one of the greatest 100 metal albums according to rolling stone, and I don't know why it's there. It could of been Acid Bath or Candlemass, but no we get this newer album on that list that seems to alienate most metal fans, especially black metal fans who are more Authentic and extreme with black metal. So I decided to review the whole 'Sunbather' album to see how the entire album stacks and to see what the hype is for this album.\n\nI'm going to start by taking a look at the album cover. The album artwork is far from being any metal, it is the kind of album that would attract hipsters of course. I will give it credit for leading outsiders to listening to some metal at least. The font on the album is neat though I have to say, it is simple and it doesn't need a complex logo where nobody can read the name. Looking at the cover it made me not want to listen to it because I thought it was another indie band album cover. Though I give Deafheaven credit for having a bold move for this cover as this is an album cover that would help expose some metal by misleading people into thinking it's indie music.\n\nFrom the start of the album, it blasts the listener with the use of blast beats and shrieking vocals with opener 'Dream House.' What makes this song and the rest of Sunbather stand out is the bold use of melodic keys, and acoustic guitars. Though most of the time, Deafheavens black metal inspirations seem to rely on fast guitar, shrieks, and blast beats nothing else. Although it is not really a bad thing, as most of the album sounds good, but it is nothing different as the album progresses. The extreme parts in the album also seem to sound lo-fi in a way, which is not very good. Sure it may be technically \"black metal,\" but coming from this kind of music, the production could have been a lot better. I really enjoyed the instrumentals though, more particularly the song \"Windows\" as it sounds very dark and ambient reminiscent of the music I am normally listening to that incorporates dark ambient music. The same goes for \"Please Remember\" where the beginning may sound like its going nowhere in terms of musical structure, but it does have qualities of dark ambience that made the Song good to listen toThe transition from extreme music to calm and soothing sounds are a plus throughout the entire album and it does bring in some diversity to the album even though it doesn't change in structure. The music for \"Sunbather\" is well executed, it has some really catchy melodic guitars, some catchy beats, the whole album is pretty catchy and soothing. Though I wish the vocals in this album was well recorded, and didn't sound hard to listen to without headphones.\n\nWhen it comes to lyrics in \"Sunbather\", they are much more different from the kind of black metal I hear, even if it is not extreme lyrics. When reading the lyrical themes of these songs, it is almost like having a conversation, and not having any short of meaning behind the Songs. However, the lyrics for \"Sunbather\" is not entirely bad, it has some really good moments of lyrics heard in Songs like in \"Please Remember,\" and \"Vertigo.\" Some lyrics I found questionable in Songs while most of it still sounds something unique into Deafheaven's music. I wouldn't necessary say the lyrics are high points on the album, but still kind of unique in a way.\n\n\"Sunbather\" will always be an album I will joke about and continue to joke about for years, but the album is something that shouldn't be avoided. Sure, Deafheaven's critically acclaimed album may alienate extreme metal fans, but it is still a unique album that manages to still be good. From what I had heard, Deafheaven attracts music fans that are not even fans of metal. So if Deafheaven can be a gateway drug to metal music such as even black metal, then that will be something I will respect. I can get why it has been critically lauded by even mainstream music reviewers as it has a unique take on blackgaze as a genre and will definitely take this style to much success in the future. Even though the album has its flaws, I will definitely continue to listen to \"Sunbather\" once in a while.\n",
        "\nDeafheaven is a band I’ve enjoyed seeing change and experiment throughout their career. On this album, Deafheaven took a more comfy cozy approach than the melancholy riffs and melodies on “New Bermuda” (which I believe is their best album). \n\nThe album opens up with “You Without End”, which was the song I had been waiting to hear from Deafheaven. Another post rock/blackgaze masterpiece, but this time with heavy usage of piano throughout. I really did enjoy this song, but the spoken word on it was unnecessary. Nonetheless, it was a great opener for this album.\n\nThe rest of the album is basically Deafheaven’s signature style of post-black metal, but with a more cozy vibe than on other releases such as “New Bermuda” or “Roads to Judah”. The songwriting is stellar, and each musician brings something exciting to the table.\n\nThe riffs are atmospheric and pair nicely with George Clarke’s emotional screams during the black metal sections. During the more post-rock sections, the riffs are basically the same, but less distorted. The lead guitar melodies are also great and blend wonderfully with the rest of the music.\n\nDaniel Tracy is a super creative drummer, suiting the music perfectly. Firstly, the tonality and production on the percussion is perfect, from the snare to the cymbal crash, to the toms. Secondly his drum fills are perfectly placed. He can do calm, fun drum patterns on quiet sections, and he can blast beat when appropriate, which is accompanied by his amazing drum fills.\n\nBass lines on this album are actually very good and add another layer to the music making it even more atmospheric. I particularly love the bass lines throughout the songs “Canary Yellow” and “Glint”. \n\nThe only big complaint I have about this album is the track “Night People”. I’m not sure why they felt the need to include guest vocals from Chelsea Wolfe and the other vocalist on this song. This song did nothing for me, but luckily it was the shortest track on the album, so it didn’t taint my enjoyment of the album too much.\n\nListening to Deafheaven is such an experience, and this album is no exception. Deafheaven plays some nice atmospheric black metal, but goes beyond the norm of what black metal is. Yes, there were post black metal bands that did what Deafheaven did before Deafheaven was a band, but in my opinion, Deafheaven does what they do better than anyone else. This album was refreshing, comforting, and just straight up brilliant!\n",
        "\nThis album has a lot of negative reviews out there. For me this was my first Deafheaven album and working back through their backlog has been an interesting journey. Each album is a distinct experience and Ordinary Corrupt Human Love is the most distinct of all. That isn’t to say it’s their best work but rather to validate its place within the discography. They are labelled as post-black metal, which is a rare label to see and can mean a few things. Deafheaven have received this label due to the experimental approach they have to black metal, something they have always done. So, it seems odd to get upset when that experimentation takes a direction that could be considered a departure from the rest of their music. It’s just a hell of a lot brighter this time round and I think that’s thrown off the conventional black metal fans who tend to thrive on being the exact opposite of ‘bright’. In their album New Bermuda, you can hear riffs and sections that touch on what OCHL is doing. I feel like they decided to expand on that aspect of their sound and apply it to the heavier parts of their albums to create a whole new sound.\n\nTwo things are plainly present here, shoegaze and black metal. I love this combination because it just works, they are both genres known long brooding songs and often a platform to express negative feelings or destructive thoughts. Again, something I really enjoy. What OCHL does is use the conventions and stylings of both genres instrumentally but applies a tone that is more upbeat and positive. It’s the same familiar transitions, riffs and beats but they have been turned upside down. This is not only a cool concept for an album, but it also shows great craftsmanship musically, to deconstruct the two genres they have been known for and rebuild something new and interesting out of it. They essentially deconstructed themselves as a band. So not only does this fit in with their music but it also speaks volumes of Deafheaven’s awareness of what they do. Essentially, the point of contention for some listeners might be the aesthetic which goes against anything typically found in extreme metal genres.\n\nThe vocals are great, on a regular black metal album they wouldn’t be anything special, but they are used with the bright music in a way that is really fitting. A lot of the notes end high where they would end low and the rhythm is different. The vocalist clearly has a solid understand of the genres and he freely manipulates them for his own use. This will be restated in many ways, but I can’t help but express how much creativity is at play here. It has really breathed life into some very old ideas and styles. Other bands have attempted the core concept presented here but this is the most successful version of it that I have heard. The lyrics are stunning, I’d recommend reading them as they contribute to the attitude of the album in a very casually poetic way.\n\nInstrumentally this album is damn near a masterpiece. It grooves, it takes it’s time and yet it is always making its point. There’s a lot of aggressive metal guitar work like tremolo picking used on this album but it’s done on a brighter key or scale, so it just sounds nice or “pretty”. It really is the reverse side of black metal and I’m not sure if it would be as possible without the slow shoegaze aspect of the songs. It still has heaviness, but it’s been inverted, I think this album is a good lesson on the idea that aggression doesn’t equal heavy. The drumming really starts to pick up when the tracks grow in intensity, becoming just as noisy as you’d hear on any other metal record. Particularly the track “Glint”, when it reaches its peak, it goes off like fireworks on the night of your life. It’s all the parts of previous albums that made Deafheaven unique put into one fully realized album that doesn’t borrow anything for the sake of contrast.\n\nOverall this is a very emotionally stirring album and I am very glad I found out about it. It’s one of those few albums that feels like you’re exploring something as you listen to it and I haven’t felt this strongly about an album in a long time. It takes you on a journey and I think that’s worth more than any amount of genre loyalty or pandering.\n\nThis album is like your life flashing before your eyes as you lie on the verge of death but everything you see makes you happy.\n",
        "\nBefore listening to this album, I spent at least a week listening to their last album before this one on and off because I'd never heard it before this. After finishing Ordinary Corrupt Human Love here, I'm walking away from it with a feeling of immense ambivalence that I haven't felt for any album up until this point.\n\nComparing New Bermuda to this over here is no contest. New Bermuda is leagues better. Deafheaven is a band I thought I understood to an extent. After downloading and thoroughly enjoying their debut LP for its stark post-metal, shoegazey beaming through like light trying to force its way out of a cold, hollow statue of its darker, sinister black metal self, and being indifferent towards Sunbather, but enjoying it in the end, I had nailed their style down to post-black metal. Obviously they stick to the aesthetics of black metal, but the sound isn't on the cold, warmongering, Satanic horde bearing, axe-wielding, corpse paint drenched side. The American five piece care more to choose a sound of warmth and comfort, an engaging and approachable production that wraps the listener in velvet and lulls them off into a slumber, serenading with soft chord progressions, ambiance, acoustic passages, and more. For better or worse, Deafheaven's uniquely different approach to the black metal formula delivered much needed progression the black metal genre desperately needed, spawning some very genuinely fantastic post-BM bands like Harakiri for the Sky, Vaer, Fen, Alcest, and so on.\n\nOnce the last few seconds of the final song on here, \"Worthless Animal,\" wrapped up (I should mention that song is the only good song on this entire album), I came to the conclusion that Deafheaven either isn't a metal band anymore, or they don't want to be a metal band anymore. I knew I wasn't going to like this once the album started and we're treated to some awful jangly, starry-eyed guitar strumming backed up with reverb-y, echo-soaked vocals that sound terrible. I like George Clarke and think he is one hell of a screamer, but I have no idea what he was thinking when he penned this song. \"You Without End\" is, without a doubt, the most sappy ass song I've ever heard. Unbearable soft emo rock with Chelsea Wolfe reading an excerpt from a book or a poem or something. Not at all metal, not at all post-black. This goes on for nearly eight freaking minutes with no interesting changes or transitions to break up the monotony. \n\nNearly every song on here with the exception of two are absurdly long. Now I know Deafheaven do make long songs. I am not averse to long song lengths. Weakling's \"Dead As Dreams\" goes on for twenty minutes and its able to maintain my attention all the way through. Deafheaven have penned long songs before. In fact, \"Violet\" is one of their longest songs and is my absolute favorite song by them. But the difference between songs like \"Violet\" and songs like \"Canary Yellow,\" for example, is that there are enough ideas to stretch out the former song for the desired twelve minutes. It has earned those twelve minutes. Almost all of these nearly ten minute and twelve minute songs feel like they're being padded for time because the band didn't have enough material to put into the song that would justify the length. Artificial padding really pisses me off in music and it's especially bad in this album. Songs that are long for the sake of being long. Lots of people accuse Sunbather of having artificial padding, and while it is true, it's worse here. Even the songs that are short like \"Glint\" and \"Near\" feel overly long.\n\nThe performances of the band members are just insulting. Kerry McCoy, what the hell happened? On New Bermuda, he was creating some incredibly memorable riffs that were filled with vibrancy and raw emotion. Now it seems like all he wants to do is strum along his guitar these unceasing melodies that are unfulfilling, dry, and lifeless. Even the sparse black metal riffs don't feel as fast, punchy, or have that much emphasis on being placed in the forefront of the recording. They feel like an afterthought, which hurts to say because even the black metal sections on here aren't as good as they were on previous albums. There's a part midway through \"Canary Yellow\" where there's this weird, groovy transition (there's almost something of a mid-paced thrash break in one of the songs that sounds out of place) and its so awkward and weird that it just takes you out of the song. Not like the song was ever good to begin with thanks to the awful plucking guitar parts that sound so buttery and sugary sweet, and that drum beat along with the bass line makes me want to puke.\n\nGeorge Clarke feels content to croon a little, which is a new thing for the band, I think. Never heard clean vocals from them. However, I'd be really happy if he never attempted such a feat again if it's ever done like this. What George had done here is instead of sticking to one style screaming - and interwove it cohesively into the album's sound in a way that compliments or adds to the package, he chose to whisper sing over these terrible soft ballads like \"Near\" and \"Night People.\" His screams, by the way, aren't far from the worst, but they're no winner here, either. I suppose drummer Daniel Tracy does his job pretty well, although, as I made mention earlier, some of the transitions feel glitchy and awkward and they can take you right out of the album.\n\nSpeaking of vocals, Chelsea Wolfe has vocal credit on this album. She performs on two songs, the opening track and the sixth track, \"Night People.\" Now, I will not bash or criticize Chelsea on this album. I don't listen to her music, so I can't judge her performance here with how she performs on her actual project. Her voice is very pretty, I must say, but I will be ripping the shit out of this song. What the hell is this? The second I heard this song play, I forgot the last song existed. Whatever glimpses of hope I found in the previous song \"Glint\" were all snuffed away like cocaine off a hooker's ass. It's utterly terrible, the worst song on the album, by far. What we have here is a piano ballad with Chelsea Wolfe and George Clarke while every member of the band plays second fiddle. It's fucking atrocious and Deafheaven deserve a special place in Hell for penning it. I will say this, though - the only pro from listening to this song is that I never have to listen to it again. Now I know what song to skip should I ever listen to this album again. To be honest, that seems very unlikely.\n\nI don't have much else to say. This album is awful. I could deal with the fact that it's not metal, or that it's not as metal as the last few Deafheaven albums. My problem is that the chasm of difference between these musical stylings is so vast and gaping that everything feels rushed, and the songs are too long, and the performances are sub-par. I feel like there wasn't a lot of thought put into this album and that, at the end of the day, this album is only good as wallpaper music to be listened to solely in the background because if you pay any level of serious attention to it, you're going to be very angry and disappointed like I was. Seriously, I might just sell this thing and get my money back. What a waste of $11.\n",
        "\nAfter finishing this record, I came to a realization that I truly do not understand Deafheaven or rather Deafheaven doesn't understand themselves. It just doesn't fit in their discography. The way this LP started off, was like if you mixed your average ballad on the radio with some emo rock washed in heavy reverb. Everything about this record is off, the mixing is off, and the production reveals some of the flaws of the instrumentation. I'd say 'Honeycomb' is the weakest track on the album, ironically being a single from OCHL. It reminds me that I am not listening to metal but rather alternative rock or some screamo band. Which brings me to the vocals, they're comical. \n\nSeriously, what the hell happened? I know avant-garde, experimental and those new-age classics are out and about and there is quite a bit of outsider music that goes insane, but the thing about Deafheaven is that you are essentially mixing apples and oranges here. It just doesn't work. Pianos, orchestra, and some riffs from a Avril Lavigne song thrown all together with some autistic screaming layered on top of it. That's Deafheaven. Maybe some droning here and there, some 'field recordings' and samples. These songs slog on and on with tracks usually being 7 to 10 minutes long, often leading nowhere.\n\nOne exception I will make is the final track from this LP 'Worthless Animal' which has emotionally powered riffs, sound and honestly it's a bit of a banger. It also distinguishes itself from the rest of the album, being different in execution but not style. Your signature Deafheaven sound is on this track but it doesn't leave itself in a echo chamber, in its own ego. I feel like carrying candles lit in a audience swaying back and forth and 'feeling the vibe man!' What a load of bullshit for a black metal band.\n\nAlso I might add, please listen to 'Night People' for reference to why I have decided to trash the album. I mean it is truly a pop ballad and doesn't belong here, but Deafheaven is a metal band? This brings me back to the start of this review, what is Deafheaven exactly? One minute I am hearing post-rock, then some ballads, 'blackgazing', then straight drones. Listen to this song then immediately switch to 'Honeycomb', a hard-hitting post-screamo track. It shows inconsistency like a poorly written story from David Cage. The flow of this record is poor, from high to lows like New Bermuda and past material. But despite all of this that doesn't distract from the albums upsides and strengths however, since the track referenced lifted my expectations of the band. Kind of like how a fifth grader will once in a blue moon blow you away with his beatboxing-kind-of-way. \n\nThe performances overall on this entire album is halfway decent, at times I think a couple of minutes into the track there will be moments logical and full of sense but then the vocals kick in and... my God how atrocious. You know, I think Deafheaven should throw in the towel and just write instrumentals and OSTs for '13 Reasons Why' with some occasional pop artists on their compositions from time to time. Do they even want to be a metal band? Or are they content with this crossover music?\n\nThis album isn't bad because it doesn't resemble metal, it's just not good period. There are good moments from time to time, like a Michael Bay film but it definitely doesn't save the piece as a whole. Experimentation is not bad, and I am not a metal purist by a long shot but this loses the shine. Did it achieve its goal? God, no. I felt like John Lennon, Mayhem, Brian Eno and Aerosmith decided to throw together some autistic mess with that intro track, and now I can't believe I even tried liking this album. Seriously, mix 'Mother' with some Lynyrd Skynyrd and there's the beginning of this LP and probably this entire record. Can Deafheaven stick to one thing and do it well?\n",
        "\nOne reason why I don't have a whole lot of reviews under the 20% range is I don't really go looking for things that would piss me off. I prefer to find the great things in life and tell people they are idiots if they don't have it /like it. The \"hype\" around Deafheaven just seemed to radiate \"AIDS pool,\" so I steered clear of it. Plus, that album cover, it's not even the fact that it doesn't fall under \"trve kvlt black metal art design,\" its the fact that it looks like some sort of celebrity endorsed cosmetic. That's just not a good idea no matter what genre you're in. Nonetheless, the inspiration to write seemed to strike and after looking at positive reviews from people I respect, decided to give this sucker a spin. But let's judge the book by its pages rather than its cover. \n\nThe pages seem to read.....modern rock. That's what this sounds like. Modern rock with screechy vocals, the occasional blast beat and some fast picking. Nowhere is this more apparent than in opening number Dream House, where every 90 seconds or so the band decides to \"break it down\" and go into Creed mode. I suppose I could whine about how false, untrue and false and untrue the lyrics are, if I could understand them. You know boys, the reason Venom scared so many people back in the day is because you could actually hear Cronos sing \"tearing the flesh of the weak, tender child,\" \"I drink the vomit of the priest\" and \"teacher caught me masturbating underneath the desk.\" Granted a lot of black metal does indecipherable raspy vocals, but a lot of black metal also sings in foreign languages. Hey, I like to hold what I understand to a higher standard, give me a break.\n\nThen you have moments like the title track, which actually sound like decent doomy post-rock for the first three minutes before the band needs to drop everything to retune their instruments for the fast section. Because true black metal always has to be fast, right you guys? Samael called, they said they were scarier with a less-than-two-minute synth interlude than anything that actually tries to push the limit with this album. What's that? Deafheaven have one of those too? Well too bad it sounds like something Billy Joel was using to warm up for the 52nd Street sessions and then promptly discarded it because that's what it was, scrap paper.\n\nSo why is it only a 12? Well, the album clocks out under an hour. It could have been a full CD length 79 minutes long. Hell isn't that a requirement of the \"post\" sub-genre? Reader, if you want black metal that bends the rules, go pick up some Necromantia. It will probably smell better too.\n",
        "\nFollowing Roads to Judah and Sunbather, New Bermuda was a surprise evolution in Deafheaven's sound. This definitely is no copy of their past albums, but it has all the Deafheaven elements plus heavier/trashier riffs. So don't worry, you'll love it if you're already a fan, there's still plenty of shoegaze in there.\n\nStarting off with Brought to the Water, a perfect example of this album's sound. The first riffs could be confused with a trash metal band, followed by a very fast-paced incredible black metal section, then, out of nothing, emotional guitar solos, and finally a classic Deafheaven shoegaze interlude. I forgot to mention, this are just the first 5 minutes of the album, but you'll find varying combinations of this in all the songs. In general, New Bermuda is heavier than what you would've normally expect after listening to their first two records. This heavier sound comes mostly from some guitar riffs, and Clarke's singing is stronger and more present than in Sunbather, by present I mean it stands out, not that he sings longer, as you can feel vocals are there only when needed. Tracy's drum playing is superb as it was in the prior album, I sense some improvement in creativity, there's a lot of quality as speed.\n\nThe band brought their A game with this album, but of course: it's not all perfect. A few heavy riffs feel forced, so this makes a few of the transitions not exactly the best. Although this could be a good thing, considering their music is so emotionally strong, sort of a roller coaster of feelings, so this transitions can give you a small break to recover and not feel emotionally exhausted. I believe Deafheaven managed to please all audiences (or most of them at least) by showing they can be a true metal band and not just \"metal hipsters\", all while keeping the most important and recognizable aspects from their original sound in past albums. \n\nFavorite tracks: Brought to the Water, Luna.\n",
        "\nThe year of 2015 must be the most controversial and mind blowing for black metal. First, you have the complete tribute to madness which goes under the name \"Exercises in Futility\" by Mgla then the catchy melodic \"A Furrow Cut Short\" by Drudkh and then this album. Or should I call it a golden piece of black metal art? Maybe a post rock anthem of the new decade? Probably both because this is the album that makes this perfect combination.\n\nTo start things off the first track is a complete haze of blast beats and highly distorted guitars. This goes about 5 minutes and then we have a little acoustic break-which sounds more like a sudden pause of the music-to suddenly end with a post rock melody. This is the initial form of almost every song in this album, and freaking yes, this is the only thing that this record needed to embrace me as a listener. The black metal parts are what it is supposed to be: a straight dive into the deepest abyss with the guitars sounding like a storm of notes and melodies and the percussion serving the role of the silent stronghold. Although sometimes the drums have a little pitch and even sound out of rhythm this, in the end, serves as an advantage! The vocals have this catchy suicidal element from the one, yet they just come to the absolute perfection with the addition of screamo influences, the perfect addition to the black metal side of the one; the slow music carpet on the post rock side on the other. That part is what really swells the interest on the slower parts and makes songs like the self-titled or \"Please Remember\" so catchy. literally there are moments when even someone who doesn't come up with this style of metal can hold the classic black metal pose and shout \"arrrrrrrgghhhhhh\". Giving such a classic tone and feeling to the experimental and evolution step of black metal truly is a smart move and enhances the nihilistic emptiness of the genre. It's like the musicians themselves shouting to you \" Feel the darkness. You are alone..\".\n\nThere are of course some tiny issues with this release, which pretty much stand on the fact that some variety never caused trouble to anyone. Some parts in addition sound a little too rigid and dull using overused melodies from both genres. The last part is the fact that the mix of those elements, black metal and post rock, doesn't give me the exact feeling of mixing. Sometimes you hear the black metal parts and then the others; it would be awesome to see the band showing their true colors by representing the two genres like two powers who struggle to overcome each other and finally emerge to something bigger.\n\nMoreover, one big credit has to be given to the lyrics, the cornerstone for the final production of this chaotic atmosphere that \"Sunbather\" manages to produce. The songs are mostly talking about the inner thoughts of entities with a completely twisted and strained psyche, or describing the some of the darkest addictions like alcohol-these forms of expression have to be categorized as a pure suicidal brain storming. Some examples are the first song \"Dream House\" which quotes as follows:\n\n\"I'm dying.\"\n- \"Is it blissful?\" \"It's like a dream.\"\n- \"I want to dream.\"\n\nWhich for me the total exposition of a naked mind left with nothing but the desire of death, or the self-titled which starts as: \"Held my breath and drove through a maze of wealthy homes. I watched how green the trees were. I watched the steep walkways and the white fences. I gripped the wheel. I sweated against the leather. I watched the dogs twist through the wealthy garden\" -a full sacramental journey in a nostalgic place.\n\nIn conclusion, I find that this record, despite the minor things that may tickle some old school listeners, gives you the feelings that a true black metal album is supposed to: darkness, emptiness and the anticipation of filling the void inside a human soul.Nothing else has to be talked about this it is fully recommended.\n\n91/100.\n",
        "\nThis ain't no Transilvanian Hunger, Hvis Lysett Tar Oss, Nemesis Divina, or anything like classic black metal. Oh hell it isn't. What we have here is a piece of modern brilliance, which is fueled by agony, misery, and beauty. If black metal was compared to the timeline of classical, then Deafheaven would hang around somewhere between the Romantic and the Modern periods- not that loyal to the Baroque and the classical roots, and surely has its innovations and renovations that concern the musical structures, themes, and atmospheres that were added to the genre's wide range of influences and creative outputs.\n\nIt seems like the band focused more on the atmosphere the album creates and the feeling it delivers rather than the musical contents themselves, but it turns out that the former applies to the list of things Sunbather tries to do. The instruments are the strongest component of the album, and forge a wall of sound, which opposing to Burzum and other BM acts that make a wall of dark black smoke, it makes a wall of light. The riffs aren't focused on being intense or technically impressive. Instead, they revolve on major and melodic scales which gives a very dreamy feeling to the music, and the drums aren't focused on being intense too, but they seem to do the job with occasional blast beats and tight playing on the long term. Because of that, Sunbather can be described as nothing short of transcendental (screw yourselves, Liturgy!) and fits in the category of USBM classics. Even the vocals, which are rooted the classic agonized BM shrieks are somewhat different than the average shrieks and give a magical vibe that is seldom delivered in black metal. \n\nThe songs are structured very similar to each other- the tremolo-blast beat-shriek classic second-wave combo, which is followed by a dreamy post-rock passage. It does sound very predictive and boring at the beginning, but as you progress through the album you realize that every song has its own twists and turns which add to the creativity and diversity of the album (except for the intro to Please Remember, which is just a painful pain in the ass). They are helped by the lyrics, which feature some of the most unconventional black metal/post black metal lyrics ever, which mainly focus on suburbian 20-something issues. Although they seem very irrelevant and extraneous to the music, the opposite to that is true- they are purely minimalistic and quasi-philosophical, but fit the music perfectly and have a hidden and often misunderstood meaning to them. With the help of a superior production that accentuates the instruments, vocals, atmosphere, and helps giving each section of the album its specific meaning, this album can be surely described as a post-metal classic in every aspect. Recommended.\n",
        "\nWhen Deafheaven's debut, \"Roads to Judah\", came out back in 2011, I must say I wasn't very impressed with it. It wasn't bad, but it was pretty generic American black metal. Bands like Krallice were doing something similar, in a better way, before that album came out. But in 2013, things changed for me.Their sophonore release, \"Sunbather\", was my favorite metal album from that year. Deafheaven did something original, with \"Sunbather\", crafting their own type of black metal. The post-rock, shoegaze and ambient music influences from bands like Explosions in the Sky and My Bloody Valentine were clear, and that flavor was mixed into their black-metal sound with an incredible finesse, creating an unique and detailed sound, popularizing the genre now known as post-black metal.\n\nAfter \"Sunbather\", Deafheaven had huge shoes to fill, and I was certainly afraid of what would come after that impressive sophomore release. And after hearing this multiple times, I was surprised, in a terrific way. Deafheaven has done it again. This isn't in any way a second \"Sunbather\". This was one of the things I was most afraid of. I wanted something new from them, and I got it. \"New Bermuda\" is way more aggressive than its predecessor. It shows way more the traditional black-metal side from Deafheaven than the previous releases, but also keeping the elements that differentiates Deafheaven from the other bands in the American black-metal scene. The intro riff of the song \"Luna\" makes my blood boil, no matter how many times I listen to it. In the other hand, the intro of \"Baby Blue\" is absolutely gorgeous, and the guitar solo gives the song an epic feel that makes this one of my favorite tracks of the album.\n\nThe production is excellent. It's not overproducted, but it isn't even close to the rawness of Darkthrone's \"Trasilvanian Hunger\". The vocals are not as high as they were in \"Sunbather\", but it surely is still wretched and demonic as hell. The performance is also top notch. None of the members show extreme technical prowess, but they are great in what they give us. \n\nI still have problems with this album, and the one that bothers me the most is the same problem I had with \"Sunbather\", and that is the ending of some of the songs in the tracklisting. For example, in the ending of \"Brought to the Water\" the awesome riff starts to fade away with the vocals, and it seems like the song is about to finish; but, from out of nowhere, a piano that was never introduced before appears, and starts to do the \"real\" fade out. This also happens in the bridge of \"Gifts for the Earth\", where, once again, the piano shows up from out of nowhere, but this time with an acoustic, and begins to fade away. These passages and instruments didn't feel natural and it seems they were put there only to have these mellow endings. This also applies to the bridge of \"Luna\", which is one of my favorite songs, but it has this passage that seems it was there only to have a mellow passage in the song. It doesn't feel natural. The only song that makes it feel legitimate is \"Come Back\".\n\nTo wrap it up, this is a great album. I don't think it is better than \"Sunbather\", but it definitely is a worthy follow-up to it. It isn't perfect, but it's far away from being bad or mediocre. If you're a black metal fan, and not an elitist prick, you must hear it. \n\nFavorite songs: \"Luna\", \"Baby Blue\" and \"Come Back\".\n",
        "\nThis album was a step forward for Deafheaven, building on the strengths of their first album. The scope and influence of this album is dramatically increased with respect to their first, including piano interludes, spoken word and complex delayed clean guitar work. Drummer Daniel Tracy's blast beats are exceptionally full and tight. Guitarist and bassist Kerry McCoy's sound is deeper and darker than before and wonderfully in sync with Tracy. Vocalist George Clarke sounds better than ever.\n\nThis album was masterfully recorded over the course of a month in January of 2013, and the work that was put in really paid off. Many are aware that lo-fi recording is a common and often celebrated practice in the black metal genre, but Deafheaven definitely isn't doing that here. When played on hi-fi equipment at loud volume, every subtle nuance in their dark, pummeling sound can be discerned. It truly is an experience to behold.\n\nThe album starts with about half a minute of chugging overdriven guitar chords. It's not long before the full distortion is kicked on and the blast beat starts pumping. The bass is clean and full. Clarke is screaming fairly deep in the mix. Slow overdriven guitar arpeggios can be heard periodically but they are only accents to the crushing distortion. Recollections of My Bloody Valentine are sure to surface in your mind. After five minutes, the band fades to slow, thoughtful clean guitar. There's only about a minute of respite before the onslaught continues.\n\nThe rest of the album is like this, tremendous cascades of distorted riffs and heavy drumming juxtaposed with carefully curated interludes. Some of the interludes are instrumental but there are a few spoken word sections that are accompanied by distorted feedback. The interludes are moody and centered around a theme of confused desperation. One of these spoken interludes includes a recording of a drug deal altercation with a fire and brim stone sermon being played simultaneously. The purpose of this is not explicit, but there is a mood of uneasiness throughout. The juxtaposition of the spoken pieces mirrors that dynamic juxtaposition of the musical elements of the album. The album is tumultuous from start to finish but the beautiful shoegazing/black metal riffing is made all the more sweeter by the interspersed melodies and nonmusical sections.\n\nThis is not a conventional black metal album by any standard but it's well worth a listen if you're an adventurous black metal fan or if you're a fan of loud, well recorded music with a complex cerebral theme.\n",
        "\nI'm completely unfamiliar with previous Deafheaven recordings like \"Sunbather\" so I come to this third album of DFHVN's as an innocent. Perhaps it's not a bad idea either that I start my association with DFHVN's music with \"New Bermuda\" as this is actually the band's first recording as a quintet around the core duo of George Clarke and Kerry McCoy. The album is a personal document of Clarke's feelings and moods in the period after the release of \"Sunbather\", how that recording changed his life (and not always for the better) and how he struggled to cope with the rapid changes and upheavals that sudden attention brought him and McCoy.\n\nDFVHN's style is a great blend of tough, steely and aggressive black metal, thrash and indiepop shoegaze. The balance varies from track to track with the result that the music ranges from straight-out BM to emotional shimmer-guitar melancholy and back again with surprisingly smooth (though sometimes sudden) transitions. When done very well (as on middle track \"Baby Blue\"), such transitions push the music to epic heights of intense emotional drama. Intro track \"Brought to the Water\" is a good example of DFVHN's post-BM / shoegaze fusion: it starts off as sharp and raw hostile BM and morphs into bright summery tremolo guitar beauty and what seems like a mood of hope and optimism - until you read the lyrics and realise this song is actually a calm plateau of stability perched unsteadily on the edge of blackness and chaos. \n\nDid I mention \"chaos\"? Well that's exactly where we fall into with succeeding tracks like \"Luna\", with the music to match. The vocals increasingly are the real BM deal: they're screech-across-the-board raspy and demonic, while riffs and rhythms dive right into a mix of blast-beat frenzy, post-BM, crunchy slabs of Metallica-style riffing, shrieking lead guitar siren and dreamy introspective trance melody wonder. With each succeeding song, the music continues to push through greater trials of dark depression and hopelessness, and ever more intense and hard-driving sound structures, into \"Gifts for the Earth\", a calm acceptance of one's fate in a swirl of bright and sharp energy, vistas of light stretching far into the distance, melancholy piano and roaring wraith voices.\n\nOut of the storms and the afflictions of life, with all its anxieties and struggles, comes music of tremendous power, beauty and majesty. The incredible thing is that the DFHVN guys play the songs almost effortlessly, as if writing and recording music of personal angst, self-doubt and loss of hope was second nature for them. The songs' lyrics follow a narrative starting with uncertainty and then falling into a downward spiral that seems it was predestined, it just comes over as natural. \n\nAt this stage in DFHVN's career, Clarke's thin raspy singing is not too bad but he will have to consider broadening and varying his style and range to match the music as it develops. DFHVN have the potential to set a new standard in alternative metal that becomes the new mainstream if they want to go in that direction, and this will make a lot of demands on Clarke's vocals.\n\nSome listeners might find the lyrics and the music in most songs don't match well: the saddest words seem to accompany the happiest, most uplifting tunes, depending on how they interpret the lyrics. I'm sure though that most people prepared to give \"New Bermuda\" a listen will come away agreeing that this is a record of dark post-BM depressive majesty.\n",
        "\nThe San Francisco quintet became some sort of pariah with Sunbather (2013), an immense album clad in pink and done by dudes with short hair who aren't your typical metalheads, big deal, right? This record was praised by indie rock magasines and divided the sometimes unfair metal kingdom. I'll admit I had my reservations at first but the quality of their music convinced me of their relevance, I think they became trendy to hate for the trve black metal crowd who prefer the old (and tired) tactics. With that said, Deafheaven has nothing to prove to anyone, perhaps they didn't win over the crowd they wanted to but with New Bermuda, they proved that they're not a metal band by accident.\n\nI thought the direction they took with this new full length was a bit surprising, I was expecting them to move forward into post rock territories by praising Mogwai or Godspeed You! Black Emperor but the boys moved towards an even more metallic direction than Sunbather. It's like Kerry McCoy had to prove that he grew up while listening to Metallica (he's always wearing these band shirts on stage to prove that he's one of us!) when he was a kid. Thing is, Deafheaven wrote a wide array of super metal riffs for this new album (listen to the metal parts of “Luna” or “Come Back”.) They really put the “metal” into post black metal with these almost Slayer-esque riffs. A complaint I've heard about their previous album is that while the post rock moments were enjoyable, the metal ones weren't but I think it's somewhat the opposite here (to a lesser degree). Some of the calmer moments feel a bit forced or even cheap (like the piano conclusion of the opening track “Brought to the Water). Still, the mix of pop influences with metal is done tastefully, it's almost as if Savage Garden decided to included Norwegian black metal influences in their music at times and I think it's great! The musicianship is impressive, the dual guitars are mixing intricate atmospheric licks with heavy hitting riffs and the drumming is particularly awesome and can switch perfectly between all the styles required.\n\nWhile George Clarke (a strong dark guru presence on stage) fits the music, I think he's too buried underneath everything on here and a little variety would had been nice. His lyrics are pretentious, that's a given but they're not bad at all. He's not the most interesting vocalist ever but he doesn't overstay his welcome and he lets the songs flow. The five tracks are all between eight and ten minutes and they're all dense, there's not a lot of filler if you actually appreciate their softer, instrumental bits (the introduction of “Baby Blue” is quite stunning and so is its proggy guitar soloing midway through). Sure, some of the transitions between their styles aren't always top notch but there's barely any bands evolving in such crossover styles that are truly proficient at these, Deafheaven are certainly better than most though.\n\nEven if it's different than Sunbather, I doubt their detractors will find something they like here and I bet they will not even give this album a chance. Deafheaven aren't the best band of their generation and they didn't reinvent black metal on their own (Altar of Plagues, Fen or Ash Borer are all their contemporaries and are a bit better) but they're nowhere near bad or the “worst thing to ever happen to metal”.\n\nMetantoine's Magickal Realm\n",
        "\nI just love it when a band that has been in the zone of 'love them or hate them' artists exposes the full array of its potential, shutting mouths and making jaws gape. And Deafheaven are potent and willing. Striving to become great on your own terms in the world of black metal can be a disaster (Liturgy for example). However with New Bermuda, Deafheaven leave the mediocrity of Sunbather behind and move on with an album that few could craft. Sunbather was an album that didn't quite live up to its hype whereas New Bermuda just delivers the goods without the guilt of having to prove its value. As complicated as it might sound to you, that's the main reason I dislike Sunbather and love New Bermuda.\n\nI felt the urge to listen to this from the moment I learned about it. That's mostly because contrary to the rest of the so called 'hipster' black metal wave that has been uprising in the US for some years now, Deafheaven had positive elements hidden within their murky sound. The most obvious of them are George Clarke's vocalizations. You can say what you want about his style or the whole band's style but you cannot deny that his vocals fall into the category of high-pitched black metal vocals. And in the new album they are even more audible than before let alone their fantastic, hissing tone. The way he pronounces every syllable is remarkable and almost impeccable. However he sings the lyrics over some of my favorite musical parts thus I'm going to take some points for that.\n\nMusic-wise the album is surprisingly creative. Kerry McCoy abandons the tremolo picked major chords and utilizes a vast range of techniques in order to make the album special. And he manages to do it perfectly. At least there was a guitarist named Kerry that has been creative this year (Slayer pun intended). As for the rest of the instrumentation, it is simply top notch. The instruments roar and remain silent in the right moments, they burst in and abscond out of your sound system when that is necessary and they shift all the time. The distortion is not constantly piercing your ears. That's not only because of its heavier tone instead of the overdriven screeching noise we've been used to, but also because the clean guitars hold a much greater portion of the new material. On the side of the negative points, I believe they could have skipped the piano parts as well as some droning noises and samples but those don't ruin the experience for me. \n\nOn a final note this album is not half as naive and optimistic as its predecessor. Not that I dislike optimistic music, all in all I loved Spectral Lore's III last year. Maybe New Bermuda could have been a little more 'happy' like III was. Maybe it doesn't to. Maybe Deafheaven want to change their style towards a darker direction. I'm not sure and I certainly won't judge their decisions. Their brand new opus is all that matters now. And it is fantastic. Deafheaven have certainly found a style that fits them and I'm sure that if they choose to walk further down that path, they're going to create even greater albums. New Bermuda is a total win.\n\nFavorite tracks: 'Brought to the Water', 'Come Back', 'Gifts for the Earth'.\n\n92/100.\n",
        "\nHenry Wadsworth Longfellow said that ‘music is a universal language of mankind.’ In June 2013, Sunbather was released by a band named Deafheaven. The level of emotional intensity that this record reflected could only be conjured by few but felt by all. While some fans thought that the contrast of beautiful melodies within a definite black metal outlook was too far over the experimental line, Deafheaven gained overwhelmingly positive acclaim and was praised for the unique fusion of shoegaze and metal. The real test now is whether Deafheaven’s new album ‘New Bermuda’ can possibly hope to match its predecessor.\n\nThe evolving soundscapes of post rock that triumphed 2 years ago in ‘Sunbather’ have lost none of their potency in ‘New Bermuda’. While the beginning of ‘Baby Blue’ comprises of full throttle vehemence and breathless grunts, the second half takes your hand and leads you down an oceanic sway of docile soundscapes. The dimensional guitar harmonics create a tranquil texture atop the slow bass that create a deep yet lucid effect. ‘Gifts For The Earth’ is probably the most riff driven song on the album however it does resurrect the post rock abstractness that embodied ‘Sunbather’. These interludes are melancholic and bittersweet however they don’t quite pack the emotional punch that Deafheaven can, usually, easily conjure.\n\nDeafheaven have quoted Slayer as a main influence when creating ‘New Bermuda’ and the fast paced metal factor is definitely more concentrated. ‘Brought To The Water’ is consistently heavy due to tremolo guitar picking, dominant drumming and rough vocals. However the riffs from this song do seem to be a touch overused- after each dynamic change the song always returns to the same chugging riff. Every song on the album comprises of sonorous walls of sound but the trick to capturing the passion behind the curtain of noise is where Deafheaven can hold their head up high. The feature that makes this outburst is the differentiation of dynamics that Deafheaven use. On ‘New Bermuda’ the theme to creating these gut wrenching moments is heavy music to light music and back. On ‘Come Back’ it’s the opposite. A patient build in tension from Kerry McCoy’s guitars are obliterated with a touching eruption of malice and his commanding vocals gain an added sense of authority when they are placed above the furious blast beats from Daniel Tracy.\n\nDeafheaven’s music is so textured and genre-bending that there are often moments where beauty and belligerence become a natural balance. ‘Luna’ is a prime example of this technique. As the frequent change in dark dynamics spin off in every direction, and George Clarke screams breathlessly down the microphone, the brooding tone remains consistent. However, shimmering cracks of light emerge from this darkness that makes ‘Luna’ all the more special. The song slows down to allow the guitar to glide alongside the spacious bass lines until they reach the inevitable, enrapturing moment. There’s reallya sense of completion and wholeheartedness in the ending to ‘Luna’ that symbolises just how unique Deafheaven are and what exquisite music that can create.\n",
        "\nSan Francisco's Deafheaven created quite a splash when they dropped their sophomore album Sunbather. Some referred to it as the most important metal album of the decade, while others called it the worst thing to ever happen to black metal. I certainly respect Deafheaven as songwriters, but I don’t by any means see them as seminal within the post-black metal scene. Bands like Agalloch and Wolves In The Throne Room laid down the groundwork for the style during the previous decade, which essentially made Deafheaven the Metallica of blackgaze. Sunbather brought an underground movement to the masses and showed them a gentler, more romantic side of metal through their sheer musical chops and knack for toying with the listener’s emotions. As years continued to pass since that album dropped, it became apparent that it would be hard to top. How does a band approach songwriting after many people believe they already created their magnum opus? Deafheaven set out to blow away expectations, and did so quite beautifully. They could’ve made Sunbather part two, but they chose to blaze a different artistic trail with New Bermuda. Deafheaven maintains much of what made their back catalogue superb whilst introducing new levels of heaviness.\n\nWhen I first heard that the new Deafheaven record was going to have influence from Slayer, I was tempted to dismiss the hype as an attempt to get metal elitists to buy their album. New Bermuda was either going to improve the formula of Sunbather, or completely ruin the spark they had in an attempt to win over the people who always dismissed them. The former possibility became more realized for me as I listened to the album. The guitar duo of Shiv Mehra and Kerry McCoy often embrace the alternate picking of old school thrash metal in sections like the intro riff of “Luna” and the outro for “Baby Blue” and it sounds incredible. The chord progressions are also much less overtly happy than those found on Sunbather, giving way to dissonant chords and tremolo picking lines played at blistering speeds. While there is still plenty of resolve within the melodic structure of the songs, the listener must first journey through a harrowing extreme metal wilderness before reaching the clearing of post-rock solace; said wilderness is not without its frostbitten winds.\n\nThe vocals on New Bermuda are much higher in the mix than before, and pack a much more vicious punch. George Clarke gives the most brutal vocal performance of his career in these tracks, with his startling vocal range and powerful delivery becoming much more prominent in the overall sound. His growls, snarls, and shrieks cut through the instrumentation and terrify as much as they pacify. The drums are similar in this regard because they too are given much more sonic space than they had before. Everything from blastbeats to cool-cat grooves are charged with brazen aggression and grit, adding much welcomed power to the austere beauty Deafheaven was known for in their prior material. However, I would advise metal elitists to hold their applause.\n\nAlthough there’s an undeniable increase of metalness to New Bermuda, it’s still very much a post-metal record. For every headbanging assault, there’s delicate piano interludes (the outro of “Brought to the Water”) or soothing post-rock balladry (the ¾ mark of “Luna”) to send the tr00est of the tr00 running back to their havens of goregrind and slam-death metal. In fact, it is this duality between ugly and pretty sides of the musical spectrum that makes New Bermuda such an engaging listen. The fact Deafheaven is still capable of lulling their listeners to sleep even after melting their faces is a testament to how strong their songwriting chops are and how adept they are at mixing many elements together in a way that is as exquisite as it is unique.\n\nIn short, listen to this album. Deafheaven have crafted another great post-metal album with sonic diversity to boot.\n",
        "\nIt was not until last year that I discovered Deafheaven’s sophomore album Sunbather and their mix of my favorite genre in music black metal with a genre I’m not that connoisseur of, shoegaze. It was around October that I immersed myself in songs like ‘’The Pecan Tree’’ and ‘’Dream House’’. I gave them a somewhat high score but not the highest I ever gave to a new album. Why?\n\nNot because I’m a black metal purist. In fact this does not exist because if you are this purist you probably listen to music prior to 1993 or 1994. Yes there are quintessential records from this era and I am one of the believers of this classic era of metal. However, this does not explain why I did not called out like a lot of the hipster crowd that ranked Sunbather in the masterpiece category. It was a strong album, with great depth and it brought black metal textures and sound to a wider audience. But, yes there is always a but, this is an album that was too compartmented with too much intermissions.\n\nWith New Bermuda, Deafheaven hit the mark completely with a shorter wisely edited record that stands as a whole without breaks or lack of homogeneity. It is closer to a black metal sound that has been adapted to contemporary factors. The intermissions are subtle insertions in songs that are forming a strong whole.\n\nThe song ‘’Gifts for the Earth’’ has a lightness that only the great melodies of The Beatles have achieved. There’s a maturity that the earlier explorations of the first two albums leaded to the great achievement of New Bermuda. With only five songs, the blend of shoegazing gives a unsuspected depth to the melancholy and aggressivity of the raw sound of black metal. Much like Emperor’s masterpiece Anthems to the Welkins at Dusk, Deafheaven have achieve to make beautiful music filled with violence and chaos.\n\nMaybe New Bermuda is a new argument for naysayers and haters to hate more but just like after a fire there’s always life that will be growing back. Deafheaven was able to take the horror and the power of the destruction of the fire and change it into something lively, sad, melancholic, and turned on the future of a genre more than just looking back at the past and repeating it endlessly.\n\nOriginally published on: http://cinephiliaque.blogspot.ca/2015/10/music-review-deafheaven-new-bermuda-2015.html\n",
        "\nFollowing on from the release of the successful and enjoyable Roads to Judah, Deafheaven seemed to have a bright future ahead of them. Their début album was a very good stab at the metalgaze movement and showcased a lot of potential for this young duo. As you can imagine my expectations for Sunbather were high, made even more so following the release of the track Dream House which impressed me with its light and airy tone and passionate vocals by lead vocalist George. When Sunbather was finally released onto the listening public it was met with near unanimous critical acclaim and was cited as an excellent example of how to mix post rock and black metal. I do not agree with these people.\n\nWhile the first three tracks of this album are good to great, the rest of this album is boring and so uninspired that I often wonder why I bother listening to Sunbather when there are so many albums out there doing this kind of thing a whole lot better. The major problem with Sunbather is that this type of music is far too much to stomach in full album form. The ideas Deafheaven present are stretched so thin so as to be transparent. Sunbather is a very one dimensional album lacking a lot of emotional and atmospheric depth making this a slog to get through.\n\nSunbather is NOT a black metal record. Whilst this may appear in the black metal charts up on rateyourmusic (something that causes me to grind my teeth in anger as I see it spoken in the same breath as Burzum and Darkthrone) and the metal archives page adds a very convincing black, Sunbather is essentially what would happen if Envy took the masterpiece that is Insomniac Doze, pussied it out and marketed it towards a clueless audience. Nothing about this record is unique, with pages being torn directly out of the books of Envy, Godspeed You Black Emperor, Merchant Ships and to a certain extent Sigur Ros (the whole sunshine vibe).\n\nBlackgaze as a whole is a rather vague and nebulous term with so many bands fitting under its vast canopy that it can be hard to define what makes a blackgaze band a blackgaze band. However one thing is for certain, and that said blackgaze music contains a suitable amount of black metal, something which Sunbather is sorely lacking. This is screamo inspired post rock at its most derivative and uninspired, with long sections of music dedicated to going absolutely nowhere. The tender build ups to surging crescendo has been done to death before and has been done a hell of a lot better. Can you really not predict that Deafheaven are going to leap into another crescendo, really, can't you? How anybody can consider this a genre bending masterpiece is beyond me as this album is predictable to the extreme.\n\nAnother thing that irks me is the average length of the main tracks (not counting the instrumental ones) is over ten minutes. That's ten minutes the band has stretched three to four minutes worth of ideas out for. As you can imagine there is a hefty amount of repetition going on throughout, and whilst I'm not adverse to repetition, heck some of my favourite artists are pretty notorious for repeating the same riff for minutes on end, the music on Sunbather just shouldn't be stretched out. \n\nUnlike Roads to Judah which had a fairly even spread of things, Sunbather is very bottom heavy with the best moments being presented in the first three tracks. These tracks best showcase the talent of this band and whilst some of the moments do begin to drag on and I find my attention wavering throughout, they have a lot more going on than the rest of the album which is a barren and lifeless wasteland devoid of anything that could be called good song writing. \n\nIf Deafheaven were to take anything away from either post rock or black metal, it should be the ability to let the songs evolve and flow. Long instrumental passages should not be a chore to get through but instead should be used as a tool to enhance the atmosphere and make the more involved sections all the more engaging. Even the “intense” sections (and boy do I use this term lightly) are completely void of emotion and feeling. Vocals are a one dimensional shriek spouting such melodramatic nonsense that would make Dani Filth weep for our future. The mixing is another low point for this album, with the guitar tone being flat and lifeless and the vocals having an odd sort of synthetic quality about them. The drums are the worst offender, pushed way too forward in the mix they have a tendency to overshadow all other instruments beneath them at the most inopportune of moments. If there is a bass I cannot hear it, predictably buried. \n\nQuiet. Loud. Quiet. Loud. This is Sunbather in a nutshell, a boring and predictable album praised by pseudo intellectual hipsters who spend their time at Starbucks writing poetry or something. This is not black metal, heck this isn't even a metal album. This is post rock with elements of midwest screamo done at its most vapid and boring. When you claim to be a metal band but a band such as Merchant Ships or Snowing make you look as threatening as a box of andrex puppies you know you've gone wrong somewhere. Avoid this album and invest your time in something much more worthwhile.\n",
        "\nTwo years after releasing their solid, genre bending debut full-length \"Roads to Judah\", Deafheaven return with their second effort \"Sunbather\". Combining the post-rock, black metal, and shoegazing elements that made \"Roads to Judah\" so great, the dudes in Deafheaven really have upped their game this time around. Out of all the albums that came out in 2013, Deafheaven definitely were in my \"top 5\" with this release. It's melodic, atmospheric, bright as sunlight, and overall, beautiful. This album, even more so than it's predecessor, has garnered a lot of controversy in the black metal community for it's \"post-black metal\" sound. However, as we all know so well, that does not make the album bad. For me, the reason this album receives so much negativity is either simply based on personal preference, or the fact that a lot of black metal fans are elitist pricks. That really doesn't even matter, because people's opinions have never affected my own.\n\nLike the previous album, Deafheaven continues the same idea of beginning the album with the strongest track. \"Dream House\" is, in my opinion, definitely the album's best. It contains every single piece of the puzzle that takes part in the overall sound. Building off of a melodic tremolo guitar riff, we soon fall victim to an explosive, rapid fire blast beat that definitely nods to the classic black metal style. This song combines this harsh sound with absolutely breathtaking aesthetics of pure beauty and ambience created with the guitars. A lot of the more harsh black metal sections throughout this album remind me specifically of Wolves in the Throne Room, who are indeed known for implementing atmospheric ambience in their music, but at the same time, can create sonic blasts of intensity as well. This album almost seems, in a way, bipolar thanks to these musical ideas; this album does an amazing job with creating a \"duality effect\" because of the soft, warm ambience and the classic black metal influenced sound that shines through like the summer sun on a sparkling-clean windshield. I could definitely see someone picking up this LP, looking at the album art, and making a comment along the lines of: \"Oh, man! It's pink! That's totally fucking gay!\" and that's definitely a problem in metal nowadays. This is a perfect example of \"don't judge a book by its cover\" but in this case, an album. Once you put this into your player, you'll be surprised at how truly metal this beast is. \n\nThe energy behind the entire band surely is on par with \"Roads to Judah\", maybe even a little more so. Everyone does their job extremely well here and plays very tightly throughout the album's hour-long run time. The drums are extremely consistent throughout, and vary between hyper speed blast beasts, mid-paced rock sections, and double bass. I must say, while blast beats are a main ingredient in the black metal formula, it never ceases to amaze me just how consistent and fast some of these drummers can play. This certainly is no exception. The vocals performed by George Clarke are still as harsh as ever, which definitely are the \"coldest\" element on an otherwise sweltering hot, \"sunbathing\" album. He does not use clean vocals here, which is another similarity to \"Roads to Judah\". These vocals are very much influenced by obviously black metal, but also maybe a bit of post-hardcore as well. These vocals contrast quite nicely with the otherwise beautiful, soaring, melodic black metal sound that the album tends to radiate throughout on it's main songs. Although, they are really quiet on this mix on this album, and could have been slightly louder.\n\nWait, did I just say main songs? Yes, I did. The album's four main songs are \"Dream House\", \"Sunbather\", \"Vertigo\", and \"The Pecan Tree\". The other four songs are basically non-metal interludes to these metal songs, which is where my main complaint with this album lies within. These interludes are surely not bad, and are overall quite beautiful and peaceful. However, they seem to drag on in certain places. This is especially the case with \"Please Remember\". This song is generally beautiful, but at it's over 6-minute run time, it really is too long for an interlude. That's more than enough time for an actual song. Another slight downside to this album are the lyrics, which really isn't that big a deal, but do sound downright cheesy at times. For example, taken from the title-track:\n\n\"It's 5 A.M...and my heart flourishes at each passing moment. Always and forever.\" \n\nThese lyrics tend to deal with love, and that's definitely the album's most \"non-black metal\" feature and a huge reason to why these guys receive so much negative attention. This certainly is not a big deal to me, and you really can't understand much of the lyrics anyway with the vocal style and volume, but they are somewhat cheesy.\n\nDespite it's minimal flaws attributing to the album not receiving a perfect score from me, it is still a masterpiece and the best album Deafheaven has released thus far. I'm really excited for whatever they'll be releasing in the future. These guys have the potential to be one of the greatest metal bands in history, in my opinion, and they are certainly well on their way. So fuck the negative energy these guys receive, and just enjoy the music. Deafheaven is amazing, and \"Sunbather\" is gorgeous.\n",
        "\nDeafheaven is a band that certainly receives a lot of unneeded discontent and hatred from a lot of the more \"kvlt\" black metal purists. This is very much attributed to their implementation of post-rock and shoegazing music into their overall black metal-tinged sound. After releasing a very promising demo in 2010 and an EP containing two rerecorded tracks, Deafheaven explodes into the metal scene with their debut full-length studio album \"Roads to Judah\" released in spring of 2011. My first encounter with this group was only a few weeks after its release, thanks to an advertisement I saw somewhere on the internet. Originally, I just couldn't get into this album. I can't even explain why; there was just something that, to me, was very off-putting about this record. I finally decided to revisit this album during the autumn of that year. Since then, it has been an album I come back to after a very long day just to sit and vibe, awaiting the impending dawn. I've been on a bit of a post-rock kick this week, so especially now, this album has been one of my best musical friends. So, what makes this album so great?\n\nSimply put, it is a conundrum of amazing musical incorporations. Obviously, thanks to the fast-paced tremolo riffing and blast beats, this is in fact mainly a black metal album, like it or not. There are some people who would argue that fact because they don't think it sounds raw or \"true\" enough. Also, this album makes a heavy use of post-rock and shoegaze. The end of the astronomically beautiful and emotional \"Violet\" definitely showcases this, with soaring guitars that override everything and bring an extremely warm sound to the music. Wait, what? Warm? Isn't black metal supposed to be cold? In Deafheaven's case, nope. This is not black metal in the same vein as early Darkthrone or Emperor. We don't get feelings of frozen, northern forest with this. Instead, we get feelings of summer and sunlight, which is also quite atypical for a lot of black metal. Another example of a very warm, soaring guitar segment is the soaring riff that begins about 2:50 into the song \"Language Games\". For some reason, this riff sounds quite familiar to me. Actually, it's a very simple guitar melody that has been done before by the extremely underground French black/dark ambient artist Aäkon Këëtrëh on his 1996 demo tape \"Dans la forêt...\", specifically with the keyboard melody on the first track. I'm sure not a lot of people will think to make that connection and even fewer will know what I'm talking about, but for me, it was fairly obvious. I'm not sure if Deafheaven is aware of this either but that really doesn't matter. \"Language Games\" also contains a beautiful post-rock section of clean guitars accompanied by a rolling drum pattern, and then finally closes with an extremely melodic, dreary riff. \n\nThe production on this album is extremely well done. It's not completely clean, so we get that amazing atmosphere that is supposed to come with black metal. However, it's raw in a different way. Like I said before, instead of going for a cold, desolate atmosphere, we get a fresh, warm, one could say breezy, atmosphere. This is fairly different for black metal and one of the reasons this band gets so much negative attention from a lot of the purists. All the instruments are audible, save for the bass, but that's to be expected. However, some instruments are certainly louder than others. This is especially the case with the drums. They are quite loud overall and tend to override the guitars at some points, however, the guitars do remain audible. There is a lot of double bass in the drumming, and an extremely healthy amount of blast beats to go around. Sure, this drummer is extremely talented, but my favorite moments of his playing has to be when he executes \"drum rolls\". This occurs most notably in the earlier mentioned \"Language Games\" and the final song on the album, \"Tunnel of Trees\", about 1:50 into the song. \"Tunnel of Trees\", out of all four songs, contains my favorite drumming throughout the album. It's just so chaotic yet controlled extremely well. \n\nEmotion is a key ingredient to this album, as it is with most black metal. You can literally feel the emotion radiate through the instruments. If this could be compared to any other band, it would probably be Alcest, but only in terms of emotional energy. Vocally speaking, it's quite different. Unlike Neige from Alcest who utilizes a much cleaner voice focusing on singing, the vocalist here, George Clarke, uses the standard harsh, raspy vocals common in black metal. This helps enhance the emotional output by quite a bit. There is no clean singing to be heard anywhere on this album, so if you came here expecting to hear something like Alcest in this regard, you wasted your time. \n\nSo, this album is not perfect. It has its flaws, but they're not game-breaking flaws. My biggest and really only complaint with this album is that it's four tracks and extremely short. Don't get me wrong, tons of black metal bands have albums with four or so tracks on them, and this seems to be a standard thing for the more atmospheric bands. However, a lot of these albums are longer in terms of overall run time. This record certainly could have used a few more minutes on certain songs and probably ten minutes added to the total length. Still, this is not a big issue. Considering this is Deafheaven's freshman album, it is certainly a good starting point. To me, this album is only a nice taste of the brilliance that would come two years later on the absolutely amazing, yet infamous and controversial \"Sunbather\". Make note, my friends, that just because a band is not popular with a large portion of a community, does not mean it's bad. This band certainly has a lot going for them and they definitely should not be slept on.\n",
        "\nToo much pink is turned into black. What was payable is now priceless. Optimism vanished through the velvet blackness of oblivion. Marketing trick? Only the band knows. \n\nI know that I love “true” black metal, but when it comes to the new experimental forms, simply avoid connecting them with the previous pattern. Black metal has been developed from trash metal and now something is dividing from black metal itself, both aesthetically and ideologically. Deafheaven seems problematic for some people because there is a great similarity with already mentioned genre: blast beats, tremolo picking, high-pitched vocals. They feel like this band has stolen basic elements from “their music” for mainstream purposes. To be honest, From The Kettle Onto The Coil is pretty extreme track and I don’t believe rockers are listening to it (the same case with Cradle of Filth).\n\nThe only real issue is whether these guys created mainstream tendencies intentionally or unintentionally. The only clear argument is that they perform live and earn money. Many so called true black metal bands are doing the same; everything became business and the stories about art for art's sake are nothing but a legend (with a few exceptions like studio band An Autumn for Crippled Children). \n\nBack to the song! The destructiveness of love has been represented with great sensibility, but ménages to stay universal. Christians and other believers glorify love; black metal is fighting against them, mocking and bashing to the limit. Deafheaven came up with a different approach by showing (rather than telling) ordinary, modern human as a degenerated branch of evolution and weak product of social influences. We suffer, cry, love and hate, we dream of warmth and love despite the pain of idealism - this is what’s all about. There’s no better way to write about miserable, pathetic and trivial state of mind than with skilful usage of slightly pathetic tone. \n\nBesides from horrible hipster look on the stage, their music is remarkable. On this track everything is synchronised perfectly: lyrical prose, vocals, composition and performance. It starts aggressively but quickly becomes playful when George sings: My shades of blonde dancing in the high sun. Then we can hear a breakdown that corresponds with the desperate departure in the lyrics. Drums and guitars accelerate, but never reach the speed they had at the beginning; little solo evokes sorrow and regret and finishes suddenly leaving the listener in emptiness.\n",
        "\nMany bands these days gain hype over music that is seemingly dedicated to the lowest common denominator. Deafheaven is no exception. Lacking any semblance of feeling and imagination, \"Sunbather\" seems to continue to make its rounds among many communities even outside of metal as a unique masterpiece. I find this baffling personally. The first time I listened to this album, my thoughts varied. \"Why do something Amesoeurs perfected years ago?\" \"Why are the riffs absolutely lifeless and boring?\" and \"Why is this considered 'good'?\" Okay, maybe not varied. I just found it confusing that a group of talented musicians could put out something so sub par and yet have it succeed as this album did. Then I remembered, this is the real world. Or something to that effect. So I stepped back, with the intention of giving the band another chance at a later date, in the hopes of finding some redeemable aspect. An error on my part considering I might have already made up my mind on how I felt about the music. \"But some tunes grow on you\" - This album absolutely did not grow on me. If anything, it festered like an abscess which I would gladly have removed, in the hopes of never experiencing it again.\n\nI've heard countless reviews declaring this album to be a stellar and incomparable album. A 'work of art'. And for that I ask... Why? This album has its merits, don't get me wrong. The mix is clear. For the most part, most every instrument is audible which can be rare in many cases. The tone of said instruments holds well together, nothing sounds terribly out of place. The vocals seem to sit behind the mix instead of on top, adding to the atmosphere and not diminishing the musicianship therein. The vocals are also not really annoying, actually bearable. And there are SOME riffs that are catchy and/or pleasant to listen to. Unfortunately, I'd say most of these facets pale in comparison to the overwhelming pile of garbage in this album.\n\nThe album as a whole is completely boring. I would say that this is a matter of opinion, but this dynamic has already been done before. There is literally nothing new to any of the music. Time and time again it falls short in holding the listener's attention, and rehashes ideas, atmosphere and riffs that bands before have already perfected. I'd say that if Deafheaven were to play in this fashion, they should at least find a better way to draw in listeners, and keep them coming back. Do something new, you know? These guys obviously have the capacity to. First, the guitar riffs. One of the most important aspects of the music to me, in that they carry the melody (or lack thereof) as well as holding my interest, regardless of various aspects that would turn me off to an album. Like I said before, there are SOME riffs in this album that shine through (various riffs in the title track Sunbather for example). But a majority of these riffs make me feel as if I'm listening to a local rock radio station. These riffs are borderline laughable, and they feel as if they've been written with little to no emotion or imagination. I just have to pause the album at that point and let it sink in. Second, the drums. While the drums are tight, I feel like they too were written with little imagination. Fills, I've literally heard millions of times. Lines where it sounds like the drummer became bored and just did simple cookie cutter pieces. The drums rarely seem to shine through in this album. There could have been so much more to them, rather than to hold the beat, and then blast when it was deemed fit. Third, the bass. Just as boring as the guitar work. Barely audible in some points. Though this is sort of like black metal, bass has had little importance in previous works (with the exception of bands like Abigor) so I won't count that. Lastly, the vocals. I said before that the vocals are bearable. They sound underneath the mix, as to not take away from the atmosphere. Personally, I think it would sound better if it was at least 60% instrumental. What I will say is that the lyrics are interesting. Obviously not anti-theist, or satanic. Poetic in a sense. Not bad.\n\nI give this album a 30% based on these things. The lack of imagination in the music itself, seemingly defined as a masterpiece and a work of art, greatly outweighs the few fleeting moments of decent writing. I do not revel in writing such a bad review about a band that is clearly talented. If Deafheaven were to release a new album, I would attempt to listen to it in the hopes that they do not repeat this. These guys have the ability to, no doubt. All in all I find \"Sunbather\" to be a dime store version of Amesoeurs. If you are all about listening to mediocre post rock mixed with black metal, this album is for you. If you're looking for something better, go listen to Amesoeurs, Wolves in the Throne Room, Onryo, Lantlos, Dopamine etc.\n",
        "\nGentlemen (and ladies), there is a war upon the very soil of the genre we call metal. It is a war waged not by Tipper Gore and TV evangelists howling about the Satanic ramifications of your mortal soul for listening to Iron Maiden’s Number of the Beast, and not by the misguided mainstream appreciation of the genre in the light of bands such as Nirvana and Korn - but by a far more insidious and sinister force. This is a force that attempts to destroy metal from the inside, by introducing non-metal elements subtly and then slowly overtaking metal until there are NO true metal fans left at all, and instead only skinny-jeans-wearing, latte-sipping hipsters!\n\nYes, truly I am speaking of Deafheaven’s Sunbather. This is the war against hipsters, people; and we are the front lines of defense.\n\nThe album’s focused and clear vision of what it wants to do is realized through long and textured melodic songs with sweeping riffs and gentle acoustic melodies. The vocals are a sorta-blackish howl that contrasts quite nicely with the “pretty” music, and creates an interesting dynamic. The main focus of the music is atmosphere rather than riffs or one singular instrument, and the songs tend to work best when you sort of let them roll over you like waves, rather than sitting there and waiting for the next killer riff or “jump out at you” moment.\n\nIt is this very introspective nature, as well as the “pretty” feeling some of the music has, that makes Deafheaven’s plot so evil and underhanded - by playing these distinctly non-metal elements against rather generalized pseudo-black metal-style riffing and the harsh vocals, they are tempting loyal metal fans with 30 pieces of silver, so to speak. Who knows what evil could come if fans of metal were introduced to non-metal elements when they think they’re going to hear metal? Good thing you guys were here to catch that one before it started. Nipped it in the bud, man. In the bud.\n\nLyrically, the band spins enigmatic tales of lovelorn emptiness and of the vast contemplations of the human soul. I won’t try and claim these are great lyrics, as they are too vague and don’t really get the point across all that well, but there is a certain level of feeling to them; an authenticity that I think makes them rather interesting. They come off as a bit like a high schooler’s attempts at writing dark poetry, albeit with an enlarged vocabulary, and the earnestness of them really shines through and gives the band a voice - I certainly prefer it over reading any more generic Iced Earth/Megadeth/Nevermore lyrics about how the world is going to shit, or reading Gothenburg word-salad nonsense lyrics, but hey, that’s me.\n\nThese lyrics are definitely not typical for a metal band, and if something released by a purported “metal band” (read: a band submitted to Metal Archives) isn’t 100% metal, there’s definitely reasonable suspicion to believe that they may be conspiring to bring down metal as we know it and let open a floodgate of hipsters. The danger is real.\n\nThe songs tend to sound alike, which adds to the unified feel of the album. “Dream House” is the obvious stand out, with its wistful melody and rather expert combination of the loud and soft parts to create a tense and yet also forlorn atmosphere - it’s a complex mood and the song remains engaging all the way through. The title track and “The Pecan Tree” are two other long, oceanic epics, and they work pretty well, though not as well as the aforementioned opener. Only “Vertigo” could probably be trimmed down by a few minutes, but even that one isn’t offensive in its length or anything; just a tad too long. Softer interlude tracks like “Windows” and “Please Remember” also work well to add counterpoint and drama in-between the more exhaustive longer songs - and they are made atmospherically interesting through the use of somewhat muffled sound clips, which lend an eerie, slightly darker feel to the proceedings. Overall its moods and textures are complex and engaging.\n\nThe atmosphere of Sunbather overall has a rather pleasant temperament to it, painting mental pictures of crumbling Victorian houses by lakes overtaken by weeds and mold and of desolate countryside fields under a pregnant sky, swelling to storm. It’s a very affecting and poignant work. While I profess no expertise in genres like screamo or post rock or anything else like that - and readily admit there are bands who probably do this sound better than Deafheaven - I still find the album enjoyable overall and it listens like a breeze for me.\n\nBut let’s not get too far away from the main point here - these kinds of interesting and multi-layered atmospheric moments are just window-dressing to distract us from the band’s true motive: destroying metal from the inside out. I can’t let myself be distracted here. By playing with a few metal elements in their stew of mostly non-metal parts, the band shows us their true colors - serpents surrounding the Tree of Life of metal; tempting those nubile and innocent metal fans away from their beloved genre and contaminating it with acoustic guitars, a melodic sensibility decidedly un-metal and screaming vocals that could easily be from some kind of post-hardcore or screamo band rather than black metal. Evil. Disgustingly evil. \n\nThis will be a long and bloody war for sure, but we do have a great line of defense in any number of black metal fans sitting at home and judging music for truly justified reasons like, “they were reviewed positively in Pitchfork.” Or, always a favorite: the band members wear clothes we don’t like and wear glasses on stage. Glasses! The gall. What would I have done if not for the presence of these valiant souls to guide me in the right direction of how to properly listen to music?\n\nI’m sure glad I was corrected about my misguided beliefs that music was about feeling and personal expression, but clearly it’s more about hating whatever Pitchfork likes and whether or not the band members conform to a metal fashion style - these are the most important things. What more can I say but: keep on fighting the good fight, metal soldiers. Never give up.\n",
        "\nAesthetics are often the most noted aspect of black metal, an image that reflects the imagery and atmosphere of the music. The grainy black-and-white silhouette of Transilvanian Hunger - itself an homage to Mayhem, or the selective obscurity of the LLN - imitated often, but to little effect. These images paired with the sound, Darkthrone's being a bare, stripped-down shadow, and the LLN having a very rough sound with a very strong ideology and foundation beneath it. Here we have a band from San Francisco with a Peptobismol-colored cover bearing only a title of a ritual of darkening that is nearly foreign to black metal, California's favorite way of getting skin cancer. \"It's different!\" it exclaims, espousing an alleged virtue that sets it apart from the other records in the store - or, let's be realistic, the other thumbnails on YouTube. \n\nDeafheaven collide headfirst with the predicament of imitation in black metal, and keep going. When black metal was first commercialized in the mid 90s, there was quickly a flood of second-rate bands who softened it up with a friendlier formula - a bit of blasting fury stretched out into long, wandering songs with acoustic interludes - back then it was sugared up with keyboards, now it's sweetened with major scales and the folky interludes are now post-rock. Despite the superficial updates to the aesthetic appeal, it still follows the same failures - overlong songs that go nowhere for no reason and only hope that the listener follows the trail of candy. Grim gothic/black metal may be a thing of the past, but the same follies are found here without facepaint. A new shade of gloss over the same poor construction, an hour with four songs and interludes. A bitter man once told me that this album was just a repackaging of Orchid's \"Gatefold\" - at two and a half times the length, this album takes that title at face value. That style of minute-long busts of fury becomes horribly deformed when stretched to 10-15 minutes, like trying to perfectly straighten a paper clip then reshape it to its original form. Dip it in sugar to make rock candy and someone will eat it up. \n\nSame old shortcomings, new superficial gimmick. Yay, Peptobismol!\n",
        "\nThis whole shoe-gazing post black metal (whatever genre you want to call it, I'm not going to split hairs on the categorization) style isn't altogether new. Alcest has been doing this style reasonably well, with decent commercial success, but not to a level remarkable for a metal band. Deafheaven on the other hand, takes a similar approach with some twists. The chord progressions are generally major chord dominated and have overall optimistic or at least sentimental sound to them. This contrasts with the vocals, the closest to which I've heard would be to Leftover Crack on \"Operation M.O.V.E.\". Pretty aggressive, unintelligible and fairly monotonous in pitch. Not detrimental in and of themselves (this is metal after all... I think) but for me there is a fundamental disconnect between the instruments, the vocals, and the lyrical content. \n\nThe instruments as mentioned are fairly well produced, and in such a way that guitars are generally using a wall of sound type of approach, tremolo picking riffs that harmonize to outline chords which is a pretty standard approach. However, when taking into account that basically every song is in a major key, it is hard to reconcile the uplifting feeling the guitars provide with the vocals. The vocals just do not work for me with this style of riffing, there's a complete confusion as to what type of tone the songs are trying to set, which only gets more confused by the lyrics, which are sentimental verging on cheese. It's like a painting with a sunny setting where the main object of focus is in complete dissonance with the setting, channeling a angry melancholy. I personally think Alcest does this style of riffing a service by complimenting it with clean vocals of ethereal quality, giving a far more consistent tone to the music. Also, if one insists on harsh vocals in this style I'd say go check out Envy, who pull off harsh vocals with this type of riffing (and post rock interludes) far more effectively in my opinion.\n\nAnother gripe I have is the rudimentary melodic lines that all the songs have as far as guitars are concerned. It makes sense to add some variation and distinction to songs and not simply tremolo pick every riff. However melodies like the end of \"Dream House\" sound woefully uninspired, in fact the end of \"Dream House\" reminds me of a novice arpeggio exercise, playing a the I chords arpeggio for a while and then moving up to the ii and iii chords arpeggios... I can't say I find this particularly musically impressive or creative. The post rock elements of the guitars also don't particularly wow me. Many of the intricacies and layered melodies and harmonies that clean guitar passages in post rock utilize aren't present here, clean passages are much more basic on Sunbather, which is okay in and of itself. I think was disappointed by their quality as a result of anticipation based on what I had heard about the album before listening to it, perhaps it's not wholly fair to be critical on that point.\n\nMy final assessment would be that this album has many interesting aspects and areas for the band to grow and shine in but it is far from a coherent album. Too many conflicting and un-resolvable elements are found here. To the bands credit it is an adventurous combination of styles, but it simply doesn't do it for me. A couple final personal notes that took this album from an objective \"below average\" in my book to a subjective \"not good / bad\": The lyrics are god awful. Atrocious. To the point where knowing the subject matter leaves me even more confused as to the mood and tone of the songs and why the instrumentation was paired with the lyrical content on this album. Lastly, the god damn cover looks like a Swedish House Mafia single cover. Dear. Baby. Jesus.\n\nAs a final note in regard to other reviews on M-A calling this black metal, if this is black metal then we have final proof that black metal is in fact dead.\n",
        "\nPost-black metal is all the rage these days. It's the proverbial \"what are the kids listening to now?\" music for metal, destined to drive off dedicated listeners of more traditional, \"true\" black metal by incorporating major keys and a decidedly brighter element to the style, both musically and in terms of outlook on life and existence (well, most of the time; see Altar of Plagues for when the genre gets gritty). The thing to remember about black metal is that of all the different styles and subgenres of metal that have developed over the last 40 years, black metal may be the most open to experimentation. It's been fused with old school speed metal (Midnight), power metal (Satan's Host), rock 'n' roll (later Satyricon and the first Kvelertak album), sludge (Coffinworm and Churchburn), hardcore punk (Darkthrone and Okkultokrati), and even some jazz at times (Swedish Shining, particularly on Halmstad). Mixing it with post-rock/metal and shoegaze is just the next step in the genre's history of experimentation and fusion. Deafheaven, America's beefed up response to the sudden and striking popularity of French shoegazers Alcest, has taken that fusion to the next level with Sunbather, almost perfectly blending the two into an hour long mass of beautiful chaos.\n\nBeautiful chaos. I used that term originally when describing Liturgy's failed attempt at cultivating such an atmosphere with their 2011 release Aesthethica. It definitely had moments where it was going right, but those moments ended nearly as quickly as they began, preferring to rest comfortably in a meandering daze from which the album just could not recover. Sunbather is kind of like what that album would be like if the band were good at taking the great ideas that came their way and running with them. From the moment opener \"Dream House\" shifts into a pummeling onslaught of blasting and shrieking, you realize you've got something special on your hands, as the tremolo picking here creates an atmosphere unlike anything I've heard before in black metal. It's both beautiful and punishing at the same time, battering the listener with extended bursts of blackened mania before settling down into post-rock worthy of making one gaze at their shoe. It helps greatly that the production values here are as good as they are, with natural drums, rich guitars, and a ripe authentic feeling pulsating throughout the entire record. The instrumentation is astounding as well, with drummer Daniel Tracy stealing the show through his nonstop barrage of blasting and manic fills with the power and force to match any \"real\" extreme metal music. He also knows just when to dial it back enough for the spacier sections, an approach giving the tunes the air they need to make a real lasting impression.\n\nThe songs tend to exist in two halves: crazy black metal madness, and moving, emotional post-rock, and while the black metal sections have that post-rock undertone peppering the tremolo picking and blast beats, the styles usually stay a bit further apart than you'd think here. Still, the sections flow from one to another seamlessly, with special mention going to the switch in the middle of \"Dream House\" and when \"Vertigo\" really picks up about 5 minutes in (although those 5 minutes do feel very long and could disinterest those with shorter attention spans). The entire back half of \"The Pecan Tree\" may be the band's absolute crowning achievement, with the lush post-rock melodies glimmering out over a pulsating drum beat sure to make one feel as though you're in a vast open meadow or field just staring at the sky. Even the interlude tracks flow well here, although they more often than not work way better in the context of the album as a whole rather than as standalone tracks. If \"Irresistible\" were a couple minutes longer it would be a great easy listening piece on its own, but at only 3 minutes it absolutely is better as a transition from \"Dream House\" to the title track than it is on its own. As for which style tends to dominate over the other, black metal and post-rock coexist peacefully here, although I tend to view the album as half being more black metal based (\"Dream House\" and the title track) and half being more post-rock based (\"Vertigo\" and \"The Pecan Tree\").\n\nOn the subject of the album's lyrics, I've seen many people take issue with the fact that the lyrics are as inane and ultimately meaningless as they are, and...yeah, they're kind of right. Even when you don't compare them to the infinitely superior lyrics of the band's debut Roads to Judah, the lyrics on Sunbather are inane, poorly thought out, and just plain stupid. They are the one fault with this album, and the only reason I can't give it a perfect score. It's kind of ironic to me that the debut album had really good lyrics but not that interesting music has flip flopped to having excellent music but lame, shallow, intensely idiotic lyrics. It's not like you can understand them anyway, what with vocalist George Clarke's Neige-inspired shriek rendering all attempts at legibility fruitless. The way they're written means that rather than there being any real \"lines\" lyrically, they're vocalized in a more flowing manner, like if you just wrote a paragraph of nonsensical blabber and screamed it out over the music. It does work well enough for the music here, but I've never preferred lyrics written that way. The one time they work really well is in the back half of \"Dream House\", with Clarke's pained howls of \"I want to dream\" punctuating the music in such a manner that I was overwhelmed by just how massive it all was. The reason the bad lyrics don't ding the overall score that much is because you really can just forget all about them and still get full satisfaction out of the music, as if they didn't exist at all. All in all the lyrics are a failed attempt at introspection that are best left to the wayside as you allow the music itself to overtake you, kind of like watching a really good silent movie but in musical form.\n\nIn the end, Sunbather is an achievement previously unseen in the realm of post-black metal. While bands before it tended to either sway too far to the black metal side or the post-rock side, or were just post-rock/shoegaze records with metal elements sprinkled throughout, Deafheaven have taken the two styles and blended them together in a way that seems only fitting. Take one part atmospheric black metal, one part shimmering post-rock, mix them together so that both styles are represented fairly equally, and they ended up creating the best album of 2013. Their very hipster-y image I know has and will put off a lot of prospective listeners who have yet to experience Sunbather, but I encourage you to not let that dissuade you from the band and this album and jump right in. At the end of the day, Sunbather is just that: an experience, and it's unlike anything ever seen or heard in extreme metal music.\n",
        "\nThe first album of the Californian Deafheaven struck me as an easier to digest version of their New York counterparts in Krallice and Liturgy. While clearly more mature than Liturgy could ever hope to be, their brand of soaring black metal was only retreading grounds Krallice (among other established acts) had already explored thoroughly on their self-titled debut. Having more or less regarded Deafheaven as a decent but not particularly noteworthy post-black metal band, the overwhelming critical acclaim heaped upon Sunbather came as quite the surprise to me, so I caved in gave it a listen.\n\nSure enough, the album kicks off to a very promising start: the opener Dream House is one hell of a song, even if it all feels like one surging climax after another, never letting up. It's only until the obligatory clean bit in the middle that the band gives listeners a little more space to breathe, before a slower post-metal dirge finally rounds things out. The simple but innocently beautiful guitar interplay of the following song, Irresistible, serves as a perfect conclusion to Dream House; so much so that splitting the two feels completely unnecessary.\n\nBut that's when the album stops being interesting. From that point on, Deafheaven prove to be nothing more than a one-trick pony, attempting to recreate the ferocity of Dream House, but never really doing it. Vertigo, for example, briefly suggests the possibility of exploring darker territory with its haunting introductory arpeggio, but merely settles into the usual saccharine self-indulgence after a few minutes. Fast and loud, slow and soft: that's the formula the band use, both between tracks and within the tracks themselves, and it's a formula they run into the ground.\n\nAside from the heavy-handed dynamics, it's rather shocking how one-dimensional Sunbather manages to be. George Clarke's piercing but muffled howl, while admittedly rather impressive, is completely monotonous. Listen to the first syllable he screams – that's pretty much all he'll ever do for the rest of the album. The same goes for Kerry McCoy's riffs; distorted and tremolo-picked major key chords with lots of glistening sevenths during the predominant faster moments, or clean arpeggios whenever the band needs to go half-time... Nothing else.\n\nLyrically, Clarke rambles on about generally melancholic...stuff, with wishy-washy and painfully pretentious musings such as \"my heart flourishes at each passing moment\" and \"hunched over in apathetic grief with a disregard for steps except the one taken back\". Sheesh. Don't even get me started on Windows, where drug-dealing samples are juxtaposed with street preaching for five goddamn minutes.\n\nBut on their own, the mind-numbing vocals, or the inoffensively shimmery riffing isn’t all that bad. Even the insipid lyrics can sort of be forgiven if you simply choose not to read them. No, Sunbather's major pitfall is the haphazard inclusion of blastbeats. The constant blasting simply doesn't gel with the music. In fact, it almost ruins the sugary prettiness of the riffs. Now, I'm not saying blastbeats don't belong in post-black metal – they were good on Dream House, if only because it was the first instance of them – but when nearly the entire album is filled with them, what you get is an hour-long blastfest with half-assed interludes spliced in for the sake of variation. It gets worse when the guitars inexplicably get faster and faster in a desperate struggle to keep up with all the blasting. It's not a complete mess like Liturgy's outright confounding bursts of tempo, but it still takes away from what could potentially be a very rich, absorbing atmosphere.\n\nSunbather could have very well been an excellent post-black metal album if they'd just cut it out with all this ridiculous blasting, but instead, it turned out to be... this. It has all the immediacy of black metal, with the varying (albeit highly forced) dynamics of post-rock, but the manner in which the two styles so antagonistically clash with each other makes Sunbather, regrettably, less than the sum of its parts. If its Billboard charting is anything to go by, Sunbather is certain to please just about anyone wanting to get into post-black metal, but in the end, that's all it will ever be: ‘black metal’ for people who don't like black metal.\n",
        "\nDeafheaven's Sunbather is possibly the most polarizing metal album of the 2010's thus far. In the grand scheme of things, there really is no middle ground. You either love this album, or you despise this album. I fall into the category that thoroughly enjoys this record. The guys in Deafheaven have made something truly special with their sophomore release Sunbather. \n\nI remember hearing the overwhelmingly positive reviews given upon release and decided to check it out. I remember hearing \"Dream House\" for the first time and still to this day I think it was one of the best songs of 2013. A song with such power and force, but also peace and tranquility thrown in for good measure that makes for a truly wonderful song. The rest of the actual songs on this album are also top notch and follow in similar fashion with most parts favoring cold sounding black metal with a dash of post-rock/metal sections amidst the chaos. The interludes are also good and help separate the songs and give you a breather from the intensity, but at some cases they do become a bit monotonous. \n\nThe playing on this album is pretty top notch. The vocals from George Clarke are some of the best black metal shrieks that I have heard. The only thing that would have possibly made the vocals better would be if some clean vocals were added, but it's not a huge detriment. The guitar playing is fabulous as well. Whether they are playing blistering black metal chords amongst the shrieks and blast beats, or playing beautiful chords of post music, Kerry McCoy really plays the hell out of his guitar on this record. The drumming which was handled by Daniel Tracy can also be discussed. He plays the drums exactly the way he needs to, nothing too flashy, he just does his job and that is fine because the way the album sounds, flashy drums probably wouldn't stand out much. \n\nSo in conclusion Deafheaven's Sunbather in my opinion is one of the best albums of 2013 and of the decade so far. It's an album that really breaks the mold of the genres of post music and black metal. It's an album that has been praised by mainstream reviewers and it may be the album that puts extreme metal into the mainstream. You may simply call it \"hipster\" metal, but it's so much more than that. I'm also really excited to see where Deafheaven will take us on their next album. So please if you enjoy the genres of music that have been mentioned in this, then please do yourself a favor and listen to this metal masterpiece.\n",
        "\n2013 was a year ruled by oddities within the music world. Outside the world of metal, artists released albums way out of their normal standards and were lauded for it. But nothing is as odd as the fact a black metal album is almost unanimously the #1 album on every end of the year list. It's really just insane if you think about it. Black metal. On a list of the best albums. And at #1. Who's pranking us?\n\n\nDeafheaven are a post black metal band from San Francisco. They've released some highly regarded albums before \"Sunbather\", and are a highly buzzed about band in the music world. Musically speaking, \"Sunbather\" is just really straightforward black metal, but apparently it's not because bands like Mayhem aren't on Rolling Stone's list of their favorite albums for the year 1994. It's almost like listening to a drum exercise, except there is a man standing in your face screaming wildly for 9 minutes, with intervals of really shining guitars and a bunch of people telling you to love it. I kid, it's not that bad. 9 minute opener \"\"Dream House\" is, admittedly, a beautiful song. Beautiful that is after the 5 straight minutes of mindless screeching and blasting on the drums. It's taking two obtuse formulas and putting them together. The shoegazy sadness of indie rock, and the raw, soul piercing rage that is raw black metal. If these formulas weren't meant to work (a la rap metal, or industrial grind snooze core or some bullshit), they wouldn't work. But it works, if not in an intriguing non-corrosive way.\n\n\nThe true spotlight on the album is meant to be the guitar work. Many times when a guitarist is deciding how to construct a riff, they will take nods and influences from whomever inspired them or what they enjoy playing. Deafheaven guitarist Kerry McCoy has taken two horrifically non-alike genres of music and somehow made them almost mesh into one, with ease at that. Black metal is not meant to be able to blend so well with a genre like post rock, or shoegaze, or indie rock if you will. But the slew of bands that have made it so immensely popular over the last 5 years or so have taken that notion out of any music fans minds. \n\n\nWhen black metal began some eons ago (it feels like eons), the music was meant to be more a statement than a real genre of music. There were rules, and guidelines, and inevitably there were fatalities. Only rivaled by hardcore rap, no genre of music takes itself so damn seriously as black metal does, or did I should say. Bands like Mayhem, Darkthrone, Gorgoroth, etc really believed that they were somehow instilling fear into the hearts of \"non trves\" and posers by wearing corpse like makeup and wearing all black. It may seem like a joke now, but Mayhem's Dead's infamous death photo was referenced in the liner notes of \"Dawn of the Black Hearts\" as his assertion of absolute trueness. He blew his head off with a shotgun, and they loved him for it. That was the attitude. However, nowadays, black metal's entire demeanor and ethos has almost completely changed. That idea of extremity has been pushed into new avenues, and the one that has seemed to flourish immensely is the idea to musically challenge both yourself and the listener. Deafheaven haven't, by any means, created a noise album a la Lou Reed, but they have challenged the listener to step out of their box of comfort, all while treating them to some immensely pleasing melodies and soundscapes. It's as though they too have tried to instill an emotion in the hearts of people, albeit not fear and suicide. \n\n\nIn summation, Deafheaven do ultimately deserve the accolades they have gotten for \"Sunbather\". While not a perfect 10/10 by any means, this is, at its weakest, a really strong atmospheric black metal album. The title track is a true work of art if you were to look at it subjectively. There's so much going on, yet not really much going on. It's like Jackson Pollock meets minimalism, with a touch of Fenriz for good measure. If you're looking for a good album to just space out to, this is not it. This demands attentiveness, even in its most pulled back moments. But if you're looking for a good album to swaddle you in a mayhemic landscape of beauty, brawn, and bestial rage.....You may need help but this album is for you. Kudos to Deafheaven for trying to different, because God knows there's a whole lot of slackers out there.\n",
        "\nConcerning whether it's (black) metal or not: play it loud and ask your neighbors.\n\nSelf-absorbed lyrics? Yes, indeed. Like in most metal bands, regardless of the sub-genre. Isn't metal thought to be embraced by all the lost and introspective souls out there anyway?\n\nMajor keys? True. And if 'major key' does not equal 'metal', well then, strike Iron Maiden off the list of metal bands immediately!\n\nJuvenile lyrics about unrequited love? Yup. But: symphonic/gothic metal, anyone? And while we are speaking of 'juvenile', it's of course metal enough to record “Pure Fucking Armageddon” and “Deathcrush” shouting juvenile crap about ghouls and gutsfuck into the microphone, right? Any other type of juvenile crap is out of the question. Oh, but maybe you have to be juvenile AND grammatically incorrect at the same time to be metal? Or is love as the theme of lyrics the problem? Hm, why is Nightwish metal then? Or are they?\n\nBut does this reviewer care? Not really. Categorizing as such is mostly pointless, but it seems that the whole discussion on Deafheaven being 1) metal (or not), 2) innovators (or not) seems to overshadow the album itself. What I tried to point out above is the fact that traits present for decades in metal music of various kinds are suddenly being used against a band that combine them in a bit different way, adding significant post-rock influences (also less uncommon in metal music than would seem, only Deafheaven make the influence more pronounced). Different, mind you, does not mean, innovative or groundbreaking. This album is neither. What is it then?\n\nA piece of highly enjoyable, well-composed, and well-played music – on constant heavy rotation in my stereo. What I enjoy about this album the most is how well-composed it is. Contrary to what you may read in some places, it's not all major key. What Deafheaven do is mix major and minor key harmonies and melodies, at times adding some note bending and dissonance on top. True, initial listens may not reveal it, but this is the key component of songwriting on \"Sunbather”. Also, there is a degree of unpredictability in the compositions which makes me want to revisit the album. Each time the songs move into the 'less pretty' territory (and they do), the listener may rest assured that there is a release awaiting them just around the corner. And this is an immensely rewarding technique. If you listen carefully, you'll notice that the motives do not tend to be repeated too often. The music shifts and twists constantly, through harmonic and melodic variations, and it's highly effective.\n\nThe drumming is all-out excellent. The hyperactive playing adds a great amount of dynamics and power to the music. The long stretches of unrelenting blasting (“Vertigo”) are also a nice touch. The way the drums are mixed, along with the rest of the instruments, makes this album sound powerful, yet not overbearing, and create the feeling of 'riding the waves' that I like so much (Wolves in the Throne Room and Alcest come to mind).\n\nThe vocals are what I expect from this kind of music. One-dimensional but powerful and mixed low enough to be present but not overwhelming. On a sidenote, I used to think that vocals in post black metal are totally unnecessary until I heard Morphinist. The music was severely lacking precisely due to the lack of vocal. So, there.\n\nThe interludes? A pause for breath between the blasting sections. Maybe the album could do without them, but they are there and this face does not bother me, nor does it lessen my enjoyment of it. (Another sidenote, the track \"Windows” sounds similar to a section of Godspeed You! Black Emperor's \"Lift Yr. Skinny Fists...” album.)\n\nIn short, this is one of the best (if not the best) albums of 2013, which I listen to very often, and each time with pleasure. It's also emotional and naive – but in a good way. Simply put, I like it. A lot. And whatever anyone would say or think about the band and this album specifically – \"Sunbather” delivers what I expect from music in general, hence the perfect score. Hipster black metal? There's only good and bad music. This is the former.\n\nFootnote: I mentioned Alcest. Curiously, they seem to receive less scorn for being un-metal than Deafheaven. Is it because most people don't speak French and can't bash the lyrics?\n",
        "\nUS black metal group Deafheaven recently gained a ton notoriety shortly after Pitchfork readers and variable metalheads alike began discovering this band in 2013. Well right now, it's the end of 2013 and I can say myself without the grief that this band too was added to my music collection after giving a listen to this year's breakthrough LP. Interestingly enough, Deafheaven did not already began wowing audiences only recently. Their untitled demo tape, dug up from the depths of the band's very 2010 beginnings is incredible, if not just as good as Sunbather. \n\nConjuring fair shares of influences shift back and forth, including post-hardcore, post-metal and shoegazing. Black metal has never felt this warm. The songs displayed here have a vibe like nothing that has been visited in the genre previously. What impresses me the most is this a no-bars held demo tape, completely written by two men and performed by three. No label writing their songs or telling them what to do, thus proving the unadulterated talent Deafheaven holds. Session drummer John Kline, while was not officially a part of Deafheaven, gave an outstanding performance heard here. I also want to get it out of the way that some of the riffs on this album are simply amazing and contentiously have me coming back for repeated listens, most notably the riff heard in the middle of the demo's opening track \"Libertine Dissolves\", which contains a riff so pleasing to the ears, I feel like referencing its time spot would serve unnecessary. When you hear it, you'll know which riff I'm talking about. \n\nGoing back to Kline's performance on an analog kid, I forgot to add that his snare sounds nearly exactly the way I want it to. It's loud and leaves me satisfied. The whole production of drums as a whole sounds great and they're completely trigger/programmed free. The drums heard on here is the real deal, they're recorded raw with no triggers or samples and I absolutely love how they sound. Not to mention his double bass tactics combined with rapid blast beats that he gravitated off the rim of his snare sounds as authentic as ever purely because of how real this drumming is as it hits the ear. Unfortunately enough, Kline did pass away just two years after this recording. A drummer with this much stamina, talent and dynamic only lived so long. May he rock in peace. \n\nNow as I continue, I feel like many people reading this review would feel as if it's empty without mentioning the vocals. Basically, they're not much different to Sunbather. It's your typical black metal scream shrouded in studio-effect echo and distortion, but the lyrics are what really get me. Oddities such as \"I laughed at the cigarette stain\" are reminiscent to fellow US black metal Liturgy's \"chattering useless teeth\" line found in their track \"Mysterium\", just with the ridiculousness taken to a whole new threshold. Albeit, sure he's not taking a step as big as saying \"my pussy tastes like Pepsi-Cola\", but retains as this weird thought to the back of your mind at times asking if the lyrics are serious or not. Acting out as if these lines have some deep, misperceived meaning is simply the greatest way to compliment the band.\n\nBy what I do understand, however, the lyrics in all seem to be put at the point of lost love and heartbreak: \n\n• \"I loved a girl I'll never speak to again/ I spoke to a girl I never stopped loving\" - \"Libertine Dissolves\"\n• \"He smudged the blood of his lover. 'We are never apart. Maybe in distance, but never in heart.'\" - \"Exit:Denied\"\n\nImpressive musicianship and structured songwriting that manage to blow the listener away as songs in their best efforts not only stray far away from following the same formula as the last, but also introduce various sounds from track by track is not the only reason why I give this release a 95% score. It's the simple fact that this is very real music. It's not studio reliant stuff, it's not producer written material and certainly was not done to make a quick buck. Everything down to the drums is genuine as it gets. Had this been a label released album, I probably would have deducted at least 10 points away from my final score. It's the simple fact that this is a demo tape is why it gets the recognition from me that it does.\n",
        "\nThe amount of people who have expressed their utmost surprise at my dislike of this album is probably in the double digits at this point, and they're not without their justifications. I love anything that sounds bright and euphoric within a black metal template, hell, I don't even care if a given band completely stops being metal to try and further concentrate said hopeless euphoria; the end justifies the means. Sunbather sounded like it should have been right up my alley when I read about it in reviews prior to hearing it, and it's even caused the band to explode in popularity and receive a lot of attention from people who don't normally listen to this type of music. I think they may even be headlining a tour passing through my neck of the woods soon. I first caught wind of them back when Roads to Judah came out, and it was decent but didn't really stand out amidst the sea of other stuff coming out that was drawing from the exact same wells as most other music in the post-black vein. I then kind of forgot about this band for a couple of years, so watching them rise to prominence on the heels of Sunbather was a bit surreal. They've certainly upped the ante here and tried to write something more bombastic and individual, and it obviously seems to have given them a fanbase, but it isn't working for this post-black geek.\n\nA substantial amount of people are going to be tricked into seeing this as revolutionary due to the remarkable drumming on display here. The drumming really is excellent, no other way to put it; there's a constant flurry of activity and texture within the blastbeat base that single-handedly saves this album from being the absolute nadir of all music and even may make it initially seem like something really is going on. The ebb and flow of the drums is so lush and smooth that I really wish this sort of drum style could be applied to an entirely black metal framework, but unfortunately that's not the only style influencing the music. There's a significant post-rock influence at play here, and its grandeur and major-key passionate bombast entirely dominates the clean breaks and additionally manages to permeate its way into the metallic riffs. This ends up counteracting the effect of the frantic drums completely, no mater how well-done they may be in their own right. Through hybridization and attempting to create a superior sound through synthesis of styles, Deafheaven have lost what made the parent styles beautiful in the first place.\n\nPeople often mock black metal bands for overusing blastbeats in their music, but I personally never see them as anything but necessary to my black metal when used in the appropriate context, even if they run through the entire duration of the song. There's a certain focus and energy in black metal that only the stark repetition of blastbeats can accentuate properly, a passionate release of anger that with guitars that respond and acknowledge that the release in itself is cathartic with a prominent melody. In being overwhelmingly fast and frantic, they can make the music really powerful. However, the near-reliance on them when the black metal-esque riffs are present on Sunbather doesn't properly give the oomph to whatever emotion the guitars are supposed to be representing. Rarely does Deafheaven ever play anything but uplifting, major-chord tremolo riffing alongside the slick, frantic drums, and seldom do they ever come together to capture the emotional explosion they're attempting to. The edges are rounded off of the black metal template and there's never quite enough attention given to any particular riff for the songs to have their necessary staying power. Constant focus on contrasting delicate, drifting post-rock guitar with fuller and more bombastic blackgaze loses the sense of captivation post-rock brings with its gradual crescendo and the fluttering activity everpresent in the drums limits the music's range of motion and doesn't give things a chance to breathe or function in either a post-rock or a black metal context. The flurry of active tremolo riffs after three minutes of lackadaisical clean guitars is supposed to be \"bursting\" out at me or something, but the two disparate elements never really feel connected. The music is flashy and diverse but does little in the sense of a narrative when it comes to melodies. Apart from the title track, which features a few interesting sections midway through reminiscent of something like Drudkh, the riffs most closely resembling metal fail to be noteworthy in any regard. They're too safe and stable in their melodic form and the music has a too short of attention span in both texture and composition. At least Hunter Hunt-Hendrix really, really seemed to passionately believe in whatever wishy-washy crap he was peddling; Deafheaven can't even stir up an ounce of anything beyond indifference to what they're playing. There's nothing actively repulsive on display, but it doesn't seem like this band is capable of branching out in a way that would sonically offend anybody. \n\nIndeed, for all the cross-breeding going on here, one would expect something mind-blowingly original, but the methods that Deafheaven take to blend the metal/ post-rock/ screamo/ shoegaze/ post-hardcore/ whatever you think you hear in their sound (any one of them could be true for all I know) have already been frequently trodden upon. Bombastic major-chord tremolo over blasting? Neige has been getting flak for this kind of stuff for years. Sparse, ambient guitar and occasional acoustic bits leading into triumphant, midpaced post-metal? Pretty common in Cascadian and Californian black metal these days. Long, swirling noisy bits? Ignored completely when Agalloch slapped them at the end of Ashes Against the Grain, but since on Sunbather they're jammed in between the songs, they give the illusion of acting as bridges. They're terribly unfitting and the spoken word vocal samples over \"Please Remember\" and \"Windows\" reek of pretensions at Godspeed You! Black Emperor sort of levels. I'm going to be frank here; the amount of actual metal present on this album is not nearly as high as you may think. The three interludes between the longer tracks cannot be considered metal in any way, and they take up almost fifteen minutes of the album's runtime alone. There's an additional three to four minutes of delicate clean post-rock guitar in the longer, meatier songs- that's almost half the album all in all if you're keeping track, and on top of that, there's a good deal of riffing on this album that could much more easily be linked back to screamo and post-hardcore than any form of metal. This is, objectively, at least 50% not a metal album. That's not a bad thing on its own, but the soup of other influences on display don't blend and feed off each other. The three interludes don't serve as a rest from the frenzied displays that came before them, because those lighter breaks were already a feature in the four main tracks, \"Dream House\", \"Sunbather\", \"Vertigo\" and \"The Pecan Tree\". As a result, those other three \"interlude songs\" serve as little more than self-indulgent trash. Sunbather does stumble on some small segments I don't mind because I'm a fan of post-black and have a casual interest in post-rock and post-hardcore, but the songwriting is a bit too adventurous and loses thematic congruency in the process. \n\nI could have forgiven all of that though. Seriously, if that was everything that was wrong with Sunbather I could have given it a passable mark. Sure, I wouldn't be recommending it to anybody but the beardiest of neckbeards, but at the very least, it wouldn't be something I actively disdain. Sure, the songwriting and genre exploration makes everything seem a little bit high on its own fumes, but at least they tried to mix it up a bit, even if the result wasn't really anything all that fascinating. The ideas are intriguing, but the execution is sloppy. With a cool concept or backstory to an album like this, it could have even been a solid presentation of the range of influences a band can have in the post-black subgenre.\n\nBut then, they had to go cock it up and write those lyrics. \n\nIf the aesthetics of the vocals are justification for why Deafheaven could be considered a metal band despite writing an album with at least 25 minutes of completely unmetal music, the lyrics could be justification for the exact opposite. Sure, weeping love stories have never been much of a stranger even to metal at times, but the endless hopeless pining was just as annoying when Warning did it years ago, and it's even worse here. The weird, scatterbrained obsession this guy expresses with his love may be an emotion a lot of us may be able to resonate with, it sure as shit isn't all that interesting to hear about because I've heard the same sort of thing from all my virgin male friends and they at least do without the plastic imagery and the pseudo-intellectual navel-gazing. There's no sort of change in the rhythmic focus to them, either, which translates to a bland vocal performance; every rasp has the same inflection and there's very little additional personality or charisma injected into them. You'd think that with the post-hardcore influence at play, this guy would take advantage of wailing, shrieking, yelling, anything he could do to get out the frantic depression of unattainable love, but he seems perfectly comfortable just doing the same high static rasp over and over again. The vocal performance, fittingly, is as bland, emotionless and self absorbed as the lyrics that lie behind it. It's too bad they chose to include the lyrics, because you probably couldn't decipher what they are from the music and just not knowing the words to Sunbather would have made it much, much better. Adding nothing to the music but another layer of pretension, the uncomfortable whining turns what could have been an unexciting album with potential into a thoroughly irritating piece of shit. This is an attempt at creating something profound out of apathetic infatuation, but if I really wanted to feel this mix of uncomfortable and embarrassed about something attempting to be heartfelt, I'd just read the poems I wrote to my crushes when I was 13. Man, if I was to ever have written that I \"cried against an ocean of light\" in one of those things, I would burn the page then track down and formally apologize to the girl I wrote it for.\n\nThis kind of whiny crap used to get crucified when it was big in metalcore outfits, but mask it with incoherent black metal vocals and jam in some self-indulgent post-rock interludes and some people will let it slide, apparently. Deafheaven needed to further develop their own personality after a decent debut, but in doing so, they picked all the worst ways to try and stand out. I don't know why they chose that band name of theirs; All I know is that when Sunbather is playing in my general vicinity, if only I was deaf, I'd be in heaven.\n",
        "\nI remember Hunter-Hunt Hendrix (of Liturgy infamy) once defending the new wave of ‘uplifting’ black metal as being in keeping with black metal’s doctrine of controversy and rebellion. Indeed, the pejoratively-titled scene of ‘hipster black metal’ has polarized audiences; some embrace the softer approach as a relatively fresh innovation, and others have lavished the ‘hipster’ bands with the greatest execration and disdain since Dimmu Borgir and Cradle of Filth. Love or hate them, bands like Liturgy and San Francisco’s Deafheaven are causing a stir, and it’s always interesting to see people taking such equally vehement stances for and against a band. While I’ve always been skeptical that a style so historically rooted in darkness could (or should) be translated into feelings of hope and optimism as Deafheaven strive for on Sunbather, I’ve kept myself open to the possibility. Unfortunately, while Deafheaven’s shoegaze-laden approach to black metal clearly intends to revive and invent the genre, I find it difficult to be particularly moved one way or the other by the most polarizing metal record of 2013. Sunbather is not an excellent album, nor is it the horrendous abomination genre-purists claim it to be. Rather, its predictable dynamics and washy atmosphere leave it somewhere in the neighborhood of ‘moderately enjoyable’. In short, Deafheaven’s second album is an only slightly above-average take on blackgaze that doesn’t warrant the extreme opinions from either side.\n\nIn addition to the counter-intuitive emotional spin Deafheaven have placed on black metal in Sunbather, the album’s cheerfully minimalistic cover makes it fairly obvious that they mean to rebel against the traditional order. Conceptualized as a reflection of the colours seen on the insides of one’s eyelids when basking in the sun, it’s an apt reflection of Deafheaven’s emotional appeal. Operating in terms of melancholy and hopeful optimism, Sunbather gives an impression closer to that of a post-rock record than any metal I’ve heard this year. The guitars are laden in reverb and distortion, but the songwriting never betrays a sense of malice or anger. Conventionally beautiful harmonies are used in abundance here; particularly on some of the clean sections offered, Deafheaven will overdub guitars to create a dense, yet accessible wall of sound. Although it often feels like Deafheaven choose the most obvious sequence of notes to resolve their motifs, the compositions demonstrate a talent with knowing when to change up the pace. “The Pecan Tree” really excels with its dynamic, switching between soft and heavy sections, each contributing towards a powerful emotional payoff.\n\nAlthough Sunbather feels rooted in a fairly narrow emotional context of longing and melancholy throughout, Deafheaven have a firm grasp of songwriting dynamic. In spite of that, Sunbather feels constructed out of a mere handful of tricks and ideas, to the point where the formula begins to feel predictable long before the album is over. Deafheaven are remarkably consistent throughout the album, but the everpresent euphony filtered over blastbeats and vocal shrieks feels too narrow a range to stay engaging through the album’s hour length. Especially considering the roots of the genre the band is apparently trying to reinvent, Sunbather offers a nicely blended production, with textural detail aplenty to keep the atmosphere afloat. While the instrumentation is dynamic and powerful (with special merits going to Daniel Tracy for an excellent drum performance!) the vocals are painfully underwhelming. George Clarke’s harsh screams are high pitched and raspy (in keeping with frostbitten traditions) but they’re undermixed, lack resonance and fail to add a relevant emotional dimension to the music. Screams in ‘blackgaze’ music can be used plenty effectively, but Deafheaven’s failure to properly integrate the vocals into their atmosphere is a sullen reminder that the effort to reinvent black metal as an ‘uplifting’ sound feels ultimately contrived and needlessly contrarian. \n\nMost of all, Sunbather is a case where the hype (both good and bad) has left me disappointed. There are moments here where I come close to feeling the awe and admiration others have clearly felt, but the feelings are fleeting at best. I’m pleased that a fairly young band like Deafheaven is getting such an enthusiastic reception, but I’m simply not feeling it at much. Its uplifting, graceful beauty comes at the cost of emotional tension or challenge. The blackgaze style has potential aplenty for an emotionally evocative experience- Alcest’s excellent Écailles de Lune and Lantlos’ .neon come first to mind- but in the case of Sunbather, I wish I could be feeling more from it.\n",
        "\nWhen I first heard about Deafheaven’s Sunbather I was awfully excited. It seemed to be gathering near universal praise from critics as well as substantial support from fans. There were a few detractors, but they were often dismissed for being “close minded” or that they just didn’t get the musical genius contained within the album. I rarely find myself disagreeing with the community at large; if something is generally well thought of, I can usually enjoy it. Even better, I’d heard them compared to Alcest, which I adore (well, Écailles de lune anyways). So it’s with no small amount of disappoint I find myself after listening to Sunbather. If Deafheaven is like Alcest, they are only related in that they are somewhat similar in terms of musical style, yet leagues apart in terms of musicianship and overall quality. Just like Wonder Bread is similar to a fresh croissant, or Kraft singles are like Roquefort, or how Franzia is like champagne, or… Well, you get the picture. \n\nI suppose the best place to begin when describing this disappointment is the music, though they get bonus points for having one of the shittiest album arts of the year. Deafheaven plays a mixture of black metal and post rock, and throws some shoegaze into the mixture. It has plenty of blast beats and tremolo but this is most certainly not black metal. Not good black metal anyways. Imagine yourself as a newcomer to black metal and have just heard In the Nightside Eclipse. Now, assuming you aren’t suffering from a debilitating brain injury you’ll only naturally go seek out more. But then imagine that instead of checking out Immortal, Mayhem, or Darkthrone, you somehow find yourself listening to Zarach Baal Tharagh or newer Dimmu Borgir. Since we’ve already assumed you aren’t suffering from a brain tumor that ruins your ability to reason, naturally you’ll dislike this, and it might even put you off from listening to anything else. That’s kind of the experience that I’ve had after listening to Sunbather. I’m certainly no purist or kvlt master, but this album has certainly soured my views on post-rock/black metal/shoegaze combinations. “If something like this gets rave reviews, then what’s the worst of the genre like?” I find myself wondering. Indeed, if this is one of the better of the genre’s offerings I’ll likely stay away from it in the future. \n\nAnd back to the music now; like I said, this album has a large amount of black metal influence and contains a fair amount of tremolo and blast beats, but it’s just incredibly boring. The riffs are stale, shallow, repetitive, boring, etc. etc. It’s not actively terrible in the way that pop or country are, but it’s just completely pathetic, weak shit. There’s no real variation in the songs, and there are two different styles; loud black metal inspired parts, and quiet, acoustic or finger picked guitar sections. That’s it. That’s the extent of these Californians’ creativity and songwriting ability. Hard to see why they’re being praised for such an unexciting effort. On my fourth or fifth listen, I suddenly realized that I remembered exactly zero riffs or anything. The entire album is just a forgettable, misshapen, poorly-cobbled-together mishmash of genres that fails at every level. On top of the mediocre guitars and songs, the vocals are just abysmal. Sure, George Clark screams his little heart out, but it’s just poor. The vague, distant shrieks are neither wrenching or stirring, and at most conjure up mild annoyance. And to cap all of that, the lyrics are a joke, and have more in common with teenage angst ridden metalcore lyrics than actual metal lyrics. To be fair, Alcest’s lyrics might be like this too, but since I can’t speak French (I have testosterone in my body) I can’t really complain about that. \n\nThe only thing about this album that saves it from being a complete loss is the drumming. Sure, it’s not outstanding or anything, and it certainly won’t make you forget about how terrible the rest of the album is, but it gets the job done. But that’s not something that can really get Deafheaven any praise because it was done by a session drummer. It’s most definitely not a good thing that the best performance on an album was done by a session member, especially when it’s not done by a well-known musician (i.e. Hellhammer, who will apparently do drums for a six pack of Heineken, so I don’t know why they didn’t hire him). The mix might be helping me view the drumming in a more positive light than it deserves though. Everything is thrown together and compressed to the same depth within the songs, and it all blends together. Perhaps Deafheaven realized how weak the guitars and vocals were so they simply make the decent drumming louder in an attempt to mask this.\n\nAs far as failures go, this is definitely not the worst they can get. Sunbather isn’t the worst album of the year or anything quite so drastic. It’s quite a disappointment to be sure, but to rank it as the worst album of 2013 would give it more attention than it deserves. Indeed, this is one of those releases that should be allowed to die a quiet death. It’s too forgettable and boring to do anything else. It’s not something that will make you rage at how terrible it is. No, it’s more like one of those releases you check out on YouTube, listen to for a minute or two, shake your head, and move on to something more enjoyable. \n\nOriginally written for vtmetalreviews.blogspot.com\n",
        "\nThe moment I heard 'Sunbather' by Deaf Heaven, I knew a lot of people were going to loathe it and a lot of people were going to love it to death. This is often the case when a modern band experiments using a black metal template, but what Deafheaven did with 'Sunbather' is a whole new level of BM genre mixing. \n\nWith blast beats, lots of tremolo picking and shrieking vocals, the musical delivery certainly resembles black metal. What does not resemble black metal is just about everything else on the album. Even when the drums are blasting away at ludicrous BPMs, the guitar riffs make this release more of a post-rock or even a 90's screamo album. I'd much sooner recommend 'Sunbather' to a fan of Godspeed You! Black Emperor than I would a fan of Wolves in the Throne Room. \n\nAnother aspect of this release that defies typical black metal standards is the very liberal use of major chords and scaled. The album opener, \"Dream House\" starts off with a typical wall of noise, tremolo riff that is far more upbeat and hopeful sounding than anything I've ever heard over a blast beat. The even numbered tracks on the album are instrumental interludes. These three tracks provide a nice break and compliment the flow of the album, but the last two suffer from annoying voice samples muddling the music. I understand that Deafheaven had philosophical reasons for including them, but they make what would otherwise be beautiful songs sound harsh and abrasive (not in a good way).\n\nThere isn't much to say about the vocals or the lyrics. The vocals are mediocre and typical. The lyrics are angst ridden and come off as pretentious. In a Deafheaven interview, it was said that the lyrics on 'Sunbather' were incredibly personal and not meant to be relatable in a literal sense.\n\nOverall, I find 'Sunbather' highly enjoyable. The drums do what they need to do and nothing more. They provide a washy backdrop for the rest of the band. What stands out for me on this record is the guitar work. I find myself liking the quiet passages reminiscent of Explosions in the Sky more so than the aggressive, biting sections. Deafheaven knows how to create a beautiful, euphoric atmosphere with the use of clean, delayed guitar and piano. 'Sunbather' is an okay black metal album, but it's a spectacular post rock release (if that's your thing).\n",
        "\nI wasn't going to write this review. The fact that I did means that I listened to Sunbather again, which means that said amount of times is an integer larger than zero - and that happening will forever weigh down on my conscience, keeping me awake at night in the sad and lonely nights of melancholy in which my aching heart returns to the dying dream of my memories of sunlit windows that... Oh my, I'm already starting to sound like Deafheaven too, it seems. \n\nTerrible, painful, worthless (did I mention bad?) lyrics (did I mention the lyrics are the worst thing ever?) aside, the core issue with this album is a bad case of The Borings. Now, Deafheaven are clearly a Midwestern US screamo band masquerading as a metal band, but that's not the real reason why Sunbather doesn't even have the punch to build itself up so it can fall apart on its own; this is an album in which nothing ever happens. The guitar riffs never shy away from tremolo-picked major scale runs (sometimes they use minor scales too! Sadness!), which at timed intervals stop to give way to post-rockish acoustic sections. \n\nThat's it. This whole album is composed of just two things: You have the \"loud\" sections, which are all walls of noise generated by guitars played with a spaced out reverb-heavy tone over some admittedly very good drumming. However, good drumming, like the act of simply holding hands with one's significant other, is only a tool to make an already pleasant entity even better, but it does nothing by itself, and it's downright saddening if paired with an entity that is actively unpleasant (like if the only reason she lets you hold her hand is because she's made it clear she will never sit on your face while wearing yoga pants. I weep at the possibility). In contrast to the loud parts, we have the \"soft\" sections, which are acoustic guitar arpeggios or chords which may or may not have drumming underneath. Neither of those two elements are pulled-off in an interesting fashion, and that's basically what the entirety of Sunbather is like; just those two things going back and forth and transitioning between each other for an hour, with the exact same style of screamo vocals with a tinge of black metal all the way through. Nothing else happens here, there's no real use for seven whole tracks with an average duration of eight and a half minutes each when you can take any of them at random and play it on a loop for the exact same effect. \n\nThere might be an element of mood and feeling at work here; some kind of lingering concept within that I'm missing. I could go on a long-winded essay about how sixteen year old girls on tumblr write better poems than \"Vertigo\" by cutting the words on the flesh of their thighs, but to achieve such transient level of understanding upon the aesthetic aesthetics behind the inner workings of Sunbather, I'd have to read all of its lyrics again. No thanks. On the other hand, nobody would want that friendly fellow with the half-shaved head, thick-rimmed glasses, skinny jeans and holding a can of Pabst at the front row of a Deafheaven concert to be distracted from his hypnotic, entrancing all-emphatic voyage through the beautiful atmosphere by way of anything even remotely resembling a change of pace out of octave-harmonized tremolo picked sections. That would be too rude.\n\nBut seriously, fuck these lyrics.\n",
        "\nDeafheaven’s have been turning heads towards their direction ever since their inception, and with their first full length, Roads to Judah it is easy to see why. Focusing on a much more post rock inspired wavelength than many other bands within the field, yet still keeping the metallic fury, Deafheaven have created a competent mixture of the more mellow varieties of post rock with blistering black metal and even the odd touches of screamo. What Roads to Judah is, is one of the purest examples of the post black metal sound I’ve come across, existing in perfect symbiosis with each individual sound.\n\nCompared to a band like Alcest, who more often than not entered in the realm of pure shoegaze, Deafheaven focus much more on the black aspect of the post black style. Yet even with the amount of black metal, Deafheaven manage to mix things up by injecting a hefty dose of post rock into their sound. Songs follow the post rock structure of the loud-quiet dynamics, crescendos are powerful and emotional and some of the leads wouldn’t be out of place on a Godspeed You! Black Emperor or Post Royal album. Deafheaven, along with Cold Body Radiation, are one of the best bands to perfectly blend black metal with post rock. Unlike a lot of bands within the style, Deafheaven flirt with both sides of their sound equally. \n\nDeafheaven are able to create long, emotional black metal songs that, with the exception of George Clarke’s anguished screaming, doesn’t have a drop of malice. The melodies are beautiful and highly melodic; with post rock leads constantly flowing within the black metal foundations. Songs feel fluid, constantly moving and flowing, never settling on an idea long enough for it to wear out its welcome. There’s nothing in the way of the standard verse-chorus format, instead focusing on monolithic compositions that are constantly shifting. The atmosphere on Roads to Judah is really quite excellent; it’s beautiful, yet also filled with a sense of subdued sadness. The vocals in particular are highly anguished and full of sorrow, giving the album an introspective and melancholic feel to it.\n\nOn the other hand, the mixing of the album is quite a problem with me. Drums are pushed way too forward into the mix, to the point that they almost obliterate everything underneath them. The bass is almost non existent; the guitars are low in the mix, constantly being buried by the vocals and the drums. This leaves the production of the music quite thin, and unfortunately makes it difficult to hear the melodies properly that are undoubtedly very good and well written. When a band plays music such as this, surely the production needs to work in favor of the music and not against it. A more well rounded production would have done wonders for Roads to Judah, allowing for the beautiful melodies to shine through much more. \n\nHowever, despite the productions flaws, the qualities of the music are good enough to allow me too look past that one, slight problem. The music, despite being quite intense at times, especially with the drum and vocal performance, is quite light and airy. As previously mentioned, there are hardly any drops of malice or hatred within Roads to Judah. Instead, the albums opts for a soothing, almost trance like atmosphere that is very easy for the listener to get sucked into. I’d certainly recommend Roads to Judah to anyone looking for emotive, forward thinking black metal. Roads to Judah shows a lot of promise for this young band, and you’ll see their talents blossom even further on their sophomore album; Sunbather.\n",
        "\nI'm gonna do something a little different here, an experiment if you will, so bear with me. Deafheaven is a band that's been generating a lot of fuzz. Neckbeards around the world have been ovulating with excitement over this new \"different black metal\" band since the hype of Liturgy and their unbearably inane frontman seem to have fallen by the wayside in recent months. Places like Pitchfork and probably Anthony Fantano (I haven't looked yet, but I can guarantee he's reviewed and loves this album) have just been drooljizzing all over the place since the release of Sunbather in the middle of June this year. Now, this will be an experimental review for me for a few reasons. 1) Hipstery post-black metal is entirely out of my element. I like post rock and I like black metal but I rarely seem to fall in love when the two are blended (notable exception for Altar of Plagues' first album), and 2) This is clearly the kind of album you need to sit down and lose yourself in. \"Experience\" more than \"listen to\", something with many layers that you can tune in and drop out to, ya know? Well I'm not doing that. Nope, I listened to this once about a half hour ago and now I'm reviewing it. Consider this different because it's a first impression from an outsider.\n\nAnd what do I think? Well... I like it. I like it a whole shitload, to be more precise.\n\nYou see, most reviewers I know and trust have been pretty lukewarm about this album, whereas others with taste I rarely mesh with and unknown noobs and noted hipsters and whatnot have just been showering this with praise. This usually indicates that the album's content and quality is probably more in line with the minority I trust, but here I actually think I'm gonna have to side with the jizzlobbers, though not nearly as fervently. I don't find Sunbather to be any sort of world changing effort, nor do I foresee this ranking on my year-end list, but I do find it highly enjoyable, and even when this experiment is done I can easily see myself spinning it more often.\n\nI'm not going to pretend that I'm entirely well versed in this style. I mean, I'd like to think that I'm pretty kvlt with my post rock tastes (Godspeed You! Black Emperor is good in theory and atmosphere but sloppy in execution, Gifts from Enola is sheer brilliance, God is an Astronaut are basically a pop band but I love them to death anyway, and then I can namedrop a bunch of horridly obscure bands that I adore like Yndi Halda, Foxhole, you.will.die.in.the.desert, Up+C Down+C Left+C Right+C ABC+Start (I swear to God they're way better than their name implies), The Samuel Jackson Five, Six Parts Seven, et cetera), but most of the bands Deafheaven are compared to are bands I have little to no experience with. I haven't heard a single note of Alcest's music, I know who Liturgy and Weakling are but I've never actually listened to their music, Wolves in the Throne Room are pretty rad I suppose, and Skagos is okay, but I haven't heard Fen or Lantlos or anything like that. Basically the entire atmospheric-post-black-shoegaze-cascadian-whateverthefuck scene is entirely foreign to me, and so I have no preconceived notions on Deafheaven or Sunbather, nor do I think they're diametrically opposed to black metal for simply trying to be pretty and not singing about Satan buttraping virgin ibex.\n\n\"But what do they sing about instead?\", you may find yourself asking. The answer is simple: mundaneness. Of course the band has some really esoteric sounding explanation but it really boils down to \"inane shit\". I suppose they're trying to be poetic or something but there are only so many ways you can screech about ogling topless women from afar before you're forced to throw up your hands and just admit that there's no higher art here and move on with your life. Luckily the lyrics are as inconsequential as they are stupid, because the music itself is very evocative and romantic, along with a sense of psyched out urgency, remorseful interludes, and frenzied blasting atop very soothing melodies. I feel like whatever the band was trying to achieve here, they nailed. I'm sure there are much better things hidden in the underground within the style based on how many casual fans are blown away by this record and how many well acquainted with the style are underwhelmed, but dammit I'd be lying if I said this wasn't a very strong, emotional sounding album that can't help but make one hell of a connection to the listener. Maybe it's because it's so accessible (who am I kidding? Of course that's why) that it's been so successful, but I have to hand it to the band, after merely one listen the entire experience stuck with me. I remembered the weird, hypnotic pulsing of \"Vertigo\" and the soothing melodies of \"The Pecan Tree\", I remembered the spoken word sermon in \"Windows\" and the major melodies permeating throughout \"Dream House\". I can't lie, the songs are all very well written, and the atmospheric black metal transitions to the post rock sections so smoothly that it never once comes off as clunky or forced. \n\nOf the seven tracks here, only four are really traditional \"songs\" like you'd expect, with each one being broken up by a shorter (semi)instrumental interlude. These interludes are actually very well done and flow remarkably with the mood and pace of the album. \"Irresistable\" in particular really stands out for me, being so damn calming and gorgeous, though \"Windows\" is also extremely captivating with the aforementioned spoken word samples. Of the more structured \"songs\" on the album, I feel like it's cliche to say but I really find \"Vertigo\" to be my favorite on this first listen. It's the longest one, but it never feels like it's being stretched out. It moves along at a deliberate pace and contains a lot of ideas, but it's all very well thought out and the complexities make themselves known without being obnoxious about it. What I mean is that throughout all the pretentiousness and cliches of post-black metal, this entire album is very well written and yet doesn't seem to feel the need to be all in-your-face and intellectual about it. It's content to tell you its story, relay to you its imagery, and just sit back and let you soak it all in. I like that about it, Sunbather is a very passive album. It's a pleasant listen, with many moods and relatively simple execution. It's basically a lot of ideas boiled down to a minimalistic approach to songwriting and it knocks it out of the park. It's not showy or irritating, it's just... good.\n\nIn the realm of pretty, atmospheric black metal, I may not be an expert but I suspect that Sunbather is far from one of the worst in the genre. The vocals are very distant and brash, the guitars are clear yet kinda dirty, it's basically everything you'd expect from a production standpoint, but therein lies what I like about the record. Nothing in particular strikes me as horribly new or innovative, but it's just a simple album with a simple goal and it's done very well. There's nothing worth hating (nor praising to high heaven for that matter), and overall I can't think of too many bad things to say about it. For a first impression, Sunbather left a hell of a mark. Again, I don't see this making my top 10/13/15/however many I decide to do this year, but if there's not much I would change about it and it keeps me engaged for a full hour despite stupid pretentious lyrics and waves of unnecessary hype, I'd have to say that Deafheaven hit a pretty strong ball. It's no 700ft over-the-bleachers moonshot, but it's a solid double in the perfect seam between two outfielders.\n\n\nOriginally written for Lair of the Bastard\n",
        "\nStarting off with what sounds like a pop-punk band covering a Catherine Wheel song while a spastic ADD drummer hits his kit randomly, it's safe to say the rest of this album is a pretend metal sham, and it is. This part then goes into a fast strummed indie chords part for a \"bittersweet\" effect. This is pretty much the extent of the emotional expression contained in this album, aside from some \"reflective\" clean guitar pieces that accomplish the same thing sans the pretending to be a metal band part of it. The worst thing is Deafheaven fail to even do that. This whole things feels like the byproduct of focus groups coming up with a way to repackage Orchid's Gatefold album in a way that would appeal to Slowdive and Emperor fans at the same time through the \"post-black\" gimmick.\n\nTo start off, the lyrics are inappropriate for metal. They read like some whiny hot topic kids egocentric musings about how life has wronged him because of heartbreak and other mundane \"high school\" topics. I suppose they felt metal topics can be cliche and felt the need to drum up their indie \"slam poets\" card to show people how deep they are, but the whole thing comes across as something AFI would do than any metal band. These lyrics are appropriate enough, however, for the \"emo\" that they bury under black metal aesthetics to fool morons into believing that they are buying the next new thing. Bittersweet, mundane topics for a hoaky, whiny album. You can tell these whiners have made a bad album just by looking at them (indie haircuts and Aeropostale shirts in \"black metal\"...how IRONIC...). The whole thing reads off like some self-pitying, Kurt Cobain styled bored youth vapidity. Just moping and whining about first world problems.\n\nThe hippies have won. Everything that's wrong with modern \"metal\" can be found on this album. For starters, it's not even a metal album, having more in line with the screamo with more minor chords and blastbeats variant that is referred to as \"emo-violence\", like their clone targets Massachusetts band Orchid. The only thing that makes this \"black metal\" is a couple rare moments where a \"blackened\" part akin to something maybe Strid would have done makes an appearance to break up some of the monotony (even then, it feels like a generic DSBM part that could have been borrowed from Shining or Xasthur). The rest sounds like Slowdive discovered trem picking and hired the wrong drummer, which is where people came up with the conclusion that they mix black metal with post-rock and shoegaze elements. The songs go nowhere, droning on incessantly in one fixed mood (bittersweet melancholy) underscoring \"emotional\" vocals that are more akin to what an \"extreme\" screamo vocalist (like the one in Orchid) would perform than any kind of black metal vocals. The end result is whine rock with nothing to offer, but since it's in a more \"extreme\" form, you can lie to people and tell them that this is a \"nu\" kind of black metal and they would buy it, even if it is cut from the same mold of things they supposedly hate. The fact that these guys have no problem riding the waves of this marketing gimmick for the sake of popularity reveals just how insincere their band is.\n\nThese guy don't understand metal and this album feels like it was written by a bunch of guys who should be known for playing LUSH covers to Starbucks aficionados than anything remotely related to metal. If you think ironically juxtaposing underground metal aesthetics (where only the fast drumming and fast chord strumming speed are utilized) with the music of a Sigur Ros LP is the next \"nu\" creative frontier, then do yourself a favor: stop listening to metal (or pretending to), and go search for early 90s 4AD records releases. At least that way you can listen to crap in it's original form instead of this insincere whine rock. Vapid.\n",
        "\nSurely you’ve been drawn in by the waves this album made in the metal world and of the trench war of its detractors and admirers. Deafheaven succeeded in making a statement within the metal world and essentially presenting their music as a glitch in the system, and you’d be surprised at how metalheads swarm to such anomalies in the genre, not to mention that it’s very fun to annoy the purists, but I digress. Music is the bottom line, and while Sunbather may in time become a mandatory listen for its innovation, the music isn’t quite as attractive as its vision.\n\nLet’s get straight to it. The music is a combination of the happy-go-lucky, major chord black metal of Liturgy, the more shoegaze-y end of Silversun Pickups and monolithic, quintessential post rock of Godspeed You! Black Emperor. The slight shoegaze leanings seem to be the binding element between the more distant black metal and post rock and also one of the greatest strengths of the album, the shoegaze grounds the songs and reins them in, so that there is always something tying these songs together. The largest selling point here is the “seamless merging of black metal and post rock” (not quoting anyone) which is only a half truth. Occasionally the songs transition effortlessly, gliding smoothly and without pressure. New elements are progressively added and the subsequent sections are inconspicuously hinted at, culminating in effective crescendos. And sometimes transitions carry the subtlety of waking up with a punch in the balls. More than once they will drop whatever they have going and go for its polar opposite and it is jarring, especially hearing how well they can mix the genres, when they plan it correctly. So no, the marriage of genres is not as flawless as it is often lauded to be.\n\nAnother glaring blemish in the album is that the individual genres that make the music here are simply not capably executed. The black metal parts, when taken separately from the rest of the music are quite simply not very good, same with the post rock parts. For example, the black metal feels not much different from the same, tired stuff any black metal fan has surely heard before, the only clear difference is that it is clearly played in major scales so it sounds very joyful, and that’s where the differentiation ends. The post rock falls flat, it fails to entrance and bewilder, like post rock is pretty much required to do. We do get these great genres within the same package here, but they are subpar on their own, and are far too often not allowed to work in conjunction either, because the transitions are regularly so poor. One of my greatest pet peeves in music is when a band has a song so good that it makes the rest of the album obsolete. Here we have the magnificent Dream House. Sadly, the album never meets the standard of the colossal opener, the rest of the songs lack the incredible energy that this song has almost a surplus of. \n\nThere is reason enough to keep your eye on Deafheaven, because this band seems to be setting the stage for something grand. It’s not Sunbather, though, which is invigorating, relaxing and generally pleasant. For about ten minutes. Then it is simply boring. Much like sunbathing, I guess.\n",
        "\nI was fairly confident of liking this album- the super cool album cover, reports from various people-whom-I-respect of the album's quality and what seemed like a general consensus as to how well it mixed post-rock with black metal. Numerous contexts and numerous plays later though and I'm still left feeling rather underwhelmed- bored is perhaps a better way to describe it. \n\nIt's hard to articulate why as Deafheaven certainly give a good fist of things; and the simplest answer is perhaps the worst. I don't like the riffs. I don't like the music. Songs are structured well enough, and when there are some good sections the crisp, powerful production and all that do make it pretty cool. But there's not many of 'em, and in between there's just these long stretches of boring, featureless, vaguely-aggressive haze that I forget as soon as the parts pass me by.\n\nThe opening track's a good enough example, although most of the songs do the same. Stuff bursts out of the gates- I really rather like the energetic drums throughout- but the riffs (chord progressions, not sure what you could really call them) are really boring. There's all these colour tones, heaps of minor 7ths and fourths floating around and there's nothing wrong with that, but shit man that's all these things are. Super boring chord progressions with a few krazy intervals and a tiny bit of dissonance thrown on top so that they sound interesting- and they fail at that, which is quite a big problem when you get down to it! It's like the band wrote all the drum parts, all the lyrics and then quickly shoehorned a bunch of guitars into it. To quickly digress to the subject of lyrics- I like the theme of them, but the vocalist is terrible! One of the most one dimensional you've ever heard, but also easily ignored... totally redundant to Deafheaven's sound.\n\nThere are some decent moments throughout- the title track rolls along like a particularly out of control freight train through some of the darker riffs of the album, and the awful clean break that bookends this section doesn't change the fact that it is a pretty cool few minutes. Likewise, the album closes on quite the bang- from what I can tell Pecan Tree is the oft-cited standout track of the album and I'd agree- quite a huge track, with a frantic opening that continues to pick up as the track goes on, all amidst a very tasty Mono v Explosions in The Sky clean break that quickly acquires a rather charming life of it's own. It's the track that suggests to you that perhaps, with a bit of practice, Deafheaven could finally be the band that manages to mix two disparate but super awesome genres together. \n\nBut they aren't the one to do it yet, basically. Playing jangly chords quickly with a lot of distortion does not equal a well executed (let alone interesting) black-post hybrid. Doing a \"First 50% of the song blasts, last 50% of the song does a half time feel\" (half time feel= double the feels, apparently) does not equal a well executed post-black hybrid.\n\nAll things considered, Deafheaven have a long way to go yet.\n",
        "\nDeafheaven turned a lot of heads with its 2011 debut Roads to Judah. In a year that was highlighted by a number of notable fusions of black metal with post-rock and/or shoegaze, Deafheaven gave one of the most stellar examples of how these genres can be unified. Deafheaven merged long, droning passages of black metal with climatic post-rock peaks and soothing chamber rock low points. The songs were well crafted, using the long drags of black metal to gradually lead the listener to the emotional post-rock crescendos.\n\nYet, for as impressive as Roads to Judah was, Deafheaven still showed plenty of room for growth. For one, the music was at times overly derivative: the black metal passages heavily referenced Weakling; the post rock passages, Explosions in the Sky. Those are certainly not bad sources of inspiration, but the transparency of the influences at times minimized the impact of the record. Also, while the post-rock passages were all top notch, some of the black metal passages were overextended.\n\nDeafheaven's sophomore release Sunbather sees major improvement in all areas. Sunbather offers a very original sound. The black metal and post-rock passages are not as isolated as they were on the debut, but rather are interfused, creating a multifaceted sound. This is evident right from the get-go. The first five minutes of the opener, \"Dream House,\" interweaves a variety of guitar styles: a bright major chord progression, rumbling black metal and droning shoegaze, all unified by a steady tempo and seamless transitions.\n\nThe quality of the arrangement is matched by that of the composition. The record contains four longer tracks (9-15 minutes), all in the same style, but each with its own wrinkles. Each track is a fantasia, traversing dramatic emotional spectrums while maintaining a unified vision. The musical unity is reflected in the lyrics, which paint disillusioned visions of modern life (especially suburban culture) from a first person perspective. The word choice is sparse and impressionistic, like a series of distinct sense-impressions within an otherwise blurry memory. \n\nWhile there are some shadowy moments, most of the record ranges from solemn and inspired to outright ecstatic. It's unusually uplifting for extreme metal, yet quite authentically so. The riffs are so fervent and heartfelt that it's hard to not be swept up into their pathos. Still, the constant presence of shrill, blackened howls serves as a counterpoint, an element of pain that accompanies even the albums most exquisite moments. It’s almost impossible to pick out highlights from a record this stellar, but the final five minutes of the record is absolutely staggering: a semi-tragic piano melody accompanied by crying guitar and anxious drumbeats builds to a breathtaking apex of screams and burning, romantic post-metal riffs.\n\nThe four longer tracks are split up by three shorter tracks. \"Irresistible\"—a beautiful piece for piano, bass and two guitars— is essentially a coda to \"Dream House.\" \"Please Remember\" begins with whirling ambient noises and samples of a French guy speaking in monotone and then shifts into a dreamy, twangy post rock ditty. \"Windows\" is the albums only weak moment. It consists of audio samples of a crazy preacher and a guy buying drugs on the street embedded beneath ambient noises. While this does fit into the record’s “suburban nightmare” theme, the whole rambling, crazy preacher trope—fittingly enough—is really overplayed in both post-rock and black metal.\n\nSetting that small blip aside, Sunbather is an excellent album. While many bands have played black metal and post-rock off each other (and to be fair, some quite successfully), nobody has interfused the two styles as elegantly as Deafheaven. Add to that the quality of the musicianship and songwriting and you have one of the best albums of 2013.\n\nOriginally written for Deafsparrow.com\n",
        "\nThis is not black metal.\n\nI hate to break the news to deafheaven's supporters, or vindicate their detractors for that matter, but in my time with Roads to Judah one of my dominating thoughts was simply: \"This is not black metal.\" Nothing about Roads to Judah fits the genre for which it is most commonly associated with, no matter how much justification their fans may try to provide. This is not about the bands appearance, their ideology or their \"kvltness\": from a purely musical standpoint, any black metal that might be found here is negligible at best. The bands over-arching sounds hems much closer to the progressive sludge of Neurosis and the melodic intensity of Defeater(not to mention the shoegaze-y elements of bands like My Bloody Valentine) than anything black metal.\n\nWhich is not a bad thing: while not black metal, Roads to Judah is still a fantastic record. Haunting, technical and at times very beautiful, Roads to Judah is as fine a progressive Metal album as to be released this year. At times, like the absolutely gorgeous intro of \"Violet,\" Roads to Judah is an emotional experience, one that does not evoke feelings of cold grimmness, but almost a hopeful tone. This in an of itself might be enough to disqualify deafheaven as a black metal band, but more likely it is the moments of obvious melodic hardcore influence, like on \"Language Games,\" when the band enter a low-key section, complete with clean guitars and a drumroll that would do Defeater proud. The vocal attack is the closest thing to black metal here, and I actually find it a bit disappointing, considering how amazing Kerry MecCoy and George Clark were at them with Rise of Caligula, a fantastic technical deathgrind band you should check out post haste.\n\nThere is something about this shoegaze-ified, people-call-it-black-metal-for-some-reason Progressive Metal that keeps me from completely getting in to it: at times, riffs and sections run together, and I lose entire sections of songs, committing them to the Recycle Bin of my memory as soon as they enter my brain. Roads to Judah does not evoke that same feeling in me anywhere near as often as many of these other bands, which makes it such a joy to listen to. It still happens: about a 3rd of the way into \"Violet\" I had completely tuned the song out on pure instinct, only to be drawn back in later, but compared to say Litugry(a review is... forthcoming), deafheaven maintain a level of interest that few acts within this sub-genre can match. I should not be surprised, considering the connection to Rise of Caligula, but after reading much of the haters perspective on deafheaven, and similar bands, my expectations have been consistently skewed to the negative.\n\nI can't really explain where the band picked up the black metal label: maybe it is self produced(in which case, I would recommend the band change their perspective), maybe others are forcing it on them. What I can say is this: Roads to Judah is a damn fine record. For what it is, this album is an emotional, musically complex and consistently interesting. For those looking for some progessive, thought provoking metal, I would recommend Roads to Judah in a flash.\n\nRating: 8.5/10\n\noriginally posted at: http://curseofthegreatwhiteelephant.blogspot.com/\n",
        "\nYou know this whole shoegazing, post-rock US indie black metal scene has gone supernova when a respected hardcore or metalcore label like Deathwish Inc. opts into its spacious arches of angst. Ladies and gentlemen, you are presented with Deafheaven, the latest of bands to fuse the aesthetics of the cultural rage against a subtext of black rasping and occasional spurts of accelerated tremolo picking. These Californians certainly have that 'wall of sound' effect you hear from both the Cascadian core and the overrated New York revolutionaries (Krallice, Liturgy, etc), but sadly they seem less interesting than the former camp, if simultaneously less irritating than the latter. Yeah, Deafheaven are probably going to be lumped into that whole 'hipster' category, but who gives a shit. How is the music?\n\nUnfortunately, there seem a number of burdens holding it back from the blissful wedding of sounds it strives towards. For one, the vocals are flat-out aggravating. If you threw them over a random deathcore or perhaps a more dour screamo act, they might fit the bill better. But here, they seem like the same, vacuous emotional pedagogues you'll hear in all the 'warmer' toned bands of this niche. In attempting to convey real pain and depth, they cough out only droning sequences which seem to have no concept for syllabic punctuation and variety. They also seem to arrive almost exclusively over the 'black metal' components, and it might have been nice to hear something more eloquent and fragile during the prettier melodic chunks, of which there are no shortages. Another downside is that, while competent and constant in their scriptures of sad, streaming chords, with an occasional texture that lights the imagination, the overwhelming majority of riffs are terribly dull and unmemorable.\n\nNot to mention, like so many pretentious young acts, they inflate a number of their tracks to oblivion, with no hopes or aims to actually fill the watershed with sufficient sustenance. So you end up with \"Violet\", 12 minutes of emptiness that opens like a Sonic Youth hangover without the fine taste in tones and notation, proceeds into a faster paced, noisier alternative to Dredg's mid-career feedback fare, and then surges into the black territory. But along the way, I don't hear a single riff worth revisiting. The subtlety is expressed only through the density of the chords themselves, which is to say, not much, and all the emotional buildup that might have exploded in the song's depths is inflated once the monotonous vocals erupt. Granted, this is the worst song: \"Language Games\" and \"Unrequited\" are mildly catchier, if barking up the same tree. The closer \"Tunnel of Trees\", while dull during its initial onslaught, at least fades back out into the clean-space, before twisting into the most single annoying, screaming dissonant melodies anwyhere on the album.\n\nThen what exactly is there to like here? For one, I though the drums were fulfilling enough, even if the blasted bits were less interesting. The guitarists clearly have an encyclopedic handle on the post-hardcore chords made prominent through the 80s and 90s, and they're not bad at placing them in sequence, even if there are just not enough shifts and strides. The lyrics should appeal to fans of underground emo, post-punk and indie rock bands, or the artsier metalcore or grind outfits like Converge, Trap Them, etc. They're also not nearly so arbitrary, spastic and taste chafing as those NY contemporaries I listed above. But ultimately, Road to Judas is a road to ennui, another of these incredibly hyped up records that is almost wholly tired and uninspiring. \n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nBlack metal is not the first style of music that one associates with “The San Francisco Sound”. Nonetheless a number of significant black metal acts hail from Fog City. While it’s no Oslo, San Francisco has produced a number of influential acts, ranging from the epic Weakling to the deviant Leviathan. Post black metal act Deafheaven continues this San Franciscan tradition with their impressive full length debut Roads to Judah.\n\nDeafheaven’s sound centers on melodic riffs that simultaneously possess the moodiness of post rock and the atmosphere of black metal. Echoic production allows the riffs to resonate, creating a vast, heavenly sound. The riffs are backed by sweeping guitar leads, a wide array of percussion and raspy growls. The compositions are nonlinear, containing little in the way of a verse or chorus. However, the music develops slowly, allowing each passage to come to full fruition. For the most part the transitions occur with ease, like subtle shifts within a train of thought. However, on a few occasions the transition from purely post rock passages to post black metal passages feels forced.\n\nWhile all the musicianship is stellar, Trevor Deschryver’s drumming deserves special praise. From Hellhammer style blast beats to looping tribal patterns, new sounds are constantly being brought to the table. Deschryver’s playing is crisp, precise and spirited. It stands as a lively counterpoint to the slow, contemplative guitar progressions.\n\nThe highlight of the album is the closing track, “Tunnel of Trees”. The song begins with large, watery black metal riffs that swirl around, a la Weakling’s “Dead as Dreams,” before transitioning into a stunning passage of mellow, twangy, Southern guitar with a hymnal spirit. Suddenly, the melodies burst forth into a series of effusing guitar and piano solos that burn relentlessly until all emotional resources are exhausted.\n\nWith Roads to Judah, Deafheaven has placed itself on the post-black metal map. In spite of some derivative passages (particularly the post rock passages, which can draw too directly from Godspeed You! Black Emperor and Explosions in the Sky) the album displays creative songwriting and impassioned riffs. From start to finish, “Roads to Judah” is an album that summons intense and wide-ranging emotions. Chalk it up as another win for the city by the bay.\n\n(Originally written for www.deafsparrow.com)\n",
        "\nDeafheaven is a post-black metal band that is fairly recent on the wider scene, releasing this- their first official release- and a full-length debut just earlier this year. 'Libertine Dissolves' introduces Deafheaven as a band that should not meet unwelcome ears among fans of such other post-black metal acts as Fen, Agalloch, Wolves In The Throne Room, and a score of other bands that fuse the harshness of black metal with lighter atmosphere and even beauty in the more conventional sense. This two song EP shows Deafheaven delivering on both the abrasive, and lighter atmospheric fronts, and doing each quite well. Although the debut 'Roads To Judas' is a much more fulfilling experience, this short release is a fairly strong sampler for anyone looking to check out the band.\n\nThe music on 'Libertine Dissolves' begins as you may expect something in the black metal style to erupt; complete with black metal rasps, fast-picked guitar riffs and a grand sense of melancholy. This is woven in quite well with the lighter moments, which are fairly predictable by post-rock standards, but very pleasant to the ear. Deafheaven's greatest strength -as far as 'Libertine Dissolves' goes- is their innate ability to fuse the heavy and lighter moments together into cohesive compositions, which is sadly something that many bands who attempt it seem to overlook. The second track 'Daedalus' gets even better than the title track, with a nearly danceable rhythm and sense of optimism that screams shoegaze, or even post-punk to me. Powerful stuff.\n\nWhile much black metal does tend to suffer (or benefit, depending on who you ask) from low fidelity production, Deafheaven's music hit me with a very gritty feel that took a second listen through to warm up on me. While it works very well with the more melodic moments of the music, the heavy sections here came through as more of an abrasive rumble than I may have cared for, but it is something that can be overlooked after the first listen.\n\nDeafheaven is another band I can be excited about, and while 'Libertine Dissolves' is fairly rough around its corners, this and the debut have set a very steady foundation for the band to do great things with their music in the future.\n",
        "\nWhen I was a child, my mother always taught me to never judge anyone by the way they look or present themselves because I have no idea who that person may be until I have a conversation with him or her. As most children did, I ignored my mothers advice and have been casting judgment upon souls for the last decade or so. Now being in my mid-twenties, times have changed and I've learned those lessons that my graceful mother tried to teach me in the past. Learning the hard way of never judging is over for me, hopefully, but some bands still trick me into their little traps of confusion with presenting themselves in a way that you would never think they play more extreme music. deafheaven, yes it's spelled with a lowercase “d”, fooled me into thinking they were some indie rock project from some unknown city in some state that nobody cares about but I was wrong on all levels. deafheaven is exactly what nobody would guess, an atmospheric black metal/post-rock outfit out of San Fransisco, California that might just change the way us black metal lovers look at “outsiders”.\n\n“Roads To Judah” can be described in only a couple words but I'll go more in-depth than that. The first word, apocalypse – as hell begins to freeze over and the dead start to walk the earth, “Roads To Judah” is what might help me survive the end of days. Letting this record blast from my iPod as I do somersaults over the walking dead, decapitating each one that thinks it can mess with me. The sounds of screeching guitar riffs slamming my brain against my skull is only motivation to reach the next spot where I can plan out my next move. The next word, undeniable – even though deafheaven was only created last year, they can't be denied access to anyones collection. “Language Games”, the second track on the record, destroys all of my negative thinking about normal, average, everyday dudes making some black metal, very well and creepy black metal at that. The last word, freedom – finally I can stop worrying about the American black metal scene. I understand that certain bands like Absu, Black Witchery & Wolves In A Throne Room pretty much have it down for us but we don't have it down to the point where other countries respect us for it, at least in my opinion. “Roads To Judah” is sort of like the air conditioning inside your house after you've been out in a hundred degree heat for half the day. It's refreshing and very welcoming, just like the cold side of the pillow when you flip it over.\n\nSo, in a world were we judge people because what they wear, how they walk, how they talk, the clothes they wear or the music they listen to, we never care to understand and get to know the person behind it all. deafheaven and “Roads To Judah” has taught me that no matter what you support, love, hate or agree with, black metal comes in many forms and you don't have to “look the part” to create hypnotizing yet chaotic and obscene music to bless your ears with. I know that some have been bashing black metal for year because of certain acts in the genre and you all know who you are. If any of you are reading this, check out deafheaven and give this record a chance because unlike Liturgy, these Americans give you raw black metal with no hope of ever coming back from the lake of Hell.\n\nOriginally written for: http://bloodorlove.domesticgenocide.com\n",
        "\nLet me mention some black metal bands from different countries before I start my review. Just to name some of them, we have Gorgoroth, Mayhem, Beherit, Marduk and Watain. See what they have in common? Besides playing black metal, that is.\n\nCorpsepaint? Check.\nSpikes? Check again.\nSuper black clothing? Another check.\nStage names? Yet another check, even though it’s not really a necessity nowadays.\n\nNow look at this band from America, deafheaven (yep, that’s spelled with a small “d” as far as I know), and tell me what kind of a band they are.\n\nI remembered asking my friend about this, and judging their looks, they seem to play something close to classical or alternative rock, or maybe even punk rock. As for me, they seem to play pop punk music a la Boys Like Girls. Geez, and Metal Archives even said that they play black metal. Is this what a black metal musician supposed to look like!? Just look at them, they look no more than hipsters jumping their brains out!\n\n“Can’t you just get to the point, La:mort!? You keep on bashing them solely based on their looks and do nothing else!” Sheesh, such impatience I smell! I know what I’m supposed to do since I’ve done this way before!\n\nNow to the review, then. The music, as expected, isn’t anything new. Although they play something closer to post-black metal than traditional black metal, typical black metal elements are still here.\n\nRaspy screams? Check.\nBlast beats and tremolo picking? Check.\nMinimalist music? Check again.\nUnclean production? Check yet again.\n\nOh, did I say “unclean production”?! Oh, yes I did, though not in a ”kvlt” sense. What do you think the production is, as crisp as a bag of Lays!? No, this is black metal, baby, BLACK METAL. With that said, you are supposed to expect a drum-centric production, and hear blast beats. Unfortunately, after putting high-priority on the drums while on the mix, the bass became invisible, and the guitars buried with the vocals… and this became the sound of the overall music: VERY THIN.\n\nTo make up for that, the music is simply wonderful, making you feel light, like having an out-of-body experience. It isn’t like you’re usual black metal that sounds ghastly and just plain evil, it’s something that makes you feel that you’ve transcended, even though you’re just no more than a sneaky little devil. With that wonderful description said, I don’t know, really, what is the first four minutes of the album for (the ones you hear on “Violet”). It sounds nothing more than a jamming session, but at least it got the atmosphere right for the listener.\n\nAt least I’ve seen in this album that hipsters can play decent black metal. Yeah, don’t judge these guys simply because they wear V-neck shirts and all. Though not excellent to the core, this is one heck of a start for them. It’s something more than music; it’s more like a journey itself.\n\nWritten for my blog, lamortisdeath.blogspot.com\n",
        "\nDeafheaven are a difficult band to pin down. Visually, they look like they should be playing Joy Division or Smiths covers. Sonically, they combine lacerating black metal with swaths of lilting, shoegaze-esque guitar work. They’re signed to Deathwish Inc, a label that’s known almost exclusively for putting out hardcore records. Sound confusing? Don’t worry, the sounds are what’s important here, and once you push past all the contradictions, you’ll find that Deafheaven is creating some seriously compelling (albeit tough to categorize) aggressive music with their debut album, Roads to Judah.\n\nScratching the surface, you can trace Deafheaven’s lineage back to the aforementioned Weakling, just as you can with several other upstart US quasi-black metal acts, namely Krallice, and unfortunately, Liturgy. But as far as I can tell, this is the only parallel you’ll find between Deafheaven and the NYC black metal practitioners. You see, unlike Krallice or Liturgy, Deafheaven write songs that actively engage the listener and draw you into their sonic realm. The songs on Roads to Judah are not pretentious museum pieces or college theses masquerading as black metal, no, this is genuinely emotional music that commands your attention. It’s dynamic, painstakingly crafted music, and black metal is just the jumping-off point; even the most violent portions of Roads to Judah possess an ethereal, shimmering quality that’s about a million miles away from the unrelenting grimness of traditional BM. There are just as many passages on this album that sound like they could’ve been lifted directly from Loveless as there are moments that invoke Dead as Dreams. I realize that I’ve been highly critical of bands combining black metal and shoegaze in the past, but this is because so few bands have been able to do so in a way that I find compelling. Deafheaven is one of those few.\n\nBut why Deafheaven? The answer is simple. Good ideas. Deafheaven has lots of them, enough to justify stretching songs out past the nine minute mark without ever getting tedious. They do this by letting up on the gas and allowing the corrosive black metal elements to recede so that the aforementioned shoegaze and even some rock and post hardcore influences can take the driver’s seat. The transitions are fluid and a spacious production scheme allows the songs to open up and breathe. I’ve also heard the term “screamo” being thrown around in discussions of this band, but since I don’t know what the hell screamo is, I’m completely unqualified to comment. Whatever exotic ingredients Deafheaven are bringing to the table and throwing into the stew-pot along with black metal, they’re doing it right, and doing it better than just about any other band they’re currently being mentioned in the same breath as.\n\nIs it “true” black metal? Does it matter? When the music is this absorbing, things like genres and labels are secondary, an attempt to put things in neat, clean little boxes that results in utter frustration every time a band as confounding as Deafheaven comes down the pipeline. As I noted at the beginning of this review, the music found on Roads to Judah is difficult to categorize, and I have a feeling the members of Deafheaven wouldn’t have it any other way. It’s an exhilarating and adventurous listen, but it’s also soothing and caustic and beautiful and fucking ugly. You simply cannot ask for much more than that from a band’s debut.\n\nOriginally written for http://thatshowkidsdie.com\n",
        "\nHipsters have really been getting into black metal these days. I'm not quite sure what the draw is for them, but whatever it may be, they're finding their way into the more forward-thinking side of the genre, bringing far more major chords than we're used to with them.\n\nWhen you see Deafheaven's band photo on Metal Archives, with the regular-looking guys in V-necks and button-up shirts with skateboards and a Che Guevara poster in the background, your hipster alarm should go off immediately. The cover art to their first full-length, Roads to Judah, isn't helping much either, resembling as it does the art accompanying Final Fantasy VI (formerly III in the US). Nor is the last review of it I read, which called it \"extremely hip\". I dared it anyway, despite my past bad experiences with post-metal, because what I heard intrigued me.\n\nThe first four minutes of the album did not bode well. Gentle drumming and pretty, shimmering guitar chords. It sounds like that crap album Anathema released last year. But afterwards, things definitely start to get better. They speed up into a full-on tremolo picking assault, with extremely aggressive drumming. The vocals are entirely in a generic (but good) black metal rasp--no clean singing here. All four songs are well-composed, with the gradual evolution, subtlety, and balance appropriate to post-metal. It's aggressive as hell, 90% of the time, but it still manages to sound pretty, like some kind of delicate flower filled with deadly poison. It gives the music a morose but still angry emotional texture. The drumming is far more engaging than most post-black metal tends to be. It's aggressive even more often than the guitar, with plenty of fills and a wide variety of blasts.\n\nThere are some downsides of course. Honestly you won't notice the bass most of the time, and since the guitars stay in the higher range there's very little heaviness to be found. The middle two songs are excellent, but the beginning of the opener and most of the closer sound like hipster bullshit, right up through the piano outro.\n\nPeople you don't normally think of as metalheads can bring new blood to the genre. If a hipster is anything like the guys in Deafheaven--regular guys who want to try out some forward-thinking black metal--I'll welcome them to the fold.\n\nadapted from an article comparing and contrasting the album to Liturgy's Aesthetica (you can read the full post at http://fullmetalattorney.blogspot.com/2011/05/roads-to-judah-v-aesthetica.html\n",
        "\nOne of the biggest surprises of 2010 for me was definitely the first Deafheaven demo. Even 'though they really aren't the first to play this style of modern Black Metal, in my humble opinion they are the first to do it in the right manner. Of course I enjoyed Two Hunters and Black Cascade by Wolves in the Throne Room, but those were still a kind of regular Black Metal albums, just with a little atmospheric touch and some clean passages. Roads to Judah seems to bring this whole genre to a whole new level, obviously more inspired by non-Black Metal related genres like screamo and post-rock, this records basically blows a whole lot of the Black Metal releases put out nowadays to tiny little pieces.\n\nCompared to the demo, which was released less than a year before their debut album, very few things changed. The overall production improved a little bit, which actually wasn't a necessary thing to do, because the production of the demo was already perfect for this kind of music. It's still not overproduced 'though, which is something I was afraid of when this album was announced and especially when I read it would be released by Deathwish Records, a label normally releasing only screamo, metalcore and hardcore bands.\n\nThere is one change in sound I, as a post-rock devotee, really adore, this is the introduction of more clean guitars and more complex drum patterns. On the demo these clean parts were recorded using an acoustic guitar, I have absolutely nothing against acoustic guitars (oh, how I love all those folk albums coming out these years), but acoustic guitars and metal are still a somewhat doubtful marriage, even when you're playing music like Deafheaven does. But, good for me, they seem to have dumped those acoustic guitars in a nearby trashbin, set them on fire, or threw overboard in the Atlantic (yai, subtle Black Lips hint), and continued with the in metal naturalised electric instruments. \n\nThis is not only music for the extremely hip, this is just a fantastic metal record, mainly focussing on the atmosphere most of the Black Metal records are missing nowadays. There is just one little minus, the demo was good, the album great, but after another album or two this just might get a little boring. I just hope they will keep improving their sound, and especially keep experimenting with more influences, instruments, sounds and structures. \n\nOriginally posted at: http://amplifiedstrawberry.blogspot.com/\n"
    ]
}