{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Santa Barbara, California",
        "Status:": "Active",
        "Formed in:": "2003",
        "Genre:": "Nu-Metal (early); Groove/Melodic Death Metal (later)",
        "Lyrical themes:": "Hate, Chaos, Revenge",
        "Current label:": "Napalm Records",
        "Years active:": "\n\n2002-2003 (as Deathride),\n2003-present ",
        "Number of Reviews": 55
    },
    "Band Reviews": [
        "\nDevilDriver’s definitely one of the more interesting mainstream metal bands from the mid-2000s, at least as far as the earlier albums are concerned. The self-titled debut had some carryover from Dez Fafara’s failed nu metal act Coal Chamber, but it’s The Fury of Our Maker’s Hand that has DevilDriver double down on the heavy fucking metal. There’s that Lamb of God-style groove metal alongside those At the Gates/In Flames-style melodeathisms that a lot of US metalcore bands were utilizing at the time. Like Lamb of God, they’re definitely the most extreme-like metal band out of the New Wave of American Heavy Metal scene. Going from All That Remains and Killswitch Engage to this was quite a shock back in the day, let me tell you.\n\nBut if I’m being real, where the likes of Lamb of God and Trivium can still hold up, DevilDriver… don’t. Not from a lack of trying – Dez Fafara’s vocals are genuinely vicious (which was way too much for a dull nu metal joint like Coal Chamber, and the sorta groove kinda nu metal joint the DevilDriver debut album was), and John Boecklin’s kinetic percussion positively radiates the songs with a ton of energy. Honestly, this was a scene that bred some top-tier drummers. Alongside Boecklin are the likes of Chris Adler and Travis Smith, who – alongside Joey Jordison and Scott Travis – elevated heavy metal drumming sensibilities by intensifying the drumming while providing ample backup to the songs. But Fafara and Boecklin are stacked against third-rate Lamb of God/Pantera riffs and blasé melodeath harmonics. Compositions that can make for some killer background music while you’re benching 100kgs; compositions that get the pit fucking rolling; and sadly, compositions that do not do a whole lot else.\n\nOkay, being nice, there are some legitimately good parts. “Hold Back the Day” has a fucking sick tremolo riff throughout much of its duration, which is excellently emphasized by the percussion. This song is a fucking treat – both if you are new to heavy metal, and if you’ve been a big fan for more than like half your life. There’s some real razor-steel riffage between that and the more semi-mid paced verse riffing, although much of it is boosted by the drumming and vocals. Regardless, this shit is quite infectious! I’d make this weird exception also for “Driving Down the Darkness” thanks to some competent nu metal swagger, coupled by a genuinely catchy rhythm. Sadly, this does not carry onto “Grinfucked”, which lacks that sharp hook “Driving Down the Darkness” has. Anyway, other than that? Umm, “Just Run” has a decent lead through its intro and chorus, and “End of the Line” at least hits the hardest out of its groovy riffing… which I suspect much of the album is derived from.\n\nThat’s really where a lot of the problem lies. In a vacuum, these guys can pull off some tunes – there’s enough groove and enough fast-paced riffs to get things going. But a lot of the songs just go off the “End of the Line”/“Hold Back the Day” formula, only weaker and without any particularly memorable bits or hooks to really draw you in. They end up rather forgettable. It just has this unfortunate habit of going in one ear and out the other. It’s a similar issue to what Shadows Fall had back in the day, except their singles are generally stronger and more memorable than what DevilDriver had to offer here.\n\nA more melodic direction does result in some smoother tracks, with a decent enough groove and some sharp riffs to try and get your attention. But above all else, they’re busy enough to get you going during a workout and they get the moshpit going. If that’s all you’re looking for, this is worth looking into – but not before going through Lamb of God’s earlier stuff first.\n",
        "\nFor those who remember the rise of nu-metal in the late 90s and its ascendant status shortly after, the name DevilDriver often dredges up memories of the campy 2003 Freddy Vs. Jason horror flick and their groove-infused, Pantera-inspired addition to its soundtrack “Swinging The Dead”. The eventual eponymous debut LP that followed was notable for its aggressive, groove thrashing character, as well as its tardiness, as the previously mentioned American metal movement was fast becoming a four-letter word even among the most prominent bands that were initially associated with it. A change in musical direction was naturally in the cards, and given the band’s already more metallic character when compared to the likes of Korn and Slipknot, the eventual pivot to a grooving, quasi-Gothenburg inspired sound similar to the one that put Lamb Of God on the map was not only a logical one, but practically inevitable.\n\nIn the years since this California-based outfit has seen all of their original lineup save their founder and lead vocalist Dez Fafara and longtime guitarist Mike Spreitzer change up several times, yet the output since 2005’s The Fury Of Our Maker’s Hand has been defined more by consistency than anything else. The focal point of the band’s stylistic evolution, however, has been the lyrical content provided by Fafara himself, which has always been of a confessional character comparable to a number of prominent metalcore outfits, yet has become more methodical and focused with each new effort. Recently the album structure has also taken on a more programmatic and serial nature, with the previous studio excursion Outlaws Till The End, Vol. 1 marking their first series in album form. 2020’s Dealing With Demons, Volume 1 continues this same trend, albeit by kicking off a new series prior to the previous one’s completion.\n\nThe musical tapestry that is painted here is one that shifts between somber and reserved atmospheric moments and high-impact fits of anger in a generally jarring fashion. Opener and expositional anthem “Keep Away From Me” presents a visual of extreme social alienation, beginning with a dreary, doom-like dirge with a droning clean guitar line and exploding into a storm of rage that vacillates between a blurring set of tremolo riffs and a pummeling set of groovy stomps with the introductory theme recurring to mark the refrain. Similarly structured mixtures of soft and hard moments like “Iona” and closing crusher “Scars Me Forever” convey a similar sense of isolation and resentment, but go a bit heavier on the melodic death metal influences and prove a bit fancier, while the almost pristine melodic guitar lines that paint “Wishing”, alongside Fafara’s occasional moves towards a cleaner vocal presentation, almost move the band into territory usually reserved to Insomnium and Omnium Gatherum.\n\nFor all the interesting musical elements going on at this album’s periphery, it’s ultimately a very concise and predictable venture from a songwriting standpoint. Of particular note among the songs that veer into familiar territory is the partially In Flames inspired anthem “Den Of Vipers”, which has this catchy yet somewhat oversimplified and repetitive melodic hook, though it also contains some truly excellent and highly expressive lead guitar work that one rarely hears out of bands tied to the New Wave Of American Heavy Metal. On the other side of the coin, generally mid-paced groove machines like “Witches” and “You Give Me A Reason To Drink” are quite heavy and forbidding, yet seem a bit static when compared to the more melodeath-infused songs that showcase a greater variety of emotional expressions. Then again, while the groove thrashing violence of title anthem “Dealing With Demons” is also of a more straightforward character, it has a dynamic character to it and a level of depth that keeps things moving, and again showcases some solid guitar chops.\n\nIt will be very interesting to see how this series develops on the next album, as per the band’s own testimony, they intend an even more intense experience next go around. They’ve definitely provided a varied enough foundation here to have a lot of options available to them, and further emphasis upon the playing abilities Mike Spreitzer and Neal Tiemann would be a welcome outcome given how brightly they shine here. About the only thing that really hinders this album to any extent is that the flow of the songs comes off as a tad erratic, with the somber melodeath inspired anthems being front loaded onto the album, much of the groovier stuff in the middle kinda putting the brakes on things, and the faster thrashing parts being a bit few and far between. This isn’t quite the best thing to come out of their arsenal in the past 15 years, but it’s a solid listen that should play well with the band’s existing fan base and possibly rope in a few stragglers in the European melodeath scene.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nI usually allow myself one Devildriver indulgence during the last day of a review challenge, mostly because their first decade of existence brings back potent memories of growing up as a metal fan and as a person. ‘Dead to Rights’ may mark the most anticipation I’ve felt for a Devildriver album, since it followed just 18 months on from magnum opus Pray for Villains, probably the most diverse offering the Californians ever put to tape. Clearly, others were anticipating it too, because the Roadrunner website crashed shortly after the song was put online. However, it confused me a little on first listen.\n\nThat confusion came from the slightly technical direction that the quintet picked up on their fifth album Beast, summarized well by the unusual rhythm taken in the introduction to ‘Dead to Rights’ and the lizard lurch of the main riff. I don’t know my polyrhythms well, but I know they were laying down a gauntlet to competitors like Trivium and Lamb of God in trying such a thing; then again, if I had John Boecklin on drums, I’d probably do something similar. As a result, the song doesn’t prove the catchiest or most melodic of Devildriver’s career, though that riff serves its purpose, driving the chorus nicely and not getting old due to its complexity. The band seem slightly at a loss in the bridge however, rehashing a familiar sequence until the melodic solo sets things right. In the end, ‘Dead to Rights’ proved one of the better songs from the mildly disappointing Beast, but not quite Devildriver’s finest hour.\n",
        "\nAlmost dead and certainly low on gas, Devildriver pulled into 2018 like a dying horse limping towards a long-forgotten finishing line. Dez Fafara’s voice was rather the worse for wear on the preceding albums and Trust No One hadn’t panned out the way the band wanted. I personally renamed it Convinces No One. And then, quite literally, that dying horse took on a new demonic lease of life, got fucking lassoed by Johnny Cash and, eyes glowing in ominous undead orange, galloped off into the sunset of the Wild West. These things shouldn’t happen in real life, but Devildriver made an album full of country music covers. And, compared to what they were doing before that, it slays and sounds kind of fresh.\n\nThe band (specifically Dez) loving country was never a big secret, especially not since ‘Black Soul Choir’ proved the absolute highlight of Beast, though going all in for an entire album of the stuff was a shock, not least because it’s called Outlaws ‘Til the End, Vol. 1. That suggests Vol. 2 is at least a vague notion. Devildriver did this in the right way too, picking up the best bits from the songs that they cover and adding all the metalcore and melodeath weight and pace back in. If Dez was indeed the weak link on previous releases, his vocals are supported by a massive cast of guests, some of whom come from the source material (Hank Williams III appears on his own song and Johnny Cash’s son John Carter, plus his wife, contribute to ‘Ghost Riders in the Sky’), then some of the metal community get in on the action too, such as a pair from Lamb of God, 36 Crazyfists’ Brock Lindow and Fear Factory’s Burton C. Bell. Lee Ving is there too, known from the punk band Fear, and he does a great job on ‘The Ride’.\n\nThe guests don’t really make the music more special (except one that I’ll come to), though the twanging sounds of acoustic and steel string guitars form this into a more atmospheric listen than the otherwise regular modern metal that forms the chassis of the ramshackle vehicle. Starting off ‘Country Heroes’ with 30 seconds of eerie Ennio Morricone twang sets the scene perfectly, since first-time listeners will be unsure if Devildriver have adopted the country style as well as its standards. The guitarists rip into a chug soon after and the eerie phased guitar continues to hover above the music, upon which I knew that this was a good idea. The melodies play an enormously important role in keeping Outlaws ‘Til the End fresh, ensuring that problems with thinking of creative riffs don’t crop up, while the leads are also some of the best from Mark Spreitzer and newish partner Neal Tiemann. Austin D’Amond turns in one of the best drum performances since the almighty John Boecklin occupied the DD drum stool, packing the songs with energy and the band’s signature groove.\n\nThis all sounds positive as hell so far, so it’s time to cool off by learning that not all of the songs hit the spot. Some of them wind up to high intensity yet don’t manage to deliver the goods, which is a problem that plagues Fafara’s vocal style – maximum effort but medium impact. As a result, ‘A Country Boy Can Survive’ feels overdone, even if it gets attention. The real winners are ‘I’m the Only Hell Mama Ever Raised’ (originally by Johnny Paycheck) and ‘If Drinking Don’t Kill Me (Her Memory Will)’, which feature the smartest lyrics and some of the best delivery. The former benefits from a simply massive riff that drives the storytelling vocals, while Wednesday 13 (told you I’d hold one back) is the perfect choice for a song about getting blind drunk and being haunted. He and Fafara absolutely nail the chorus to that one too.\n\nMetal bands have never really been into mash-ups, but if this is the way Devildriver’s experiment turned out, I’ll have to demand a few more. The Americans really had nothing to lose and a lot of fun to gain, so the decent overall result is an added bonus. It’s interesting to note that the structuring imposed upon the band by cover songs led to every song hitting close to the three or four minute mark: a simpler approach, it seems, meant better decision-making and concentration on the execution. I am so in for Vol. 2.\n",
        "\nDevildriver’s releases have a special place in my heart, because I was at a certain age (and, importantly, a certain stage in my journey through metal) when each came out, so several of their pre-release singles left a deep impression on me. For ‘Pray for Villains’, the association is of a trip I took to France with my school on which we behaved fairly freely and became a lot closer as a result. When I came back, the pre-order of Pray for Villains was waiting for me, but I already knew that the album would contain themes about unity and companionship through tough times. This title track is about supporting the underdog when things get rough, hence the whole \"They pray for villains / When their heroes have let them down\" refrain. The spirit of the thing, as well as the heads down charge of the meaty riffs and broken two-step groove of the bridge have the same kind of momentum as that trip had and always combine in my mind.\n\nIn any case, the song is one of the plainer cuts from its mother album, displaying Logan Mader's production job that flattened the guitars against the speaker to give oomph to the low end, though the technique perhaps took away an ounce of pace. There are no leads or melodies on 'Pray for Villains', which were quite a feature on the album, so one could accuse it of misrepresenting the release, though the philosophy of Dez Fafara's lyrics is perfectly encapsulated in this aural nugget. Besides, the groove is powerful and John Boecklin a terrific drummer as always, so there's plenty to be enjoyed. Another strong step for Devildriver.\n",
        "\nReleasing a facile extreme metal offering is not really that bad. There are bands out there in the scene who tend to keep every element on their releases unsophisticated, yet they are successful in delivering a good output that the audiences would dig. After all, you don't always need loads of varied elements in your record just to impress the crowd. Uncluttered metal music, brewed relevantly with the right amount of decent elements, sometimes work more satisfactorily than being flashy. Unfortunately for DevilDriver, they fall under the ranks of those who cannot administer an unblemished debut release.\n\nDevilDriver is a band that I never heard of until the year 2005. That year they released their second studio album \"The Fury of Our Maker's Hand\", and someone recommended it to me, thus I stumbled on their material. The album was worth the listen, so I decided to track down more materials from the band. Then I came to dig their debut eponymous record, \"DevilDriver\". As much as I was convinced with their sophomore album, their debut failed to amazed me.\n\nThis debut album will offer you nothing with it's miserably composed song structure. It pretty much carries a poor cliché of nu-metal elements fused with a soupçon of post-thrash features. Certainly the guitars are chaotically down tuned, like the most bland that bands playing under their class does. Plus you won't hear any dignified solos in here, because there is really none in present. It's all just a loud guitar battle between the duo of Jeff Kendrick and Evan Pitts. They are both clearly just trying to out play each other as booming as they can, to try and make an impression, but disastrously they did not.\n\nJon Miller's bass work in here is somewhat exceedingly laxed. It was lethargically presented and it made no indication of being there all throughout the whole 40 minutes of the record. As for the drum section, it is tremendously insipid and uninspired. John Boecklin's execution is so non-complex that it led to the degree where it did not bore the ability to even get the listeners out of the state of being bored to this abomination of a release.\n\nOh, and I almost forgot about the audibly bumbling performance of Dez Fafara behind the mic. His vocal display was entirely obnoxious, in view of the fact that it sounded merely stilted and strained. The overall product of the guitars, bass, drum, and vocal staging had put together an extremely lame introductory album. The only good thing about this offering is that it made DevilDriver realize that they need to drop the nu-metal traits on their music and just stick with the neo-thrash/post-thrash section. Propitiously, they found an improvement and a little success with their sophomore as they eradicated the aggro-metal nature on their style.\n\nSo there you have it folks. DevilDriver's self-titled debut is in every way weak and feeble. Though the band would go on and continue to released unremarkable records, this first studio full-length is conceivably the most pathetic that they had created.\n",
        "\nDevilDriver is one of those bands hailing out of the 2000's metal scene who are maybe an ounce underappreciated by the metal masses. Ever since their inception they've been one of the most productive bands, sticking to the old school formula of releasing a new album every two year or so, whereas their peers often make us wait three or four years. When DD dropped their excellent fourth album Pray For Villains back in 2009, they cemented something that a lot of bands fail at - they passed the \"three great records\"-rule. Fast forward from there to 2011 and DevilDriver's fifth album, entitled Beast, and we get to see a band side of the band.\n\nImmediately from the get-go things are certain that DD's made a few changes to its sound. Their trademark groove metal sound is immediately recognizable but it's fueled with some seriously pissed off death metal riffing and drumming. The album's opening track \"Dead To Rights\" is something I've not quite heard from the band before; a ferocious beast (pun intended) coming on to rip your ears apart. Its direction feels a lot more brutal than I've heard the band going for before, but my initial thoughts about the song and the new sound are divided. The next song follows a similar formula, being a fastpaced face-kicker without any greater memorability. It's actually not before the fourth track, \"Shitlist\", that I'm starting to recognize the DevilDriver I know and love, and by the time it initiates I feel like it's what I've been waiting for all along.\n\nThe remainder of the album is like a roller-coaster, going back and forth between some classic-esque DevilDriver songs while a few others follow the new formula. \"You Make Me Sick\" is something of the album's \"hit song\", feeling as much DD as ever. \"Coldblooded\" sounds like some mid-paced melodic groove that could've come straight out of the excellent previous album. The rest of the album, however, manages to create little interest for me. The only exception (from the album's B-side) of any larger interest is a cover song, \"Black Soul Choir\", of the band 16 Horsepower. This is actually one of the album's most enjoyable highlights as DevilDriver manages to completely make it their own.\n\nThis album's production and recording process saw a reunion between the band and then former producer Mark Lewis. The guy did the band's 2007 album The Last Kind Words, but they did not work with him on the previous one. Much like the first time the band worked with him, the result leaves mixed thoughts with me. On one hand Mark Lewis is an excellent producer of modern metal music, but on another I find myself disliking some aspects of the album's overall sound. On the upside we have a very heavy sound going on here, but the album also suffers from sounding way too flat. Pretty much everything just feels flat - drums, guitars, bass, etc. There's no real punch to any of the elements and the album tends to sound like it was squashed between a hammer and an anvil. Despite those details, the album sounds quite clear while maintaining some rawness to its songs.\n\nBeast is an album that drives a hard bargain. It's not a bad record by any means but its main flaw is the lack of interesting songs and moments. A lot of the songs are just too fucking dull. The lack of memorable riffs, melodies and several other things just leave this album feeling like a large boul of soup with too few ingredients. It's just way too watered down. Keeping in mind that this was the band's fifth album, however, does justify those flaws to some extent, though. DevilDriver decided to incorporate something new in a larger dose, but it failed. It's okay. One thing about this album that actually makes me happy is the fact that they didn't repeat it. As much as I love death metal, it's not what DevilDriver are. The only thing I want from them is their trademark groove metal and then some. Luckily, that's exactly what they returned to after this one.\n\nCheck-outs: Shitlist, You Make Me Sick, Black Soul Choir, Coldblooded.\n",
        "\nDevilDriver is one of the last standing bands out of the early 2000's metal(core) scene. Where many of their old peers have perished in recent years, DevilDriver has remained quite productive by releasing a new album every two year or so. Trust No One is not your ordinary DevilDriver album, however, seeing as it marks a few changes within the band. Firstly we have the fact that this is the first DD album to arrive after a three year gap. This was due to vocalist Dez Fafara reuniting his former band Coal Chamber and doing a record with them in 2015. Things didn't seem to quite work out in that camp, however, and CC has seemingly been put to rest once again, with Dez quickly returning to DevilDriver. Secondly we have the changes within DD itself as well. Since the band's 2013 release Winter Kills and the following hiatus, the band has lost its long-time drummer John Boecklin, long-time guitarist Jeff Kendrick, and short-lived bassist Chris Towning. Needless to say, DevilDriver's had a lot to prove with this album.\n\nWhen the first notes from \"Testimony of Truth\" hit our ears it's evident that DevilDriver is back - just as we know them. Our greatest fears and most curious anticipations about DevilDriver anno 2016 are quickly put to rest. It's clear as day that the new band (lacking a dedicated bass player on the album) is just as good as the old one - if not even better. In my review for Winter Kills I did criticize John Boecklin's drumming to some extent for being less interesting than usual. Seeing this album's overall lyrical theme (trust) and listening to Dez's pissed off rants, it leaves our minds open to speculate that things may have been somewhat tense within the band before its hiatus. Especially considering that three of the band's four instrumentalists left the band before this album was made. While not quite clear if this has got anything to do with the album's lyrical theme, it does seem somewhat too convenient.\n\nNew guys on this release are Neil Tiemann and Austin D'Amond. The latter's well known from his stints with Bleed The Sky as well as Chimaira shortly before their ultimate demise. They manage to completely and confidently carry on the band's trademark sound. They fit absolutely perfect in the band and I have no doubts that Dez and Mike Spreitzer could've found better replacements for the band. It's like the band never lost any members at all. Austin's drumming in particular is just as thunderous and awesome as on any DD release ever, without being a copy-n-paste sound to that of Boecklin's drumming. The guy's just a madman behind the kit. Neil Tiemann on the other hand proves to already be a perfect songwriting partner for the band, penning a few of album's tracks which all sound convincing.\n\nMusically this album, much like its lyrical theme(s), takes a very dark route. I thought the previous two albums were pretty dark but this one goes even further. The songs are slightly more eerie and haunting than before, which is especially evident in the band's trademark guitar harmonies and clean parts. Songs like \"Retribution\", \"House Divided\" and the title-track are like deep melancholy and (mostly) angst put together into a great groove metal sound. This is further evident by the fact that this album's missing a \"party song\" - something the band always had on previous albums. We are also treated with what is apparently a song from Dez to his wife - \"For What It's Worth\". In a series of webisodes documenting the making of this album, Dez described it as the \"heaviest thing ever\". It was something of my greatest anticipation with the album, and I must say I'm not disappointed. The song is beyond everything else on this album. It's absolutely amazing and it might even be my favorite DD song of all time. It's one of those songs which left me speechless.\n\nAt the end of the day DevilDriver assure us that they're alive and well. Despite having gone through massive changes since their last album, things don't sound like it. It could be for better or worse depending on how you see it, but I personally love the band for their trademark sound and am glad it's not changed. I do, however, feel that this particular album might perhaps be somewhat one dimensional. It's almost as if they played things a bit too safely, which of course is understandable if so. Where previous albums often felt more varied and had half a bunch of \"hits\" on them, this one feels more like a greatest hits collection of album tracks. Trust No One will likely not go down in history as the band's finest hour but it's a decent record which provides us with some great new music from them. Most of all it ironically cemented a trust that the band's still got an interesting future ahead of them.\n\nCheck-outs: For What It's Worth, My Night Sky, Trust No One, Daybreak, House Divided.\n",
        "\nIt's become rather a tradition of mine to look back at Devildriver albums and singles with a certain amount of nostalgia because when the band was in its prime, I was a budding metalhead and looked to each of their releases with expectation. The advent of albums like The Fury of Our Maker's Hand and Pray for Villains pushed my tastes on to ever more diverse and heavy groups, though I must say that The Last Kind Words - if not the band's best album - is certainly the one that symbolizes all of Devildriver's appeal. That release is slightly uneven, but 'Clouds Over California' can be said to be nothing other than pure joy from start to finish and has yet to be bettered in my opinion for the semi-extreme take on modern melodic death metal that it captured. For the record, I'm not talking about Swedish melodeath, but about the American variant that was so prevalent after Killswitch Engage made it big with The End of Heartache back in 2004.\n\nWhat I love about his song in particular is the way in which everything is geared to increase the adrenaline and intensity of the experience, so that even though it isn't especially fast and still retains the fat Devildriver groove it seems to power forwards by instinctive energy, adding wave after wave of riffs and John Boecklin's insanely accurate beats (he's been accused of using triggers in the past and it just isn't true), Dez Fafara contributing one of his most incensed vocal performances. Add to that a sparkling melody and a great melodic lead that put the cherry on the top of the band's sound from The Fury of Our Maker's Hand, 'Clouds Over California' ushered in an era for me of pure metal bliss, in which every element of the band was unified in a venture of pace, aggression, and memorability that 16 year old me loved and 25 year old me is currently losing his head over.\n\nAs with 'End of the Line', I wouldn't have chosen to review this were it not for a personal story that makes it all the more special. This one has nothing to do with surprising girls I liked, but I remember practicing tennis (in my parents' garage, which was not exactly the best place considering how confined it was) and blasting this song on my laptop, trying to perfect the trickshot of running towards the back of the court to retrieve a lob and hitting it back through my legs. After many, many attempts I did manage to do it and finally stopped to take a breath, realizing that just about everything that could have been knocked over in the garage had been knocked over, spilled, or otherwise wounded as a result of my exuberance and the song's energy. It's pretty stupid, but that's what makes 'Clouds Over California' such a great companion to this day.\n",
        "\nIn our little metal world, DevilDriver is a name that rings a bell with most metalheads. Shortly after the break-up of Coal Chamber, 13 years ago, Dez Fafara popped his head back up with this completely new outfit. On their eponymous debut album you still heard quite some hints from Coal Chamber but with what seemed like a much more straightforward thrashy/melodic death metal vibe to it. Quite soon they became notorious for their Californian groove metal on speed and the huge circle pits they created at live gigs. About 3 years ago however, most of the band members turned their backs to DevilDriver. After going on the road for a bit with Coal Chamber, Dez found 3 new members and with an almost completely new line-up they created the 7th album Trust No One.\n\nDon’t go expecting a completely different sound here with the new line-up. Dez and guitarist Mike Spreitzer have clearly held the reigns pretty tight and kept the music in their comfort zone of what they know they do good. Compared to their last album before this release (Winter Kills), which was more moody and a bit lower paced, they seem to have picked up a higher gear in most songs. The culprit behind this slight change is most likely their new drummer Austin D’Amond (Chimaira, Bleed The Sky), which delivers some pretty decent beating that pushes the songs forward. Like I said already, there’s nothing new and exciting to be found here. What does kind of thrills me, is here and there a hint of the good ol’ Coal Chamber. For instance My Night Sky‘s beginning immediately made me think back to their music and so does most of the rest of the song. The voice and pounding slower riffs really hit home on that level. Their overall sound is a quite digestible kind of metal with a heavy groove that doesn’t bring much complexity to it. Just the DevilDriver like we know. If you’re into having a bit of a good time, want to headbang to some cool riffs and drums or shout along to work out some frustrations, you’re at the right spot here!\n\nTalking about those frustrations, lyrically it’s quite clear that this time Dez has been inspired by the feelings brought up by being abandoned by certain former friends and associates. He’s angry, hurt and has a thirst for revenge. With songs like Bad Seed (“you’re a bad person; bad deeds, bad karma; bad seed; stay away from me”), This Deception (“This deception it cuts so deep”), Above It All (“I took you into my house and let you in, like family, just like a friend! Thought I knew you and even more till I saw your face then I wanted no more!”) and most of the others, he makes clear what he thinks of the betrayals he experienced. The cover (a wolf breaking out his sheep’s clothing) and album title Trust No One only supports my observation.\n\nAs a Coal Chamber and DevilDriver fan of the first hour I’m ok satisfied with this album and so will probably the big fans. Though I have to admit that the album doesn’t really makes me excited and go like “yeah! awesome!”. There are some really nice songs to be found and nice parts that would probably come across even better live, but I want more! I sort of hope that on future releases they will try to be a bit more adventurous in their song writing. Though hey, you don’t hear me complaining, Trust No One is still a killer metal album.\n\noriginally published on www.grimmgent.com\n",
        "\nWhile it may be just a promo single, 'End of the Line' marks a very important point in Devildriver's beleagured history. After stepping on some toes with the awkward mish-mash of groove metal, nu metal, and extreme metal that was the debut album, Dez Fafara and his cohorts must have quickly had a team talk and decided to go for the real deal on the follow-up. The Fury of Our Maker's Hand was a huge step up in quality and marked a determined transition that would win over many fans, myself included. The first track on that album and also the first Devildriver song that I heard was 'End of the Line'.\n\nDeceptively mellow at first as it builds up with rippling clean guitar picking, the song begins to swell and eventually breaks into full-on groove-cum-death metal riffing with an imperious drumming performance from John Boecklin. The level of subtlety and complexity is drastically different from the debut album, the band using two guitars fully for the first time and smashing out many more riffs than expected. The thrashy verse riffs are sometimes backed by drumming that might be partially triggered, though it's the descending bridge riffs that really do the trick, in addition to the huge swinging meathooks that dominate the breakdown lasting from 3:35 to 4:16. Dez had begun using the overlapped screaming that would later characterize all of Devildriver's albums and contributes lyrics that don't make me want to bash my head into my desk, a crime of which he had been guilty earlier in his career.\n\nOverall a crucial turning point for the band, 'End of the Line' heralded the beginning of a few great years for Devildriver and knows how to throw its weight around in just the right way to get noticed, though doesn't quite make it as the best cut from The Fury of Our Maker's Hand. In any case, I have a lovely memory of putting my headphones into my first sorta-kinda-girlfriend's ears during the calm intro and watching her eyes pop out as the rest of the band introduced themselves with all the decorum of a car bomb. Ah, the good old days.\n",
        "\nThis isn't painful in the way that watching your family die in front of you would be painful. It's not even really painful in the way that being poked with sharp needles and pieces of glass would be painful. It's more in the way that watching your favourite team lose is painful, especially as they start out playing alright and then slowly concede a goal or two, eventually losing by six or seven. By the end, it's a bit painful to watch, because you don't want to see them go down like this. And then you remember this is Devildriver's debut album, so it's not your favourite team at all - you can just watch another game until this one gets better.\n\nDevildriver would hot up a bit later in their careers, but this first step is not really a satisfactory one. Granted, this isn't the nu metal drudgery that many would have expected from Dez Fafara as he came out of Coal Chamber, but nor is it a successful attempt at melding more extreme styles of metal with the groove-ridden approach of the early '00s. There are several points on which Devildriver falls down and a few ameliorating moments that make this worth a quick flick through. Before moving on to the style and songs, I want to quickly summarize the skill of the musicians - don't expect much. This is really messy, with downtuned guitars competing with thick bass and sadly combative-sounding but essentially boring drums and then Dez's voice (which has always been out of place ever since Coal Chamber) roaring dryly over everything.\n\nThe music splits about 50/50 between turgid rhythmic groove and vaguely post-thrash/melodeath downpicked riffs, sometimes in the same song and sometimes entirely separated. This makes the album inconsistent and frustrating, since some of the songs have pretty good ideas that are spoiled by really bad ideas at inopportune moments. The start of the album is actually quite promising, 'Nothing's Wrong?' kicking in with a cool riff and drum build-up, while the lazy chorus is thankfully short enough to cause little trouble; however, it breaks to a totally nothing riff and Dez horribly shrieking \"So go fuck yourself anyway\", so it's a decidedly mixed experience. Then there are songs that have decent melodies, lifting them out of the baseness of the groove cesspit, such as 'I Could Care Less' and 'Cry For Me Sky', even if they can't match those meaningful melodies with anything suitable from the rest of the band.\n\nWhat becomes more and more apparent as Devildriver progresses is that the genuinely thoughtful ideas are mere embellishments on a formula which is one-dimensional and lacking in musical quality. The seemingly random solo found in 'What Does It Take (To Be a Man)' is evidence that somebody had some inkling of how to write the kind of metal song that the band intended, while others thought that playing low and fast and growling brutally would be enough to make convincing songs. In fact, the majority of songs like 'Revelation Machine', 'I Dreamed I Died', and 'Devil's Son' are straight from the Coal Chamber template, altered for Devildriver only by increasing the pace (and thus the chaos of the guitars) and allowing John Boecklin to use more of his drumkit in every song than most nu metal bands ever did. The fact that 'Revelation Machine' picks up into a genuine death metal riff for about three seconds towards the end or that 'The Mountain' has a death doom break and a main riff of reasonable thrash proportions just goes to show how confused and rushed the writing must have been - no one has thought out how these songs should affect the listener.\n\nLooking for hideous material is a similarly annoying proposition to finding the interesting parts, though made easier by the fact that most verses have little to no musical content and no song is devoid of repetitive and lame sections. Complete write-offs include 'Devil's Son', 'Cry For Me Sky', and 'I Dreamed I Died', the last of which will make all nu metal-haters puke their guts out, especially the jerkily rapped verses. There are some signs of the future Devildriver, such as the decent 'The Mountain', the hide-and-seek styles of 'Meet the Wretched', and 'Swinging the Dead'. The latter is probably closest to the sound on The Fury of Our Maker's Hand, although it's a poor man's version of that modern metal sound and might have come from the film soundtrack before it was included on this album, something that I'm deeply confused about.\n\nIn order to bring this review to a swift conclusion, just as 'I Dreamed I Died' brings our hopes of a decent album to a similar end, I would not recommend anyone listen to Devildriver unless they like messy, noisy groove metal with random interjections in purer styles. There are some moments of interest and a few songs are listenable, though the majority will confuse and dismay you as much as inspire all-out hatred. Stay out of the water.\n",
        "\nAs we bow our heads in declaration that the New Wave Of American Heavy Metal is as good as done we must also raise a glass in admiration of those few bands in the movement that still remain. The movement itself was such an important phase for heavy music. Not only did it bring throaty singers and abrasive instrumentation into the mainstream but it also birthed the next generation of artists like Machine Head and Lamb of God that, while not as popularly, will eventually fill the shoes of pioneers such as Metallica. \n\nDez Fafara’s second son, Devildriver are such a band that have battled through the ages and still come out strong but their hardest challenge comes in the shape of “Trust No One”. It’s the first album that marks the departure of songwriter and guitarist Jeff Kendrick and drummer John Boeklin back in 2014, not to mention the reformation of Dez’s firstborn band Coal Chamber. Despite this, Dez has assured us that the energy levels of Devildriver are at an all time high however, can we trust him?\n\nFirst impressions always count and luckily for Devildriver, they always create awesome opening tracks to an album. You’ve got “Pray For Villains” (Pray For Villains), “End Of The Line” (Fury Of the Maker’s Hand) and “Dead To Rights” (Beast) just to name a few but every album they have realised always has had an eruptive entrance that sets the unabashed tone of the following songs. And now we can add ‘Testimony of Truth’ to the list. “Trust No One” starts with vicious blast beats and alarming grooves that give way to Dez’s typical snarls. The belligerent tone is continued on ‘Bad Deeds’ where the guitars almost create a wall of aggressive sound beneath the hard-hitting chorus and Dez officially ditches the guyliner and sees nothing but red in the monstrous ‘Daybreak’ with crushing grooves and shattering drums.\n\nYou could argue that although “Trust No One” is a solid and imposing album that is bursting with authoritative atmosphere and you’d be right. But when listening to the album you can’t help but feel Devildriver are playing it safe here. The title track and songs like ‘This Deception’ are fast and hostile tracks and the lyrical content of both songs are clearly aimed at something so deceitful that has provoked the band to this violent nature however it just sounds customarily chaotic. The album as a whole basically sounds like another Devildriver album; the latter track even seems to nick some lyrics and melodies from their past work.\n\nAmongst this feeling of predictable expectancy, Devildriver do introduce a number of experimental moments in “Trust No One”. These features largely take the form of interludes in songs such as ‘My Night Sky’ and ‘Above it All’. The former includes menacingly eerie guitars but the latter is a straightforward groove metal track but has some odd break that stops all momentum Devildriver have built thus far. The album closer, ’For What It’s Worth’, also incorporates a forgiving guitar tone which is a first for such a ruthless band. \n\n“Trust No One” is the quite simply the Devildriver album you’ve already heard.\n\nOriginally written for http://www.sputnikmusic.com/review/70720/DevilDriver-Trust-No-One/\n",
        "\nAfter DevilDriver's somewhat mediocre 2011 release \"Beast\", many fans as well as myself was wondering if DevilDriver was done for. Especially after an album like \"Pray For Villains\", which was amazing, \"Beast\" just didn't quite deliver the goods like we had hoped it would. Fast forward two years later and we are in 2013 - a time in which DevilDriver as well as the whole NWoAHM (New Wave of American Heavy Metal, or simply metalcore) movement had a rather lukewarm interest left at best. No matter the musical landscape beneath them, they unleashed \"Winter Kills\" which would prove not only being a back-to-form record, but also that DD indeed still had got some mojo in them.\n\nWhereas \"Beast\" started off rather brutal, almost in a death metal kind of way, \"Winter Kills\" doesn't let us worry the slightest of what is to come. What we immediately are served is a large dose of classic DD style groove metal that we got to love and associate them with in their earlier records. No bullets are spared here. Fast forward a few tracks into the album and things are really starting to get interesting. The middle section of the album includes the best, most creative as well as beautiful tracks found on here. Tracks like \"Haunting Refrain\" and \"Curses And Epitaphs\" are some of the most powerful and epic tracks DD has ever penned, and fans who loved early tracks like \"Sin & Sacrifice\" (off of \"The Fury Of Our Maker's Hand\") are sure to be happy with these tracks.\n\nThe production is the standard you would expect from a DevilDriver record. It's a bit too polished yet has a raw vibe to it. The instruments are well-balanced in the mix, though some evident clipping is to be found throughout the album (more so than in previous DD albums). The musicianship is also strong once again. Compared to \"Pray For Villains\", the roles of the guitars are stripped-down with few solos to be found, but the riffing and harmonies are just as badass and beautiful as ever. On the other hand, powerhouse drummer John Boecklin doesn't quite impress me as usual this time around. The drumming here is not all bad, quite the opposite, but as much as I think the dude rules on drums, his performance here feels rather run-of-the-mill. The same could perhaps be said be said about vocalist Dez Fafara, who really just shouts his way throughout the entire album. It's not a bad thing by any means, but he's not bad at doing clean vocals and I do wish he'd create some dynamics by adding some clean vocals.\n\nAll-in-all this was more or less of a return-to-form album for DevilDriver and their audience. While not quite the best record of their catalogue, it certainly is a very solid album. Many fans seem to be disappointed in it, however, which I personally don't understand at all. Maybe a few listens are needed to really hear and appreciate what this album has to offer, but I can assure that it's worth it. If you can get your hands on any of the deluxe editions, I would recommend that as well. The two bonus tracks that come with it are pretty good additions to the track-list, not to mention the bonus live-DVD. I personally ordered the Best Buy exclusive which also included a really neat \"free\" T-shirt, which on its own was worth getting the album for.\n\nCheck-outs: Haunting Refrain, Curses And Epitaphs, Winter Kills, Sail.\n",
        "\nAfter the widely acclaimed and successful album \"The Last Kind Words\" in 2007, DevilDriver returned in 2009 with \"Pray For Villains\". DD has always been a band that constantly takes a new route from album-to-album without losing its trademark sounds. Needless to say, this time around was no different.\n\nWhereas the previous album was a rather one-dimensional record, focusing more solely on heavy, groovy, and blistering tracks, this album is in many ways the opposite record. While keeping their signature groove and melodies from previous albums, this album really is more built around a toned-down groove sound with a lot of melody. In fact, compared to their earlier albums, this one is rather ultra-melodic in comparison. This is mostly evident in the guitar playing, which incorporates a lot of classically influenced scales and styles throughout many of the albums tracks (\"Resurrection Bvld.\", etc.), and that is something that truly feels refreshing when embracing the band's fourth album release. The album also has an overall richer feel to it as far as influences go, even sounding a bit influenced by pop music at times (\"Teach Me To Whisper\").\n\nThe musicianship is as strong as ever, and of course even a bit stronger than before. Guitarists Mike Spreitzer and Jeff Kendrick both really prove themselves being great guitarists this time around, something that unfortunately don't happen on every DD album because lack of guitar solos and such. The massively underrated powerhouse drummer John Boecklin hasn't changed a bit from previous albums and he's just as ferocious behind the kit as ever. Even badass vocalist Dez Fafara has grown since the previous albums, providing an overall stronger and genuine feel to the vocals through his performance and personal lyrics.\n\nAll-in-all this album is perhaps the band's richest and most creative album to date. It really does stand out in the DD catalogue with its melodic groove metal and great musicianship. The production, done by the old Machine Head guitarist Logan Mader, is perhaps a bit too polished in certain areas, but it does suit the music and really balances all the instruments well together. Though I don't really like the principle of \"deluxe\" or \"remaster\" issues of albums, it's undeniable that it's a common thing for the past ten years or so. With that said, the deluxe version of this album is a lot richer than the standard issue itself. The bonus tracks are the strongest on any DD release, outdoing several of the album's standard tracks, and there's also a nice and fun bonus DVD showing the making of the album.\n\nI would totally recommend this album to fans of aggressive yet melodic metal music, especially if you're into groove, melodeath or metalcore (though I would not really label DevilDriver as metalcore). This is probably my favorite by DevilDriver as I'm a sucker for classical guitar stuff, but fans of any of their other albums would most likely dig this one out of many other reasons as well. It's just an overall heavy, beautiful and very personal record.\n\nCheck-outs: Bitter Pill, Waiting For November, Pray For Villains, Forgiveness Is A Six Gun.\n",
        "\nAs EPs go, this is useful rather than excellent. A Devildriver fan doesn't need to get this by any means, but they might well like to, since it compiles bonus and extra tracks from the previous couple of albums. As a showcase of the band's music at the time of 'The Last Kind Words', it feels a bit worthless, seeing that none of the tracks are actually new, but none of them are too bad either, which swings the balance back the other way.\n\nTo get the birth of these tracks out of the way, it seems that at least 3 of them ('Unlucky 13', 'Guilty as Sin', and 'Digging Up the Corpses') were recorded along with the other studio tracks on 2005's 'The Fury of Our Maker's Hand' and originally appeared on the special edition to the same album, although 'Digging Up the Corpses' doesn't quite ring true as a product of that session. 'Damning the Heavens' was a bonus track from 'The Last Kind Words' and 'Pray for Villains', even though the recording date of 2007 seems odd considering that it sounds as if it was recorded a few years earlier, or at least in a different studio. Finally, we have the title track, 'Head on to Heartache (Let Them Rot'), which was culled directly from 'The Last Kind Words' and works precisely as a kind of single release; however, its position last on the tracklist suggests that this was merely an excuse to release the other bonus tracks.\n\nMusical quality is surprisingly high for such a pitiable odds and ends collection, with 'Unlucky 13' and 'Guilty as Sin' being the picks. They sound marginally less distinctive than the other songs from 'The Fury...' but get by very nicely with hooky riffs, strong chugging guitars, and some catchy vocals. The other two don't sound specifically like Devildriver, yet aren't bad in any particular way, just not especially memorable. 'Head on to Heartache' is ostensibly the best song here, with a much greater range of emotional and musical intensity, which supports the band's choice to choose it as an album track rather than merely another extra recording. Purchasing any of the three albums mentioned in this review would be preferable if you don't already have them, though if Devildriver is really your thing, you would probably do well to pick this up for a low price.\n",
        "\nDevildriver have long been one of my favourite bands who cater to both the mainstream and traditional communities of metal. They have never been afraid of mingling the groove and 'core qualities of their music with extreme and melodic titbits that brought a sense of adventure and variety to albums like 'The Fury of Our Maker's Hand' and 'Pray for Villains'. The same is true to some extent of 'Beast'. It seems like on this album, the band had pushed the extremity up a few notches and aimed for a more experimental combination of the metalcore, groove metal, melodic death, and thrash influences they had previously used.\n\nThe first big difference that this album shows is a battle with rhythm that plagues some of the songs and defines others, departing from John Boecklin's usual style of battering momentum and flashy fills. Listening to the verses of a song like 'Hardened' or the deliberately technical opening of 'Dead to Rights', some of the band's former energy has been replaced by a tendency to bludgeon and groove in a more staccato manner, which pleases me less than the fluid likes of 'You Make Me Sick'. There are a few instances of blastbeats and double bass focus, notably on the alternately melodic and brutal 'Shitlist', which is a lot more palatable than its name might suggest, though the guitars don't match the drums for heaviness, since they are produced in a fat modern style that bites little and grooves heavily. This gives the album a slight problem with imbalance, because the extreme ideas sometimes lack the musical conviction that a rougher production would permit.\n\nThe songs have a similar problem to most of Devildriver's other albums, whereby some of them contain instantly memorable hooks and riffs, while a few pass by without many remarkable features. The balance of these songs on 'Beast', however, is especially disappointing, with four or five songs doing little to stand out from the general thrust of the album, even if the others include some unusual ideas that make them easy to recall. For instance, the slippery tapping of 'Blur' marks it out from most modern metal bands: I can't imagine Lamb of God or Machine Head pulling out something quite so far outside their own sphere, nor did I expect the appropriately chilling melodies in 'Cold-Blooded' or the optimistic melodic riffing of 'Black Soul Choir'. That said, I would expect both of the aforementioned bands to make either something catchier or with more quality guitar work than the bland 'Bring the Fight (To the Floor)' and 'Talons Out (Teeth Sharpened)'. Those two songs are particularly boring, but 'Lend Myself to the Night' and 'The Blame Game' are hardly any better, making use of too many samey riffs and exhibiting Dez Fafara's lack of lyrical direction on this album. His part in 'Beast' is as a centrepiece for most of the songs here, yet he really does a poor job of pulling all the elements together and acting as a focal point, with a certain kind of intensity that loses its appeal after too much repetition and not enough variation. The other thing that is sorely missed is the presence of the classic lead guitars on many songs, since the solos were a definite highlight for the two preceding albums, proving the main attraction on a full-throttle shredfest like 'I See Belief'. Here, solos are present, but are often underdeveloped or a seeming afterthought in the songs' construction, so that they do little to break the monotony of some of the blander riffs.\n\nThe notable exception to all these complaints is the fantastic cover of 'Black Soul Choir', which has been remarked upon before as one of - if not the - standout tracks from this album. The constant presence of melody, the hookier chorus from Fafara, the upbeat drumming, a certain joy in the riffs: all of this brings it to a higher level than the heads-down attack seen elsewhere, and adds replay value. There are some great riffs to be harvested in 'You Make Me Sick' and 'Blur' too, while the lurching groove of 'Dead to Rights' proves that technicality needn't proclude catchiness. However, I just find that 'Beast' doesn't maintain any sense of progression or momentum from song to song, whereas 'The Fury of Our Maker's Hand', though ostensibly a groove metal album with a major drumming boost, fared much better in this respect, tearing through its second half in a shower of riffs and screams. Consistency is a big issue, particularly when the band were trying to be inventive in some songs, since there is a vast gap between the best and worst offerings.\n\nOverall, I feel disappointed by 'Beast'. It followed hot on the heels of the adventurous and successful 'Pray for Villains', yet delivers only a portion of the excitement and detail that album offered. Too many bland parts, notably in the vocals and some samey riffs, drag several of the songs down, which turns a 55 minute album into an endurance test far sooner than one might expect. The band seemed just on the point of running out of ideas and - if the extremely lacklustre 'Winter Kills' is anything to go by, there isn't much gas left in the tank for these guys. Not a truly terrible release, but a big step down for Devildriver.\n",
        "\nIf you think of the most significant modern metal bands, Devildriver stands out more than one might expect. For instance, some of the big names in metal, like Slipknot and Bullet for My Valentine, aren't considered to be \"metal\" in the sense that this website defines it. Hell knows what they are if they're not metal, but this isn't the place for the debate and I'm not sure I have the patience to begin or end it. Then there are other big names in metal that do have band profiles on the Metal Archives, such as Killswitch Engage and Lamb of God, who aren't exactly more recognisably \"metal\" than the aforementioned bands, excepting perhaps a greater focus on riffs and rhythms. Devildriver comfortably fit into the same sort of category as Lamb of God, whereby they bear marks of some classic metal elements - the riff approach, harsh vocals, solos - but also maintain a very modern sound, which defies the trends of most music from the previous century. Even then, Devildriver have steered clear of most of the 'core genres (metalcore, deathcore, hardcore) and usually build their songs from an amalgam of classic and extreme cuttings. Their first album aside (let's call that a warm-up), these guys have been putting out consistently satisfying albums that stand at the crossroads between melodic, extreme, and modern.\n\nIn my view, 'The Last Kind Words' is the first album on which Devildriver figured out what they wanted to do and how to do it. The debut was a leftover from Coal Chamber, 'The Fury of our Maker's Hand' took everyone, including the band, by surprise, leaving Dez Fafara and co. emerging into 2007 with a fair bit of attention and a lot of options. Would they revert to the safer ground of Fafara's previous career or would they forge ahead with the heavier elements that they had displayed on the sophomore release? The answer is firmly the latter and in fact 'The Last Kind Words' ends up a lot more focused and cohesive than its predecessor, with a style and energy running right the way through it. I've seen a lot of comparisons between this and melodic death metal and, while that may be the most helpful reference to start off, it doesn't take you terribly close to the eventual product. The elements of melodeath that are present are the hooky riffs, which include lots of dynamic and rhythmic shifts, much of the lead guitar style, as well as the melodies, plus the general aesthetic and weight of these songs, since they tend to brandish their heaviness in a manner more often euphoric and emotional than purely savage.\n\nFrom an instrumental point of view, this is going to appeal to fans of Chimaira as much as Arch Enemy and - while I can see this comparison causing some issues for the haters - Devildriver have many things in common with Machine Head's heavier work, though I find this band both more brutal and more subtle on occasion. What tends to separate Devildriver from all those bands is a sense of fluidity to their riffing and songwriting that comes mostly from the downtuned guitars (don't worry too much, it's only drop D) and sinuous, groovy bass. Although often hooky, the guitars don't have the same approach as a lot of modern bands, whereby they will chug and fill (as in metalcore), nor are there many beatdowns, barring the rather obvious effort at the end of 'Burning Sermon'. Instead, the riffs bounce and bob on top of a smooth production, like a motorboat on a gentle sea. This gives the songs a kind of \"flow\", whereby they build intensity and keep interest through momentum, rather than focusing all the energy on stop/start modern rhythms. The whole \"gentle sea\" image may make the band sound a little tame, but the effect is actually somewhat akin to speed metal, even if the overall style is quite different. Perhaps there are a few moments that could point to 2000s Grave Digger, though Devildriver are still too modern to maintain the comparison.\n\nWhat really stops this becoming a groove metal album in the vein of 'The Great Southern Trendkill' is the drumming. It's somewhat tiring to explain that John Boecklin is a great drummer every time Devildriver is mentioned, so I'll cut it short: he transforms both the flatter and hookier riffs into something approaching extreme territory, providing a lot of the dynamics and drive behind the band, which is why you won't get bored of any songs on 'The Last Kind Words', nor do any of the sections drag. He plays with a sprightliness that really pulls those lumbering guitars up a notch and it would be tough to find any gap in his assault - he's doing something new all the time. This is the opposite feeling I get when listening to Machine Head, where all too often the guitars are banging out some nice riffs and the drumming is completely absent in effect, so the song gets dry very quickly. The other thing that emerged on Devildriver's third album was a preponderence of leads, which turn up on most of the songs and always sound fresh, dazzling, and energetic.\n\nDepending on your preference for genre, there may be a couple of songs here that you'll want to approach with caution. Those averse to overtly 'core and modern sounds will probably baulk more at the latter half of the album, which includes that breakdown in 'Burning Sermon', the lacklustre chuggy 'When Summoned', and the interesting 'Monsters of the Deep', which slows things down for plunging bass-drops and tight rhythmic groove. The band sound more confident when moving faster and Fafara becomes a more commanding presence behind the sonic weight of 'Bound by the Moon' and 'Not All Who Wander Are Lost', both of which pack in a lot of riffs and pace, have scream-along choruses and sweet solos. 'Clouds Over California' might be the catchiest of the bunch and 'Horn of Betrayal' comes off strongly too, leaving the first half much better than the close.\n\nThere are a couple of surprises thrown in to the songwriting, such as the Spanish-sounding acoustics that close 'These Fighting Words', the attempt at atmosphere on 'Monsters of the Deep', as well as the organ that leads us out of the album. The largest surprise, however, must be Devildriver's development from a shoddy nu metal band into a decent modern melodic group only four years later. 'The Last Kind Words' isn't quite the best Devildriver album, but it's the most focused and gave the band a hand up into the general metal community.\n",
        "\nOver the years, Devildriver have enjoyed throwing out the heaviest song on any given album as not only the opening track but also the single. And, mostly, that heavy song has not been entirely representative of the album, which (in the case of Beast and this album) actually featured more adventurous and well-crafted numbers that would perhaps have attracted more listeners to the party. I'm not exactly criticizing the band for this choice, but you do have have to question exactly how they see themselves: do Devildriver think they are a semi (non-melodic) death metal band, because that's what 'Dead to Rights' screamed and it's also what the title track here weightily suggests.\n\nThe song 'Pray to Villains' is a heads-down, churning riff-storm with no melodies and no shifts in pace, except for that stop-start grooving riff near the end. Brutal it may be, but it's actually bland compared to the rest of the album. Devildriver's sonic palette has been expanding ever since they released their debut album and, by their fourth full-length, Pray for Villains saw the band making full use of the diverse range of styles they had claimed. The title track is the only song that doesn't employ a single melody, solo, or outside genre. There is really a lot going on here, from the doom-on-steroids main riff of 'Pure Sincerity' to the out-and-out shredding that closes 'I See Belief' and most of these ideas are executed with great precision.\n\nCreativity is a high point, although the band is not completely on fire. John Boecklin as ever is the vital component to Devildriver's success: it may be Dez Fafara's band but the drummer is the driving force behind every song, whether pounding along at high pace on the opener, kickstarting 'I've Been Sober' with a gloriously precise fill, or restraining the whole band as they build tension midway through 'Fate Stepped In'. On this last song, the bass comes to the fore as well with an acrobatic, flexible tone that generally gives the music a feeling of momentum and groove that is hard to resist. The guitarists work their arses off in several modern styles, drawing from death, melodic death, metalcore, and a more general modern metal sound, as well as pulling in titbits from thrash and doom. The leads and melodies, however, are far more classic in places and give nods to both the atmospheric and adrenalized corners of our world. The tone for the rhythm guitar sometimes sounds a little too modern and processed, but it packs a much needed punch, since Dez Fafara sadly isn't all there in the vocal department. His contribution to the 2 preceding albums was more front and centre and gave the band a focal point, but here he sounds one-dimensional in places. Fafara never had more than one style (always gruff and furious), though he was able to bring more emotion to songs in a way that is partly absent from Pray for Villains. On the other hand, his lyrics on 'Waiting for November' and 'Another Night in London' have serious character, something extended by the hand-drawn notes in the CD booklet.\n\nThe songwriting really saves the vocals and is the crowning achievement of the album. Because of the diversity, nothing really gets boring and I can pick out numerous highlights. It's actually easier to say that 'I've Been Sober', 'Forgiveness Is a Six Gun', and 'It's in the Cards' are the weakest songs on offer, perhaps because they don't have such a distinctive character as the others, though none are especially poor. The scrambling, circling motif of 'Bitter Pill' is a high point, as is the melodeath rush of 'Waiting for November' (a.k.a. how to make the lyrics \"You looked so beautiful/At your funeral\" sound joyful), and 'I See Belief' is the perfect closer, especially the trick ending. I won't describe everything, but there is a wealth of riches to enjoy long after the first listen.\n\nI have the limited edition version of this album, with 4 bonus tracks and a DVD that details the making of the album. The extra songs are not bad, though more limited in style than the album tracks (a couple are notably a few years older than the rest of the material), with the most diverting listen being the cover of Iron Maiden's 'Wasted Years', if only because we get to hear a very modern take on a classic style and because Fafara's vocals are lowered to half-bark, which works better than it sounds. Anyway, with or without the bonus tracks, Pray for Villains delivers a whole lot more than its title track suggests and, while it arguably doesn't have individually the strongest songs of the band's career, it is probably their most balanced and most rewarding album.\n",
        "\nThe Fury of Our Maker’s Hand came out in 2005, which I remember quite clearly. I was into nu metal at the time. My favourite bands were Korn and Slipknot. I remember reading the review in Kerrang! magazine and looking up to the album as much heavier than anything I was listening to. I bought it after I had a couple of Coal Chamber albums – maybe that was the gateway, maybe not. The point of all this reminiscing is that I’m still listening to this album today, while I don’t really spend much time with my favourite nu metal bands of yesteryear. This is, more or less, the album that got me into more extreme forms of metal.\n\nThat is one thing really worth noting. Devildriver’s debut was tame, uninspired, and sounds dated now, especially compared to this release. This album could have been recorded by a completely different band, one that was used to taking the tastiest (also read: grooviest) parts of death metal, metalcore, thrash metal, and melodeath and turning them into something modern and exciting. There are some nu metal moments, like on ‘Driving Down the Darkness’ and ‘Bear Witness Unto’, but these parts are rare and are probably attributable to the downtuning of the guitars more than specific stylistic choices. Dev Fafara was always too brutal for a nu metal band, but if you listen to the drums, the great step-up in heaviness is immediately apparent. John Boecklin has since proven that he’s a great drummer, but he does an extremely good job of keeping up the intensity, filling the mix with double bass and quick, tight snares. There are a few moments when it sounds like the drums could be triggered, but having seen what this guy can do, I think I’d give him the benefit of the doubt.\n\nThe guitars are a vast, vast improvement on the debut. There are lots of good riffs here, even if the downtuning and slightly rounded, muffled tone don’t let them really tear the shit out of the extreme parts and makes them groovier. Of course, on the plus side, it’s a groovy, catchy album that doesn’t have to skimp on actual heaviness. That full bottom end tone packs a mighty punch when ‘Ripped Apart’ erupts into death metal two thirds of the way through and keeps the simple riffs of ‘Before the Hangman’s Noose’ meaty and catchy, while contrasting wonderfully with the more complex blackened style of ‘Grinfucked’ (again the song becomes purer as it progresses) and the sharper sledgehammer and pickaxe groove-and-stab thrash of ‘Pale Horse Apocalypse’.\n\nA big plus for this album – and most likely the reason Devildriver are on Metal Archives at all – is the injection of melody and lead work into an otherwise slightly bland formula. There are some very modern attempts at melody on the scream-along ‘Hold Back the Day’ and ‘Bear Witness Unto’, but the genuine gold comes from the pleasant melodic leads that fit into heavier songs and sprinkle a bit of water on those dry, earthy riffs. The title track is actually a great melodeath song that shows the genre hadn’t run out of ideas by the end of the '90s. The lead melody still haunts me in the shower.\n\nThus The Fury of Our Maker’s Hand is either the heaviest and most technical nu metal album ever recorded or a very respectable slab of modern metal that shows brutal can still be catchy and catchy can still rip your nuts off. The songs aren’t all absolute keepers, but the 2 year transformation since Devildriver’s debut was astonishing, and this album is fun, furious, and not at all boring.\n",
        "\nFirst of all, let's make things clear: I love DevilDriver. I really liked The Fury of Our Maker's Hand, The Last Kind Words and Pray for Villains. Hell, I even liked their debut album! What in God's name happened to the DD that made those albums? Beast was ok in some ways, but they went a bit downhill then as it featured some really bad songs. Winter Kills takes all the bad stuff featured on Beast to form one whole album filled with even worse songs.\n\nThis album is total chaos. The guitarists are just mindlessly chugging their way into the album, without going somewhere with the riffs. Where are all the nice melodic, yet aggressive riffs from the previous albums? Some of this atrocious playing can also be heard on Beast. But they at least played some catchy and melodic riffs as well on that album. Some choruses are actually melodic and catchy, but that's not enough to get some extra points, not when they get back to those mindless chugs during the rest of the song. And why is there a lack of solos? DD has good guitarists, who can play very good solos with technicality. There are only 4 solos on this album! Dez, you have skilled guitarists, USE THEM! \n\nJohn Boecklin is often referred to as an underrated drummer, and that's very true! On Winter Kills however, he is delivering his worst performance ever. He was the backbone on all the others albums with some excellent drumming that got my head banging and made me wanna run my feet off. But now it seems he really didn't feel like giving his best. It's the same problem with the guitarists, just pounding away on the drums and not giving it too much thought. Compare some of the songs on this album with songs on The Last Kind Words and focus on the drumming, and you'll see my point.\n\nBut the absolutely worst performance is from the toughest guy of DD: Dez! He has always been shouting and screaming more than singing, but this is just over the top. He's constantly shouting with monotonous screams, it drives me nuts. It literally gives me headaches. There used to be some emotions in his voice and you could really feel them, and he actually sang for once and a while. Now it's just: look how though I can be. The lyrics are also the worst on a DD-album ever. Ruthless and Gutted is just laughable. What is he trying to prove? Beast already featured those kinds of songs with the badass attitude and almost nobody liked them, why do it again?\n\nThe 23% rating is because of three songs that are in fact really good. The Appetite, Haunting Refrain and the cover Sail are all very good songs. I don't know what those three songs are doing amongst the 8 atrocious ones but I'm glad they're there. Those are tracks where all the bad things I mentioned here above, aren't featured. They're catchy and melodic, but still aggressive enough. They feature good solos, and I can feel some emotions, especially on Sail. Speaking of, it's another really cool cover from DD. It might be the best song on this album. Which again reminds me of Beast, but now in a good way. Black Soul Choir was also an impressive cover track and it's personally my favourite song on Beast.\n\nI truly hope that DD quickly makes another album, that sounds a bit more like the 3 albums before Beast. I lost a bit of my respect after hearing Beast, and now I lost way more after listening to Winters Kill. I really hope they get back on track and make an album that get's me headbanging like I used too. Come on DevilDriver: desperate times call for desperate measures! You said so yourselves.\n",
        "\nGroove machine DevilDriver has been around for little more than 10 years now, and two years after the quite weak “Beast” returns to the scene with this “Winter Kills” of 2013. Since the inception of the former album, Fafara and company’s compositions have been lacking something. “Beast” didn’t have enough songs that could catch the listener attention or keep him attentive to the music, which resulted in a poor album. However, with this new delivery the band shows itself a bit more decided and with a clearer direction, though one can hear that they still have to work a little harder if they want to get out of the compositive hole they seem to have fallen into.\n\nIn “Winter Kills” the band shows a slight improvement, but they’re still not quite there. In this album, the band seems to have focused more on the melodic and catchy (yes, catchy, because if a song doesn’t “catch” you, you won’t have interest in listening to it!) side that former compositions didn’t have, resulting in a bigger inclusion of melodic choruses than those that we could find in “Beast”. The problem with that album was the pretentiousness of the songs it contained, which overflowed with fills and didn’t go anywhere and others were way too long for what the band plays. Nonetheless, with “Winter Kills” the group simplified their songs considerably, something that really benefited them. Now the songs sound more solid and everything seems to flow together, and the coherence between the musicians is noticeable. Despite this, several songs still fall to irrelevance because of this lack of resources to catch the listener’s attention that I’ve pointed out so many times up to now, only saved by the choruses, which make up for the mediocrity of the songs, building quite memorable passages. \n\nTaking back what I said in the last sentence, the strong side of the songs within this album are the choruses. Part of this is due to the little diversity respect to the riffs that accompany the verses. Many songs lack the catchiness and the groove of albums like “The Fury of Our Maker's Hand” or “The Last Kind Words” or the melodic side of “Pray for Villains”. Most of them start off well, like “Oath of the Abyss” or “Winter Kills”, but after their “intros”, they attack us with grooves that leave a lot to be desired and fail to cause something on the listener, besides that many of them don’t differentiate much from each other, since riffs found in songs like “Ruthless”, “Gutted” or “Curses and Epitaphs” follow really similar patterns. But on the other side we have the choruses, where both guitarists come up with very good ideas and catchy and melodic riffs that make us forget about the bland songs that we had been listening to. “Oath of the Abyss”, “Desperate Times”, “Winter Kills”, also “Gutted” and Curses and Epitaphs” or “Carings Overkill” are some of them, just to name a few. Even so, the band still manages to deliver some groove onslaughts like “Desperate Times” or “The Appetite” (which borrows some riffs from “Clouds over California”). \n\nThe musicians also seem to have recovered from what “Beast” was. On one hand we have John Boecklin with his once again excellent performance. This guy is one of the reasons why this band is still on its feet, Satan bless this dude. And on the other side there is Dez, who sounds way better than in the former album, where the variety of screams and bawls became really annoying after a while. What I read from an interview with Mr. Fafara was that they included the first takes of the vocals, the ones that would have been part of the demos, something that can be heard in the spontaneity of Dez’s voice and in the absence of unnecessary and annoying effects. Respect to the guitars, even though the solos are scattered throughout the album, their lead guitarist has been listening to Arch Enemy more than ever. He really likes Michael Ammot, as his influence is present in the solos of “The Appetite”, “Carings Overkill” or “Hunting Refrain” (this last one is really good). They’re also better worked-out, since they sound better from those included in “Beast”, which seemed to be there as something obligatory.\n\nIt seems that with “Winter Kills” they have found their way again, as the “irrelevance syndrome” had hit them quite hard, but they still have to work out some things if they want to bring something that is interesting to the table. After all, “not all who wander are lost”…\n\nOriginally submitted to http://theforlornson.wordpress.com/\n",
        "\nDevilDriver began just as vocalist Dez Fafara's old band, the nu-metal Coal Chamber, was nearing its demise. Now, Coal Chamber had achieved some moderate success with songs like \"Loco\" and always had a more gothic side to them than their contemporaries. Fafara's next band, DevilDriver, took a different direction musically, opening themselves up to a new generation of fans. The band's style doesn't so much fit into the nu-metal category, as it is more groove-metal driven and the songs are faster. The song structures, however, are simpler, with the band shooting for consistently fast and heavy material which seems to take influence from thrash in the vein of Metallica or Slayer, eschewing the often eerie elements of Coal Chamber. Fafara's vocals are suitably more aggressive, and there is less melody in his delivery.\n\nThe lyrical are often angry and hostile, such as in \"I Could Care Less\" and \"Die (And Die Now)\". Some of the lyrics cover the hardships of life and makes references to Hell and the devil (\"Don't you see, our lives are on trial now / and if we lose, we're going straight to Hell\"). The album's lyrics are generally not a far cry from the death-to-your-enemies, self-reflective type lyrics of many nu metal bands. However, sometimes this choice of topic does work well in a lot of music made past the nu metal era in the late 90s/early 00s. Some of these songs, for instance, are solid, enjoyable metal songs. My personal favourite tracks on the album are \"I Could Care Less\" (despite of course, the grammatical error which kind of irritates me. The only thing it rules out is that you don't care at all, which is what I think Dez Fafara was aiming for here), \"Swinging the Dead\" and \"Meet the Wretched\", which features a fast tempo change towards the end which I think works quite well. It's one of the few songs on here that demonstrates a change in speed and deviates a little from the simple structures of most of the songs.\n\nHowever, I will say that apart from my favourite tracks, I do not feel that there are many memorable moments on this album. Much of it feels quite derivative and many of the songs sound too alike. As I've mentioned, the tempos are consistently fast and there is little demonstration of musical complexity, meaning there is less of a variety in the songs to maintain the listener's interest. Coal Chamber was sometimes quiet and eerie when it wasn't loud and heavy, and the bass guitar always audible in the mix, but DevilDriver has no real quieter parts and makes less significant use of the bass, preferring to focus on loud guitars. Although that isn't necessarily bad, none of it is really anything special, either. The album doesn't break any new ground for the metal genre in general, but nor does it really sound like it is trying to. However, perhaps the band is simply happy enough to play music in this style, although it does not leave me hungry for more DevilDriver. \n\nI will say I have also listened to the follow up, The Fury of our Maker's Hand, although I liked it less than this album, finding it to be more of the same both musically and lyrically, and therefore, I currently have no intention of listening to any other DevilDriver albums. Any great band should have at least a few albums in their discography that make you want to listen to more until, eventually, you have the entirety of their discography. However, since I don't feel this way about DevilDriver, I will say that this album/the band is quite good, but not great. However, if you are short on consistent, fast, angst-fuelled groove/thrash metal in your collection, you could do worse than picking this album up.\n",
        "\nDevildriver are one of those bands i found myself liking but not sure why. I didn't get into them immediately, their first single was boring but later grew on me slightly (catchy riff). Second album even passed me by. After seeing them live i was hooked, from 3rd album onwards i was a big fan. After owning all their albums, i now only own the 2nd and 3rd ones. Beast is album number 5. In a word: rubbish.\n\nDevildriver tried to go harsher on this album. What they failed to realise is their best qualities were a combination of melody with (relative) brutality. Don't get me wrong, this isn't Suffocation. But they used a death metal influence to good effect until this album. The riffs are boring and recycled, only without the melody. Dull solos mostly. Bass? What bass? John Boecklin's drumming has single handedly carried this band for years. He's not the fastest but he's by far the best drummer from the metalcore scene with his varied fills and cleverly used double bass. in fact, this album probably only gets a score as high as this because of the drums.\n\nDez Fafara-what a shitty vocalist. Not as bad as in his Coal Chamber days, but still bad. I just hope they don't release a live album because he is now even more atrocious than on record. Is it a growl? A black metal screech? Most of the time it's a bit of both, and frequently terrible to listen to. His lyrics are even worse, all macho posing and wannabe tough guy bullshit with no depth.\n\nThe main reason this album suffers is the poor songs. As i said, the older albums had a good dose of melody mixed in. This doesn't and it only highlights how bland and generic the riffs are. There's no power here except the drums so it comes off as a poor effort. The only song i'd really recommend is 'Shitlist'. Despite the lyrics it's probably the most reminiscent of older Devildriver and goes at a nice pace. 'Lend Myself to the Night' is a decent track too but you'll have to sit through the other 11 tracks first and it really isn't worth the effort! If you want to get some Devildriver, get The Last Kind Words instead.\n",
        "\nIf you don't have the ability to respect something for what it is rather than what it is not, then do not read this review. You can't review this album like you would another metal album. It isn't really meant to be taken at face value. The musicianship is not nearly good enough and the themes aren't nearly as interesting as they could be, but it is an incredible album if you focus on its purpose. If you overlook its purpose, then you will find absolutely nothing good in it. If you're open-minded about heavy metal, then read on. If not, then go listen to something else.\n\nLet me start off with a simple contradiction; Devildriver's self-titled debut is a terrible example of metal, but it is still an incredibly good metal album. As other reviewers have stated, this album is thrash-meets-nu-metal. The song structures are very simple. The lyrics don't really have anything brilliant in them. The instrumental parts are, in general, very mediocre. However, that's where this album shines. It isn't trying to be a good album. This album is just trying to be as pissed off as possible. That is this album's only strength. While nothing else in it has a strong punch, the anger hits like a train.\n\nThe songs are pretty predictable in general. There's no sugarcoating that. Most sound the same. The core elements that this band uses, which are thrash metal, groove metal, and nu-metal, never change.\n\nThe lyrics don't exactly deserve an award, either. \"Nothing's Wrong?\" is basically saying that someone (the subject that the speaker is talking to, who I'll refer to as X) is in the speaker's (who I'll refer to as Y) way. \"I Could Care Less\" doesn't really go any further than the title of the song. \"Die (and Die Now),\" like \"I Could Care Less,\" doesn't really move any further than the title. Y tells X that Y wishes X was dead. \"I Dreamed I Died\" is a bit of an awkward song when it comes to the theme. Y dies, goes to Heaven, and a Saint told Y that Y did a good job. \"Cry for me Sky (Eulogy of the Scorned)\" is somewhat emotional and somewhat distressful, talking about death and pain. It doesn't really go any deeper, though. The lyrics continue on in a fashion very similar to this. The lyrics, to be honest, are on the same level of crappy as Children of Bodom's lyrics.\n\nThe musicians are all competent and nothing more. They can play their instruments, but there really isn't anything spectacular about them. The drummer knows his way around a double pedal and has a tiny bit of dynamic contrast with occasional buildups. The guitars chug along on the low strongs. The bass is audible enough at points, though it lacks innovation. The vocalist, while not being annoying, is far from an expert with his voice. It works, though. There's nothing really remarkable that can be heard.\n\nHowever, there is a huge saving grace. Unfortunately, it lands Devildriver in a VERY bad category. This category is shared by Static-X, Children of Bodom, Chimaira (though Chimaira is, in my opinion, far above most of the bands here), ill nino, old Slipknot, The Black Dahlia Murder (I respect them, but to me, they still fit in this category), and other bands ilke that. The only saving grace of most of them (minus Chimaira and TBDM) is fury. Devildriver's entire discography is basically a heavier, faster, and more pissed off version of Godsmack's \"I Fucking Hate You,\" which, as I'm sure we all know, is another really crappy song. If Devildriver did not have fury, Devildriver would have died a long time ago.\n\nWhat makes this album good is its unrelenting fury. This album is not heavier or more technical than death metal bands like Origin and Fleshgod Apocalypse, but I would pick Devildriver over those two any day if I wanted an album filled with pure fury. That anger never lets up. I don't know if anybody else feels the same way that I do about bands like Origin and Fleshgod Apocalypse, but I can't listen to them when I want pure rage. They simply do not have it. Black metal doesn't have it. Death metal doesn't have it. Only the thrashiest metal can ever speak to me when I get really angry, so that's where Devildriver has found its niche. Devildriver CANNOT compete with any extreme metal band or any classic metal band on any level except for in furious rage.\n\nMetal is supposed to be a pissed off genre of music in general. I'm just thankful for bands like Devildriver, Static-X, and even Children of Bodom (First four albums. Everything after Hate Crew Deathroll sucks.) when I'm angry. They are the only bands that really seem to have any bit of a grasp on that fury. Of course, the music is still stereotypical mallcore garbage. However, at least bands like Devildriver can serve an actual function in society. Devildriver drives a trash truck of metal. That truck smells horrible, but at least it performs one vital service very well.\n",
        "\nDevildriver's sophomore album, The Fury of Our Maker's Hand is a huge step forward for a band that started off as the offspring of frontman Dez Fafara's previous nu-metal band Coal Chamber. But those nu-metal influences are almost nowhere to be found on this album. The band has improved on all fronts, and the things that made their debut slightly above average are gone.\n\nLyrically the band has taken a great leap forward. The catchy but simplistic lyrics from the self-titled album have been dropped on The Fury of Our Maker's Hand. Previously, the band basically picked a catchy phrase like \"Swinging the Dead\" and repeated it seemingly endlessly during the song's chorus section. The lyrics on DevilDriver also had a slightly hip-hop inspired feel to them, like on \"I Dreamed I Died.\" On their sophomore album, this has been replaced with more potent and better written lyrics. \n\nDez's vocals have greatly improved since Devildriver. The amatuerish, frog like croaking sounds, have been replaced with more skillfull sounding growls and shrieks that are more death/thrash metal esque. This combined with improved production makes Dez sound much better than he previously did on DevilDriver. \n\nBut the biggest improvement is in the musicianship and songwritting of the band. The band has transformed their sound into a thrash/melodic death type sound, establishing the band in the groove metal genre. However the greatest improvement is in the guitars, which now sound much more harmonic and groove metal oriented. This improvement can be seen on \"Hold Back the Day,\" and \"End of the Line.\" \n\nHowever, they still have problems with sounding metalcore. \"Pale Horse Apocalypse,\" and the albums title track instantly make me think of a heavier, more pissed off Unearth, \"Just Run,\" is simply awful,\" and \"Ripped Apart,\" although catchy and somewhat enjoyable, sounds a tad bit too mallcore. It's like a child growing up who can't throw away childish things from his past and mature completely. That's the only thing holding DevilDriver back, if they'd 100% drop all metalcore or nu-metal influences they could realize their potential.\n",
        "\nIf their was a single album that introduced me to metal, than Devildriver's self-titled debut is it, and this is probably why I like it so much. At the time, I was a huge fan of hip-hop/rap, and believed all metal to be a bunch of rednecks screaming into a microphone. And then one day my cousin and his friends in an attempt to drive me insane, played this album in the car we were riding in and much to their surprise, I enjoyed it.\n\nAs many fans and critics of the album will point out, vocalist Dez Fafara was also the vocalist for the failed nu-metal band Coal Chamber, and Devildriver's debut contains the lingering effects of this. There are similarities with the now defunct Coal Chamber, and even other nu-metal bands like Korn and Static-X. Despite this, it is still a decent album and a definate improvement from Fafara's nu-metal days.\n\nHere are my main problems with the album, my first problem is the lyrics. The lyrics to just about every song on this album are below average and at times just plain dumb and pointless, yet they still tend to be annoyingly catchy. Anybody who has listened to hip-hop/rap songs where the artist can't think of anything meaningful to say so just picks a catchy phrase and repeats it over and over throughout the album will know what I'm talking about. \n\nSecond, Dez's vocals sound like a weird combination of a frog and someone like me trying to do metal vocals. The result is that the vocal's sound very amatuerish and sloppy. Fortunately, on later albums this would improve along with the lyrics.\n\nMy last main problem with the album is that the musicianship of the band. The album to me sounds like a nu-metal band trying to play real metal. Picture if you will Static-X doing covers of Slayer and you'll get the picture. The guitars essentially do the same thing on every track, and there isn't a single solo to speak of. There are some good riffs, like on the beginning of songs like \"I Could Care Less,\" \"The Mountain,\" and \"Swinging the Dead,\" but all the other guitar parts are nothing special.\n\nThe drumming sounds pretty simple. Think of it as being in a math class and to solve twelve problems you have to use the same formula over and over again. That's what Devildriver did with the drums and the band did for the entire album. However, at some points, like during the chorus on \"Die (And Die Now) the drumming does seem halfway decent but not enough to make for the albums other faults.\n\nI would only really recommend this album to diehard fans of the band, and to people who haven't heard anything heavier than Korn or Linkin Park, and think that its a good gateway to heavy metal for some people.\n",
        "\nIt was only about a year and a half after the release of Pray for Villains that DevilDriver announced that they had finished the recording for Beast and were going into mixing. My first thought was, \"well this seems a bit rushed.\" Sadly, I was spot on. \n\nBeast sounds like a DevilDriver album at its core, but something is different. The impressive drumming is still there as are Fafara's rough(love/hate) guttural vocals remain unchanged and Kendrick and Boecklin -who have shown to be one of the best lead/rhythm combos in commercial metal- prove that they can still write some impressive melodic harmonies and solos, but these take a back seat to Fafara('s awkward attempts to come off as much of an angry, violent bastard as humanly possible), which is a huge shame because to be completely honest, he is least appealing part of DevilDriver. \n\nStylistically, some songs are more reminiscent of Fafara's old band, the universally berated Coal Chamber. Famous for overly aggressive lyrics and little -or no- melody on certain tracks. It's obviously not nearly as bad as Coal Chamber, but you can hear its influence clearly on songs like Blame Game. \n\nFor example, take a good DevilDriver song ( Tirades of Truth - Last Kind Words), and a random song off beast, (Blame Game). Now listen to one after the other. Tirades starts off with a slow double kick beat, followed, by a fast catchy harmony, then a thrashy bit, to a melodic chorus and so on. Blame Game however, it pretty much 4 minutes of verse, which you are constantly waiting on to kick into a crazy melody or a solo that us DevilDriver fans have grown to love, but it never really comes.\n\nIt kind of feels like these are a bunch of songs Fafara had written for Coal Chamber and pitched them to DevilDriver who only just managed to make the songs semi listenable. For example, Hardened has really interesting guitar work around the 3'50'' mark, but its way to short, and overwhelmed by a mediocre body and then followed by and equally mediocre conclusion. \n\nThe two songs that really stand out to me off the core album are Black Soul Choir and Crowns of Creation, and it seems the rest of the stand out songs only come with the SE of the album, namely Fortune favours the brave which I believe is the only song that truly acts on their promise of \"returning to the Last Kind Words feel\" complete with interesting melodies and all.\n\nOverall, it’s not the worst album ever, but it is definitely a huge disappointment. C'mon DevilDriver. We know you can do better than this.\n",
        "\nI've already documented the impact Dez Fafara has had in my own personal journey with metal. In short, I was a budding metalhead in the mid- to late-90's, and Coal Chamber was one of my favorite bands. They were better than most other nu metal because they had an angrier, more evil sound. And then Dez started DevilDriver, and The Fury of Our Maker's Hand was an important stepping stone for me into more extreme music. \n\nYou're probably already familiar with DevilDriver, since they're one of the best-known bands in what's sometimes called the New Wave of American Heavy Metal. The style is similar to others in the NWOAHM (like Lamb of God, Machine Head, and Dååth), i.e., an aggressive brand of groove metal strongly influenced by the Gothenburg melo-death sound, and recorded with perfect production. You know what to expect, and DevilDriver doesn't stray from the formula. Since there's nothing new, the album can only be judged on the strength of the performance and the songs.\n\nThe performance is as strong as ever, with every instrument doing exactly what it's supposed to do, and doing it with feeling, as they say. Dez Fafara has convinced me (for the umpteenth time in the last decade and a half) that he is one of the most charismatic frontmen in metal. That's not to mention his nails-and-battery-acid gargled voice, one of the most instantly recognizable, aggressive, and all-around perfect voices in metal. Nothing at all is missing from this performance.\n\nThe songs aren't the strongest the band has ever offered, but none of it's bad. There are only three real standouts (\"Dead to Rights\", \"Shitlist\", and \"Black Soul Choir\"), but there are also only three songs you might want to skip (\"Bring the Fight (to the Floor)\", \"Talons Out (Teeth Sharpened)\", and closer \"Lend Myself to the Night\"). The rest of it's solid, if predictable material. And you can't really go wrong with that. But this kind of album shouldn't go on for 55 minutes either (you're not doing anything artsy here, and this isn't funeral doom), so it is a tad long. Unless you skip those three weaker tracks, because then it's perfect.\n\nThe Verdict: Yeah, it's predictable, but it's also good.\n\noriginally written for http://fullmetalattorney.blogspot.com/\n",
        "\nDevildriver - Beast\n\n\nFor those of you who didn't like the more melodic approach on Pray For Villains (I did) you can relax because that's over. This album delivers a heavier approach to the Devildriver formula. At first glance at the title and track listing it appears Devildriver went back to the elements and influences that drove their self titled debut to shit with a few peanuts. I am glad to tell you this isn't true though the album is far from holding up to The Fury Of Our Maker's Hand. As the title suggests this album delivers some good fight/workout songs. \n\n\nAnything Brutal?\nNo. Simple groove metal tracks with other influences that at times can either mix nicely or come off feeling forced in. Dez stated before in many interviews that he thought the band wouldn't start to shine until the 5th-10th albums. Unfortunately he was wrong about this one. The only Devildriver album this one beats is their debut which isn't saying much. Not that this is a bad album. Tracks like Blur and Bring The Fight (To The Floor) make some of Devildriver'a best work but other tracks just don't hold up to previous work.\n\n\nWhat About The Bonus Tracks?\nI often find that Devildriver's bonus tracks excel the rest of the album. However these are typical bonus tracks: very simplistic stuff that you can't get \nmad at the band for making because, well, they're bonus tracks. The best on being Fortune Favors The Brave with a more complex delivery than the over simplified Lost. I would only suggest the special edition to those interested in the band's documentary.\n\n\nThe most standout track is The Black Soul Choir. This is because it is a remake of a country song by an \"artist\" I've never heard of nor can remember (but this is metal archives not hickibleontheinternets.com. This is the best song on the album mainly because it IS the definition of melodic death metal. I've never thought of any of Devildriver's work to be melodic death metal until I heard this track.\n\n\nTo some it all up if you're looking to get into Devildriver I'd suggest The Last Kind Words or The Fury Of Our Maker's Hand as opposed to this, but current fans should be pretty happy, especially the ones who did not like Pray For Villains. The standout musician on this album would have to be (as usual) the drummer.\n",
        "\nDevilDriver is a band I’ve always found to be a starter metal band. I fell that they aren’t bad, nor are they good, but they certainly aren’t talented. Dez Fafara is best known for being in this band, and in the early 90’s, he was also in a Nu-Metal band called Coal Chamber. Throughout the years, DevilDriver has changed their genre, but kept the overall sound as the second record, Fury of Our Maker’s Hand, but at the same time continued to be highly boring. I will admit that their early stuff (namely that which is on their self-titled release) is horrible, but their newer stuff is not much better.\n\nBeast starts out with DevilDriver’s signature groovy sound and then just goes into Dez’s intangible screaming as always. Is it possible to have maybe a song that might be instrumental, slower, not hardcore influenced or possibly having some melodic vocals? For DevilDriver, probably. The release sounded exactly like Pray for Villains, and overall, was the same songs packaged with new names and a new artwork. It’s hard to even say anything nice about this release, but there is one good thing: the drums. Their drummer, John Boecklin, is probably the most talented member in their band, and he truly shows that in this release. It’s good to see that he can still throw out some intense beats, especially shown in the song, “Shitlist”. The overall feel of the drums, however aren’t fitting for the music, and often overpower the guitars or the singer (ref. “Talons Out”)\n\nThe rest of the instrumental portion of the band is very stereotypical groove metal. I never really had much of an interest in hearing the same chordal structure, the same solo structure, same pentatonic feel over and over in a release, but DevilDriver did it. And they’ve done it since the beginning of their band. Their guitarists don’t really focus on fitting with the music, but rather sound like they try to improvise the tracks after the drummer tracks his portion. It’s strange, but I don’t think I even heard the bass once in this album either, and that is a sincere put off.\n\nOverall, this album is mediocre mallcore groove metal blandness at it’s very best. I’d say that you should stay away from this record unless you’re a die hard fan (if you are, I’m so sorry) or if you want to torture yourself writing a review about a shitty album for about 30 minutes.\n",
        "\nLet it never be said that Devildriver don’t know how to blow minds. Originally a glorified nu-metal band without the rapping and with less lame, Devildriver first wowed everyone over with Fury of our Makers Hand, followed by an equally well-received and somewhat better Last Kind Words, which made everyone think again when they released the incredibly limp-wristed Pray For Villains. But Beast... just blows all that out of the water. In an interview with Dez Fafara about what to expect in Beast, he stated 'Its gonna have more punk... and Terrorizer readers will like it' (or something along those lines, I'm not perfect). \n\nSo what do we have?\n\nFirst off is typically DD named 'Dead to Rights' which, for no real obvious reason sounds ALMOST EXACTLY like Meshuggah's 'Bleed' (follows the same polyrhythm of 23/16). Well I cant say anything other than that because that’s what it is, its just pure chuggggggggg for like 10 awesome seconds. And the song is entirely devoid of actual melody. Outrageous, Devildriver have their hands deep enough in the Gothenburg riff bucket of somehow limitless ideas so why suddenly go full on death metal? What am I saying, this is what this band do, pulling random tricks out of the hat like some very modest magician with a 4 foot hammer. \n\nThis trait of non-melody actually continues until the second half of the 3rd song (Hardened), without ignoring the blistering 2nd track 'Bring the Fight (To The Floor)'. This is some serious guitar work they're pulling out for the solo, only a few moments in Pray For Villains could be close in technicality. \nTrack 4, the expectedly (and badly) named 'Shitlist'. Bad name, very very good song. This is more like true Devildriver, a very 80's thrash intro and some highly catchy leads flying off over th- WAIT WHY IS IT SUDDENLY TECHNICAL DEATH METAL, oh wait its back to Devildriver again and I spilt my drink. This song has a high tendency to switch between Scarve/Hacride style technical metal and highly melodic groove/thrash. And it only took them a year to do this after PFV? This is seriously promising material up to this point. \n\nThe general trend of this album is that for every melodic lead and riff there is an equally dissonant or (excuse the phrase) 'loopy' riff that just bounces and grooves over the (as always with DD) explosive drumming. The more obvious element I seem to be getting across is that a lot of this album is very 1990's death metal, caught in that shortly lived spot between pure death metal and proto-Gothenburg with some heavy progressive influences. In fact there are many new influences to Beast, without needing to mention the Meshuggah worship in the first song: the melody incorporated in some of the songs is of a somewhat Asian influence, the riffs are just that much more complex with an almost 'djent' sound to them, the punk is there in spirit more than music as everything is so much more aggressive and... just not Devildriver. At all. \n\nDez himself has outplayed himself on this one. I don’t think even he realizes how well he has done. Although Devildriver are popular enough to have 'good' production, Dez sounds like he’s just got the closest thing that is roughly microphone shaped and blasted it into oblivion with his voice. Still having the half-scream/growl that didn't sound that great on previous albums, Dez has adopted a tendency to add a vocal layer of grindcore style screams to nearly everything and the metal purists are most likely laughing their faces off as they read this but who cares? THIS IS WHATS IN THE ALBUM, its just how it is and I'm as perplexed as anyone. \n\nOne notable highlight of Beast is the song 'Black Soul Choir'. This is pure melodic death metal, amped up to extremes with blast beats aplenty. Nothing in Devildriver's past material really comes close to this one song. Apparently its a cover of a country song by 16 Horsepower... I'm not sure what to make of it now. NOTHING IS CERTAIN, ARRRG. \n\nThe song right after (Crown of Creation), coincidently, follows a very similar vein but is more of a short and sweet intro with some very typically Devildriver style 'southern groove' riffing and a moment of dissonant and very odd melody. One hell of a song...\n\nI am really not sure of what to make of this album. I'm sure of anything any more. Its more avant-garde than anything Devildriver have done before and yet its less like their previous material, save the lyrics. There are some powerful and melodic moments, some progressive moments, hugely addictive moments, massively headbangable moments, outright laughable moments (most of the bonus track 'Lost' being one of them, seriously, its just an elongated chromatic power chord slide over the fretboard repeated over and over for full comic effect) all glued to a death metal base. And somehow its the best material they've ever written and its still not exceptionally good, just.. (thankfully) different. \n\nI guess all I can say is that to newcomers, this is Devildriver, and to the existing fans, this is most certainly not Devildriver. This rips the shit of LoG, thats for sure...\n",
        "\nDevilDriver have been, in a career that astonishingly has yet to cover even eight years as of this writing, a near-perfect model for the upward curve of a metal band’s sound. With every release, they’ve gone from strength to strength with a fantastic sense of self-possession; they shook off the cobwebs of Coal Chamber with the eponymous debut, cemented their sound with the ferocious ‘The Fury Of Our Maker’s Hand’, and delivered a powerblast of brutal good times with ‘The Last Kind Words’. \n\nAlbum No. 4, then, perhaps called for a consolidation of their position, the last nail in the coffin that will forever put to rest the absurd issue of ‘credibility’ that follows this excellent band around like a bad stench. What ‘Pray For Villains’ needed to do was silence every doubter, and establish permanently that this band is a primal force you dare not mess with. \n\nHow sad, then, that instead of that glorious metallic vision, ‘Pray...’ ends up us something of a strange blip on the screen; an experience that, once over, you don’t really recall much of, only a vague sense that it wasn’t much worth it in the first place. After three consecutive leaps in aggression and a steady rise in songwriting quality, ‘Pray...’ represents a sort of musical stutter, a momentary halt for DevilDriver to make sure their footing is still firm. To be sure, that perfect model hasn’t started descending just yet; instead, it’s levelled out, and after such an impressive incline, the results are a touch disappointing.\n\nTo be sure, this is certainly not the worst album you’ll ever hear – it’s not even much of a ‘bad’ record to begin with. Nothing here will offend your sensibilities, and no-one in their right mind would ever be able to get their ‘sell-out’ finger a’pointing at ‘Pray...’, not least with a faint, almost proggy spice lingering in the mixing pot. The album isn't shy of its share of belting fist-pumpers, either; from the fantastically balls-out title track, through the paean to The Wretched that is ‘Another Night In London’ right up to the devastating pounding of ‘Pure Sincerity’, there’s no shortage of pit anthems to get stomping along to. And yet...\n\nFirst off, there’s absolutely no getting around the fact that the production, supplied here by Logan Mader (formerly of Machine Head), has neutered the sound almost completely, and is the factor that almost ruins the record. Whereas ‘Fury...’ was delightfully no-frills and lean, and ‘Last...’ went all out with a rich, fat, meaty mix, ‘Pray...’ sounds exactly like what it is – overlayed into oblivion. The whole affair sounds light, airy, the individual parts seeming to be hanging loose from the whole. Frontman Dez Fafara suffers the worst of it; the man who has been the valiant spear point of DevilDriver’s attack since they began now sounds like his snarls and shrieks are being drowned in a thick treacle of overdubbing. And while performances all round are uniformly top-notch, the technical expertise far outstrips most of the songwriting, which on the likes of ‘Forgiveness is a Six Gun’, ‘It’s In The Cards’ and ‘Waiting For November’ seems to be positively straining to maintain a hard-hitting edge.\n\nAs mentioned, the album is far from painful to listen to, nor does it necessarily a significant dip in DevilDriver’s quality. It’ll win no prizes as the album of their career either, but to write off a band who can still pull astounding material from even the lower points in their work (the title track truly is a stunner) is pure folly. Treat ‘Pray For Villains’ instead as an oddity, a strange pit stop on a journey that, with luck, will just get smoother and smoother in the years to come.\n",
        "\nPrior to this, I had given my views on Devil Driver's later career in which I gave them varying levels of praise. Personally, I view their work between 2005 and the present as somewhere between interesting and excellent with nods to \"Fury of Our Maker's Hand\" and \"Pray for Villains\" respectively. As such, I decided to lend some views on the band's self-titled debut, and how the level of quality, both in music and performance, is staggering compared to their sophomore effort. \n\nWhat we have on \"Devil Driver\" is basically a new band trying to find their way. Perhaps the nu-metal and post-thrash (or groove metal, whatever you care to name it) stylings, which play a very heavy hand here, are something of bridge between Dez Fafara's ill-fated Coal Chamber project and the work he has contributed to this band since. The \"melodic death metal\" genre has also been applied to this album, which holds some truth, albeit those influences are very loose and can generally only be detected by Fafara's vocal stylings, which were essentially a much shoddier version of what they are today.\n\nThe music here is very simplistic, which takes an obvious nod to the derogatory \"groove metal\" term as this reminds me of the level of effort that Skinlab often employed (just a hair below \"half-assed\") but without the melodic death metal inspired vocalist. The bass takes an unusual prominence at times, which is another nod to the nu-metal style, particularly since the work put into the bass is rather sloppy on a level only Fieldy or Sam Waters could truly appreciate. The drums don't hold much of an impressive condition with me, which is unusual, given that John Boecklin is one of the more talented members in this group (something he has proven on subsequent releases.) Possibly the most disappointing individual in this group is Dez Fafara, especially anyone working their way back in Devil Driver's catalog. His vocals are utterly annoying not to mention his performance both sounds forced and unnatural. He's corrected this in later years, going from his performance here as a Gothenburg inpersonator on karaoke night to a more respected and individualistic vocalist.\n\nA good portion of these songs often run together, which is not a good quality to have when even the better moments of this album sound like a parody of the post-thrash and melodic death metal styles. Both \"The Mountain\" and \"Knee Deep\" possess more interesting bits and pieces of the overly simplistic songwriting at work here, and take my vote as the better songs here. The singles in \"Nothing's Wrong\" and \"Swinging the Dead\" would have been decent songs had they been more memorable, and in the case of the latter I agree that the title is repeated far too much. An overload of repetition in the song titles (in the chorus or elsewhere) is a common flaw on this album, which is where the bulk of the negativity over this release being meant for radio attention only is probably coming from. That, and a general lack of interesting ideas that can only be rivaled by Damageplan's \"New Found Power,\" though at least that release had Dimebag Darrell who managed to write a few interesting though brief solos.\n\nConsidering how Devil Driver would play out years down the road, this is nothing more than a historical piece on the band. It shows where they began at and how they would progress to the better \"The Fury of Our Maker's Hand\" before ditching the nu-metal meets post-thrash concepts thereafter. In any event, its a very poor release by any stretch of the imagination, though I rewarded a better grade than \"New Found Power\" (the only comparable release of this same time period with the same stains of shitty music quality) because its easier to stomach as a whole. That said, I'd still encourage anyone to avoid this as the previous reviewer noted and this especially includes Devil Driver fans who enjoy \"Last Kind Words\" and the like. Bottom line, this was a mere evolutionary step for this group who has gone on to much better things, and this release is to be avoided.\n",
        "\nThere is a reason why most thrash metal fans are completely turned off by its modern offshoots, and it is pretty well displayed in the early works of DevilDriver, a band that has been given a lukewarm reception into the metal world since releasing some qualifying, though not necessarily stellar Melodic Death albums. Combine the most banal elements of 90s Slayer with the most redundant elements of early Machine Head, then maybe throw in a few token riffs paying homage to older Slayer and the Teutonic Trio, then either tune down to ludicrously low levels or employ a muddy sounding 7 string guitar or two, and you have a rough idea as to the musical workings at play here. The worst of 90s Annihilator, the dregs of Pantera, they all pale in comparison to the utterly monotonous and predictable results of this formula.\n\n“DevilDriver” represents the de facto pinnacle of the nu-metal craze before the mainstream took on an interest in metalcore, with all of the half-assed ideas and minimally constructed fluff that goes with it. If luck would grant the listener the luxury of a song with more than 2 riffs, it will only be in the form of a breakdown section that employs a slightly varied version of one of the two former riffs. Even when a mildly interesting idea like that Kreator inspired tremolo riff at the beginning of “Nothing’s Wrong”, or that heavily Slayer oriented flurry at the beginning of “The Mountain”, it’s only an occasional respite from an endless barrage of hypnotic single note chugs and groovy half-riffs. Forget about guitar solos, for those who may inquire, this band is here for radio play on this album, and can’t be bothered to put that sort of effort into turning mundane crap into something mildly listenable. Such pursuits are reserved for Dimebag Darrel and other musicians who never completely got out of the 80s.\n\nBut amidst the drab guitar work, formulaic drumming and non-existent bass, a lone impresario emerges in Brad Fafara to bring that new school wigger goodness to those who crave it. To be fair to the former front man of mallcore extraordinaire outfit Coal Chamber, at least he doesn’t sound like Jonathan Davis or Mike Patton. Having said that, he often resembles that ear grating gravel pit David Draiman, but with a slight tendency towards Mike Stanne and a few other melodic death vocalists, albeit a pretty piss poor interpretation of the latter. A classic example is that annoying chorus to “Swinging The Dead” where the song’s title gets pounded out over and over ad nauseam in the most annoying, semi-guttural homage to “Down With The Sickness” way possible. If there was anything truly redeeming about this album, Dez essentially kills it over and over every time he opens his mouth.\n\nThough there was a level of improvement in the product pushed by these guys later, “DevilDriver” is essentially little more than a slightly more thrashing version of Slipknot. Some may like being subjected to the same utterly rudimentary formula 12 times with almost no changeups to speak of, but I don’t count myself among them, particularly when said formula was done better and with more balls 15 years earlier, without needing to out down tune Tony Iommi I might add. Even fans of the grooviest and boredom soaked version of Melodic Death Metal are encouraged to avoid this.\n\nOriginally submitted to (www.metal-observer.com) on March 9, 2010.\n",
        "\nWhen discussing the band Devil Driver with those of the metal community, one should always expect a fair amount of buckshot thrown into the conversation. This intense dislike of all things Devil Driver often stems from their frontman in Dez Fafara, who was once the frontman for goth/mallcore tragedy known as Coal Chamber. Not only that, but saying that this band's first two efforts weren't very impressive is putting it mildly, even if \"Fury of Our Maker's Hand\" showed more than a little potential from this band.\n\n\"Last Kind Words\" is a welcome change from the nu-metal and groove metal tendencies of this band's earlier career. Here, we can examine a band in transition, one who has realized their flaws and made the best decision in seeking a new style to play. The style that the band adopted here seems like a combination of heavy metalcore and melodic death metal influences, with some groove metal and very slight thrash thrown in for good measure. Interestingly enough, this style has been played to death by other outfits, particularly bands like In Flames, The Haunted, etc. That being true, one would imagine that \"Last Kind Words\" might sound like a tired, generic throwaway album. Surprisingly, it isn't, and for some odd reason everything here sounds rather fresh and unique to the band.\n\nOf course, the biggest cornerstone to Devil Driver has got to be Dez Fafara. The much belated frontman of Korn-meets-eyeliner in Coal Chamber is long gone, and I'm very happy with what has emerged from the ashes. Dez's voice is certainly a unique snarl, which helps distinguish his band from others at times and in some ways is a saving grace to the band. This isn't meant to imply that the band as a whole is awful, far from it, but without Dez on the vocal front I feel some of these songs would be interchangable with other acts out there.\n\nAlthough I wouldn't say there is a tremedous amount of variety here, the band does manage to split their songs up where various influences take center focus. \"Horn of Betrayal\" and \"Bound by the Moon\" are two favorites of mine here, and both bring out the melo-death influence, right down to Dez's vocal performance. \"Clouds Over California\" is faster, and while I wouldn't call it thrash, it definitely picks up the pace in a respectable manner. \"Not All Who Wander Are Lost\" and \"Burning Sermon\" both seem to bring about metalcore influences, which doesn't make them overly terrible but also doesn't make them stand-out. \n\nAnother notable song would include \"Monsters of the Deep.\" Its not a very fast nor heavy track by other standards set on this album, but it almost borders doom metal in some ways. In addition, the bass lines add a sinister vibe to the song which you don't hear much of these days. \"These Fighting Words\" stands out as being more memorable than most other songs here, thanks to a powerful chorus that keeps it running in your mind long after the song has dissipated. Yet I feel the best song was saved for last in \"The Axe Shall Fall.\" Listen to that song, and notice how everything simply falls into place, even the keyboard outro took me by surprise but strangely did not feel out place.\n\nAside from a few songs running together, my experiences with this album have been nothing but positive. It isn't a jaw dropping epic by any means, but ironically this much hated band seems to have put many of their peers to shame with this one. That said, I truly feel like the band didn't reach their full potential on this album and what they began here would only be refined on the next album. In any event, \"Last Kind Words\" dwarfs its two predecessors and is a good all around metal album, especially for the standards of our time. This, along with \"Pray for Villians\" is something any Devil Driver fan should look into and makes an excellent starting place for the curious listener.\n",
        "\nWhen one considers Dez Fafara's back catalog and his time in the comical nonsense of the mallcore with eyeliner abomination in Coal Chamber, its easy to understand why most metalheads do not take a liking to Devil Driver. After all, no one would accept Jonathan Davis or even worse, Fred Durst if they popped up with a more respectable metal act, no matter how impressive the other musicians were. Given that Devil Driver have forged a unique career for themselves by evolving their sound further with each new album, they stand amongst some of the more impressive bands to arise out of North America in the last decade or so.\n\nThe crucial moment for this band actually came after the self-titled release. The \"Devil Driver\" album was basically post-thrash meets mallcore with snarling vocals, which came off slightly less half-assed than Damageplan's \"New Found Power.\" It was still nothing great and definitely nothing to either build a career upon nor convince metal fans that Dez still wasn't still kicking it with the idea of nu-metal mediocrity. Yet when the original guitarist left the band following the self-titled release, a new transition began to take hold, one that would open up a far more creditable and sustainable career than before.\n\n\"The Fury of Our Maker's Hand\" is a pretty unique album, not only because of the band involved but also because of the concept. Its still engrained in some aspects of mallcore, such as the downtuned guitars and a heavy reliance on catchiness, not to mention a shortage of impressive soloing. The bass still has prominence, though not as much as before and is far less sloppy. This helps bring out the improvement on the guitars, which now have some decent leads and leaves behind the Neanderthal concept of dumb-assed \"stop-go\" riffing. The drummer has also stepped up his game, going on to become one of my favorite members of this group. His performance here isn't exactly awe-inspiring, but its a definite upgrade from before.\n\nTo truly grab hold of the changes, we need to discuss the songs. From the very beginning, one can hear the obvious differences between \"The End of the Line\" and the sloppy mess off the self-titled. This continues with the grinding \"Driving Down the Darkness\" and the interestingly titled \"Grinfucked.\" The band even rolls out a few ambitious tracks, such as \"Hold Back the Day,\" \"Sin & Sacrafice,\" and the title track. None of these are truly incredible, at least not in the context of more epic works by other bands of the era, but they're definitely gateway into where this band would go later on.\n\nDespite the upgraded sound and quality of the album as a whole, my problems deal with the lack of variety. Most of these songs play out in a similiar fashion, running off the chunky, downtuned riffs and Dez's snarling vocals. This works for a good deal of them, but it also causes many of these songs to run together, thus making recalling them pretty difficult. \"The Fury of Our Maker's Hand\" is a twelve track, 50+ minute album, and I can only recall about half of them after not listening to the album for three days. That fact does not help Devil Driver succeed in making an incredible listen, instead something that listens fairly well for most of its duration but never striking awe into the listener. \n\nAs much flak as Devil Driver gets, I personally think about half of it is pointed in the wrong direction. Most of the hostility spurs from Dez's past in Coal Chamber and the band's unwillingness to fully let go of the nu-metal tendencies until \"The Last Kind Words,\" which came out after this one. That is the wrong reason to hate this band, as the amount of quality material they've put forth matches, if not supercedes most others on the American front. Love them or hate them, they've carved out a sound that is their own, thanks largely to the most controversial guy in the group, Dez Fafara. Still, everyone is their band was putting a good effort into this album, and while it lacks the intricacy of \"The Last Kind Words\" and \"Pray for Villians,\" I find it to still be rather enjoyable. Devil Driver fans will certainly appreciate this, though I'd advise curious listeners to seek out \"The Last Kind Words\" first, as it displays more of the good aspects of this band. \"The Fury of Our Maker's Hand\" is a good release for the band, one that was crucial to their career, but the uninitiated might find the music here a little too hard to grasp onto.\n",
        "\nDevil Driver has been a favorite punching bag of the metal community for a while now, alot of it directed at Dez Fafara. I was never a friend of Coal Chamber but I did like Fafara, and like I hoped, he left that horrid band for something with far more lasting potential. Since Devil Driver's self-titled debut was a pain to withstand, I wasn't exactly charged with excitement to hear anything else by them. \"The Fury of Our Maker's Hand\" and \"Last Kind Words\" were both steps in a better direction, even honorable mentions in terms of quality. \n\nDevil Driver make their largest improvement in terms of maturity here on this release. It carries a more melodic tone to some of these songs than previously encountered, but it holds up fairly well. While this album does take influences from some new areas, like Pantera-inspired groove for instance, it still retains alot of the aggressive nature of earlier songs. I'd even go so far to say that it surpasses previous albums on that level, as well it proves to be a more quality release in terms of songwriting. \n\nSongs like \"Fate Stepped In\" and the title track are both examples of Devil Driver maintaining their older sound. Other songs like \"Pure Sincerity,\" \"Back with a Vengeance,\" and \"It's in the Cards\" all show some Pantera-inspired Southern groove metal thrown in, but this still retains more of the band's sound from the last album, running off the wells of melo-death and a tiny bit of thrash. Despite throwing in some influences that could otherwise de-rail this effort, the band puts them in the right amounts or at the right times so everything holds together for what I consider their most impressive album to date. \n\nWhile the band continues to improve, especially drummer John Boecklin who is particularly impressive here, I like the variation Dez throws in on this release. He still prefers his trademark snarling growl most of the time, though he does throw in some lower pitch spoken word sections like on \"It's in the Cards,\" albeit just for a short while. His vocals on that track in particular, along with \"Resurrection Blvd.\" and \"Teach Me to Whisper\" are not as gutteral, though his lighter vocals are not as good as his usual style. Still, he works pretty well most of the time, and this evolution in his vocal style kicks the hell out of what he was doing in Coal Chamber or on the Devil Driver self-titled.\n\nThe biggest problem I had out of this album might be that it slowly runs out of ideas as we near the end of the album. This is definitely nothing isolated to Devil Driver, as its a common issue with most American bands today. Since these songs are still good to great, I don't find this to be a huge problem. It does, however, make repeat listens a bit of a drag at times since some of these tracks do run together. This has been an issue with this band from the very beginning, and it isn't as noticable here since more than a fair share of songs here are memorable. \n\nAt the end of the day, I give Devil Driver praise for this album. Its a step up in every way I can come up with, better songs, better performances, and the incorporation of newer ideas and smart implementation. This band did evolve here, but they didn't go so far out of their element that it backfired. This is still the same Devil Driver you heard before on \"Last Kind Words,\" but we have a more mature and more intelligent band. If you can withstand a little repeititon at times, you do get about 9 songs out of 13 that are memorable or at least fun, but none of these are mediocre or bad. A worthy mention in the string of 2009 metal releases.\n",
        "\nIt’s really easy to see why many people hate Devildriver without even listening to them. They are fronted by Dez Fafara who previously sang for Coal Chamber, a painfully average nü metal band that Roadrunner possibly dropped Suffocation or Gorguts for when that label decided to hit the nü metal goldmine. So, the entire metal community was understandably skeptical when Dez announced his new project “DevilDriver” back in 2002, and according to the old website bio, wanted to go to an old school death and black metal sound. Their debut received much deserved flack when Dez’s view of “old-school death and black metal” sounded like The Haunted and the final Carcass album mashed with Korn and Pantera.\n\nThe next following albums sort of redeemed this faceplant, but it still wasn’t really death metal or at all black metal. The closest sound-alike I can gum up is transitionary Arch Enemy, i.e. Burning Bridges and Wages of Sin. \n\nThat’s about it really. Mute the vocals in both bands, and one would be hard pressed to find a difference. Not that that’s a bad thing. Arch Enemy, while not a band I personally go insane for, are still an enjoyable band with not that many sound-alikes that are worthy of a listen. Devildriver have nailed the Arch Enemy formula pretty much perfectly: Intense vocals, melodic yet powerful riffs, fitting drums, clear production, and a decent sense of song structure. During the raspier moments of Dez’s performance he almost sounds just like Johan Liiva…’s raspier moments.\n\nThat being said, they also suffer from Arch Enemy’s weaknesses. In this case, the entire album is very repetitive. The whole album is almost like one long drawn out song with only a few parts sticking out, such as the title track, “Fate Strapped In,” “Resurrection Blvd.,” and “Teach Me to Whisper.” 16 songs in and only a few stuck with me after two listens. Not the sign of a masterpiece.\n\nBut not every musical offering from every band in existence has to be a masterpiece. This album is neither bad nor amazing, it’s good. Not great, but not awful. It’s slightly above average. The only things preventing Mike and Angela from suing are Dez’s vocals and much less guitar solos. So if you are part of the diehard Arch Enemy fanbase (especially the aforementioned Burning Bridges and Wages of Sin… and possibly Anthems of Rebellion) then you could do much worse than “Pray for Villains.” Hell, pick this up even if you aren’t a huge Arch Enemy fan. There’s much worse modern extreme melodic metal offerings out there. Right, In Flames?\n",
        "\nDevildriver – “Devildriver”\n\nThe end of Coal Chamber brings the beginning to Devildriver. When I first heard a song by Devildriver I was very young. It was a song on the Freddy Vs. Jason soundtrack. What Roadrunner did was create a little website where you could preview all the songs on that album. “Swinging the Dead” by Devildriver was on that album. At the time all I was used to was Nu-Metal music. I didn't really broaden my horizons into death metal until a few years later. So, I was kind of hoping for something along the lines of Coal Chamber. What I got was completely different. First of all Dez's voice got a hell of a lot deeper and his screaming improved immaculately. Not that clean bullshit from the Coal Chamber era. So, when the CD came out a few months later I eagerly bought it and finally got to listen to the entire album.\n\nOf course, the first song I hear on the album is “Nothing's Wrong”. The very fast guitar work was something I never really heard before. I was so used to the repeated lyrics of bands like Slipknot and Korn, that when I heard this song it kind of took me as surprise. I mean, sure “Swinging the Dead” was heavy but I did not know Dez was going into a, that much heavier, direction. I admit I was very very pleased and I think this album is sort of responsible for getting me into heavier music. The other thing I noticed immediately was the fantastic drumming. Every song on here is just amazing on drums. Mr. Boecklin is one of the main reasons that this album stands out from other nu-metal releases during that so popular beginning of the 2000's. With that being said, this is still a nu-metal release. \n\nThe demise of this album is something I don't want to make a gigantic deal of. Yeah it's a nu-metal release and I take it how it is, but I would have really loved to get blown away by some fast solos, to go with that drumming to make that thrash sound complete. It also would have helped if Dez stayed away with the repeated lyrics in a lot of the songs. Some of the songs seem like they have unnecessary lyrics just to fill time. I can't say much for the guitar work. The songs have generic nu-metal riffs that are not going to blow anybody away, but how they incorporated the riffs on the album, make this album fantastic. Also, the album cover artwork is not the greatest. They could have experimented with it to make it a little more interesting.\n\nDevildriver pretty much nailed this release on the head. Sure, it's a nu-metal release, but it's done extremely well. Everything on this album is a vast improvement from what Dez has accomplished before. I highly suggest everyone to purchase Devildriver albums in order, so you get to see how the band progresses over time. This album is just the beginning to Devildriver. They turn into one hell of a ride.\n\nSong Recommendations: “Cry for Me Sky (Eulogy of the Scorned)”, “What Does It Take (To Be a Man)”, “Swinging the Dead”, “Meet the Wretched”.\n",
        "\nI actually kind of like Dez Fafara. I have since I was a teenager, even though I really did not care for Coal Chamber, Fafara's first band, I thought his voice was pretty good. I always wished he would focus on more metal projects than the nu metal style of Coal Chamber.\n\nEnter DevilDriver. I actually didn't hear this band until their second album, The Fury of Our Maker's Hand, probably because of my disdain for Coal Chamber and the fact that their first album sounded a lot like later Coal Chamber. There were some very good songs on that album and it was infectious. I do believe that it was a lot more metal, but the band still had a little growth to do. \n\nThis is DevilDriver's third album, and the album that got the band into the Metal Archives. I can see why, as it is a lot more focused on groove metal with some melodic death metal thrown in for good measure. Most of the nu metal elements have been stripped away and replaced. However, it is not as catchy as their previous album, and this is unfortunate.\n\nDez sticks to his growled vocal style that I have always liked. There are no clean vocals in the entire album, which is good because his clean voice from the Coal Chamber days is horrible. The riffs are decent and reasonably catchy with some fine guitar leads thrown in at various points in the proceedings as well as some surprisingly decent guitar solos. As I said earlier, the music is more groove-oriented with some melodic death metal as well. The most intriguing musical part is the end of the album with a somber organ leading to the conclusion.\n\nUltimately however, this album is not as good as their previous album because it's just not as memorable. There are a few decent songs, but nothing that rises to the level of \"Grinfucked\", \"Hold Back the Day\", and \"Before the Hangman's Noose.\" \"Bound by the Moon\", \"Horn of Betrayal\" and \"Not All Who Wander Are Lost\" are the highlights.\n",
        "\nWith this second album by DevilDriver, the band still wasn't accepted into the Archives, though it contains more elements of true metal than the self titled debut. The sound of the band on this release ranges from groove/thrash down to metalcore. With emphasis on \"core\".\n\nThe album contains some great tracks, such as \"End Of The Line\" and \"Grinfucked\" (the latter features harsh vocals that remind me of Children of Bodom) but some of the tracks are absolutely unlistenable, such as \"Pale Horse Apocalypse\" and the title track. \"Sin and Sacrifice\" has an interesting opening, but is overlong.\n\nOne strong point of the band is that their singer can growl the whole time. The whole CD is pretty much growled vocals. There are no Slipknot-esque half-growls, or shitty clean singing, for 12 tracks. For those people who put DevilDriver in the same category as Slipknot, Limp Bizkit, and Korn, you are wrong. This band is nothing like nu metal.\n\nDespite the metalness of this record, this is DevilDriver's worst effort. It is an awful lot like the first CD, except the singing style is different. Also, unlike the first album, the songs are all at least 4-5 minutes. Good groove metal is quick, three minutes is enough ... However, the skill of the singer makes up for the unoriginality and lengthiness of it all. My overall rating for the album is 2/3.\n",
        "\nDevildriver has copped an immense amount of flak from the metal community, mainly due to the presence of ex-Coal Chamber vocalist Dez Fafara but also for contributing what is quite possibly some of the most unnecessary and useless music to date. Their first two efforts are as repugnant as they are forgettable; the reprehensible bringing together of metalcore and nu-metal made for an ugly sight not unlike fat people fucking. However with 'The Last Kind Words' we see Devildriver thankfully shed this terrible affliction only to side-step into a new outfit which is more aesthetically pleasing but is just as cheap and unwholesome as the first.\n\n'The Last Kind Words' is not the type of album that makes you pour blood from every orifice on your head as you crawl in agony towards the stereo in a futile attempt to somehow stem the onslaught that bellows forth; it's just really bland and terrible. \"Not All Who Wanders Are Lost\" is the only track that I can clearly remember, if only because it's the blueprint for every song that proceeds it from then on; the song writing falls hard on it's ass with every song being a string of mediocre riffs you've heard at least three or four times elsewhere. The riffs themselves are split between Pantera-esque chugs and gothenburg melodies that even In Flames deemed to be too derivative for release on 'Come Clarity' (but not on 'A Sense of Purpose'! However that's a completely different kettle of fish).\n\nAt this point you'd be forgiven for thinking that 'The Last Kind Words' sounds like nothing more than an 'Ashes of the Wake' clone, and for the most part you're right since that crowd of brain surgeons happily eat this insipid shit right up. Unlike Lamb of God's miscarriage however, there is at least one solo every song, sometimes two! If your eyes actually lit up with a glimmer of hope for a moment there you may want to consider doing another shot of draino for the good of the gene pool. The solos are just as bland as the riffs; simplistic and insignificant in every aspect possible. They're there because that's what all the other cool metalcore bands are doing. From memory there are a few moments that constituted breakdowns but much like the rest of the album there’s little point in actually giving a shit since it’s not unlike every other one you’ve heard before.\n\nThe remaining elements of the band are a mixed bag; Dez Fafara vocal's are severely lacking in range and after awhile his dull barks are completely phased out, or at least I managed to. The bass is inaudible but when isn't it on a modern metal release? The drumming is surprisingly decent, if not great at times and is the only instrument in the band that contributes anything that could be considered worthy of noticing.\n\nEven with the great drumming this is still a terribly redundant release that is lamely trying to be 'real metal' by stealing riffs that make every second of this music more of a derivative than d/dt, but still desperately holding onto it's brain-dead initial fanbase. I'm not implying that Devildriver could be a good band, because to do that they'd have to somehow learn the definitions to the words integrity and originality. Let's face it: if Dez Fafara ever came across a dictionary he'd complain that his steak wasn't well done enough.\n",
        "\nDevildriver has impressed me tremendously with this album. Recently, I have noticed that many metal albums have begun to take turns for the worst; however, Devildriver went all-out on their 3rd album to date. When I heard that they had finished a new album, I didn’t know what to expect. The Fury of our Maker’s Hand blew me away, and I was extremely impressed by it, and that set the bar very high for The Last Kind Words, a bar which was met and exceeded greatly.\n\nThe lyrical content of this album was extremely impressive to me, as the lyrics never were what I favored Devildriver for, but I was very pleased to hear some very meaningful yet powerful lyrics coming from Dez Fafara. Not All Who Wander are Lost, which is the opening track, really puts life into perspective. While brutal, it gets across a message of a sort of adventurous/devious side to the character of the album story… and yes, there is a storyline. \n\n“Clouds over California” was one of my favorite songs (masterpieces) on this album. Starting off with a “what next” sounding intro, followed by Dez’s scream, leading into some very well-delivered and brutal verses, backed by some incredible drum and guitar work.\n\nDevildriver does not miss a beat through this whole album. The riffage does not over-power the melodic parts, or vice-versa. Very impressive throughout this album I noticed an excellent balance in this. \n\nSkipping ahead a bit, Head on to Heartache is another masterpiece on this album. I found the drum work very impressive in this song and the flow goes well throughout the album.\n\nFinally, The Axe Shall Fall is easily my favorite song in this album. It is a perfect finale to such an incredible album. The intro and body of the song is incredibly brutal. The guitar, bass, vocal, and drum work is mind-blowing. It also features a catchy ending. Not easily described, it leads you out of the album very well.\n",
        "\nHolding a position as perhaps one of the most unfairly maligned bands in existence, DevilDriver are also a group who offer far more than first impressions may account for. Vocalist Dez Fafara’s dubious musical past as frontman of Coal Chamber and DevilDriver’s association with the modern ’New Wave Of American Heavy Metal’ has all too often lead to them being disregarded instantly by skeptical metalheads. Not a reputation they deserve, and one that will likely be wiped from many a rivethead’s mind upon hearing DevilDriver’s triumphant second album ‘The Fury Of Our Maker’s Hand’\n\nWhat seems to escape the notice of many listeners is that DevilDriver are one of the few bands who have succeeded in utilising a mixing pot of elements to create a highly memorable and, above all, distinctive sound. Often there is truth to be found in the belief that many groove metal/metalcore bands sound indistinguishable from their compatriots – DevilDriver are a valiant deviation from the groove metal archetype, with a sound that has their exclusive, recognisable stamp all over it.\n\n‘Fury...’ sees the band achieving a remarkable streamlining of their sound, impressively without losing the feeling of very genuine, sinister mystery that gives them their distinctiveness. Marrying this surprisingly effective talent for atmospherics with a much wider variety of influences than previously shown, and topping off the spectacle with a massive leap forward in terms of violent aggression, ‘Fury...’ is a record that satisfies on all counts.\n\nThe variety found in each song has nearly tripled in the two years between records, and this serves to thoroughly engage the listener throughout – DevilDriver wisely avoid dependence on the repetition of ideas and seek to enhance upon them at every turn. Accusations that the songcraft is not as catchy as the debut are, in all honesty, somewhat misleading. ‘End Of The Line’ is possibly the best song the band has yet written, a whirlwind of thrashing, maniacal guitar and drum work, underpinned by one of the best intros in metal today. Lone single ‘Hold Back The Day’ is a chronicle of memorable vocal lines and delightfully punishing lead work, and the chorus to the storming ‘Ripped Apart’ is a testament to just how aggressive this band can get. And these, remember, are just the most choice examples.\n\nThe expansion of musical horizons serves DevilDriver exceptionally well, with much of the Pantera-through-a-diluter guitar work of the debut gone in favour of far more consistent and technically concise riffs. Guitarists Mike Spreitzer and Jeff Kendrick lay down some absolutely storming lead parts on this album, overlaying creepy, threatening melodic intros, blistering bridge parts and enrapturing lead work onto delectably brutal riffery. The guitar may not win any prizes for complexity, and the lack of solos is something of a disappointment, but nevertheless the straightforward approach works in DevilDriver’s favour – they pull no punches and add nothing that may undermine their attack.\nOne major flaw the album carries is the bass; while Jon Miller has before and since proven himself a more than competent player, here his talents go unappreciated simply because it’s impossible to hear the poor bastard, buried beneath the guitars pushed to the fore in the production. A shame, considering that Colin Richardson’s production is otherwise clear and sharp, thankfully avoiding sounding over-polished. \nAs for Miller’s rhythmic counterpart, John Boecklin gives an exceptional performance, displaying an entirely unique style specialising in complex, unusual drum patterns and pummelling, rolling fills. His drum work is as impressive as it is enjoyable, and one of the key reasons to snap this album straight up.\nFafara himself is another such reason. While the man’s vocals are given a certain degree of layering, this is used sparingly and it remains clear and plain that even without such vocal effects, Fafara has one of the most unique-sounding and powerful voices of modern times. Blending the best aspects of death and black metal vocal stylings, his style is a joy to listen to.\n\nWhile it is unlikely that DevilDriver may ever shake off the suspicious opinions many hold of them because of Dez’ past associations, at the end of the (line?) day it is the loss of those people, as ‘The Fury Of Our Maker’s Hand’ is a record that boldly challenges modern ‘metal’ acts to a brutal head to head and emerges the bloodstained winner. A record of few frills and honest, raw power, that will leave its mark on the listener long after it stops spinning in the player.\n",
        "\nUpon listening to DevilDriver's previous works, namely their self-titled debut, I thought this would be another attempt at recreating what Dez Fafara hoped Coal Chamber could have been. Well, I was wrong. Very, very wrong. I had picked up a copy of their sophomore effort, The Fury of Our Maker's Hand, and I was shocked. Their sound had evolved from really mediocre metalcore-ish angsty \"let's bang our instruments but kind of act like we know what we're doing\" to \"hey, let's actually make some quality fucking music because Coal Chamber failed miserably.\"\n\nBut their third output, The Last Kind Words, shows MASSIVE maturity and improvement upon their style, and their musicianship as a whole. This album is very consistent, never missing a beat. One of the most astounding aspects of this album is the drumming. I have never heard such precise, timely, and well-maintained drumming on any other album (minus Mirrorthrone and Unholy Matrimony, but that's just a given). \n\nMoving on, Dez Fafara's vocal skills have improved upon themselves as well, taking a major step forth from his still-raspy screams that presented themselves on The Fury of Our Maker's Hand, and his screamo-esque high-pitched shrieks on their self-titled. The lyrics and the way Dez executes them follow very accurately with the melody of the song, never really straying in between notes. His tone fits the atmosphere, as well. I'm really looking forward to hearing the changes on the next DevilDriver album, because Dez has really started to make a name for himself.\n\nThe guitar work is stellar. I really can't stress this enough. They really keep the rhythm intact, and the solos don't really take away from the value of the song at all. They match the timing, and give each song character. Along with the backbone drumming, the constant up-down-up-down picking adds a nice touch to keep the structure of the songs flowing. Great examples of guitar work on this album include Clouds Over California, Bound By the Moon, Horn of Betrayal, Head On to Heartache, When Summoned, and The Axe Shall Fall.\n\nOne thing that really caught me off-guard when I first gave this album a full listen was the introduction to Monsters of the Deep. That bass line is just incredible. This is honestly the first time I can say I've ever heard bass present itself on a DevilDriver album, minus a few times on The Fury of Our Maker's Hand. But this, the bass is much more prominent and is an awesome addition to the fluency of the songs. It gives them a ballsier, gripping, almost industrial sound without being too deep.\n\nIn general, this album was really well written. The production quality is fantastic, and the band just unites, each doing their part as best as they can. I'm not really sure why these guys get so much hate, aside from the fact that Dez Fafara once fronted Coal Chamber, a nu-metal act. It's quite obvious that those days are over, and Dez is back with a vengeance, ready to kick some ass.\n\nThe highlights of this album include: Clouds Over California, Bound By the Moon, Horn of Betrayal, Head On to Heartache (Let Them Rot), Monsters of the Deep, and The Axe Shall Fall.\n",
        "\nOK, we're all well familiar with Dez Farfara's musical past, so how about we concentrate on the present? And well we ought to, as this is a very good album. After years of hearing about this band and catching them on Ozzfest recently, I finally took the plunge and (on guitarist Mike Spreitzer's recommendation) went and got this CD. And it was worth it. \n\nWhat Devil Driver lack in technical ability on the guitar front they make up for quite adequately with a surfeit of riffs and melodies that are accompanied by a well-honed sense of structure and songwriting craft. Each song has little to no excess, muscle and bone as opposed to fat, and all comfortably settle into the 3:30-4:30 time range with a couple of exceptions that nudge over the five-minute mark. And each song feels well-developed with plenty of ideas that flow surprisingly well in such short amounts of time. They get in, make their point, and get out before they overstay their welcome and there's something positive to be said about that. There is just enough going on musically to get your attention and hold it. And yes, a pronounced Pantera influence rears its head, most notably on \"Burning Sermon\" in the intro and verse riffing, but is this a bad thing all the time? Not always, if you ask me. \n\nThe riffing is catchy and precise throughout the album, and the drum work is fantastic. John Boecklin deserves more attention for his ultra-tight double kick work as he follows tricky syncopations and his creative and energetic tom-tom and hi-hat work, as well as his overall rock-solid feel over the album's course. Of course, the kick drums are triggered, but it's not as obnoxious as that drum sound tends to be much of the time. Give this man some press! \n\nMike Spreitzer and Jeffrey Kendrick are a strong guitar team weaving simple and effective melodies around the powerful riffing as well as adding menacing sounds to enhance those riffs and even some sweet-toned clean parts in classical counterpoint style like on the middle and ending of \"These Fighting Words\". Their soloing is, again, simple and effective, and downright moving at times--while not the Amott brothers, they have their own identity and that means a lot to me. And you can actually hear and feel the bass guitar for once, with Jon Miller's roaring distorted tone elbowing the guitars hard in the mix, which is full and clear and packs plenty of power. \n\nSpeaking of roaring, Dez' vocals are furious and he sounds demonically possessed at times as he layers screams, growls, and roars into a deadly package of bile and rage. This is one aspect I actually wish he'd backed off on a bit, as the layering sometimes gets to be too much sometimes. He sounds like Phil Anselmo's enraged brother, not entirely a bad thing since I mean Phil in his prime as opposed to the parody of himself he became before Pantera's end. His lyrics explore themes of alienation, being the outsider, and he delivers them with caustic conviction. \n\nStandout tunes are most definitely opener \"Not All Who Wander Are Lost\" with its frenzied thrashing, \"Clouds Over California\" (my favorite on the album)--some of the best riffs and drumming and the best chorus on the album rear their heads on this little bruiser--\"Horn Of Betrayal\", and the gorilla punch in the nuts that is \"Monsters of the Deep\". The guitars are tuned extremely low on that number and the riffing exploits this with its groaning, almost Sabbathy feel. Final tune, \"The Axe Shall Fall\", has a surprisingly unconventional ending--instead of the usual crashing rock ending or fading out or ending abruptly, the song seems to end, and then goes into some more of those nice clean guitars playing some pretty melodies, a crisp and downright funky beat, and some righteous organ playing that sends you out on a comfortably grooving feel. Outstanding that they chose to try something different and original instead of adhering to the tried and true, and it works well, in my opinion. \n\nAgain, I say enough with bitching about Dez' musical past and forget about scene cred/kult cred/what have you. LISTEN to DevilDriver and give them their due as a totally different and valid musical entity. If you don't like this album, fine--but at least try seriously listening to it first instead of downing it sight unseen or giving it a cursory listen and ragging on Dez for having been in Coal Chamber instead of giving the music a chance. I think that once you get past that prejudice you will be able to give this album its due as well. I like it and that's that. (And Mike Spreitzer is one funny dude--if ever you meet him, ask him about his record label's German reps giving him crap about his last name!) DD are no joke and no lightweights--take thie veteran banger and hater of nu-metal's word for it.\n",
        "\nYou can imagine my surprise when I saw a link to Devildriver's metal archives page on a forum elsewhere. I thought to myself \"is this a joke?\" and \"what the fuck?\" simultaneously. I then saw in their notes that they had been added courtesy of their latest release \"The Last Kind Words\". Naturally I thought to myself \"this must be a hell of a redeeming CD to get this joke of a band on the archives\".\n\nNeedless to say, it's not that great. They're listed as a melodic death band, so I was expecting some Darkest Hour / Mors Principium Est style riffs. What I got was more of the same, except with solos and a few improved riffs here and there. It wasn't a total change of sound or a total improvement by any means. The riffs are still far too groovy for me to get into, and there's still a severe lack of brutality in the vocals Dez tries to deliver.\n\nHowever, there are some actual winners on here! Bound By The Moon is a pretty good melodic death metal song, complete with epic guitar work and some awesome licks. It doesn't feel like the same band with this song. It's a heavy and fun piece of metal, and it doesn't just drone along like their other songs tend to. There's dynamic and emotion behind the writing, rather than just Coal Chamber with a makeover.\n\nShit, I said winner(s) as in the plural form didn't I? As it turns out, Bound By The Moon is the only good song on this album. I guess it put these clowns on the archives. All the other songs on this album are repetitive and boring, just like their other works. Oh well, at least they squeezed out a decent song this time.\n\nMy recommendation is to download Bound By The Moon just to beef up your collection with another artist, but avoid everything else. Even Bound By The Moon isn't that worth having, but it's a decent song for fans of In Flames / Darkest Hour.\n\nDon't spend a penny on this album.\n",
        "\nDevilDriver was never that bad of a band. Sure, their material is considered trendy these days, but I admit that they had some decent song structure. \"The Last Kind Words\" was, in a way, an improvement in some areas, and a strong disappointment in all others. Their first two full-lengths were, in my personal opinion, a lot better. I would consider them metal long before I even think of adding this album as metal. \n\nThe guitars are very predictable. They are just your typical \"machine-gun-sounding\" riffs. There are occasional solos, but they are nothing worth it. They are trying though; I have to give them that much. The major problem is that they're trying to sound like Yngwie Malmsteen when their guitarist is obviously not that talented. The bass line may be there, and it may not. The only song that really let their bass shine is \"Monsters of the Deep.\" However, the bass is so distorted that it sounds like a down-tuned guitar. \n\nThe drums are the real talent here. There are many double bass kicks, blast beats, and drum fills. The drummer never repeats the same thing twice. You would almost think that these drums were programmed, but they're not. After seeing this band live, I can appreciate a lot of what their drummer does. However, it's hard to hear the drums over the barking vocals. Everytime I hear this guy, I keep thinking that my neighbor's dogs are barking again, then I remember that this guy just barks out his vocals. \n\nThere are some songs in this album, such as \"These Fighting Words\", that are obviously aimed at the trendy. I'm half-expecting them to go into clean vocals saying \"I slit my wrists because I love you.\" The only words to describe these kinds of songs are \"trendy, screamo, false metal.\" However, some songs like \"Head on to Heartache (Let them Rot)\" (which is a very stupid title), make up for it. The riffs sometimes actually sound like metal riffs, but they're ruined by the monotonous solos. \n\nThis album was a major disappointment, but at least DevilDriver is trying. I just find this whole thing to be a setback from what they released before. This is only a good \"metal\" album if you haven't heard anything else.\n",
        "\nDevilDriver have evolved into the next phase of their career with their third (and highly anticipated) release, \"The Last Kind Words.\" The initial side-project attitude has finally been left in the dust and on this release DevilDriver are taking out all the stops (and almost all the Nu Metal nuances). Those who had been skeptical about DevilDriver before seem to have even come around to this latest album whilst fans of the original two albums have also been satisfied. \n\nThis is DevilDriver's best album to date. Granted, it isn't as catchy as their first two but \"The Last Kind Words\" delivers in areas that DevilDriver has yet to touch. With each release the band has increased the stakes and that includes this release. Everyone involved on the album is giving their A game and nothing seems to hold them back.\n\nMusically, the album is not near as diverse or catchy as their previous two. The songs are similarly structured on first listen but with multiple spins the little differences come to the front and really make this album solid. Gone is most of the stop and go riffs that were some of the main song structures prior. This time the band has included a plethora of Post Thrash Metal groove inspired riffs along with dueling leads and solos galore. Where the band had never really included a solo on a song before, \"The Last Kind Words\" is full of dueling solos that even most critics were amazed at. No one really knew that the band was able to solo with such technicality or emotion before this album. Not to mention the riffs that underlay the solos and leads are way more complex. This band truly had talented guitarists and no one really knew. \n\nThe bass lines are back and also more complex. Although the bass doesn't get to shine all that often with a new found focus on the guitar work and chemistry the bass does serve its purpose. \"Monsters Of The Deep\" has some of the most interesting bass parts to it and, considering the title, really uses the bass to its potential. The drum work is once again a beast on this album. I was skeptical to whether or not the drum work on \"The Fury of Our Maker's Hand\" could be matched or topped but after listening to \"The Last Kind Words\" I know that the drums are not some fluke of the band. The drums are more subtle on this album but they are very technical and diverse. \n\nDez does experiment a little with his vocals on this album. The lyrical writing style is more complex and there are few initial sing-a-long moments. The choruses are much more complex and his delivery is definitely more towards the Death Metal side. His unique voice does help the album out and any nay-sayers he may have had because of his Coal Chamber days can kiss that comparison goodbye.\n\nThis is a very solid album and the best offering the band has yet to produce. This is a more Post Thrash than the band has ever been. There are some odd experimental moments on the album (the keyboards are the end of \"The Axe Shall Fall\" took me by surprise) but the album is still more cohesive then any past releases. The direction of DevilDriver seems to be more complex and technical - and I couldn't be happier.\n\nSongs to check out: \"Not All Who Wander Are Lost\", \"Head On To Heartache\", \"The Axe Shall Fall.\"\n",
        "\nDevilDriver shocked me with their unique style on their debut self-titled effort, but I wasn’t convinced that they were “the next big thing” as some people claimed. Sure the debut was good but it definitely wasn’t great. So I was eagerly waiting to see if this so called next Pantera (Phil Anselmo claimed DevilDriver was the next Pantera in fact) was just a one trick pony or a legit deal. So when the release of “The Fury of Our Maker’s Hand” came I was in the store on day one to pick it up.\n\nTo say that DevilDriver changed their style would be wrong. Really this album is just a refinement of their unique blend of Post Thrash and Nu Metal rather than a change of style as some fans claimed it to be. Not near as catchy as their debut, “The Fury of Our Maker’s Hand” placed a greater emphasis on the Metal part rather than the Nu this time around. And right from the get go with the track “End of the Line” listeners can hear just how much the band had matured in two years.\n\nMusically, “The Fury of Our Maker’s Hand” has a greater variety in general but the biggest difference (at least to my ears) was the increased focus and thought that went into the guitars. Rather than the stop and go riffing that was found on the debut, the band has created a wider range of guitar tones and sounds that really opened them up. Losing their original guitarist seemed to actually be a blessing for the band. Melodic intros and sections smoothly meld into vicious Post Thrash riffs and even some differentiating guitar parts. One guitar plays a riff and the other plays a melodic riff over it (although they are not really leads in the classic sense of the word). The leads are actually audible on this album and there are plenty of catchy moments in almost every song.\n\nThe bass has finally taken a step back and a step up. The bass is not near the motivating force it was prior but now it helps keep the music in line and really works as a support structure for the guitar parts. Also it seems as though the bassist has stepped up his playing abilities and worked on not being near as sloppy. I think it is very important to mention how monstrous the drums are on the album. This is some of the best drumming I’ve heard from a newer band in years and the drum patterns and playing on this album are superb in every sense of the term. The precision is lacking at times but the variety and technicality of writing make up for it two fold. \n\nDez actually steps back on this album a bit and pulls away from the variety he used on the first album. He uses his guttural barking almost the entire time on the album (up until one of my favorite tracks “The Fury of Our Maker’s Hand” at the end of the album). And he delivers each track one right after another in his own unique way without ever really touching his Coal Chamber days.\n\nI think, in the end, the band is just working better as a whole. Rather than a “side project” mentality, the band is operating as a machine with each member using the others to crank out a product that is both quality and timely. Everyone in the band has done their part to increase the abilities of the band as a whole – and “The Fury of Our Maker’s Hand” is proof of their work and dedication.\n\nSongs to check out: “End Of The Line”, “Just Run”, “The Fury Of Our Maker’s Hand.”\n",
        "\nInitially I picked up DevilDriver on a whim. I had heard the song “Swinging the Dead” as a track on the “Freddy Vs. Jason Soundtrack” and I had thought the song to be rather catchy. What I didn’t realize was that DevilDriver was the child of ex-Coal Chamber front man, Dez Fafara. When I found this out – I was instantly skeptical. Coal Chamber had been a fad band and it wouldn’t have surprised me if DevilDriver would be too. I was wrong.\n\nA strange combination of Nu Metal and Post Thrash (or Melodic Death Metal depending on who you talk to) is the best way to describe the sound that is produced on DevilDriver’s debut album. Definitely a groove orientation overall, but there are moments of each genre and a mixture of the two that really defies much description. Needless to say, Dez had moved out of “poser” territory and onto a project with much potential and a unique sound.\n\n“DevilDriver” has some of the strangest guitar tones on it. Catchy as hell but fairly simplistic guitar work covers the majority of the album. The riffs are definitely based on a Post Thrash ideals with a heavy distortion used on them. There are almost no leads present on the album (a shame considering what would come later for the band) and what leads there are, are pushed back in the production value. The leads are trampled by the heavy riffs and loud bass to the point that they don’t exist on the album unless one takes a serious amount of time and effort to search for them. The distortion used on the guitars does give them a tinge of Nu Metal flavoring but the writing style is more prevalent for Post Thrash. There are some odd noises created with the guitars too that add layers to the music but are really not needed.\n\nThe loud use of bass and the sloppiness of its playing is what gives this album most of its Nu Metal sound. The bass lines are somewhat off on “DevilDriver” and they don’t quite blend with the guitars and music. This makes them very obvious to the listener even on their first listen as well as every other listen this album may get. The drums on the other hand, although somewhat sporadic in nature, are well played and give the album a heaviness it wouldn’t have reached otherwise. There are plenty of places the drums could have gone that would have given the album great variety but they didn’t. The bass drum comes off a little loud in the production of the album but doesn’t really affect the overall affect of the album.\n\nDez’s vocal abilities (which used to center around a half spoken gothic tendency) are now almost all harsh and guttural. They aren’t Death Metal vocals per say but more of a barking style this time around. There are those spoken moments on the album and even a song that sounds as though it could be some sort of half assed rapping (“I Dreamed I Died”) but his good variety vocally is key to the catchiness of the album as a whole.\n\n“DevilDriver” may not be the most impressive debut I’ve heard from a band but it did catch my attention enough so that I would follow the band through their career. If you enjoy Post Thrash I would suggest giving this album a try but be aware that you also need to be open minded enough to not let the Nu Metal tendencies throw you. There is more beneath the surface then just “mallcore” here… enough to keep even a thrashead like me coming back to it every once in a while.\n\nSongs to check out: “Nothing’s Wrong”, “What Does It Take To Be A Man”, “Swinging The Dead”.\n",
        "\nSo. DevilDriver are finally secured in the annals of metallic elitism. Whatever traits they've tacked on since their shitty sophomore album apparently transformed them from a slightly harder Nu-Metal act with underlying Rap Metal/Core rhythms and a good sense of \"when to plagerize\", into a full fledged, bulldozing, woman-beatin' aural assault of PURE FUCKING METAL.\nIn other words, DevilDriver now incorporate a more classic approach to the genre, not unlike Trivium and Avenged Sevenfold, all while remaining mind-numblingly bland and marketably susceptable.\n\nLook back for a moment: Do you see the birth of Pearl Jam worship aka Post-Grunge? Now bring it forward a few steps: Can you make out the shape of Korn and the rest of the Nu-Metal boom overthrowing Post-Grunge in terms of popularity? Then look back at the last 3 years: Metalcore has decidedly replaced Nu-Metal. Do you see where I'm going with this? \nBasically, shit heaps like Trivium, Still Remains, Darkest Hour and now, DevilDriver are the logical next-step for modern \"Metal\" acts: harder, faster, grittier vocally, the inclusion of solos, etc...\n\nAs much as I'd love to embrace the shift away from radio-friendly pop-metal, this new sound is just as fucking awful as the old. DevilDriver are as previously mentioned, \"harder, faster, grittier etc...\" than on their previous efforts, but the real kick in the teeth is: they still sound derivative and unintentionally silly, regardless of their decidedly more serious lyrical focus, wailing solos, and excursions into heavier genres. The vocals are even more processed and layered than ever, the riffing is devoid of the old, groove-laden chugging that made the songs relatively memorable on the self-titled, and occasional melodic fills are already too played out by other bands to sound emotionally charged or stimulating. It's not terrible, but it's far from good at the same time. I couldn't even peg it as \"listenable\", as it's barely inviting from the first track on. \n\nIt's not a landmark album either way you look at it, it's just an average album by an average band that will never see the same commercial success that it's catalysts have. Will we see goregrind with pop tendencies 5 years down the road? We can only imagine.\n",
        "\n“The Last Kind Words” is the third album in DEVILDRIVER’s four-year existence. Many metal purists have written off DEVILDRIVER due to front man Dez Fafara’s nu-metal past (vocalist for COAL CHAMBER). This album distances the band even further from those unfair comparisons. In a recent Metal Center interview, Guitarist Mike Spreitzer commented on the group’s style, “I would call us more straight-forward metal.”\n\nSprietzer’s statement is for the most part right on the money, but lacks the term “modern.” New Wave of American Heavy Metal (NWOAHM) also aptly describes the group’s current direction. “The Last Kind Words” is a snap shot of the modern metal scene. Employing the talents of two of the best sound controllers in the business, Jason Suecof (production) and Andy Sneap (mixing), the group has found a polished, professional sound. Although the album’s production lacks rawness, especially in the guitars, all the instruments are clear, crisp and loud. The sound is grand, especially the drums. This is an album meant for cranking on massive home or car speakers. One could use Chimaira and Fear Factory’s sound for comparison.\n\nThe low guitar tuning is not too far removed from nu-metal, but bereft of the funky grooves and boring fret work. Instead, Spreitzer and Kendrick opt for muffled and open chugging rhythms, and catchy scale work. Also, the duo focuses more on melody—both in leads and solo breaks—to add a degree of expertise and emotion not found on previous efforts. “Clouds over California” contains some of the more memorable guitar work. A myriad of guitar changes and lead ins start the track before settling into an ascending hammer on riff that hits its peak before swiftly chugging back to lower ends of the fret board. \n\nDrummer, John Boecklin is more than qualified to fill in the gaps between guitar technique change ups and tempo changes. Boecklin’s constant moving feet and rapid drum rolls not only keep the pace moving, it is the key ingredient for the group’s BIG sound!\n\nDez Fafara’s vocals must also be examined. Fafara is the veteran of the group. Obviously, he knows how to make a band successful. The easiest approach for Fafara would be to make COAL CHAMBER part two, but instead he has created music a great deal heavier than his former project. Through a Phil Anselmo-like screaming style, Fafara provides the perfect voice for the extreme direction he has chosen to stride.\n\nWhen asked about “The Last Kind Words, Spreitzer made another comment during the interview that held true. He said, “Great album! Definitely, in all of our opinions, the best DEVIL DRIVER album we've done so far. We all had to step it up quite a bit as far as our playing skills.” After giving several listens, I can’t argue with anything in his statement. The hype is true. “The Last Kind Words” is DEVILDRIVER’s best album, by far! It is a genuine modern metal masterpiece.\n\noriginally published on www.metalcentre.com\n",
        "\nLike many of the current New Wave of American Metal bands, people love to hate DevilDriver. Particular scorn is reserved for frontman Dez Fafara, mostly due to his nu-metal roots from fronting the band Coal Chamber. Personally, I can't understand what the big problem is; this album kills.\n\nWith The Fury of Our Maker's Hand, DevilDriver pretty much completely tear away their nu-metal roots (keeping only the Drop-B downtuned guitars) and make one thrashing good time of an album. Admittedly, it does share a few things in common with the metalcore bands of today (breakdowns aplenty), but this album also boasts several unique elements in its favour. Firstly, the songs on TFoOMH all boast a particularly sinister atmosphere to them, particularly on songs like End of the Line and Hold Back the Day, where subtle, creepy intros give way to scorching guitar riffs. Secondly, Dez Fafara has an interesting, powerful voice that perfectly suits the music and also happens to be very unlike the typical yelling/growling found amongst other current bands. Finally, although this isn't necessarily unique, these guys definitely know how to play. Mike Spreitzer and Jeff Kendrick are an excellent guitar duo that throw tasteful harmonies into the songs, Jon Miller's bass adds an extra layer of heaviness over the already thick riffs, and John Boecklin consistently keeps up an excellent rhythmic attack with tons of double-bass.\n\nNow, admittedly, this album isn't perfect. The songs are all a little similar to eachother, and I really wish the guys had thrown in a few solos amongst the rhythm work. However, this is still a great album for when you're in need of some music that really gives you the drive to kick some ass. Highly recommended.\n"
    ]
}