{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Los Angeles, California",
        "Status:": "Changed name",
        "Formed in:": "2012",
        "Genre:": "Metalcore",
        "Lyrical themes:": "Corruption, Personal struggles, Society, Redemption",
        "Last label:": "Nuclear Blast",
        "Years active:": "\n2012-2017,\n2017-present (as Light the Torch) ",
        "Number of Reviews": 4
    },
    "Band Reviews": [
        "\nA year after the masterpiece in The Beauty of Destruction, the band has released They Bleed Red. Now welcoming Ryan Wombacher from another quality metalcore band, Bleeding Through; to give the band some bass grooves. With his background and with the rest of the members' own respective backgrounds, now it looks like they're a one powerful metalcore supergroup (even though they're not; that's just a hypothesis - and a compliment at that).\n\nThe sick album cover is as good as the debut’s, if not better. The colors and texture are about the same, which hints (to my belief) a follow up of the debut, in terms of pretty much everything; opting to achieve a solid successor to a solid debut. But, unfortunately, this is the second and last time you'll see such quality (which I'll explain in the conclusion of this review). That being said, there are a lot more engineers unlike the previous record, which I don't know if it's a good thing or a bad thing and if it's the production's fault or the music and writing's fault. I remember hardly liking this album compared to their debut, though as always, I opt to be proven wrong.\n\nThe album is as long as the debut, only this time the majority of the songs are four minutes and has one five-minute song and one two-minute song (which is the third bonus track). Speaking of bonus tracks, you get three of them: the first one is the famous Eye of the Tiger song by Survivor and the other two songs share a similar subject: life. This gives me the impression the band ran out of ideas, I mean \"I Am Alive\" and \"We Live\"; literally singular and plural perspectives in the present tense... doesn't really speak volumes.\n\nJust to start off with the opening track (which has live performance music video), Consume the Damned already sounds djenty, badly angry, and generic in every aspect of the song. It's got no impact other than trying to sound groovy for appeal. Shattered Silence is probably the worst song from the band, period. It tries to sound groovy but never transitions to something good. The riffs are overwhelming, and Howard doesn't deliver quite the impact; it's more about angry expressions than impressing melodies. You want more Fear Factory-inspired song? Don't look further than How the End Shall Be; just a disappointing track. Broken by the Cold has a good chorus and guitar solo, yet turned to be just another generic track. Even its length didn't make for a good atmosphere. I bet you don't wanna hear this one, but what's worse to come is the metalcorized Eye of the Tiger from Survivor. It sounds way too metalcore for a stupid cover, which makes the Holy Diver cover back with Killswitch Engage a little bit better - and also it's got 20 seconds of sheer silence, like why not end the recording literally when the song ends? I Am Live is the band's non-metalcore/acoustic song, which I understand was to deliver some variety and style to the album, but that brought absolutely nothing to the table.\n\nFor those that showcased any potential: the single, Stay of Execution, surprisingly sounds like clean death metal: the riffage and the blast beats sound excellent, as his Howard's impactful vocals. Yet the problem was, it lacked the power necessary to make for something shocking, like 95% of the entire first album. Remember, heavy doesn't always mean good. Break the Ties is melodically catchy, but the song overall sounds repetitive. The riffs are quite weak - and I think Howard's vocals showed some potential, but unfortunately not enough. Master of None wasn't that bad and melodically interesting, but imagine it as a chart that fluctuates up and down - that's how I think about this song.\n\nLet's see what really justified this album as a proper follow up: the second music video and song, The Way We Die is quite funny if you watch the music video. As for the song itself, while it sounds djenty as well, it at least contains melodies and unique vocals by Howard; just hearing those heavy cleans really won me over. The guitar solo is also fantastic, as is the beautifully atmospheric bridge which you can tell took inspiration from the debut. I'm disappointed to say how Howard's vocals weren't enjoyable in the verses of Your Last Breath, but the song is melodically orchestrated well and sends a powerful delivery. Let the Pain Take Hold calmed the heaviness down and produced pure melodies, as well as the song being pretty emotionally cruel. But the addition of the acoustic guitar was great, and the chorus is well-written. I always liked Searching for the Sun because of its melodies and Howard's vocal delivery. The meaning behind this song is very powerful and the music helped prove so. The chorus alone is just too good. To end this disappointing record with We Live, for being the shortest track on the album, it actually delivered more than most songs. The verses start with beautiful chords with a chorus effect on, not to mention the multiple vocal types in between, the chorus is fantastic and catchy, and Howard's clean vocals at the beginning of the bridge reminded me a lot of Chad Gray's from Mudvayne. Really great track!\n\nSo clearly this album is a lot worse than the debut. Although it showed some potential in some of the songs I mentioned, it was still not enough to make for a decent album. Whatever the band made in their first approach, most of it went straight down the toilet with They Bleed Red, which is a damn shame considering the quality the band possessed as they started. Assuming that maybe they didn't have enough time to work on the album, but I don't see that being the case...\n\nAs the band released such a disappointing record, more bad news came thereafter: a dispute between the drummer, John and the rest of the band members started because John was too busy doing other things, while the band had to continue their ongoing tour and looked for, I suppose, part-time drummers to fill in. Part of this dispute was also in relations to the name of the band and maybe even money along the way. So I suppose the band decided to fire John because he was being greedy, despite doing other things, yet still wanted the share of what he once started. Ultimately, the managed to fire him, but the name couldn't be intact. Devil You Know is still in the books and John and the band members parted ways, and so this closed this chapter of the band and led to a fresh start.\n\nThree years later, while in 2017 the supposedly third record was recorded, Devil You Know was no more. The band was reborn with a more hopeful and positive attitude; forming Light the Torch. Recruiting drummer Mike Sciulara kickstarted their new chapter. Obviously I'm not going to start talking about the new band name and their album but basically, their new approach helped them experiment and showcase more quality to beat the disappointment in They Bleed Red. However, it sounds more commercial than Devil You Know with less metal essence and lacks the artistic quality Devil You Know had (which is why this reincarnation isn't available on Metallum). Another plus side: Howard looks better than ever!\n\nHeh, I almost forgot. The best songs are The Way We Die, Searching for the Sun, and We Live. While the latter two are original in the band's second approach, The Way We Die could've been on The Beauty of Destruction since it sounded like it belongs there. If it was up to me, still, I'd probably include the aforementioned two tracks as bonus tracks and really promote The Beauty of Destruction for a longer period. And that's the end of Devil You Know.\n",
        "\nHoward Jones had some pretty rough years since he left Killswitch Engage - or in another sense had enough troubling health issues, even when Devil You Know was formed during that time. His problems were mostly health and mental, which to be honest is hard to speak about (preferred to be left for those that wonder). I will say that he hardly looked like himself, but he remained strong enough to put out this fantastic album with his phenomenal vocal range and style; with the help of Francesco Artusato's stylistic and somewhat progressive guitar instrumentation (as well as bass since there was no bassist during the album's recordings), backed by his performance with the pioneering deathcore band, All Shall Perish (before their breakup) and his solo project, and John Sankey on drums.\n\nIt comes to no surprise that one of the better producers in the industry was helping with this album's creation: Logan Mader. He helped a lot of bands not just in production but also with mixing and mastering. This time, though, it's merely just producing and engineering. As for the album cover: I think it looks too good for the genre. It's pretty terrifying compared to what the music offers, which is entirely the opposite.\n\nThe album's length and tracks' length is standard. All the songs are between three to four minutes tops. As good as I remember how this album turned out when I first tried it, I don't think you could ask for more (never mind that just a year later they've released another album). These three to four minutes songs feature just about enough to enjoy - and I have no doubt that you'll enjoy the music.\n\nAs I said above, Howard sounds as good as he ever had. In addition, you also get some evil shrieks and weak death growls in A New Beginning, A Mind Insane, The Killer, and Shut It Down. A New Beginning wasn't really the best opener, let alone better compared to the other three tracks I mentioned. But, it wasn't bad either. The next two tracks are by far my favorite from the band, and to this day I'm mixed on which one is my favorite. Starting with My Own, Howard is more melodic, yet still featuring them evil shrieks and weak death growls. As for Embracing the Torture, it's got one of the best choruses I've heard in the genre. It's way too powerful and uplifting; in spite of what the song's title suggests. I think Howard's vocal delivery on the chorus is what made this song the winner - or to simply put, the best song on the album. Howard showing off his respected baritone voice and cleans in For the Dead and Broken really outperformed songs of similar fashion. One of the band's famous songs, Seven Years Alone is as heavy as the first track, only it's more melodic in every aspect. This includes the guitars' instrumentation, too. It's Over's verses are very emotion-driven, while the chorus showcases more devastation than anticipated, but the clean vocals, in general, are great! Lyrically, it's one of the stronger songs, and one of Howard's best. Howard's vocal delivery on Crawl from the Dark was just - fuck... so damn good! I feel like after Howard's struggles it's as if he came back from the dead and revived the spirit of metalcore, giving it a new identity and sound. So this song would be that justification. As the song progresses, the choruses become more harmonizing, yet chaotic which is reflected from the guitars as well. The chorus of I Am the Nothing reminds me a lot of Ozzy Osbourne. I would admit the song has some unpredictable writing to it, huge thanks to that particular section.\n\nThe guitars sound from being melodic and atmospheric, to deathcore-like riffage, to Demon Hunter-like sound. A New Beginning sounds pretty simple; apart from the guitar solo. It's surely groovy and brutal, but you can see the extent. The guitars are melodic in My Own. The song itself, from start to finish, is excellent and compelling. The chorus gets much more melodic as the song progresses, and there's extra chorus effect on the bridge for extra atmosphere. The verses on Embracing the Torture are simply groovy, though the chorus's melody sounds amazing, even though it's not that audible. For the Dead and Broken features more atmospheric melodies throughout the entire track. It's one of the more calming and friendlier tracks from the guitars' aspect (other than the deathcore-like palm-muted riffs during the guitar solo). It's Over features more orchestration to complement the atmospheric verses. The guitars also get the props for their sound. A Mind Insane has both great and catchy riffs, but the guitar solo was unique and impressive. Crawl from the Dark has some sick riffage throughout the entire track, which even then sounds like modern Fear Factory, but this shouldn't come to any surprise which additionally includes the song Shut It Down. The outro solo was the best on the album. The Killer's opening riff sounds like - to no surprise again, something from Fear Factory's fifth album, Archetype; specifically from their song, Undercurrent. I Am the Nothing has an interesting reverbed or echoed effect on. Going into the verse, though, it sounds like a simple metalcore song. The bonus track, Sacrifice is another groovy and melodic track, although the riffage might sound generic. The chorus is easily the best part about this song and was really impressing for a bonus track, instead of disappointing.\n\nThe drums sound artificial for some reason but they start to sound better with My Own and forward. The drums on Seven Years Alone gives this Fear Factory or Divine Heresy vibe, considering John has worked with both bands in the past. Same can be said for Shut It Down. A Mind Insane has some awesome cymbals, while the drumming itself is just as good. Overall, they sound pretty standard, though at least less suspicious on whether it's presumably a drum machine, heh.\n\nAs Bright as the Darkness needs to be generally addressed since it's a lot different than all the other songs. You could say it's the most depressive song on the album and the most non-metal one at that. It's very atmospheric and artificial, which honestly this experimentation made it one of the best songs from the band. It's also got a music video. For the non-metal aspect, I would recommend giving the song a try regardless of the band's genre.\n\nThe Beauty of Destruction should be considered one of the best metalcore albums. Not only it's mature, but it's also very different and experimental. It is original and doesn't come off as something repetitive or something one hasn't heard of. Fresh would be a suitable word to describe this record. With that being said, while I would say it's perfect but perfect to what extent? Obviously, I have to say biased and give it my utmost appreciation, while the only lacking factor was the production of the bass. You can hardly hear it, but it doesn't take ANYTHING away from this masterpiece whatsoever.\n\nI thought to myself while I listened to this album for the very first time, it looked like a solid 8. I think the songs that I didn't like were A New Beginning, For the Dead and Broken, It's Over, either A Mind Insane or The Killer, and the bonus track, which regardless now I think I've complimented some of these songs very thoroughly and realizing that they're so good, they've grown on me instantly. I still feel like that maybe A New Beginning is the worst song and takes a little bit from this incredible debut. Honestly, though, it wasn't that bad as I used to remember. Best tracks are My Own, Embracing the Torture, tracks 6 to 10, As Bright as the Darkness, and Sacrifice. I know, it's 9 out of 13 songs. It's a lot to mention, but they're simply that damn good.\n",
        "\nWhenever I'm not worshiping satan and listening to black metal, I sometimes like to bump something different. something a little less destructive on the ears and not too taxing on attention. I got to discover Devil You know due to their singer, who also happened to sing for Killswitch Engage at a certain point in time, after being replaced by the singer who held the same post before him. Admittedly, the Devil you Know plays a very similar style of metalcore, however, these guys still take it up a little notch. \n\nHoward Jones's vocal delivery on this single is extremely impressive. He manages to pull off some pretty low growls. The song starts off with a drum solo, then instantly kicks in into melodic riff-mode. The atmosphere of the song starts off being a little oppressive, relying on groovy short interweaved breakdowns. Don't get me wrong, the popish, more accessible, extremely cheesy choruses we associate with Killswitch Engage are also present on this single. However, in my humble opinion, it doesn't really manage to hit hard enough as a Killswitch Engage chorus would. I think that the chorus takes itself too seriously and makes it pass off as really alienated from the rest of the song which sounds wholly more organic and less self-aware. \n\nThe solo is where the song gets to an epic climax. The short breakdowns, and the ear-friendly riffs, all lead up to this point. The solo makes a lot of sense when considered as part of a whole song. It contains the usual metalcore-wankery also known as technical metal, sweep picking, shredding, it's all there. If I had to describe this band, I would call it the offspring of Killswitch Engage and Lamb of God. It contains a lot of heavy parts, however, it also has a softer side, expressed of course, in the chorus. However, when I keep thinking about it, there's nothing that really stands out in this song. I think it would be a great addition to some metal-party playlist because it does have a strong groove which would get pits going. \n\nThe production on this single is crystal-clear. I'm sometimes very skeptical about this sort of production on most of my music, however, this sort of music was meant to sound as crisp and clear as possible. The main instrument is, of course, the guitar, heavily embellished by an ever-present bass, Howard Jones's amazing vocals, and chunky drum-fills and techniques. The song doesn't overstay its welcome, clocking in at three minutes and forty seconds, the song is really succinct and straight to the point. The song doesn't say much though really, so I'm kind of on the fence to embrace any feeling I have about this, except that it's relatively sub-par, all things considered.\n",
        "\nI am a die-hard fan of melodic brands of metal (melo-death, melo-black, melo-metalcore). With that said, I think Devil You Know has justified the status of metalcore as a valid genre. I've said time and time again that metalcore is a dangerous genre, because many bands do it WRONG. You have various horrific bands, like Demon Hunter and the like dancing around as if they're that great. \n\nFirst, this album is filled with a balance of melodic death metal, hardcore, and some experimental moments. You will discover that there is a frenzy of amazing break-downs (oh shit - did I just praise break-downs? Well get the hell over it). The drumming is typical of metalcore, and in some places I am reminded of All That Remains which can prove to be completely disastrous, this band however makes metalcore look good - don't forget the opening thesis of what I said.\n\nSecond, the vocals in this band are none other than ex-Killswitch Engage vocalist - Howard Jones. Howard's vocals are a necessary force in the realm of heavy music, in this album his voice seduces us. The highlights of his vocals can be seen in \"Seven Years Alone,\" where he moves in a melodic death metal tone, and at certain moments climaxing with metalcore screams, and at certain instances he does his clean vocals. Which is plain brilliant, his voice is indicative of the maturity he presents - even though it seems to make things sound alternative (like \"I Am The Nothing\" which in my opinion is a song that was almost boring). Nevertheless, considering the range that Howard captures, I think his vocals are praise-worthy based on the entirety of the album. \n\nThird, the guitars are strikingly similar to All Shall Perish's \"The Price of Existence\" and \"This Is Where It Ends\" in a variety of instances, especially \"A New Beginning,\" \"Crawl From The Darkness,\" and \"Seven Years Alone.\" It didn't come as a surprise to notice that All Shall Perish guitarist Francesco Artusato is playing here. However even amongst the similarities here, Devil You Know succeeds in producing an original album.\n\nConsidering the entirety of this metalcore piece, I think Devil You Know is actual evidence that metalcore is still a decent genre. If you are not a retard who thinks too much of yourself in terms of \"pure metal,\" by all means listen to this. This is a metalcore album which will not be forgotten, and dare I say a definite challenge to the position of Killswitch Engage's \"Alive And Just Breathing.\" Killswitch Engage, you have been dethroned.\n"
    ]
}