{
    "Band Information": {
        "Country of origin:": "United Kingdom",
        "Location:": "Stourbridge, West Midlands, England",
        "Status:": "Active",
        "Formed in:": "1976",
        "Genre:": "NWOBHM, Heavy Metal/Hard Rock",
        "Lyrical themes:": "Fantasy, Fiction, Love (early); Society, Life, Introspection (later)",
        "Current label:": "Silver Lining Music",
        "Years active:": "\n1976-1985,\n1991-1994,\n2000-present ",
        "Number of Reviews": 34
    },
    "Band Reviews": [
        "\nAside from the ascension of thrash and the continued growth of the metal underground, there were some strange things brewing in the metal scene in 1983. Pyromania’s release and phenomenal success would pave a new for metal bands to become increasingly stylish, pop-orientated and, soon enough, seemingly hundreds of bands were chasing the rightful success of Def Leppard (alright, so Quiet Riot were major hitters, but their material has often struck me as a little unremarkable). Similarly, major bands fell into an odd streak in ’83 – Motorhead’s ill-fated yet spectacular year with Brian Robertson and Sabbath’s bizarro one-off Born Again were all odd occurrences in this annus mirabilis of heavy metal. Amongst all this great change, Diamond Head found themselves between a hard rock and a pop place: clearly poised for bigger things (you might note that Canterbury and Pyromania share an engineer, although they certainly don’t share multi-platinum sales) but unable to capitalise on that whilst appeasing their original fanbase. While Metallica never covered any songs from this record – they might well have learnt from its folly when it came to their own crossover, ultra-mega-hyper seller in the early 1990s. \n\nUpon listening to Canterbury you’ll notice a few things: \na)\tThe band are clearly taking those Led Zeppelin comparisons seriously, albeit in a more Houses of the Holy/Physical Graffiti way – which is fine by me, as that is probably the most interesting era of Zeppelin. \nb)\tDiamond Head are clearly pushing for radio play and “crossover” into a much more mainstream audience. \nc)\tThe band’s famous BIG RIFFS are notable in their absence here. I consider Canterbury to feature a towering, gigantic Sean Harris whilst a Hobbit-esque Brian Tatler cowers in his supporting role in the corner. Quite unlike Lightning to the Nations, which was chock-full of some of the greatest riffs you’ll ever hear. \n\nWeirdly, despite all these warning signs and portents of a NWOBHM band’s doom or sonic disaster, Canterbury ends up being quite a charming listen. It is evident to me that the band are clearly talented enough to pull this style off (okay, let’s rephase: Harris and Tatler are talented enough, as their old rhythm section seemingly got the boot here hence an array of bassists and drummers credited on the album itself, it does reek of label interference). So, in the end, most of their Zeppelin homages are appropriately measured and their attempts at commercial rock are pleasing. Certainly, of all the NWOBHM belters, Harris is the one who has the most typically commercial voice. It’s telling that - in between stints in Diamond Head – he did produce some pop, AOR record that certainly is an amusing curio. \n\nThat’s not to say that Canterbury is without its flaws. The aforementioned tiny presence of Tatler is a disappointment given his prowess as a riff-writer. It’s hard to imagine that his riff-well had run dry of monster riffs, but it’s clear that – with Page as his muse – he’s pursuing a more subtle approach for the most part here: clever rhythm guitar textures, 12-string passages, alternate tunings and a guitar sound that barely passes a light crunch are the order of the day. Even his guitar solos tend to be very brief, “serve the song” passages. He’s good at this new style, but he was… better on the debut what with all its youth and fire. Furthermore, unlike, say, Pyromania some of the material does feel a bit “old hat”, what with the “stock” nature of some of the rhythm guitars (to quote Lars Ulrich). Similarly, some of the commercial songs feel like another lusty ode to young love (you’d make a fair guess that ‘One More Night’ is such a number, whereas ‘I Need Your Love’ is actually the most typical Diamond Head number of the album, if you overlook the new wave-ish section after the intro – so let that be a testament to how far the band have shifted from their debut). \n\nThat said, at its best, Canterbury is a very pleasant listen if you’re onboard with its stylistic quirks. Given its spritely bounce and infectious chorus, ‘Out of Phase’ wouldn’t sound out-of-place on the radio in between Dexy’s Midnight Runners and Wham. It’s almost amusing on the more epic numbers, how the band refrain from letting their heavy metal roots show: ‘The Kingmaker’ gives what would be heavy guitar parts over to the keyboards (and yes, it is very clear that the band want to write their own ‘Kashmir’). ‘To the Devil his Due’ might have a song title that promises darkness and metal, but it sounds more like a sultry James Bond theme than a hard rocker. Harris is clearly in his element crooning along and, props to him, he has the pipes to pull it off – even if the song ends up being too lethargic for my tastes. Even when the songs break out of a mid-tempo (only just!) it ends up being very much an ‘Achilles’ Last Stand’ rather than a ‘Helpless’. You can imagine Diamond Head looking at a very big Zeppelin-shaped void left in the rock scene and dreaming, wondering if they could be the ones to fill it. \n\nUltimately, however, I can’t help but wonder: who is Canterbury aimed at? If you compare it to a Pyromania it lacks a certain hit-orientated firepower and it’s clear why the metal world would be enamoured with, say, Piece of Mind whereas Diamond Head’s third is barely remembered at all. Even if we compare it to Saxon’s Crusader - a similarly lighter record from a heavy band – it’s clear that Saxon still manage a much more marketable album than this given its out-and-out energy and occasional epic. On this note, the record’s best track is moody, sultry ‘Ishmael’ whose Eastern feeling is like a reveller on opium travelling across distant lands in his mind. It’s really beautiful… but I’m not sure if it would win many hearts and minds in a hard rock climate in 1983, and certainly, I don’t think Diamond Head were able to reach many people outside their heavy metal postcode. \n\nOverall, I’d recommend Canterbury to those interested in seeing where Diamond Head drifted off to after their wonderful debut. It’s a strong record in its own right – even if it’s a little confused: quasi-proggy but lacking the rhythm section to take it into real prog territory, Zeppelin-esque without the chest-beating, broaching on Leppard territory without the hits and occasionally dark but without the expected heaviness. I’m not surprised the band sunk into oblivion for the next decade – especially given the cut-throat nature of major labels. Next time you pass over this one in the second-hand bin, perhaps give it a shot… you might be pleasantly surprised.\n",
        "\nThe NWOBHM phenomenon is sometimes difficult to explain to non-metalheads or casual music listeners. To most of them, it will sound “more of the same”, referring to classic heavy metal, a thought and phrase that clearly denotes their lack of ability or interest in discerning between similar metal aesthetics, and also a disdain for learning. For those willing to become initiates with the curiosity to understand what it meant (and still means) to metal, my usual and simple approach is to describe it as a bridge between the past, the original creators of 70s hard rock/heavy metal music (Sabbath, Priest, Purple, Zep, Heep…) and the bright (and dark) future to come, with bands paying homage to the first metal sounds while simultaneously trying to surpass its heaviness and aggression, an ambition that ended up spawning many of metal's genres. Perhaps there's no clearer example of this than Diamond Head's debut, Lightning to the Nations, an album whose importance and impact looms much larger than the rest of Diamond Head's discography or career.\n\nIf classic metal albums are measured by their influence, I doubt there are few, from the 80s onward, that could compare to Lightning to the Nations. As a certain polemic Danish-American drummer once proclaimed, while introducing the remnants of this band to a new audience: “They're the fucking reason Metallica exists, it's that simple. If it wasn't for them, we'd all be doing something else”. That does the trick. The story of Metallica's love for the NWOBHM and Diamond Head in particular, is well documented. They've covered some tracks of this album several times, even live with other thrash metal legends. Diamond Head directly influenced the creation of thrash metal and Metallica (and therefore, subsequently, also Megadeth), themselves one of the most influential metal bands of all time. That alone warrants a tremendous, legendary status by itself. The reason of that influence becomes crystal clear while listening to some of compositions here. \n\nDescribing the sound of Lightning to the Nations to newbies could be accomplished by comparing this great metal masterpiece to a photograph, or more precisely, a photogram, of the exact instant when the 70s and the 80s collided. On one hand, Diamond Head provided the world with some of the strongest traits of the classic hard rock; a youthful but potent, charismatic and vocally seductive frontman in Sean Harris, with a good range and great attitude. Also, an axe-grinder with all the technical chops of the time and the creativity to build upon his influences, resulting in himself becoming an influence for the coming generations, and a rhythmic section that, while might sound dated for our current times, was rock solid and everything the vocals and guitars lines needed to shine. On the other hand, the expanded aggression of the Sabbath/Priest influenced riffs and the, literally, more evil imagery, sliced forth to lead the charge of 80s metal world domination. \n\nBrian Tatler became a METAL GOD here, and his work will forever resonate thanks to the domino-effect his seminal and stellar guitar playing set forth as his compositions were put to tape. The combination of his six-stringed mastery with Harris' energy and swagger was almost virtually unmatched for a NWOBHM debut, barring Iron Maiden, but I'll take Lightning to the Nations over the Maiden debut due to the fact that there are two colossal, in every sense of the way, tracks here than manage to overshadow even “Phantom of the Opera” itself. Side A closer, “Sucking My Love”, and the iconic “Am I Evil?” opening side B, have a set of transcendental riffs that easily obliterate most things ever released under the NWOBHM tag. When you compose such delicious, headbang-inducing rhythmic units, you should exploit them like there's no tomorrow, and that's precisely what the band did. At nine and seven minutes long, there's just not a darn second wasted. Though not the only neck-pulverizing tunes here, those two towers of pure metal awesomeness constitute the core of this record, the next evolutionary step of the beast that arose from the embryonic sac of “Symptom of the Universe” or “Tyrant”. \n\nWhile the foreboding, dark intro to “Am I Evil?”, a motif from Gustav Holst's \"Mars, the Bringer of War\" had already been used in rock music, among others, as heard in fellow Brit heavy psych band Andromeda's “Return to Sanity”, from their homonymous 1969 debut, Diamond Head made the most epic and spooky use of it. The added Purple-esque organs on “The Prince” also serve to increment the dark mystique of the album, and that song in particular, another of its highlights. But in reality, there are no fillers here, the upfront rockers “Lightning to the Nations”, “It's Electric” and “Sweet and Innocent”, are COVID-19-catchy, fierce, sexy and… well, more than sweet. Closer “Helpless”, almost reaching the seven-minute mark itself, successfully combines the long-winded approach with the dynamic, fast-hitter aesthetics of the shorter tunes, with some proggy stop-and-go sections thrown in. Diamond Head would try to explore their proggier side for their ensuing releases, a stylistic mistake that nonetheless just incremented the uniqueness of their incredible debut. \n\nI'd probably kill to get the original Lightning to the Nations vinyl press, but have to conform myself with an expanded CD version that features a collection of b-sides and singles, most of which are decent and cute, but definitely lack the metalness of the original seven songs, with the exception of “Streets of Gold”, that has a cool Killing Machine vibe. The last couple of tracks from the Diamond Lights EP are also enjoyable. The line “only time will tell if I make it myself someday” from “Helpless” might still provoke some discussion when referring to the careers of the musicians involved in the creation of this classic, but there's no denying that Lightning to the Nations remains and will forever be a heavy metal top-tier highlight, a time-defying, decade-bridging marvel that will continue to gain adepts and cultists for as long as metalheads exist.\n",
        "\nNope. Nope. Nope. This is… EASILY… the second worse thing to have come out of 2020. After Coronavirus, that is. I was curious about it… for the two minutes that the “I am Evil” intro lasts. When I listened to the main riffs and vocals, yeesh! I swear I didn't know if I'd laugh or cry. I actually farted in its general direction, as instructed by John Cleese. This is EXACTLY as if Disturbed had chosen to cover the greatest 1980 metal release in existence (with apologies to Heaven and Hell by Dio and co.), Lightning to the Nations by the ill-fated but incredible seminal Diamond Head. Funny thing… the album's artist IS Diamond Head. Lead guitarist Brian Tatler is the only remaining link to that once significant outfit, with current frontman Rasmus Bom Anderse, Diamond Head's third studio vocalist, already in the band for several years. Now, I've listened to Diamond Head previous two releases with the Danish Andersen at the helm, and they were quite enjoyable pieces of modernized heavy metal, with almost nothing in common to the band's 80s material, save for Tatler's vintage metal playing style. But this… this is an UTTERLY unnecessary re-touching of one of heavy metal's most classic and iconic works of all time, following the ill-advised footsteps of Exodus' 2008 Let There Be Blood or Manowar's recent dual classic album re-recordings.\n\nNow, I have nothing personal against Rasmus Bom Andersen. They guy is fronting a modern metal band under a classic, legendary moniker and all he has done is to own it and contribute to a new era that in the last decade, which saw the band release two solid works, 2016's self-titled record and 2018's The Coffin Train. The guy doesn't have a great voice, but he sings with passion, contributes orchestrations and occasional additional guitars, so he's undoubtedly talented and focused in this. Was he an adequate choice to replace or replicate Sean Harris' immortal performance on Lightning to the Nations? HELL NO. Is it his fault? HELL NO. I think the one that had an issue against Sean Harris is his former brother-in-arms, Brian Tatler. Or perhaps it was just the band's intent to cash-in via newbies and more recent metal fans' exposure of a modernized classic, with all the current love for 80s-throwback and retro-metal going on. In any case, the intentions seem dishonest and selfish at best, perhaps even malicious. Andersen's vocals, which are way closer to Disturbed's David Draiman than to Sean Harris', feel totally out of place here. He's really out of his league and totally lacks Harris' youthful charisma, potency and, dare I say it, sexiness. The longer tracks are the ones that suffer the most from his plain delivery. \n\nBut again, the idea of this aberration wasn't his, as most signs point out. In Tatler's words: “We thought it'd be great to re-record the debut album with this line-up and the modern technology available. The original album was recorded and mixed in a week, and we were very young, still 19/20 years old when it was recorded, so there's a lot of that youthful energy. But we didn't have the technique, time or craftsmanship to record it with the sort of power that we could now. So that was a real thing to savour: the opportunity to go in the studio and record these songs fresh and vibrant.” Well, fresh and vibrant is not how I'd describe the sound on Lightning to the Nations 2020, rather, overproduced, insipid and of bad taste. Sure, the guitars are heavier, and the Death Magnetic-esque mixing flexes its brawn with might, the American way for mainstream metal music, but for all intents and purposes, the whole album lacks the soul, flavor and passion of the original one, a NWOBHM treasure that bridged the hard rock world of the 70s with the expanding and refining metal world of the 80s. 1980's Lightning to the Nations’ DIY naivety, its perceived flaws and imperfections are part of the everlasting charm it bestowed upon mankind and prompted several youths in the San Francisco Bay area to form several inspiring bands of their own. This magic can't be replicated by consciously modernizing it, nor the polishing of the surfaces will make the results more brilliant, au contraire, that's exactly why classic gems of decades past should remain as they are; untouched. \n\nSo yes, the production is a big issue, as expected, with the exception of Tatler's guitars, which sound pretty good to be honest; a full, crunchy sounds in the riffs, and fiery potency during the solos, even though that translates to a vapid extended version of “Am I Evil” or a mutilated one of “Sucking My Love”. The rhythmic section is ice-cold robotic in both performance and sound, even if the aggression has been revamped with the four-decade developments of metal music. More double bass and a thicker bass guitar sound, as clearly exposed in the new version of “Helpless”. Another modernizing aspect are the very subdued but audible extreme metal grunts added here and there, under Anderson's efforts. But it really doesn't matter; this whole record is a waste of everybody's time. Fans should adhere to purchasing the original if they can or having a try at Diamond Head's most recent output. The musicians involved should have produced new, original material, rather than this deplorable rehash. The only somewhat salvageable items here are the covers, especially “No Remorse” and “Sinner”, good choices in songs, but uneven performances as well (this line-up totally lays waste to any atmospheric moments the original versions ever possessed). Hell, the whole thing feels like a setlist of cover versions by your local hard rock/metal bar ensemble. \n\nI wish bands stopped doing these pointless re-recordings, but it appears it has become sort of a trend in the 21st Century for veteran bands. The only two such offerings I think somewhat bring an upgrade are Dimmu Borgir's  Stormblåst MMX and, to a much lesser extent, Sodom's The Final Sign of Evil, though both trade the originals grimness for better production values. The only one I have bought is the Norwegian's, and that's the only one I ever intend to have. A new Lightning to the Nations studio version is virtually unjustifiable. A live rendition/tribute, a complete re-interpretation with a more experimental approach… that might have worked to a degree. No option to surpass the 1980 version was ever attainable. It's not about being close-minded, it's about minding the legacy that no amount of time will ever tarnish.\n",
        "\nDiamond Head, at least until recent years, has been the epitome of wasted potential in metal. What once started out as a top-tier NWOBHM trailblazer with the classic and highly influential debut Lightning to the Nations, and even billed as the \"next Led Zeppelin\", quickly degenerated into failed experiments and \"progressive\" wankery - the result of many poor decisions and vain grasping at rock stardom, all within a record 3 years. But not even this was to be the end for Tatler & Co.; if the band had reluctantly shot themselves in the foot with Canterbury, they had forcefully taken a shotgun to the face with Death and Progress. This was the ill-conceived \"comeback\" after 10 years of dormancy that nobody expected nor wanted, and was finally released in 1993, the year where metal as a whole found itself in a mid-life crisis.\n\nHaving more in common with Guns N' Roses than the NWOBHM movement that they abandoned all those years ago, or even any form of metal for that matter, Diamond Head have successfully taken the fastest route to commercialisation on this record. This is the kind of radio hard rock you'd play on a mundane 30-minute road trip to make the journey seem like a grandiose expedition. It's a thoroughly generic experience with the obligatory ballad 'Calling Your Name (The Light)' for posterity, with just scraps of the detectable elements that defined the band's sound previously. In fact, they were seemingly so desperate to compensate for their lack of musical talent at this point that they had to get Tony Iommi to play on 'Starcrossed (Lovers of the Night)', and Dave Mustaine to play on 'Truckin'. Why either of these legendary guitarists wanted to waste their talents on these insipid songs is beyond me, but their contributions make these tracks the only real highlights on this album, even if they're sorely under-utilised. Unfortunately though, they're the first two on this record, so everything afterwards takes even more of a dive in quality.\n\nThe most obvious red flag that immediately sticks out here is Sean Harris' new vocal style. He was always one of the more melodic vocalists in NWOBHM, but his approach worked on the debut because he was establishing a second melody to Brian Tatler's hyperactive riffs, so he didn't dominate the songs but still kept them interesting. Here though, it's almost like he actively goes out of his way to make the songs as annoying as possible to listen to. He inexplicably hums along to the dumbed down riffs sometimes, and also overdubs his voice on the choruses; you can bet as well that there's a lot of \"Ah\"s, \"Oh\"s and \"Yeah\"s, an approach he could have ironically borrowed from James Hetfield if nobody else at this point in time. Of course a new sound wouldn't be complete without a new equally idiotic look, so on this album's promo video, he performs exaggerated motions with this embarrassing 'sexy guy' attitude, all while of course donning a biker jacket. As for the other musicians, the bass is audible enough but might as well not even be there, mostly playing the same note in 'Calling Your Name', while the drums although equally nondescript most of the time do pick up the pace towards the speed of early Diamond Head at times, like at the end section of 'Starcrossed'.\n\n'Wild on the Streets' is the only song with lyrics resembling anything intelligent, but even that comes off as just another attempt to be socially relevant without possessing a shred of authenticity. Meanwhile, it seems the band has gone beyond just borrowing time, as near the end of 'Damnation Street' a riff very similar to that on their classic opus 'Am I Evil?' starts to pop up, a sure sign that Tatler didn't have quite the creative spark as he used to. Speaking of which, there is a sore lack of memorable or unique riffs on this album whatsoever, robbing the music of what memorability it could have had. It's ultimately a frustrating waste of potential since Tatler was far more capable than this as his performance on the debut attests to, and even on Canterbury he hadn't abdicated all responsibility towards constructing half-decent riffs. At least this album goes out on quite an unexpected bang with the final track 'Home' rapidly picking up speed at the end, to the point that the band comes dangerously close to inventing glam speed metal. Though thankfully, that doesn't happen and we are finally released from the torture of having to listen to Sean Harris poorly attempt glam vocals for a whole 40 minutes.\n\nOn the whole, Death and Progress turns out to be among the worst sell-out albums of 1993, alongside those of many other bands that took the money train such as Annihilator, Anthrax, Sepultura and Entombed. In all its inoffensive hogwash, it represents a band that had effectively committed artistic suicide, and for the second time no less. This time it was even more fatal, as Diamond Head wouldn't show a semblance of a return to their former glory for another 23 years, and even then fans had to wade through two more mediocre albums to get to that point. I'll now close this tragic story of the British band that couldn't, with one of their vacuous yet equally prophetic lyrics penned for this very album: \"Walkin', walkin', walkin' down on Damnation Street...\"\n",
        "\nThere are many doubled edged swords lain before veteran artists seeking to continue their ongoing journey, but the most treacherous of them all is the elective task of rerecording past material. Though opinions may vary, more often than not a band that attempts to bring a seminal offering from a bygone era into the present day with a newly minted the production often finds themselves either robbing the original character of the songs in the process, or otherwise battling insurmountable expectations from the old guard of their respective fan base. Adding a further wrinkle into this risky venture, in the case of a band from the early days of heavy metal, is the ongoing trend of bands trying to recreate the old rustic sound down to the last sonic nuance, often to the point of incorporating almost every flaw present from the days of analog recording. Yet there is one band that seems willing to buck this trend of late and have struck auditory pay dirt while doing so, and that is the iconic NWOBHM act Diamond Head.\n\nTo those who remember the early 80s when heavy metal was the law in the British Isles, the stellar debut outing that was Lightning To The Nations needs no introduction. It functioned as something of a bridge between the older, hard rock roots of the style that progressed through the 1970s on both sides of the Atlantic and the newer, nastier sound that was beginning to rear its head thanks to the exploits of Motorhead and a few others. But those who were born in the years since will likely only know it through the promotion that it enjoyed via the homage repeated paid to it by Metallica throughout their early years and their regular practice of covering select songs from it. Were the latter group of metal devotees who may well only know such seminal classics as “Am I Evil?” or “The Prince” due to the 1998 Garage Inc. LP to hear the original 1980 opus today, it might barely pass for a metal album by current standards and be more readily seen as a successor to Led Zeppelin or Deep Purple with a more abrasive guitar presence.\n\nWhile this 40 year anniversary tribute to the original is tailor-made for those accustomed to the highly compressed, maximum heaviness production practices of the present day, it is also faithfully realized for those loyal to the humbler sounds of yesteryear. Despite original guitarist and co-founder Brian Tatler being the only musician with any connection to the 80s incarnation of this band, let alone perform on the original album, it comes with a comparable degree of musical credibility that shines through its more industrialized skin. Vocalist Rasmus Andersen has both the range and the power to match the soaring character of Sean Harris’ original performance, but also proves apt at adding some rougher edges to coincide with the more aggressive tone of this particular rendition. Likewise, the chunky and distorted bass work of Dean Ashton and the thunderous punch of Karl Wilcox (the second longest serving member of this fold) provide a solid foundation that is loose enough not to lose the rocking roots of these songs, but also tight and ferocious enough to give things a moderately thrashing character.\n\nSelecting a standout moment from the revisited seven compositions that rounded out the original would be a fool’s errand as the original was a pinnacle moment in heavy metal’s versatile character and qualitative consistency. The generally mid-paced rocking good times of the opening title anthem “Lightning To The Nations” and the jazzy shuffle with a heavy edge “Sweet And Innocent” are powerful examples of how the style’s bluesy roots and Tatler’s spiced up riffing can easily translate into a heavier template. Likewise, the drawn out jam session with a raunchy lyrical approach “Sucking My Love” showcases the style’s affinity with the 60s and 70s rock template where time limits were optional and all but non-existent in the live venue. The flash and flair of speeders like “The Prince” and “Helpless” build upon the strides made by Judas Priest while also showcasing a more adventurous songwriting approach bordering on epic in scope. But if there is one song that stands out from the pack, it’s “Am I Evil?”, if for no other reason than that its proto-thrashing character and its status as the most iconic metal anthem since Black Sabbath’s eponymous offering fits perfectly into this darker and more forbidding production sound.\n\nYet insofar as this album is a retread of the past, it functions also as a tributary offering to the whole style and a guide as to where the Diamond Head sound came from when considering the included cover songs. The renditions of “Immigrant Song” and “Rat Bat Blue” confess of a band that was very much aware and tightly rooted in the traditions that were handed down from Led Zeppelin and Deep Purple in the years prior to their formation, and the only thing more surprising than how well these earlier rock anthems fit into the modern heavy metal template is how seamlessly Andersen’s vocals can shift towards the banshee wailing days of yore. On the other hand, the inclusion of Judas Priest’s classic, long running metallic trailblazer anthem “Sinner” showcases where Diamond Head’s stylistic affinities were most concentrated during this album’s original composition given its heavy similarity to the majority of the original 7 tunes. Combined with the cover of Metallica’s “No Remorse”, which sounds so similar to the original version it could almost be its twin, it was equally clear that Diamond Head were both with the times and ahead of the times as they were tied to the glory of the past.\n\nIn the vast majority of occasions, the remake will pale in comparison to the original. This particular case differs in that it avoids the trap of sounding too similar or too different from its source material; a fine line that few can walk affectively. It’s a testament to the glorious history of heavy metal that continues to buttress every new act that comes raging out of the underground, but more so an example of how a guitarist with a vision and some impressive chops can build the same basic monument of greatness with an entirely different fold of musicians. To be clear, there is not a dull moment to be experienced during any of these eleven performances, but it’s impossible not to find oneself itching for Brian Tatler’s idiomatic guitar solos to come roaring into the foreground, providing a missing link between the frenzied blues noodling of Jimmy Page and the virtuoso shredding of Ritchie Blackmore and Eddie Van Halen. In essence, the only thing that makes Lightning To The Nations 2020 inferior to its 1980 original self is that the latter was recorded first.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nAh, Diamond Head: proof that derailed hype trains are by no means a recent phenomenon. The New Led Zeppelin and the apple of Metallica's eye wrote one superb album, immediately soiled it with Borrowed Time, and then sang along to the same slow rock lullaby as most of its NWOBHM compatriots. If you haven't heard of Canterbury, or perhaps only have a faint inkling of its existence and concluded it wasn't worth unearthing, don't feel bad. However, as far as risk-averse dad-rock written at the request of oblivious record companies who plugged their ears and sung 'Don't Stop Believin'' at the top of their lungs whenever anyone told them heavy metal was a commercially viable genre in the 80's... goes, it's actually not too shabby.\n\nCanterbury, by virtue of its cohesive subject matter energized by decently imaginative songwriting, is nowhere near as boring and amateurish as its contextual brethren The Wreck Age and Crusader. My chief advice for enjoying this album is to view things in this metric, and forget Lightning to the Nations even exists. Defined by slow-rolling tempos and soft, pensive riffing, this album shares more in common with the bell curve of latter-day Jethro Tull; think specifically Broadsword and the Beast and Crest of a Knave. Organic, bluesy passages blend together with some degree of caution, making long-awaited solos feel all the more rewarding. Mind you, even standouts like the galloping 'Knight of the Swords' and the spacey, synth-propelled 'To the Devil His Due' aren't quite as fleshed out nor captivating as 'Broadsword' or 'Farm on the Freeway'. I'm just saying the similarity was potent enough to make me wish I was listening to Broadsword instead. Okay, so apparently I'm no good at this 'pardoning' thing.\n\nWhile its unexpected capacity for experimental, folksy melodies shouldn't be understated, it's returning vocalist Sean Harris who truly saves this album. His pipes are simply immaculate, hitting some dramatic notes without any evidence of effort. To my ears he sounds similar to Vic Wright, Tokyo Blade's second vocalist after spurning the more rakish, Di'Anno-style Andy Marsh. And, much like Tokyo Blade's fate, Canterbury adopts an unmistakably cleaner-cut aesthetic that frankly doesn't even resemble metal anymore. \n\nThat doesn't necessarily mean it's bad music, though, as evidenced by the dreamy cruiser 'Ishmael'. Harmonized sections and blues-addled howls work in tandem with the sagely acoustics, developing an eerie countenance as if attempting to hybridize classic Queen with Blue Öyster Cult. 'Ishmael' is one of the album's flashes of proggy genius that actually legitimizes their abandoning of the hot-blooded speed metal they just got done inventing. ...But all that's from an album I told you to forget about, remember?\n",
        "\nAbout 40 years ago the NWOBHM was the premier avenue of expression for the British rocker who was either down on his economic luck or otherwise in need of letting off some steam, yet unwilling to embrace the anarchy and scorn for virtuoso musicianship that was rampant in England’s punk rock scene. Diamond Head was among the bands that were poised to take not only their island of birth, but the whole world by storm with an onslaught of massive heavy metal anthems that arguably helped pave the way for thrash metal and also a series of glowing endorsements in print media. Alas, a combination of finicky sentiments in the music consuming population and heavy competition between numerous bands in a crowded style were among the factors that kept this from happening, yet due to renewed interest, in part, thanks to the promotion of their material by Metallica, this band has managed to weather the storms of change and returned after nearly 4 decades since the recording of their seminal debut Lightning To The Nations for another go.\n\nThough the trials and tribulations that followed in the 90s and the new millennium saw this band meeting with varying degrees of success in the studio, the core of this band in guitarist and now lone founding member Brian Tatler has showcased a desire to continue moving forward rather than outright dwelling upon the glory days of 1980. Nevertheless, the latest incarnation of Diamond Head finds an album in The Coffin Train that lands a good bit closer to the epic, grandiose, heavy yet still hard rock-infused formula that first brought their name to prominence during heavy metal’s primordial days. A lot of this is due to Tatler’s riff work and songwriting getting a sudden shot in the arm, but one would remiss to deny the massive impact that relative newcomer in Danish-born vocalist Rasmus Bom Andersen has on things. His voice matches the wide range and versatile demeanor of original front man Sean Harris, but has a more soulful and rugged quality to it that is occasionally reminiscent of Chris Cornell, particularly during more subdued moments when his voice is fully exposed.\n\nAs mentioned previously, the old school hard rock vibe that Diamond Head exhibited in their early days is still very present, albeit presented in a more raucous and massive fashion due to the exploitation of modern studio methods. The more grooving, mid-paced and quasi-psychedelic character of songs such as “The Phoenix” and “Shades Of Black” definitely point to their roots in the archaic 1970s sounds of Led Zeppelin and Deep Purple, while Andersen’s somewhat huskier vocal affectations give it an ever so slight grungy flavor. On the other hand, the outright Black Sabbath inspired punch of “The Sleeper” and the chunkier heavy metal stomp of “The Messenger” definitely showcase a proportional metallic element, while the outright cruiser of a speed metal anthem that kicks things off “Belly Of The Beast” stands as one of this band’s most utterly metal moments. About the only thing that doesn’t quite conform with the nuanced packaging of an early days album in a modern package is Tatler’s lead playing, which sticks a bit more closely to a blues-based rocking approach similar to Blackmore and is generally bereft of those classic Van Halen moments he’d often trot out in the early 80s.\n\nIt is doubtful that Diamond Head will ever top the magic that they created at the dawn of the 1980s when Lightning To The Nations was heralded as having more good riffs in one song than Black Sabbath did on their first four albums (a bordering on ridiculous hyperbolic statement by music journalist Geoff Barton, but not entirely without some basis), but this is about as close as they’ve gotten to matching it in recent history. It is among one of the better fits of heavy metal conservatism to grace the 2010s since Satan’s auspicious 2013 comeback album Life Sentence, while also cutting against the concurrent trend among younger bands of trying to completely recreate the studio sound of the era that this band was born in. All in all, it’s a testament of a band that has come to acknowledge their place as a pioneering heavy metal band with a specifically defined sound, but also one that isn’t afraid to showcase their continued relevancy by amping up their sound to compete with the current crop of modern heavy and power metal bands that have been paraphrasing their style for the past 20 years. \n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nIt's incredible what new vocalist Rasmus Bom Andersen did to a band that seemed dead and gone and never managed to live up to its potential since its influential debut. The young Danish dynamite revitalized the old band that came back with a bang in form of the self-titled record three years ago that was followed by an energetic tour that more metal fans around the world should have attended. The Coffin Train keeps the momentum of the previous comeback and offers fresh, juvenile and powerful heavy metal with an excellent contemporary production.\n\nThe record starts with a bang in form of ''Belly of the Beast'' that doesn't have anything to do with the Anthrax song of the same title but ironically flirts with thrash metal influences in a highly energetic way. The vivid vocals really stand out and give some additional oomph to the speedy rhythm section and tight guitar play. \n\nTitle track ''The Coffin Train'' shows the band's other side with a more atmospheric and melodic touch and quite modern melodic vocals that successfully bring the band's sound to the twenty-first century. This song would be a great single to introduce the band to the next generation in my book.\n\nThose who are rather craving for melodic traditional doom and heavy metal should be pleased with the plodding but intense ''Shades of Black''. \n\nIf you tend to like it a little bit faster you will get something to chew on with the vibrant ''Death by Design'' with its catchy guitar lines and versatile vocals that also flirt with hard rock territories. \n\nThe band also shows a more experimental side with the soothing ''Serrated Love'' that flirts with oriental folk sounds and a domineering bass guitar. \n\nAtmospheric, epic and melodic ''Until We Burn'' is the album closer you have been waiting for without knowing it that unites all the different strengths of the band showcased in the previous tunes. This track is my personal highlight of the record and represents epic melodic heavy metal at its very best that can indeed compete with the classics of the early eighties.\n\nIn case you haven't noticed, Diamond Head are back, ladies and gentlemen, and The Coffin Train might be the band's greatest release since its debut nearly four decades earlier. The veterans are better than most young heavy metal revival bands out there and this is mostly due to excellent new vocalist Rasmus Bom Andersen. Get this record and attend one of the group's energizing concerts.\n",
        "\nHindsight is always 20/20, or so the old adage goes, but even the most legendary of moments in metal's history ought not be immune to review or even historical revision where appropriate. One would be remiss to gaze upon the timeless classics that shaped the genre from its most primordial state and not find the occasional flaw, be it the alleged earliest examples of metal found in Black Sabbath's and Deep Purple's earliest offerings, or even the auspicious pioneering efforts of the late 70s and early 80s that brought things full into view. Though there is definitely something to be said for the seminal offerings of Motorhead, Rainbow and Judas Priest in the late 70s and how they upped the ante in terms of speed and aggression, a fairly solid case could be made that the short-lived Stourbridge born proto-thrashers Diamond Head hold the most consequential place in the NWOBHM due to their highly influential debut offering Lightning To The Nations. It stands as probably one of the most bizarre cases of an unsung classic, all but shaping the very zeitgeist of the harder side of the 80s metal scene, yet largely being passed up by the masses in its day as an afterthought of the older guard rather than the trailblazing feat of innovation that it has since become seen as being.\n\nThere is naturally a fairly strong case to be made that this seven song manifesto of heavy metal greatness is as much an exercise in affirming old traditions as it is in breaking new ground. The greatest indicator of this sense of metallic conservatism is Sean Harris' smooth, hard rock infused swagger, which definitely injects a strong UFO flavor into things given its heavy similarity to Phil Mogg's gleaming pipes. At times this more clean cut approach serves to bring out the more rocking and melodic throwback songs that occasionally chime in, perhaps lending some credence to the notion that this outfit was poised to be the next Led Zeppelin, while at others it plays a tiny bit against the harder hitting metallic assault of Brian Tatler's guitar work, or at least that is the impression that one might gather if approaching this album as the wellspring from which thrash metal eventually flowed. To a lesser extent, the humble production quality presented here plays a part in tipping this album away from the forerunner of Metallica and Megadeth and towards the immediate successor of Rainbow and Thin Lizzy. This is further bolstered by the bass work of Colin Kimberley being of a smoother character, even when compared to the mild raunchiness of Geezer Butler, and the fact that Duncan Scott's kit work doesn't get much fancier or more bombastic than Cozy Powell's contributions to Long Live Rock 'N' Roll.\n\nWhen getting down to it, the element that ultimately dissociates this album from the hard rock paradigm is Tatler's impact-based riff work, and by extension the manner in which the rhythm section plays into that rather than reverting to a looser jam band feel in line with the Sabbath sound. Coupled with a songwriting approach that is 100% riff-centered and completely eschews any sense of restraint or balladry, these songs build upon precedents set by Ritchie Blackmore and Tony Iommi and distills them into an iron-clad gauntlet to the skull of a sound that is heavier than Rainbow yet also more nuanced and involved than anything Sabbath had done during their pioneering early to mid-70s albums. When specifically contrasting the heavy-ended yet still rocking character of the extended groove machine \"Suck My Love\", which was repackaged and then offered up as a slower offering by Metallica's debut album in \"Seek And Destroy\", and the fast-paced nod to Rainbow's \"Kill The King\" at a notably longer duration \"The Prince\", this approach does have a multifaceted character to it, but comes off as unrelentingly energetic and furious all the same. About the only thing more impressive than the songwriting is Tatler's technical guitar soloing feats, which crisscross a litany of blues, jazz and classical influences and essentially set the stage for every thrash metal guitar god from Kirk Hammet to Gary Holt.\n\nThere aren't any dull moments to speak of here, nor any songs that could be considered outright slouches by any standard, though there is a clear dividing line between what would be considered innovative versus what reaffirms what has already worked during much of the 70s. On the latter category where things tend to rock a bit more is a charming melodic anthem in \"Sweet And Innocent\" that sets the stage for a number of more mainline NWOBHM acts such as Demon and matching the more nuanced moments of Tygers Of Pan Tang's debut. Likewise, the upper mid-paced rocker \"It's Electric\" has more of a light and nimble feel to it that falls in line with more of a mid-70s character of sound. Though these songs want for little in the fun department, the true points of intrigue here are where this safer mode of metal is deviated from, as in the punchier swinging groove of \"Lightning To The Nations\" and the massive proto-thrashing epic \"Am I Evil?\". These two aforementioned songs alone account for a direct influence on more than half of Metallica's famed debut album and, to varying extents, the early alumni of the 80s thrash metal scene, with the latter standing as arguably the crown jewel of the entire NWOBHM between its menacing riff work and virtuoso lead guitar feats. In essence, it could be stated without a hint of hyperbole that \"Am I Evil?\" is Tatler's legacy, and to this day it continues to find parts of itself in the riffs of various thrash, speed and power metal bands.\n\nAll things considered, there is little question as to how great of an accomplishment this album was, but very much so as to why its objective greatness didn't meet with the same degree of recognition as the many bands that were immediately inspired by it. Even when accounting for the fact that this band was hyped intensely by several music journalists at the time, with Geoff Barton's hyperbolic statements placing a single Diamond Head song over the collective whole of Sabbath's first four studio albums and MCA Records marketing them as the next Led Zeppelin, the immediate response from consumers and concert goers was minimal. Metallica's continued promotion of their music either through live covers and their own songwriting was likewise unsuccessful in pushing the band into superstar status, though it did lead to many associating these songs more with Metallica than their original source. Then again, it may well be that this band didn't catch fire because the media and labels of the day were out to hype the NWOBHM as a revival of an old style rather than its own new and unique thing, cutting off a needed dose of youth appeal that was inevitably grabbed up by thrash metal, which was marketed as a rebellious and innovative movement. Nevertheless, while history will cause most to question why this band didn't ascend to the heights that Metallica would using the same basic formula a couple years later, this timeless album ought to be approached as neither a bridge to the past or a stepping stone to the future, but as a stand alone classic that is overshadowed by neither its immediate past or future.\n",
        "\nBy now, most people are pretty familiar with Diamond Head’s biggest album, Lightning To The Nations, also known as The White Album. Whether you found them through all of the covers Metallica did (all of which appeared on this record), or you’re of the rare breed that knew them on their own, this proves to be quite a smash record. In 2016, they put out a double disc reissue of this album with different sound quality, and an entire disc of singles that weren’t released to an album. I figured this is worth revisiting and discussing.\n\nFor those who aren’t familiar with Lightning To The Nations (disc 1), to put it briefly, it’s basically a very raw heavy metal record that uses a lot of speed metal and teeters into the thrash zone a little bit. Songs like “Helpless” kick out the blitzing drum beats and deep, heavy riffs, while others like “It’s Electric” are a little more on the classic side of things, somewhat reminiscent of Saxon. Of course, the legendary “Am I Evil?” takes all ideas presented here and mixes them all into one sequential slab of a song, utilizing a lot of suspense.\n\nDespite all the heaviness, the lead singer’s vocals are anything but threatening, and that’s what I absolutely love about it. Never has whiny singing ever worked so well on anything. On this reissue, everything is taken from the original vinyl recording from back in the very early ‘80s and produced from there. Other previous versions of this came from cassettes, such as the one that came out a few years prior with everything on one disc, rather two. In all honesty though, unless if you’re a sound quality freak, you won’t notice much of a difference in production.\n\nDisc two is what I mainly came here to talk about, because far fewer people are familiar with it. It’s essentially a compilation, but the songs were only released as singles. The musical makeup is far different as well. Gone are the thrashier vibes and in place are more rock ‘n roll oriented builds. “Waited Too Long” has a borderline power pop feel to it, as it’s all in major scales and doesn’t use much distortion. Plus, the melodies on this are super laid back and accessible as ever. “Play It Loud” takes a similar approach but has a little more umph to it. The solo on this one is absolutely stellar and the tone reflects Aerosmith. Even “Diamond Light” has so much vocal harmony and softness to it that you wouldn’t even believe it’s by Diamond Head.\n\nBut it isn’t all just a rock ‘n roll festival, because you can still find your classic metal bangers such as “Shoot Out The Lights” or \"Streets Of Gold\" that amp up the riffwork a little more and have a shred of force. There’s just a different energy from the speedy aura of disc one. Personally, I’m glad that these songs weren’t dropped back in the day as a full length, and were only singles, because I assure you that people would bitch about the fact that it’s “not metal enough” since they can’t let their “true” metal be ruined by calmer melodic rock. Smart move on the band's part. Overall, we get a rehash of a classic heavy metal banger torn straight from the first recordings, and a shining pile of rock ‘n roll that not many have dipped into, yet should feast their ears.\n\nOriginally written for Antichrist Magazine:\nhttps://antichristmagazine.com/review-diamond-head-lightning-to-the-nations-hear-no-evil-recordings-reissue-2cd-deluxe/\n",
        "\nEspecially for this band. Diamond Head were once a prominent band in the NWOBHM scene, with their opus, Lightning to the Nations, considered an early metal classic by those who actually know about the band. They were one of the biggest hopefuls of the movement. It has been said that Iron Maiden bassist Steve Harris said they were the next Led Zeppelin. That be true or not, it never really happened for them. The band have split up multiple times and reformed once again, this time the only remaining member of the original band is Brian Tatler. Unfortunately Diamond Head's nwobhm sound which influenced the Dave Mustaines and Lars Ulrichs of the world many years ago has also all but vanished. Not that anyone should expect Diamond Head 2007 to sound like Diamond Head 1982. After all it has been over 25 years and this isn't exactly the same band. Instead of heavy metal, or even the proto-thrash metal that Diamond Head helped inspire, what Tatler delivers is melodic, late 80's/early 90's, hard rock not too terribly dissimilar from Canterbury. However, that album still had the Diamond Head sound and had a certain charisma.\n\nOne thing missing from the equation on What's In Your Head is original vocalist Sean Harris, who most certainly was part of the band's character. Filling his shoes is Nick Tart who has a similar style to Sean, but ultimately isn't quite the same. Imagine Def Leppard without Joe Elliott. I am sure the remaining members of Def Leppard could create a fine album, but Elliot is a big part of the band's sound and it would be missed. Well, the same is true for Harris and Diamond Head. However, if that had been the only thing missing, What's In Your Head still could have been a solid album. Unfortunately even the music lacks much identity, save for Killing Me. For me, that song gave a glimpse into what could have been and also retained the Diamond Head identity. For the most part Diamond Head meanders around listlessly from song to song with very little to distinguish one song from the next. Even after listening to the album four times within four days, I still can't remember much from it. Where this style of melodic hard rock excelled for bands like The Scorpions, Def Leppard and even Saxon was that it was anthemic, inspirational and ultimately fun. That's really not the case here. Ultimately What's In Your Head isn't a horrific album, but it certainly isn't a great album for a classic band like Diamond Head and that has to take a few points off.\n",
        "\nThere are albums out there that are extremely boring and therefore have nothing to remember. Then there are albums that are absolutely fantastic and extremely memorable. But what about albums that are fantastic, but not memorable, despite your thoughts otherwise while listening to it. This is one of those albums. Diamond Head's self-titled 2016 album has just now finally been released... again. I was wondering if it would ever even come out at all. It could have ended up like Wintersun's upcoming \"Time II\", or everything that Guns N' Roses is doing in recent times. But it finally settled on a date. I had listened to the first four tracks of the album when it was first released, then plans got in the way and it was too late. When I listened to those four songs a second time, I liked them a lot more than I did initially. The rest of the songs were a blast for me as well. I remember having some thoughts that it would be one of the most memorable things that I would hear in 2016. However, I found myself struggling to remember my personal favorite moments of the albums. I remembered it a lot better the second time, loving practically every moment of it. It was as if I had partied too hard the night before and then had flashbacks when looking at the photography that I had taken.\n\nI guess that the least memorable tracks are the first four, as much as I love them. This is most likely due to the fact that they have very similar riffing structures. It was repetitive, but it was still enjoyable. However, the rest of the music was much better. This is music that is pretty much what you would want from Diamond Head. Rather than the horrendous experimentation that they have been working with for the last two decades, this is an album filled with energy, rawness, as well as tons of power. The vocals are going back to their original charismatic wailing bluesy ways, which is what I have always wanted. He may not have the widest range, but it could not fit the music more. The power that he displays on the opening track of the album, \"On The Edge\", or the gritty wailing of \"Wizard Sleeve\" has not yet ceased to amaze. While not every second of every song is all that captivating, it never gets bad. \n\nAlthough the bulk of this album is nostalgic, the band has tried some new things. For example, \"All the Reasons You Live\" is still a hard-rocking track in its own right, but it seems to have a lot of sincerity placed within it, rather than the fun that we all know and love about this band. Nevertheless, it still showcases the dirty energy that the band is known for. This keeps the album from having a lopsided identity, something that is often possessed from bands who attempt this. This is also showcased in the final track of the album, though not quite as enjoyable. Quite the opposite is shown on \"Wizard Sleeve\", which is another highlight of mine. The lyrics are pretty self-explanatory when you read them out loud. It is nothing new for Diamond Head, as they have done pretty much the same type of song (lyrically) on Lightning to the Nations, with \"Sucking My Love\". It fits the music, although it isn't really anything that will really spark up all that much controversy. On the other hand, this album gets very melodic and uplifting on the track, \"Diamonds\", which is nothing that has never been heard in the metal scene, but it is still quite enjoyable, mainly the anthemic chorus.\n\nThe guitar work is definitely something that sounds good on this album, but it doesn't really stand out among the rest of the music, as it's done on their debut. But as simplistic as it is, it really holds the music together without sounding lackluster, due to a bad tone or simply subpar playing. What I love about the presence of the guitar work is how it sounds pretty much perfect with the vocals. Every vocal melody laid out completely soars over the rhythm work, until the leads come in, which sound completely energetic and epic. Everything to do with it is done without any big issues contained. Quite an achievement for an album sounding as old-school as this. Most of them just sound devoid of passion and completely boring.\n\nThis is an album that will get stuck in your head, once you have listened to it a few times. The classic rock-inspired riffs and the insanely charismatic vocal performance are guaranteed to appeal to those who enjoy the earlier work from this band. It blew my expectations up in front of my face, as well as those few who have also reviewed it. Some have given it a perfect 5/5 stars on certain sites. While I do not believe this to be a perfect album, I will admit that it is nothing short of exceptional. I am hoping that their upcoming tour will go well for them. After releasing a record that is this great, they deserve absolutely nothing less. While this isn't quite as amazing as the masterpiece that is Lightning to the Nations, it is still an amazing album. Do not be fooled by the albums that have come before it, this is a massive step over them. Do yourself a favor and do listen to this album. You will enjoy it... I promise.\n",
        "\nDiamond Head is one of those bands that pop into your head when you hear the word \"influential\". However, I feel that for about 99% of that time, this is the only album that comes to mind...and I can see why. This is an album is not modern-sounding by any means, but dammit, it's awesome. This is actually pretty diverse. It features elements of blues rock, hard rock, and some garage rock, as well. For this reason, even people who don't like heavy metal could find themselves listening to this masterpiece, every once in a while.\n\nThe music on this album is pretty reminiscent of bands such as Led Zeppelin and Black Sabbath, but it also managed to keep up with the changing sound of its genre. It's just a bit more blues-influenced, especially with the vocals and guitar work. This is also shown by the prominence of a pretty smooth bass. Colin Kimberle is not the most talented bassist out there, but he has some pretty nice bass lines here. Not really too much to say about the drumming, other than it doesn't suck. It keeps the music together. There is one song that breaks away from the usual sound of this album that I have to mention. \"Am I Evil?\" is much less bluesy and mainly just straightforward heavy metal. It's definitely the heaviest song on the album and has a pretty down-tuned, crunchy riff. Sure, Angel Witch had down-tuned, heavy riffs on their self-titled debut album, released in 1980, as well, but this album was recorded a year earlier. So for 1979, you can't get much heavier than this. This is probably why this is the most well-known song on the album.\n\nThere are two things that stand out to me the most on this album. One is definitely the vocals. Sean Harris delivers some quite soulful, bluesy vocals on this album and he has an absolutely amazing ability to shift pitch. He sounds very Howlin' Wolf-influenced (minus the growling tone), as well as quite a bit of Robert Plant. He puts quite a bit of chest and throat into his voice, which results in a voice that is both hollow and rich if that makes any sense at all.\n\nThe other thing that really stands out to me on this album is the guitar work. Brian Tatler is an extremely talented musician. His guitar work isn't exactly ahead of its time (with the exception of \"Am I Evil?\"), but it's really fucking good (and I just swore, so you know that I mean it)! His riffs are very catchy and have a pretty nice, thin tone. His solos, on the other hand, are also catchy, but in addition to that, are played with technicality. There aren't really a lot of guitarists out there who know how to do that. Being a guitarist myself, he has definitely inspired my to try a few new things out.\n\nAs musically dated as this album is, it isn't an album that hasn't aged well, in its genre. There is no older heavy metal album older than this one that I enjoy more. It took what heavy metal already was, and brought in some wider influences. Sure, heavy metal didn't really end up being like this, but this album has been an influence on many bands, most notably Metallica. If you're looking for a diverse, hard-edged album, this is probably a great album for you!\n",
        "\nDiamond Head, a band that (kinda) came to fame with the help of Metallica, after they covered not one, but 2 songs from this LP. I looked it up to see what all the commotion was about, and what I discovered, was one of the best albums in the entire new wave of British heavy metal movement, and an album that still gets regular plays from a person who is much more a thrash fan than a NWOBHM fan.\n\nI can't talk about this album and not make comparisons with the Metallica versions, so may as well get it over with quickly. Very simply, the Metallica covers are insanely different from the originals. The Metallica versions are heavy and played tightly while here the songs are not even close in terms of heaviness and are played quite loosely. I personally by far prefer these versions to Metallica's take on them, not that they are bad, but you'll have to make an opinion on this yourself. If you prefer the Metallica versions, you'll probably get very little, if any, enjoyment out of this album. Make sure to listen to more than just Metallica's version of \"Am I Evil\" is not one of the covers where Metallica changed too much around (although they clearly did make it their own song). \n\nI forget the name of the critic, but when it was released, it was said that this album contained more good riffs than the first 4 Black Sabbath LPs, many called Diamond Head the next Led Zeppelin. Of course, these are all overstatements, but really the quality of songwriting on this album is awesome. In the Japanese magazine Burn! ranked it at #3 for album with the best riffs and the Guitarists' Book of Heavy Metal put \"Am I Evil\" as the fifth best riff ever, so understand, these really are some awesome songs with great riffs.\n\nAll 7 songs here are all equally awesome, and every song has an identity. All the songs here are blues based, but they defiantly aren't a blues band at heart that just so happens to play their blues in another style, like bands such as Led Zeppelin did. This leads to riffs that sound familiar (assuming you have listened to a lot of older metal), almost as if you've heard the record before. You may view this as a good thing or a bad thing, depending on if you want something that in a way you already know or if you prefer to be challenged.\n\nFans of Angel Witch will love this album, as it is probably the best NWOBHM record made. All the songs kick ass, and there is never a dull moment. They are all very melodic compared to many other NWOBHM bands, and for me this is the album's best feature. From the starting riff of \"Lightning to the Nations\" to the closing notes of \"Helpless\" you always think that the song that is playing right then is going to be the albums best song. As I look back, I think the title track, \"The Prince\", and (obviously) \"Am I Evil\" but even they barely stand out when compared to the other almost as good songs. The riffs are honestly catchy without having to ever compromise their \"metalness\". \n\nThis is a must own for any metal fan. Heck, even country and rap fans should own this album! it is worthy of the praise it gets.\n",
        "\nThis is, in my humble opinion, one of the best albums in the whole NWOBHM movement. Not saying that I have heard everything from that era, but it is up there competing with classics such as Satan's Court in the Act, Iron Maiden's self titled debut, Venom's Black Metal and Tygers of Pan Tang's Wild Cat. \n\nAs so many before me, I was introduced to most of these songs by Metallica before I finally went into my favorite music store and bought this great 1980 album. Naturally, the songs on here have more of a NWOBHM blues feel than the Metallica covers and the production is less clear. This is not necessarily a bad thing for either Metallica or Diamond Head, they simply have different approaches to the songs. For example Metallica left out bits and pieces of both “The Prince” and “Helpless” and the drum-intro to “Helpless” sounds quite silly in Diamond Head's version. At least Metallica fixed that. Enough with the Metallica comparisons. \n\nBack in the day of its release, Diamond Head was praised with now famous quotes such as “the natural successors to Zeppelin” and “there are more great riffs in one of these songs than on the first five Black Sabbath albums”. But does the album live up to it? Well, they didn't become the new Zeppelins and even though the riffs are plenty and great on this one, it is probably an overstatement in regards to the Black Sabbath comparison. But looking at the hype in a less literal way, then yes, this band had a lot to offer. Comparing them to other bands from Britain in that period, there most definitely was more talent in this band.Which this album is proof of. \n\nThe record opens with the awesome title track and maintains the high quality level right to the end. The music is very varied both in tempo and intensity which makes the whole album very interesting. The drums have this pre-thrash groovy feel to them and the guitar work is impressive. Not only the riffs but also the lead work delivered by Brian Tatler is amazing, see e.g. “The Prince” and “Am I Evil” (the solo in “Am I Evil” is almost identical to the one Kirk did in 1984 on their cover). Also the vocals work very well. Sean Harris is no Cronos and comparisons go more in the direction of Paul Di'Anno (imagine he could hit notes) and the great Brian Ross, i.e. less aggression and more singing. He has a great tone and I have always enjoyed his singing and even his moaning on the extended part of “Sucking My Love”, with Tatler's impressive blues solo. The bass has leading parts in several songs, so in conclusion every member really does a good job. Combining this with seven great tracks and you got a really unique and interesting album. \n\nVery recommendable.\n",
        "\nThis collection of early Diamond Head demos reveals a young band clearly enamored with the heavy metal sounds of the late '70s, and also displaying some clear songwriting and instrumental chops of their own. These early cuts are all superior to the officially released versions that later wound up on \"Borrowed Time,\" or as b-sides to the singles.\n\nOf particular note is the frenzied ride pattern on \"Dead Reckoning,\" the faster pace to \"Borrowed Time,\" and the lack of backing vocals on \"To Heaven From Hell.\" All of these elements provide an experience more in line with the hallowed \"Lightning to the Nations.\" The pulsing bass melody of \"In the Heat of the Night\" is an excellent propulsion for Tatler's more basic power chords on the slow burner, using the same trick John Entwhistle taught thousands of bassists.\n\nThis compilation has surprisingly strong fidelity for a series of demos from the late '70s, and displays everything that was marvelous about the band before Tatler and Harris started emulating MTV arena rock. Frank Sinatra once said \"the past is where you screwed up, and the future's where you're dead.\" Fans of Diamond Head can point to this EP as evidence to the contrary on at least one account. The earliest years were easily the best.\n",
        "\n10 years between their last album (which was also very incoherent) and 20 years after their classic period, this album has very few traces of the Diamond Head you're thinking about. What does it sound like? part Soundgarden, part Black Label Society, a few nu-metal bits and very little Diamond Head. \n\nThe major line up change is that original vocalist and founding member Sean Harris has left, instead we get a one Nick Tart. How does he do? His vocals are upfront and loud, and he himself isn't so good, he's pretty wimpy and weak, and although his upper range is high and reminds me of Chris Cornell at times, he's mostly on \"annoying whispery pseudo sexy modern rock frontman\" mode.\n\nAfter the sucky opening track, which features some really annoying distorted vocals, \"Give It To Me\" pops up, it's a nice little groovy rocker with a nice little solo. The solos on this album are not as shred happy or as interesting as on the early 80s Diamond Head albums, they aren't very plentiful either, but you can still hear that the guitarist knows what he's doing. \n\nThe riffs here, however, just fail to stand out, and it's really a shame, because this is a band that was known for the quality of their riffage, I believe the phrase was \"There are more good riffs in your average Diamond Head song than in the first 4 Black Sabbath albums\". As I am a big Sabbath fanboy I'll have to disagree, but Diamond Head certainly had their share of good riffs. Ranging from simple catchy ones, epic ones and skullcrushing, they knew what to do. On this album, the riffs are your typical bluesy rock riffs, and don't really stand out. \n\nAs much as I'd like to deny it, this album just sounds like an average bland hard rock album, with some silly modern overtones, an above average guitarist and below average singer. I wasn't really paying attention to the lyrics, but they seem to be revolving almost exclusively around the typical boy girl rock cliches. The vocals also add to the cheese with plenty of oohhh yeah baby whooaa and knees-please fire-desire rhyming couplets. \n\nLost at Sea is the first track which sounds like it might be interesting, with it's Am I Evil intro, dark atmosphere and audible bass guitar, but then it just falls again to that typical hard rock silent verse-loud chorus-silent verse formula and ends disappointingly. The title track and Dead or Living are another pair which try to rise above the mediocrity of this album, but they also fail. Dead or Living sounds like it's going somewhere but it just keeps on plodding until it runs out of time. \n\nDrinking Again is a track with potential, it's fast and intense, and sounds kind of like Slave to The Grind. Two minutes intense enough that even the over-repetitive two line chorus sung by the nasal and annoying singer doesn't become too atrocious. Unfortunately, it doesn't get awesome. I was expecting some crazy soloing and over the top vocals to bring life to this track and to this bland album, but it just didn't happen \n\nI mean, the attempts at impressing the audience through intricate and well constructed songwriting failed, so did the air guitar value of this album, so how about abandoning that and going straight forward with everything you got? Meh... I guess it's better this way, when all the songs suck instead of a good one letting you imagine what could of been if...\n",
        "\nAhh how the mighty have fallen. This time it's Diamond Head's turn, the NWOBHM legends who \"Looked as if they were going to be the next Led Zeppelin\", according to Steve Harris.\n\nCommercial appeal is not something new to Diamond Head. There were always rooted in hard rock, which isn't exactly the most underground genre, and had their share of poppy singles in the 80s, the most infamous commercial effort being 'Canterbury'. Canterbury was commercial and different for the bad, but it still was undeniably Diamond Head and had traces of innovation and originality. This, this is just an awful blend of uninspired crap, mixed with some random 'modern' touches and a modern production. It is mostly unmemorable, and there are barely any good riffs here, most of the time the guitars are just droning around with some power chords. \n\nThe opener, Skin on Skin, introduces us to the new singer, and he isn't very good. He has a high range I suppose, but he's very wimpy and weak. No match at all to Sean Harris, who wasn't that legendary, but had personality and worked for the band.\n\nTrack 2 continues with a repetitive and uninteresting chorus, which sounds kind of like Soundgarden. This Planet and Me is the first song here to feature A SOLO! Please tell me this isn't the same guy that pulled off the opening solo to 'The Prince', or filled half of 'Sucking My Love' with unforgettable guitar noodling...\n\nKilling Me is the first track to really grab my attention. It features an okay riff, but then they feel it necessary to drop the guitars every once in a while and let some pointless acoustic strumming take their place. The ending is kind of weird and has an okay but not really great solo.\n\nThe rest of the songs continue with the Alternative Rock/Metal bluesy Grunge thing the band has going on this album, and they aren't very good either. Even the faster songs like Pray for Me just fail to be interesting.\n\nCombining boring songs, bad vocals, modern touches and a flat production, this album just sucks. If you're looking for good Heavy Metal, let alone anything which sounds like early Diamond Head, you will be very disappointed.\n",
        "\nThis album right here suffers from a fairly unique problem. It's nothing to do with the music, or at least it's not directly responsible for the problem- the songs here are of a pretty excellent quality. I'll just be frank and say that before (a long time before) I bought this album, I had already heard most of these songs done a good deal tighter, faster and sounding a lot heavier. The problem is that someone has already played these songs a good deal better, and since I heard the covers first it's hard to really get into this.\n\nSure, it's a bit unfair to say \"I don't like this album as much as I should because Metallica made these songs a good deal better\", but that's the plain out truth to it. And it's a shame, because if I hadn't heard these songs before then chances are I'd be raving about how damn excellent this thing is. Instead, I'm sitting here thinking \"man this sounds like a sloppy english version of Garage Inc.\"\n\nBut anyway, the songs. Well, they are pretty good. Very good, really. Diamond Head traffic in a fairly complex, progressive-ish sort of NWOBHM, but not really knowing anything about that genre I'd say it sounds like a lot of early thrash/speed stuff, just in a much looser, less aggressive style- it seems that perhaps at this point metal was still somewhat enamoured with Led Zeppelin and those other late 60's/early 70's proto metal bands. These somewhat unfortunate remnants of earlier music styles cause this thing to suffer a little bit- certainly a bit more distortion, a tighter approach, a bit less \"groove\", as it were would be nice- but overall this is surprisingly heavy. Am I Evil is an absolute brute of a song- I dare say the bridge riffs in this tune are so heavy that light can't escape from it. You could do a 50's crooner cover of this tune and it would still be super heavy. \n\nThe album doesn't quite continue on at that level, but there's still plenty of big riffs- Helpless kicks along with a ton of power and quite a few excellent, speedy riffs, Sucking My Love's man-sodomy (double tracking orgasm noises is never a good idea) is made up for by a really sweet main/verse riff that sounds like some particularly upbeat Sabbath outtake, and while Sweet and Innocent seems to get a bit of a bad rap for being quite rocky and less metal it's still got some rather nice riffs. Reminds me of a heavier Thin Lizzy- (although I imagine people who listen to more trad metal/hard rock would probably laugh at that), it's a pretty nice tune- catchy, not overlong - and it goes extremely well with beer. While It's Electric does sound a little bit prissy and fey at times, that's the production more then anything. It's still a pretty cool hard rock tune. Yeah, overall there's a lot of good things to say about this album.\n\nNonetheless this album comes off as less then the sum of its' parts. The vocals are probably the main reason why this just isn't as good as it should be. It's never the classiest insult to use, but damn, does Sean Harris sound like a poof/fag/man with gender/sexuality issues. Mariah Carey's vocals are manlier. I guess a basic summary of his style would be \"weak and wailing\" and/or \"faggy\". It sounds terrible and it makes everything sound a good deal less heavy.\n\nAnd the second reason that this just isn't as good as it should be is, well, Metallica. I find this record really hard to listen to... why play this stuff when I've got better versions of these songs? I understand that these guys wrote these songs first and that's cool, but just as the 486 has been superseded, so these songs have been. There are better versions of these tunes out there, that have better vocals, better guitars, with everything much tighter, heavier, and produced better. Why would I want to listen to a fruitier (seriously, they use major chords at the start of Am I Evil? wtf?), weaker sounding version of the same tunes? \n\nI know it's a bit unfair- this album was a real influential one, the songwriting's great, etc etc. These versions of the songs just aren't as good as the ones I'm used to, that's all. I'd recommend it, but if you really want to hear some good Diamond Head, buy this album then download Garage Inc. and listen to those versions instead.\n",
        "\nProbably the band that influenced Metallica and Megadeth the most, Diamond Head still is a relatively unknown metal band. Their debut is an absolutely great record, an example of the power of the NWOBHM movement: all the songs are relatively fast and extremely energic and dynamic.\n\nThe guitar playing is melodic as hell and that may have led people to regard Diamond Head as one of the acts that helped to create power metal. The solos are all very tasteful and lenghty, “Sucking My Love” is an obvious example of that, since it contains a long middle section filled with many guitar solos. There are sweet riffs smattered throughout the record too, but we'll get to them later. As for the vocals, Sean Harris is clearly influenced by Robert Plant's style, if you listen to the afore-mentioned “Sucking My Love” all becomes very obvious (his screams on the middle section are very reminiscent of “Whole Lotta Love”). The drumming is not that complex but extremely tasteful; the drummer isn't the biggest virtuoso out there, but knows how to write some interesting beats and fills that actually fit with the atmosphere and structure of the songs. The bass is rather inaudible during most of times.\n\nBut the reason why Diamond Head is hailed as one of the best NWOBHM bands is its songwriting skills. The songs are pretty long and the structures intricate; yet, all the tunes are extremely catchy. “The Prince” is an example, with its tempo changes and different sections. “Sucking My Love”, despite being a bit weaker, is another example. “Am I Evil?” another one. Sometimes, I think that Diamond Head is also one of the most progressive heavy metal bands out there and it's a shame nobody recognizes that. The production is pretty thin; in the end, that's not a problem, since it gives a very special atmosphere and feeling to “Lightning to the Nations”.\n\nHighlights? The title track, which also is the opener, is great, a little straight-forward and catchy song; also features a good vocal performance by an inspired Harris. “The Prince” is another tremendous song, I simply love it. It also probably is the fastest track of the bunch and I bet it influenced a big number of thrash/speed metal bands out there. The solo at the beginning kicks ass, and so does the chorus. The best part of the song is at 3:38, though... OH MY GOD, THE BEST GUITAR RIFF EVER MADE! That's right, the best one. Well, not the best. The best is the first one on Sabbath's “A National Acrobat”, but this one is a close second. Moving on, “Am I Evil” is excellent too, great intro, the song then progressing to a speedy section, containing more great riffs... sweet! “Helpless” is the last highlight, competent drum intro leading us to a nice main riff (Hell, this record is full of great riffs, dude!). “It's Electric” is a bit on the average side, and “Sucking My Love” and “Sweet and Innocent” are both pretty damn weak. Ok, the first one is decent, I hate that middle section filled with those erotic screams though, but the latter is just a worthless tune.\n\nConcluding, a great album, absolutely recommended. Competent vocals, great guitar work and fine drum work... All the songs are excellent in the songwriting field and the record is very energic and dynamic. Need more reasons to buy it? I'll give just one more: it's influential as hell! Worth checking out, definitely!\n\nBest Moments of the CD:\n-the “drum” section on “Helpless”.\n-the first time the main riff of “Am I Evil?” is played.\n-3:38 on “The Prince”.\n\n“Cannot squeeze the life from meeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee!”\n",
        "\nNow, the reviews here are generally positive, but in my opinion ‘Lightning to the Nations’ deserves to have a higher rating. This is pretty much the perfect NWOBHM record, it bears all the hallmarks of a NWOBHM classic: fuzzy underproduction, riffs aplenty, at least one song to do with the occult, a slightly pedestrian rhythm section and a wimpy albeit awesome singer. Yes, it could be that this album is the finest album to come out of the NWOBHM era, although it does face some strong competition from ‘Black Metal’, ‘Denim and Leather’ and Iron Maiden’s self titled debut. \n\nDiamond Head’s sound was a step forward, but not massively ground breaking as their roots still lie comfortably within 70’s hard rock and heavy metal with traces of Deep Purple, Judas Priest, Black Sabbath, Led Zeppelin and many other 70’s stalwarts that can be heard within the bands sound. Meaning if your into hard rock you’ll enjoy this too. Diamond Head are associated with ‘Am I Evil’ which certainly is a very ‘eavy number but I would say the band certainly weren’t the heaviest NWOBHM about. For instance Venom certainly sounded a lot more abrasive with their “washing machine full of bricks” sonic onslaught of ‘Welcome to Hell’, Maiden had a complexity and proggy edge in say ‘Phantom of the Opera’ which was more overtly metal than the vast majority of Diamond Head’s work and Angel Witch’s sound was perhaps a touch more dense and malevolent than these Brummie boys. However, DH combine more melodic touches with riffs that Glen and KK would have been proud of to make a truly irresistible album.\n\n‘Lightning to the Nations’ is a really strong collection of songs, one of the finest of the NWOBHM era or any British metal album for that instance. These songs have stood the test of time and proven themselves again and again as a vastly important influence on metal. The title track comes buzzing out of your speakers with that nasal yet charming guitar tone, it’s a statement of intent for the band, the riffs bouncy and great and Sean Harris’ vocals are over the top with loads of melisma (ask your music teacher). The song’s got a great energy to it, in fact the whole album is brimming with a pubescent energy that just perfectly suits the period’s excitement, that being one of “Hey, we don’t have to play punk to get a record deal!”. ‘The Prince’ is another highlight with some more great riffage, Brian Tatler may not of put as many great riffs in one Diamond Head song as in the first four Black Sabbath albums as one over enthusiastic journo said but he’s got a talent for writing absolute corkers. The lyrics in this one are pretty cool too, standard Satanic fare but well done and we also get a reference to ‘morbid tales’…which may have been of interest to a certain NWOBHM loving Swiss band… Gaelic Dew? ‘Am I Evil’ of course is the albums centrepiece, an absolutely quintessential metal song to be cherished for ever more. Brian Tatler was inspired to write a song as heavy as ‘Symptom of the Universe’ and it’s debatable whether he achieved this but his own work is still quite something. From the ‘Mars, God of War’ themed intro to that silly guitar twiddle to all those phenomenal riffs its just one of those timeless and perfect metal songs. And what a great opening line ‘My mother was a witch, she was burned alive’, metal dude! ‘Helpless’ is another favourite of mine; a wonderful piece about simply finding solace in music with some great comically high-pitched toms and tempo changes. Perhaps one of increasingly few songs that reflects the comfort and reassurance one can find in heavy metal, after all most of us listen to metal to be empowered rather than the pitiful, spotty, feeble mortals we really are.\n\nSo are there any bad songs on ‘Lightning to the Nations’? Well contrary to popular belief, no. ‘Sweet and Innocent’ often is singled out for being lightweight in comparison to other numbers, but I find it an immensely enjoyable piece of melodic rocking fun. In fact the worst moment on this album is the unintentionally hilarious section in the overtly sexual \n‘Sucking My Love’, in which Sean Harris, obviously mimicking Robert Plant’s mock orgasms in ‘Whole Lotta Love’, makes some orgasmic moans, but oddly enough he double tracks himself, giving the audio soundtrack to sodomy…hilarious. Although perhaps something you may not want to listen to every day! But hey who am I to judge? Just check the family’s gone to sleep and your covers are firmly over your head, eh?\n\nBut mock sodomy aside ‘Lightning to the Nations’ is a superb NWOBHM album that has through quality and influence endeared itself to metalheads everywhere for nearly 30 years. Blimey, I got through a Diamond Head review without mentioning Metallica…oh shite.\n",
        "\nEveryone and his cat seems to be making a comeback these days; the last few years have seen Judas Priest, Exodus, Onslaught and about a million others return from some sort of obscurity with varying degrees of success. And with what seems like the entire New Wave of British Heavy Metal back touring and releasing new CDs in some incarnation or another, it was inevitable that the legendary Diamond Head name would eventually be dusted down again and attached to some sort of product. \n\n'What's in your head?' is the 2nd CD recorded by this new version of the band (other than founder Brian Tatler, only drummer Karl Wilcox had any previous recording experience with the Head), and one so desperately devoid of creativity and innovation it would be a pain to listen to were it not so desperately forgettable. \n\nTatler has seemingly run completely out of inspiration, and the shapeless nature of the CD reflects this as the songs wander endlessly around at the same pace until things seem to just suddenly stop after almost 50 minutes of pure boredom. For a guitarist of such deservedly legendary stature, the lack of memorable riffs and solos on 'What's in your head?' is unbelievable and the whole affair strikes of going through the motions in order to fashion a product to sell at the gigs where fans wait impatiently for them to belt out the classics. \n\nThe only song that leaves any sort of serious impression, in fact, is the opener \"Skin on skin\", and for all the wrong reasons. Original vocalist Sean Harris is long gone, of course, and standing in shoes many sizes to big for him is Nick Tart, a man with a nasally, dislikeable voice similar to that of ousted Cloven Hoof stand-in Matt Moreton. His vocal style, coupled with an out of place 'heavy' guitar sound makes the opening track seem like some clueless attempt to sound modern. The horrible lyrics, sleazy vocal delivery and chugging chords make for a thoroughly unpleasant listen, and that the rest of the CD is such a colourless mush is actually something of a relief next to this monstrosity. \n\nThere is very little else to be said for this CD. Fans of Diamond Head will find nothing to remind them of the celebrated early releases, and newcomers will find nothing of any note to a fan of heavy metal or rock music to encourage repeated listens. No riffs, no time changes, no direction, nothing. The CD is almost the equivalent of white noise. \n\nIt goes to show that for every Iced Earth or Blitzkrieg out there, where one founding member can carry the original band's legacy forward with grace and dignity, there is a Diamond Head, where a once great name is dragged through the mud in a desperate attempt to wring the last pennies out of it. Were it to bear another logo on the cover slip this CD would merely be instantly forgettable nonsense that would never have gotten a record deal in the first place. Under the Diamond Head banner, 'What's in your head?' is a disgrace.\n\n(Originally written for http://www.metalcdratings.com/)\n",
        "\nAs long as i can remember this album is called \"Living On...Borrowed Time\", you couldn´t see \"Living on\" on the frontcover cause it was in the backcover along with a photo of four very skinny, still very talented young musicians.\n\nAfter the glorious and almost perfect Lightning to the Nations, Diamond Head released this LP with a more refined sound, better production and songs more in the 80's metal, than the dynamic NWOBHM of the first album.\n\nThe songs are very mellodic still catchy, and we have re-recorded versions of Lightning to the Nations and Am i Evil who are as good as the originals. In the Heat of the Night opens the album; is a slow tempo atmospheric song, then goes to more melodic \"Heaven from Hell\" and the almost pop ballad \"Call me\", then the new version of the classic \"Lightning\" where Sean Harris shows and excellent performance, then we have Borrowed Time a song with a lot of atmosphere, a song that could be considered both Progressive rock/Heavy Metal, and finally Don´t you ever leave and Am I Evil, the best songs of the album in my humble opinion with the excellent riffing/soloing of Brian Tatler, who is a riff machine.\n\nThe band would experiment with \"Canterbury\" which was step down both from the white album and Borrowed Time, buth this is A Good Album, energetic and melodic as only NWOBHM could be...\n",
        "\nI usually rate Diamond Head stuff high, since i think a lot of what they did were excellent. This EP is actually quite good. And yet... It only contains one \"new\" track. Diamond Head often recorded and released there songs more than one time. An example is Shoot out the lights that were released on a 7\" in 1980 and rereleased on this EP, just without guitar solos and a different sound. The A-side of this EP contains two song, Call Me and Trick or Treat and they are songs that I just never cared about. They were released on the album Borrowed Time too. \nThe only track that is unique for this EP is Dead Reckoning, but it also one of their very best tracks ever. My guess is that Metallica's Seek and Destroy is inspired by this track. The lyrics is alike, the riffs and the sound just remind me of Seek and Destroy.\nThe A-side of this album is the weakest with two tracks that are not as heavy metal as the others. Call Me and Trick or Treat are just not that catchy as Dead Reckoning and Shoot out the Lights that are to be found on the B-side. The sound in my opinion is quite bad. I don't know if it's lousy production or what but the sound is just bad. Dead Reckoning sadly has some hiss on the guitar sound. Call Me and Trick or Treat just sound better on Borrowed Time (album). All in all it's a good EP since I can bear to hear all the songs.\n",
        "\nThe influence that this album has had on the metal scene is immense, especially in the thrash sub-genre. That's a particularly striking fact when you realise that this album never sold in large numbers, and that Diamond Head wouldn't be more than a footnote in most metal histories if it were not for Metallica having covered them so extensively. That's a damn shame, because this is a very good album. \n\nThe vocals have a nice mid-ranged-to-slightly-falsetto quality to them, with Harris going for something similar to Led Zeppelin's Robert Plant (sometimes with just a bit too much emulation going on, such as in the middle interlude of Sucking My Love). Overall the vocals are exactly what was needed with this music, having a nice 70's rockish, yet 89's metallic, quality. The lyrics range from good to corny, but that's not really important as most groups from the period had at least a couple-few bad lyrical endeavors.\n\nThe guitars have a crunchy and potent sound, and when songs like Am I Evil and The Prince get going, there's definitely a headbanging vibe being generated. The solos not only sound good, but they compliment the music to the last possible degree. There are no solos here for the sake of solos, but rather they all add to and enhance the song. After St. Anger came out, Kirk Hammett said that they had experimented with solos, but that they decided not to, because they didn't fit, because St. Anger was a \"collaborative effort\". Well, the solos on this Diamond Head record are a great example of how solos should fit into the collaberation, how one musician taking the spotlight for a moment can make the song as a whole a lot better. \n\nThroughout the album, Diamond head flirts with both rock and metal, without really seeming like they are undecided. They are both, and they can do both equally well. They don't need to be playing over 200 bpm the whole time--but they can play fast when the song calls for it. There's a reason that this album\nhas had such a huge influence on metal: it's a damned good album, with great riffs, song writing, etc. Definitely one to pick up if you don't own it yet.\n",
        "\nThis album is one of my all time faves. From the Elric inspired cover, the amazing voice of Sean Harris, Brian Tatler's inspired guitar playing and most of all...the songs, this hits the mark in so many ways. Many say that Diamond Head's first album was their best and often overlook the other 2 they released. The first track says it all really...\"In the Heat of the Night\", is a creeping crawling masterpiece following the journey of the warrior as he comes up to the tower-\"Before long, behind adamantine doors, I taste of the wine of their joy. Through delirium of a tortured mind Her face gave me strength to this day\"-cool lyrics, cool song. Diamond Head are never given enough credit for their lyrics and the athmospheres they created in their music. Complex music met often fantastical lyrics to sweep one away to times unknown, places lost in the mists of time. Living on Borrowed Time is another example of this dreamscape athmosphere and who could forget the mighty \"Am I Evil?\" All this, and yet the band had the ability to switch path and pen a Zepellin inspired masterpiece in \"Don't You Ever Leave Me\", conjuring up thoughts of classics such \"Dazed and Confused/Babe I'm Gonna Leave You\". And here is where we find the crux of the problem concerning Diamond Head's legacy. Diamond Head were too ambitious to be confined by the limitations genre and style. They wanted to explore their music and this was probably too much for die-hard headbangers. The next album \"Canterbury\" is a testament to that...again a classic though scorned by those Metal heads who feel it is not metal enough. Forget them because otherwise you're missing out. Allow yourself the time and open your mind to one of the best bands who carried the torch first lit by bands such as Zeppelin and Deep Purple, you won't regret it!\n",
        "\nThis album is actually from the concert at Milton Keynes, on June 1993. At that time Diamond Head just had made a comeback and performed a mix of new songs together with their classics that fans were familiar with. It was no coincidence that Diamond Head was opening up for the likes of Metallica and Megadeth. After all they clearly influenced a lot of the more refined and well known thrash acts of that era.\n\nThe very first cd is filled with live performance recorded during the concert, it is somewhat too short though, but does feature classics like “Am I evil?”, “Sucking my love” and “Helpless”. I can’t help it but I am missing “The prince”, “It’s electric” and of course \"Lightning to the Nations\".\n\nThe second cd features extra studio tracks coming from the “Death and Progress” album. With “Rock the nation” it even features a Montrose cover among other things. The production of the album is first rate, and will not disappoint. The guitars are excellent as always as well as the rest of the band.\n\nDiamond Head is one of the most influential bands that came out of the New Wave of British Heavy Metal. For that fact I would recommend Evil live, because it gives a nice combination of classics being performed live, that were so influential in so many well known bands, as well as giving a little different side of Diamond Head on the 2nd cd.\n",
        "\nAny serious metalhead is more than familiar with the New Wave of British Heavy Metal scene, and any serious metalhead should be familiar with Diamond Head. Lightning to the Nations marked the album debut of the band from Stourbridge and is one of the real highlights of the scene. Being highly regarded by many Metal bands, Metallica and Megadeth namely, is due mostly to this release.\n\nSean Harris' high, somewhat over the top vocals are some of the best of the kind, and the bass playing of Colin Kimberley is actually pretty catchy. Brian Tatler's guitarwork is the backbone of the album of course, containing some of the most memorable riffs ever, and also some nice solos. Tatler epitomises Heavy Metal guitar playing here.\n\nThe album opens with 'Lightning to the Nations' a catchy, typical NWOBHM number that isn't particulary fast. The chorus jumps out at you as being pretty dramatic, \"to the natiiiooons!\" Moments like that are all over this album. This one is a solid opener.\n\nFollowing is 'The Prince', one of the best songs on here. The song doesn't waste anytime getting started, providing nice headbanging material the second it begins, soon with Tatler soloing over the intro riff, then comes the main riff. Very catch stuff! \"Time to die!\" Also look out for that guitar melody at about the 3:35 mark, you know you love it. More than anyother song are the basslines so good too here. Epic, heavy, catchy, this is what Metal is all about.\n\nDoes the album let up after that? No! 'Sucking My Love' has one of the most memorable riffs of the album, maybe that's why so many bands have ripped it off! The song goes on for over 9 minutes, managing to hold the listeners attention throughout. Here demonstrates some of Harris' cheesiest moments \"Oooohhh yeah yeah yeah\". Does anyone do this better than him? The guitar solos(three?) are phenomenal here. There is even a psycadelic-sounding section in this song, similar maybe to 'Fly to the Rainbow' that is strangely appropriate. Another album highlight here.\n\nThen comes the peak of the album, 'Am I Evil' a classic Metal song if there ever was one. There is that unforgettable double guitar intro, which is as 'evil' as Diamond Head would ever get. After some flashy guitar work, comes THE riff, and it is absolutely crushing. If you don't like that, you aren't Metal, period. Even though the chorus is kind of cheesy(its effectiveness isn't in question however!), the song also contains the best lyrics of any on the album. And the guitar solo kicks ass. It just doesn't get much better than this, not only the best song on the album, but the best NWOBHM song.\n\n'Sweet and Innocent' is a very innocent song as it turns out, when compared to the four song previous at least. Here you've got a midpaced Rock N' Roll song more than a crushing Metal one. Not bad, but definately a step down or five from the last song.\n\n'It's Electric' picks up the pace a bit, the intro riff is nothing special compared to previously heard ones, but is good nonetheless. Here you have Rock n Roll lyrics about becoming a star. This song is most similar to the the first one of the album and has a similar dramatic chorus. Just as much as the guitar playing carries the song, the simple drum beats of this song really standout.\n\nThe album concludes with 'Helpless' an appropriate finish, it's fast, but with some serious tempo changes that slow it down in places. It's catchy, and just about sums up the album as a whole. The song is also one of the best to sing along to.\n\nRegarding the production, it is about perfect. The guitars dominate, but not overly so, as the bass and everything come in very clear. Yet it still has just a tad of rawness in the sound. In conclusion the band's sound is captured wonderfully.\n\nIf you like catchy, traditional Heavy Metal/Power Metal you can't ignore this one, it has some of the best Metal moments you'll ever hear. Thrash fans should dig this too, it is very similar to early Metallica(no coincidence, they were obviously influenced by Diamond Head and covered half of this album). Why not a higher rating? The second half of the album cannot keep up the excellence of the first four songs. That being said, there isn't a bad song on here, don't hesitate to pick this one up!\n",
        "\nIt's amazing that this album hasn't been reviewed more. What's even more amazing is that I'm actually drawn to review it when typically, I'm better suited to reviewing movies. But then again, maybe because it's so well known as a classic by everybody is the reason it hasn't been reviewed...\n\nBut, not until this latest listen do I realize just how influential this one album has been. Go ahead an listen to it. If you're a Thrash fan, you'll hear a lot of familiar stuff.\n\nHear that? That's Metallica. \nRight there? Megadeth. \nThat solo? Testament.\n\nThat riff? Oh hell, Metallica, Megadeth and Exodus all tapped that one. That's Sucking My Love--and these three bands? They all snatched that one up. Oh, and that solo over there, tucked into Sucking My Love--latter day Corrosion of Conformity seems to have borrowed that (circa America's Volume Dealer). As a matter of fact, it sounds like Sucking My Love probably has more bastard children out there than Gene Simmons. Megadeth used up that main riff as recently as on The World Needs A Hero. I guess at the time, Dave Mustaine's hero was Diamond Head. Because he also used riffs from Am I Evil on that album. I guess if you don't want to write anything new, you might as well write familiar, right?\n\nYou know, for an album from 1980, this one really seems ahead of it's time. But then again, maybe it's not ahead of it's time. Maybe it came along right when it should have. And maybe the bands that followed just didn't advance enough. Maybe it's a painful visual of just how stagnant a lot of otherwise excellent 80's Thrash Metal really was. I mean, the riffs heard on this album were used over and over throughout by Thrash bands every bit as often as they took riffs from Motorhead or Venom (apparently OverKill and Slayer were more keen on these two, respectively). Lightning to the Nations/The White Album is so easy to listen to--because it's so familiar because everyone who had a Thrash Metal band in the 80's must have yanked something off here for their own use. It's actually kind of depressing. Here all this time I thought I was getting some kick-ass Thrash Metal and in reality, I was getting pre-used, hacked to bits material from Diamond Head. My whole life is a lie.\n\nAt any rate, the overall feel and atmosphere and production of this album is kind of like an early atmospheric Motorhead with a dash of Led Zeppelin. The vocals aren't the high-pitched screeching that followed in a lot of classic-styled Heavy Metal bands in the 80's... or that Hair Band crap, but it's not heavy or gruff like Motorhead. The vocals have a clear influence in more simple Rock and Roll (think maybe early pre-Bruce Iron Maiden or Def Leppard for a mild similarity), and much of the lyrics seem to follow suit, although there are a lot of relatively standard \"Heavy Metal\" lyrics on the album as well. But the music itself, is very much ye olde (but back then, quite new) British Heavy Metal--just with much catchier riffs than I'm used to hearing from that time.\n\nOverall, not every song on here is truly excellent. But none are bad. The best are easily Helpless (my personal favorite), Am I Evil?, The Prince, and Sucking My Love. Am I Evil and Sucking My Love have each got to be among the most ripped-off songs in existence. The first three were all covered by Metallica; in fact, no one seems to have ripped off this band more. Ride the Lightning ~ Lightning to the Nations...? Even if you've never heard Diamond Head before, you've most likely heard the riffs from these songs. Metallica's Jump in the Fire, Megadeth's When and 1000 Times Goodbye, ... I can't remember the Exodus track(s) off-hand... \n\nWhen they say Thrash Metal was inspired partially by NWOBHM, they mean this band. Whoever \"they\" may be. They may have borrowed Motorhead's attitude and Venom's evil, but they used Diamond Head's riffs and solos to glue it all together.\n\nAnyway, it seems that Lightning to the Nations and It's Electric are the weakest tracks, which suffer only in that they don't carry the epic scope or feeling of overall grandeur that the previously mentioned four tracks all have in spades. Sweet and Innocent falls between these two album extremes of \"Brilliant\" and \"Not so Impressive, But Still Decent.\"\n\nSo:\nLightning to the Nations: 4/5\nThe Prince: 5/5\nSucking My Love: 5/5\nAm I Evil?: 5/5\nSweet and Innocent: 4.5/5\nIt's Electric: 4/5\nHelpless: 5/5\n\nSo now you're going, \"Well hey, dickhead, if there are only 4 out of 7 songs that really rock, why are you giving it a 90? Dickhead.\" I went as high as I did, in part, out of the sheer influence this album carries and in part because those four awesome tracks are truly excellent, catchy, Metal music. On top of which, about 75% of the album's running time is made up of excellent music, and the other stuff isn't bad, it's just not anywhere near as impressive as those best four songs.\n\nThis should be in every Metalhead's collection. Especially all us Thrashers.\n",
        "\nIt's hard to argue with a band like Diamond Head, one of the seminal NWOBHM acts and, along with Motorhead, the backbone of the classic Metallica sound. Sadly, this act got little respect until Metallica covered the hell out of them and people began to realize what a great, great band they were.\n\nThe best way to describe Diamond Head's sound is Metallica meets Led Zeppelin. I know DH was first, but it'd be fair to say that Metallica axed the Zeppelin and added the Motorhead (thank god) and from this volatile mix crafted their epic style of metal. Diamond Head was a pioneering act in that they had great, multi-part almost progressive epics that were unlike virtually anything the world had seen by that point. It's not hard to see where Metallica got their inspiration when one listens to songs like \"The Prince\" and \"Helpless\" that feature upwards of six riffs in one song and a number of breaks and tempo changes. Outside of a very few Judas Priest songs, nothing in the 70's and early 80's comes close to this sound.\n\nThe lead singer of the band, Harris, is a Robert Plant-Geddy Lee type wailer, and his willowy voice can sometimes be annoying, particularly on Zep-alike psychedelic trash like \"Sucking My Love\", complete with cheesier than cheese innuendo worthy of Spinal Tap(and, err...Led Zeppelin to be honest). But for that one piece of sludge Diamond Head hammers you with shoulda/woulda/coulda been metal classics like \"Lightning to the Nations\" and \"Streets of Gold\", both songs where Harris shines, the first being a good use of his willowy style over thunderous metal heft, the second being a rough 'n' tumble piece of thuggery.\n\nGuitarist Tatler was an unsung genius, unveiling wonderous and frighteningly advanced riffery as if it were easy, playing elegant leads that complemented the music while screaming for vengeance. The man could do self-effacing breaks as in \"The Prince\"(one of the catchiest lead melodies every written) or pretentiously virtuosic as in the bands signature epic \"Am I Evil?”.\n\nAnd speak of the devil, \"Am I Evil?\" has got to be one of the most important metal songs ever written. From the Mercyful Fate-style lyrics, a stirring and vicious narrative, to the pounding Rainbow-gone-mad castle rock riffery, near-thrash overdrive two thirds through, to those multiple multi-part solo's...folks this is what you got into metal for. This was one of the building blocks for the 80's metal epics, slotted in beside songs like \"Victim of Changes\", \"Hallowed be thy Name\", \"War Pigs\"... titles that require no credit because they are so universally sacred to the metal masses. \"Am I Evil?\" is every bit as deserving as those platters and should be slotted in beside them. And one should not discount Metallica's titanic re-shred that actually manages to better this, mostly due to the intensity they bring to the song.\n\nDiamond Head excelled at the gallop, rarely kicking into overdrive but preferring to stay in that brisk clip just below, as evidenced on songs like the aforementioned \"Streets of Gold\", \"Sweet and Innocent\", and the spaced out \"Shoot Out the Lights\" and \"Diamond Lights\". But man, when they thrashed they thrashed, \"Helpless\" and \"The Prince\" being crucial links in the speed metal chain, both actually bringing to mind odd-ball Brits Budgie. Wow, Tallica just seems prescient now eh? \"Helpless\" would be perfect if Harris didn't insist on bleating out the title on the chorus, his yelps almost souring the busy guitar supporting it. But man, talk about a multi-part song, Tatler and Co. just spinning off tasty leads and tempo changes like nobodies business.\n\n\"Lightning to the Nations\" is a real crusher, a power metally song with a driving groove that brooks no opposition. \"I Don't Got\" is a brilliant longing ballad that really should've been on the Lightning to the Nations album, but was relegated to the subsequent EP I believe. And lets not forget bloozey anthem \"It's Electric\", a young dumb and likely full of cum rocker that can put a smile on the most embattled rawker, unless they think metal begins and ends with Mayhem or Dismember I suppose.\n\nThe sounds quality is better than the notes on the album entry would have you believe, and as this is one of the few places you can find all of the early, essential DH recordings in a convenient package I recommend it unequivocally.\n\nStand-Outs: “Am I Evil”, “Streets of Gold”, “The Prince”\n",
        "\nThis is the only Greatest Hits album that I will ever give this unbelievably high a rating to. Man, when I first got this (1999 or so), it didn't leave the frequent rotation for a YEAR AND A HALF, at least. One of my favourite albums ever, and it's commonly found, and it is damn well worth it.\n\nFirst off, the sound quality. Fully remastered... forget the Metal Blade bullshit pressings of Lightning to the Nations, Behold the Beginning, et al... if you don't want to hunt down the old vinyls (which you do, but that is a different story), THIS is the only compilation of old material you need to get. This is the production that definitely does these songs justice. \n\nAnd what of the songs? Spectacular fucking tracklist... my only complaint is no 'The Prince', but otherwise, man they picked a bunch of winners. The songwriting runs through a variety of styles, ranging from the bludgeoning power-metal classics like Am I Evil (the \"Mister Guitar\" version, incidentally... not the original Lightning to the Nations version, but rather the one off of Borrowed Time - no matter, both are equally good) and Lightning to the Nations - again from Borrowed Time, the vox are a bit more accented than in the original, but the guitarwork is definitely there. \n\nTwo of the more accessible tracks from Lightning are here too: It's Electric and Helpless - both very cool - I'm glad they left off the horrible Sweet and Innocent. Good choice, guys.\n\nShoot Out the Lights - a classic from their random mishmash of singles, and then also Sucking my Love is here... all 9 minutes and 48 seconds of epic fucking guitar work and Sean Tatler making an ass of himself. When the dust settles, this is a masterpiece.\n\nIn the Heat of the Night - WICKED FUCKING SOLO!!!!! Well, more like three fucking wicked solos - this is a masterpiece of melodic heavy fucking metal. Then, Call Me is also from Borrowed Time... a little catchy 80s-glammish number, but still fucking enjoyable. Then, a bit later, another wicked number from Borrowed Time, namely the title track. This and In the Heat of the Night are two of the greatest tracks DH ever made - fucking masterpieces. DH are best remembered for Lightning to the Nations, but the rest of their material is no slouch either. A bit softer, and sometimes more inconsistent, but here they really chose some of the highlights of their early-80s career. \"I have learned, at what cost...\" - this one goes through a billion moods, from the acoustic opener, to the exploding riffs and the soaring vocals. Power metal at its finest.\n\nWe also have four tracks from Canterbury to close the album. The best four, I must add... I've heard the whole album, it's kind of inconsistent, but these four are all winners. Not all of them are heavy fucking metal - Makin' Music is just a little rock and roll number, but ya know what, I like it, so fuck you. Same with Out of Phase, which is the most irresistibly catchy number since the songs they made you sing in the 1st grade.\n\nThen, Ishmael... a strange, strange number with some odd vocals (is that a SHEEP??), but it fucking works too. Finally, the closer - To the Devil His Due is another midpaced atmospheric number, and a complete winner. It's got great use of acoustic guitars, nice fucking vocals, and the final build-up to end all final build-ups.\n\nRecommended? Oh fuck yeah!!! This really is the Best Of (well, except for the Prince, but hey, you're forgiven). Also, the songs manage to go together well, despite their being from several eras of the band... from the early bludgeoning speed metal power, to the more progressive numbers of the next few years.\n\nThis is the only Greatest Hits album I ever would endorse... I don't just endorse, I force you to get this!! Right now!\n",
        "\nWell, five new songs, and two that were originally on Lightning to the Nations... those two are re-recorded.\n\nFive of these seven tracks appear on the Half Moon Records \"greatest hits\" compilation, in great sound quality, and the sixth and seventh are not worth scavenging ... To Heaven from Hell is definitely the second-weakest song on this album, and I can see why it didn't make the best of. It kinda plods along. Don't You Ever Leave Me is just garbage - their stupid radio hit. Let us never speak of it again.\n\nAm I Evil? Classic! This is the 'Mister Guitar' version - right before the main solo, Sean yells out Mister Guitar!!! Then, Brian's godly solo... just as godly as the original, though I do wonder why they had to re-record it. Both of them sound good, it's the shitty Metal Blade re-releases, not the early 80s LPs, that we must be worried about. But, there is an even better sounding version out there.. namely Half Moon. Lightning to the Nations is fundamentally identical to the old title track...\n\nIn the Heat of the Night, the opener - a slow, brooding number, but epic as a motherfuck - this is DH's sense of atmosphere coming through loud and proud here. Call Me is their other radio hit, and this is just a fun fucking song. It's a bit 80s-cheesy-glam, but damn if they don't do it well. \n\nThen, the title track... I'm living!!! On borrowed time!! Man, this and In the Heat of the Night - just plain classic heavy fucking metal. It's hard to describe quite what they sound like, other than they must be heard. The epitome of melodic metal.\n\nSo why the 58, as opposed to a 100? 4 of 7 tracks are classics, Call Me is a barrel of fun, and then that is 5 of 7 that you can obtain much easier, in fully remastered sound (BETTER than the original I am describing here), on the Greatest Hits. Thus, this album is not bad, just obsolete. You can read my review of that CD for more info on these songs.\n",
        "\nThe sound quality on here is absolutely terrible!!! This is the companion piece to Metal Blade's \"Lightning to the Nations\" re-release, and it does not do justice to the original releases.\n\nIf you can find it cheap, I guess you should pick it up, but don't let this be the be-all end-all of your Diamond Head investigations... the Half Moon Records \"Best Of\" (1998) is a much better start, in any case. But of course one should track down the original Lightning to the Nations (tracks 1-4, 9), Four Cuts EP (track 7), Sweet and Innocent single (track 5), and Waited Too Long single (tracks 6, 8).\n\nThose are where they were originally ripped from... (well, track 7, Shoot Out the Lights, was its own single too... same version as on Four Cuts, but you may as well get a 4-song EP while you're at it) - and those are much better quality if you can get a decent non-worn vinyl.\n\nAs for this - don't get this if you can avoid it - or if you do, know what you are getting. Caveat emptor. Not a very opinionated review, but I hope a helpful one.\n",
        "\nOne can make a very good argument that this is where power metal began. Before Legion, before Fates Warning and Queensryche, and definitely before Helloween. \n\nYes, you are probably familiar with this album. After all, Metallica covered half of it. That said, the original is definitely worth finding. Actually, what is really worth getting is the Half Moon Records \"best of\" which is remastered, and has the best sounding versions of some of these songs. But, not others. For that, there is only the original. Beware of the crappy Century Media pressing, try to get the original Happy Face vinyl if possible.\n\nThe album is marked by some awesome guitar soloing by Brian Tatler - very tastefully done, as in not wankery. The best examples are on \"Am I Evil\" which is total Richie Blackmore worship, and also \"Sucking My Love\" and \"The Prince\", which is more a Glenn Tipton sounding deal. Also, the songs themselves are very catchy - think almost of early Fates Warning, and you can have a good idea of this particular species of power metal.\n\nThe only kinda throwaway song is \"Sweet and Innocent\", which isn't as much a throwaway as much as it doesn't belong after \"Am I Evil\". Other than that, the album is just about flawless. Nice guitars, and also some pretty nice vocals by Sean Harris.\n\nEasily one of the best albums of the NWOBHM - highly recommended.\n"
    ]
}