{
    "Band Information": {
        "Country of origin:": "Sweden",
        "Location:": "Säffle, Värmland",
        "Status:": "Active",
        "Formed in:": "1994",
        "Genre:": "Gothic/Doom/Death Metal",
        "Lyrical themes:": "Anti-religion, Death, Depression, Love, Sorrow, Gnosticism",
        "Current label:": "Napalm Records",
        "Years active:": "\n1994 (as Kerberos),\n1994-present ",
        "Number of Reviews": 45
    },
    "Band Reviews": [
        "\nAlthough I'm not intimately familiar with the group, I don't think fans of Draconian will find too much to be surprised by on this album; predominantly slow-mid speeds, female cleans/male growls trading off from each other, gloomy riffs with force behind them, and atmospheric, cleaner segments. The formula's not markedly altered, but it's delivered to a high standard with the level of conviction one would expect from Draconian, resulting in solid early cuts on the record such as \"Sorrow Of Sophia\", \"Lustrous Heart\" and \"Moon Over Sabaoth\". If there's one complaint I could offer towards Under A Godless Veil, I feel like a number of the tracks could have run a minute or two shorter; not that they necessarily drag to the point of me seriously losing interest, but some of the momentum they build starts to dissipate before all is said and done. Obviously, Draconian are no strangers to pulling off fantastic long songs (hell, they wrote \"Death, Come Near Me\"), but they're very capable when trying their hand at shorter tracks, including with \"Night Visitor\" on this album. It's by no means a dealbreaker, but I feel like a handful of tracks here slightly overstay their welcome, with \"The Sacrificial Flame\" one in particular that could have been condensed.\n\nFor the most part, I find Under A Godless Veil to be a solid listen without too many overly memorable moments, at least in its early stages, but of the first half-dozen tracks, \"Sleepwalkers\" most reliably grabbed my attention during my first few playthroughs; predominantly muted, it has a memorable pre-chorus where clean guitar and atmospheric drumming is accompanied with muted, distant growls before a stirring Langhans/Anders Jacobssen chorus duet. Like others as already mentioned, this track arguably pushes its runtime to or just beyond the limit, but it has some quality moments in it.\n\nHowever, although \"Sleepwalkers\" usually managed to remind me that I was listening to the record during the first couple of listens, in terms of grabbing the listener's attention it has nothing on \"The Sethian\", a simply stellar cut that I would be genuinely surprised to not see become widely considered as one of the standout songs from the album. On a record that rigidly stays in the slow lane, something with the relative level of energy that this song brings is already going to make an impact (I mean, it's not fast, but it picks things up a bit), but they back up that elevated intensity with some spellbinding music, from the atmospheric, tom-heavy drumming early on, through to the buzzing tremolo and thunderous percussion that announces the chorus. The enchantment that Langhans gently singing above this crashing storm casts is so potent that it frankly makes me slightly frustrated that Gothic doom doesn't more regularly instil this level of passion in me.\n\nAs far as I'm concerned, \"The Sethian\" sits proud at the top of the pile of the songs that comprise Under A Godless Veil, but it doesn't completely outshine every song, with closer \"Ascend Into Darkness\" in particular delivering plenty to be impressed by. Without remotely wanting to discredit the first half of the album, the combination of these two songs, and to a lesser degree the duo of tracks in between, really makes Under A Godless Veil a bottom-heavy album. However, if you want to leave a good lasting impression, ending an album strongly is as good a way to do it as any.\n\nTime will tell what those more keen on this sound think, but whilst I don't feel like this will be the crowning glory of the band's career, it's a very strong effort and should provide respectable competition to Paradise Lost's Obsidian for the title of being the best 2020 has to offer in Gothic doom.\n\nOriginally written for https://metalstorm.net/pub/review.php?review_id=16360\n",
        "\nSuccessor to “Sovran” (2015), “Under a Godless Veil” presents us a different Draconian, even within the melodic doom metal atmosphere that we've got used to with this band.\n\nA cult name in the metal scene, these swedes, who spent the first 10 years as a demo band, come up with the seventh album (always on Napalm Records) and self-aware of who they are and what they want to do.\n\nOver the course of 10 new songs, Draconian deliver a very heavy and atmospheric doom metal, the latter being the most evident factor in such sonic transformation from a record to another after more than two decades. So, as much as the riffs keep crying (\"The Sacrificial Flame\" has huge reminiscences of My Dying Bride), this album allows us to take a deep breath and to digest everything (after all it's 62 minutes of melancholy).\n\nAmong the dark and terrifying parts offered by Anders Jacobsson's deep growls alongside the slow drumming and the guitars that unite melancholy in the lead side with heaviness in the rhythm side, Heike Langhans's beautiful and angelic vocals reign supreme. The second album in Draconian for the talented young woman, Heike is immensely similar to the ill-fated Aleah Starbridge (1976-2016), with whom she shares, in addition to her skill, South-African blood, although they have settled in Sweden for years. Thus, it will be in the most calm and atmospheric moments that Heike shines and leads us to a dive into an atmosphere of extreme sadness (“Burial Fields”), but always with that sweet voice whispering in the ears of the lost. Also, let's also point out the catchy chorus of \"Lustrous Heart\" and the duet with Anders in the afflicting \"Sleepwalkers\" and in the melodic \"Moon over Sabaoth\".\n\nSuitable for fans of My Dying Bride and Trees of Eternity, Draconian no longer need big introductions. “Under a Godless Veil” is another milestone in the metal scene and, obviously, in a career that grew with vision and resilience.\n",
        "\nThis year has been a flourishing year for doom metal as several of the Doom giants have released their masterpieces, among whom we can name My Dying Bride’s The Ghost of Orion, Paradise Lost’s Obsidian and Pallbearer’s Forgotten Days. But above all, I had been looking forward to listening to Draconian. They have always been an inimitable band to me and their signature gothic doom death metal sound has enthralled me ever since I discovered them more than a decade ago with their Turning Season Within (2008), where I listened to When I Wake until my ears, as well as my heart, started to bleed. Album after album, they have stamped themselves upon the massive corpus of Doom Metal.\n\nAfter their colossal Sovran (2015), which was met with unanimous exceptional commend, the band took five long years to conceive, bear and mature their seventh offering and release it precisely on the same date as their previous gem. They had an onerous task to equal or even possibly surpass their previous work. The extent to which they have succeeded, in this particular case, is a matter of taste. \n\nIt is through and through a well-planned and well-executed concept album: exquisiteness, artisticness and skill galore. Since the first moment the curtains open, there is this heavy atmospheric resonance to which, later on, the goth-doom element is added. Sorrow of Sophia is a manifestation of the art of the band in its more subtle form. Initially, a dreamy soundscape is presented to us with Heike Langhans’ velvety vocals followed then, after almost a minute and a half, by Anders Jacobsson’s tremendous growls. The give-and-take of vocals continues throughout the whole song and in the meantime, the music is further augmented by the power of the strings.\n\nDespite being the album in a nutshell, the opener is not the highest rating track. On such a wholesome and coherent album as Under a Godless Veil, picking one highlight is rather impossible, yet for the sake of reviewing, what can stand atop others can be Ascend into Darkness. With a runtime of roughly 10 minutes, this closer is the Draconian we all adore and admire. With Heike’s melodious and melancholic expressions of sentiments, Anders’ infernal vocal delivery, Johan Ericson and Daniel Arvidsson’s melo-death riff (one like those of Insomnium’s), scaffolded wherever and whenever necessary by Jerry Torstensson’s drumming, Ascend into Darkness is indeed the band’s ascension into the tenebrosity they had strived to achieve. \n\nAs stated earlier, Under a Godless Veil is a coherent yet diverse album; for an album of more than one hour, it ought to be so. The Sacrificial Flame is a down-tempo classic doom, Burial Fields borders dark ambient, Night Visitor delves into atmospheric doom (the damn solo on this, such a heartfelt beauty!), Moon over Sabaoth manifests the band’s austere, death-y side, The Sethian in parts gets its foot into the realm of atmospheric black, Lustrous Heart is gothic meets doom and Sleepwalkers and Claw Marks on the Throne blend several of said elements into a gratifying mix. All the while, it is unmistakably Draconian you are listening to. \n\nMusic-wise, the dichotomy of the founding member Anders Jacobsson and the new South African Heike Langhans (joining the band prior to the release of Sovran) shouldering the singing tasks is truly a pinnacle the band has been able to achieve. However, overlooking Jacobsson’s art of lyricism would be far from fair. The impact the album leaves could be partly, and so duly, attributed to the lucidity and solidity of narration of this concept album. The concept of Sophia as, in addition to being a Jungian archetype, a mythos and a parallel to Christos figure in Christian mythology (or demonology, whatever!) keeps the album together in one piece. Sophia is an eminent figure in Gnosticism; she is a primordial soul being, but also, she functions as the creator of life and material world in some ways through the creation of Yaldabaoth or Demiurge. She is then dishonored, trapped, tortured and dismembered under the tyranny of a cruel god, Sabaoth and other demonic figures like Archons. Christ (her male counterpart) comes and seeks to collect and assemble her pieces, leading her to fulness (Pleroma) and thus redeeming her. Subsequently, a Sethian wishes to avenge her and finally there is demise. Such a moving narrative indeed! \n\nAnother aspect of the album which has been of high caliber is the artwork. Natalia Drepina’s photo reflects the macabre and two-fold essence of the album in all its nuances and dark subtle furrows. The fiendish hand, stretching from the shadows outside the frame of the picture, grabbing the tender pale corpse by the top of her head, particularly the eye sockets and forehead, while she lies on grass in an immaculate position wearing a white dress which foils the darkness of the surroundings and that of her hands all contribute to the impact of the scene. This album art is so Draconian and nothing short of splendid. It is what is should be and so, so much more. \n\nIn spite of the band’s more softened sound and more atmospheric approach on Under a Godless Veil, which might be comparatively overly lax and subdued to some fans and critics alike, resulting in some mixed reviews and certain expressions of minor dissatisfaction coming from both fronts, I, being an unswerving atmospheric die-hard, found this work of art to my heart's content. Well, maybe, just maybe, somewhere deep within my sinister unconscious, I would wish to have had more heavy riffs and more death in it. But I am not, by any means, complaining. Under a Godless Veil is what Draconian should take pride in. \n\nHighlights: Ascend into Darkness - The Sethian - The Sacrificial Flame - Sorrow of Sophia - Claw Marks on the Throne \n\nRating: \nLyrics: 9.5\nArtwork: 10\nMusicianship: 9.0\nVocals: 10\nPersonal satisfaction: 9.0\nOverall: 9.5\n\nOriginally written for www.Noobheavy.com\n",
        "\nPerhaps the only way to truly market the ugliness of death metal to a wider audience without robbing it of its dark character is to drown it in a melancholy sense of beauty, and for better or worse, that was what began in the mid-1990s when Scandinavian acts such as Theater Of Tragedy stylized the beauty and the beast duet vocal style within the death/doom movement. It was a curious blend at first, but one that saw a sizable legion of imitators rise up and ultimately taking the sound into a more polished direction, with other acts hailing from Norway such as Tristania and The Sins Of Thy Beloved enjoying a fair amount of prominence by the end of the decade. However, it is arguably the Swedish outfit Draconian that became the most faithful adherent to the original sound, and though they wouldn’t field a studio LP until well into the 2000s, they originally formed during the same mid-90s period of flux that originally birthed the Gothic niche under consideration and recorded their first demo Shades Of A Lost Moon less than a year after Theater Of Tragedy’s eponymous debut set the standard.\n\nIn contrast to most of their contemporaries, Draconian has since proven a steadfast adherent to the old ways of doing things in spite of some substantial lineup shifts, to the point of being a mid-90s death/doom band stuck out of time. Even the loss of iconic and longtime vocalist Lisa Johansson has done little to affect their signature sound, though there has been a notable drop in the frequency of their studio output since 2011’s A Rose For The Apocalypse saw her depart the fold. Her replacement, namely South African angelic crooner and :LOR3L3I: singer Heike Langhans, subsequently brought a more nuanced but equally competent performance in the equation, often reminding of the somber and beautiful serenades put forth by Sharon Den Adel during Within Temptation’s earlier incarnation. This blend of a tortured yet tantalizing spirit with the dank and forbidding growls of front man and co-founder Anders Jacobsson formulates a perfect throwback to the days when Gothic-adorned death/doom was all the rage, thus making their latest offering Under A Godless Veil a strangely fitting one for the current year.\n\nAn album like this is perhaps best understood as one singular, hour long flowing of emotionally driven darkness, vacillating between agony and rage at a punishingly slow velocity akin to the range of speed by which six men could march while carrying a coffin. Notions of radio oriented bangers are generally an alien concept to this approach, though most of the chapters contained within this book of sorrow are replete with tuneful hooks, often bouncing between Heike’s vocal passages and the surrounding instrumentation. The opening lullaby turned beastly anthem “Sorrow Of Sophia” is among the more blatant examples not only of this band’s dueling modes of dark expressionism, but also of a fairly long and developed composition being catchy and accessible as well. Between the segments of subdued yet dense, keyboard-dominated quieter moments and the slow trudging rage that ensues when the guitars enter, an epic sculpture of a lovelorn faithlessness emerges, one that is duplicated on the similarly structured semi-ballads “Sleepwalkers” and “The Sethian” with varying degrees of drama and serenity.\n\nTo their credit, Draconian does not simply dwell upon this two-dimensional mode of expression where Heike dominates the softer moments with Anders coming in at the expected barrage of metallic riffs. The first example of breaking with overt predictability actually emerges on one of the shorter offerings, as “Lustrous Heart” sees something of a reversal where the angelic soprano lines intermingle with heavier moments, though the growls generally tend to coincide with heavier segments as well. The mid-album interlude “Burial Fields” dovetails with Heike’s dark electronic work outside of Draconian a bit more, but proves equally apt at conveying the dark sentiments that permeate the rest of the album. On the other hand, the format gets a bit more metallic on the heavy-ended crusher “Claw Marks On The Throne”, which brings in a bit more of a riff-based focus onto things and also features the most prominent of a sparse collection of guitar solos, and is the standout moment of what is a highly consistent exercise in vintage death/doom excellence.\n\nA definite boon for those nostalgic for the days when women’s faces were as pale as the moon and the music was as haunting as a choir of disembodied spirits wailing amongst the cemetery, Under A Godless Veil is something of an acquired taste, but not a terribly difficult one to attain. I definitely found myself checking the calendar a few times to see if it was still 1997, which would be something of a depressing eventuality given that I was still in high school and thus even more predisposed to this mode of metallic expression. All the same, this is an album that knows its audience and makes every stride to rope them in and keep them engaged from beginning to end. It’s perhaps a slight cut below such seminal classics as Arcane Rain Fell and The Burning Halo, but it’s definitely well worthy of this band’s impressive legacy and a continual reminder of a time when female-fronted metal wasn’t drenched in symphonic bombast. It’s a spider’s web of woeful longing and despair, but the weaver is enchanting enough to making throngs of willing prisoners.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nThe case of a terrible singer ruining what would have been an otherwise decent album is not uncommon. More uncommon, perhaps, are unremarkable recordings which are saved by the performance of not even their lead singer, but their secondary one. A Rose for the Apocalypse is one of those. Lisa Johansson’s probable farewell to the metal world may also have been her best performance to date. The voice of a child lost in an unforgiving world, simple, fragile, always on the verge of collapsing; a natural voice devoid of any camp excess, miles away from the wannabe-sopranos too often plaguing the scene. She will be sorely missed, barring an implausible comeback.\n\nBut Lisa was only a small piece of a larger machine called Draconian, and in 2011 Draconian could have worked as the textbook example of a once innovative band having switched to autopilot, performing its tricks without taking a single risk. That was already worrying on Turning Season Within, it had become flagrant on A Rose for the Apocalypse. From Arcane Rain Fell onwards the guys have found a specific sound in the gothic doom metal niche, THEIR sound, immediately recognizable; from the very first bars it is obvious it is Draconian playing, and not any other offspring from the same root (let's say, Swallow the Sun). The guitar leitmotivs, crying leads and trademark melancholy are as present as ever. That’s just a pity they’ve forgotten about one minor detail – writing memorable songs.\n\nThis may sound harsh as, after all, this release is nothing scandalous, and it’s no doubt preferable for a band to stick to its guns rather than artificially change sound to embrace the flavour of the day. But these long rhapsodies, all built on an identical slow-to-mid-tempo pattern, fail in catching attention. The album could have consisted in a single, one-hour-long track, it would have made little difference. The plaintive guitars keep on answering each other while Lisa’s ethereal chant keeps on answering Anders Jacobsson’s more standard growl. The soft semi-acoustic breaks fall exactly where you’d expect them. The drums have never been Draconian’s selling point by far, but here the guy seems exceptionally bored – bass drum, snare, bass drum, snare, only sporadically does he remember he’s actually got a full kit to toy with. A discrete, basic keyboard is sometimes heard moaning in the background. No surprise. All this cruelly lacks both the hooking melodies of Where Lovers Mourn, and the doom heaviness of Arcane Rain Fell. Indeed, Turning Season Within already sounded like a watered-down version of these, but it still had its few crushing moments. A Rose for the Apocalypse sounds like a watered-down version of Turning Season Within, and it is not a good sign; at all.\n\nIt innovates in two minor points, though. The lyrics move away from the graveyard poetry of the previous albums, to take a more abstract turn fuelled by apocalyptic themes, perhaps a loose reminiscence of the luciferianism of the early days. Then, there’s the discrete return of a – real – violin on a couple of tracks, an instrument the band had dropped for years to go keyboards-only. Still, it is too scarcely used to be of any significance.\n\nSo, well, we’re left with Lisa, far too discrete, not even handling half of the vocal duties, and mostly confined to the softest moments – she who was so good at singing over heavy music. It’s understandable the band never wanted to fall into the easy cliché of the gothic female-fronted act, and, indeed, it had worked well in the past. But when your female singer has become your one and only asset, it’s almost a crime to underemploy her so. Subsist a few moments of pure, unadulterated beauty, scattered amongst an ocean of indifference, particularly the crystalline verses of The Last Hour of Ancient Sunlight and A Phantom Dissonance, two similar short songs probably meant to be the catchy numbers here, or the whole closing track The Death of Hours which manages to capture some remnants of the former majesty, tragic relics of a band which, at that time, had very, very little left to tell.\n\nHighlights: every time Lisa’s singing...\n",
        "\nI was introduced to Draconian years ago by a friend of mine who loves a lot of Swedish metal bands, more particularly Dissection and Watain. She noticed that I was huge into gothic metal, so she decided to play me some Draconian just to see what I think of it. She played to me a few songs on \"Arcane Rain Fell\" and oh how this album was amazing. Not only was this album was depressing as anything I heard before, but it showed true passion and grief that can rival one of my favorite bands Anathema. This leads me to here with my thoughts on \"Arcane Rain Fell\" today.\n\nDraconian (much like every other gothic band with a female singer) is often compared to Theatre of Tragedy due to the use of the beauty of the beast vocals. However, with \"Arcane Rain Fell\" it was unlike anything gothic metal has ever heard. It went to the pinnacle of depression and solidified Draconian as one of the brightest lights in the genre today. \"Arcane Rain Fell\" remains one of my all-time favorite metal records that still sound fresh whenever I listen to it in full. It's an album that has ironically helped me through depression, anger, and hopelessness that I had felt during my darkest times in my life or in the world I'm surrounded in. Like Anathema's \"Eternity\", \"Arcane Rain Fell\" was one of those few albums that gave me chills, and even tears when I listen to the album, and this album represents Draconian at its best. At the moment, \"Arcane Rain Fell\" still remains as the most depressing album I've ever heard.\n\n\"Arcane Rain Fell\" music is incredibly depressing. It's so depressing that it left me with tears and chills. They use melodic minor keys to leave a lot of deep feeling and that shows within the instrumentation of the keys and the guitars. Dynamically, the guitars are crushing, and sometimes don't play in order for the keyboards to set the tone for its depression. \"Heaven Laid in Tears\" is one such example especially when the previous track builds up this song to an emotionally powerful experience. On one of the bridges of the song, the guitars repeat its alternating notes while everything else, but the elegant keyboards take a break. While it's gothic influences are not as obvious as the likes of Paradise Lost, or Type O Negative, there was a level of atmospheric elements that make this album so unique and that is not macabre depression, but sheer darkness thanks to the key signatures used combined with sensitivity. Even if you don't consider this a gothic metal album, this is still a crushing death-doom inspired album with elements from the genre such as Anders Jacobsson's vocal approach, and the rhythms of the album. It was either depressing or disturbing for death-doom and Draconian hit new levels of depression with this album combining those crushing elements with the depressing and elegance of the atmospheric gothic keyboards and Lisa Johansson's vocals. \n\nDespite having that label related to the cheesy beauty and the beast bands, Draconian manage to sound so unique in \"Arcane Rain Fell\" where Lisa and Anders were able to balance the many negative emotions associated. They took the vocal style and made it into their own thing where it wasn't just back and forth dueling between death growls and soprano singing, this was done in a tone of depression that they both have. They would do this a lot with the lyrics with rarely coming to the same conclusion until the very end. That dynamic is what makes Draconian so unique and it had reached that peak with \"Arcane Rain Fell.\"\n\nThe lyrics of \"Arcane Rain Fell\" are indeed depressing as well. It hits a level of sophistication, but another thing so unique about the lyrics is the yearning for hope. Noticeably, there is that dynamic between pain and yearning between its singers Anders Jacobsson and Lisa Johansson. Anders speaks the lyrics that sound angry, and Lisa is yearning. \"Arcane Rain Fell\" was able to balance these two emotions without sounding without going back and forth between anger and depression. It's almost at the same league as Theatre of Tragedy when they wrote in Early Modern English. Similarly, but in a way sounds modern. \n\nIf there was one song that I would say is the most depressing song I've ever heard it would have to be \"Death, Come Near Me.\" This 15-minute epic does not drag on but ultimately changes with the depressing key of g minor. The guitars were the sounds of crushing defeat and exhaustion, to the atmospheric keyboards that bring about complete depression. Then come Anders and Lisa's singing. Anders growls in pain, Lisa sings in sorrow nothing mattered anymore after listening to this song. It's one of the most powerful songs I've ever heard and the song that really lifts my spirits up after feeling depressed. Just the very last words are relateable, yearning for unity and even death and depressed about hatred, and the loss of humanity's innocence.\n\nOh, shed a tear for the loss, of innocence,\nfor the forsaken spirits who aches... in us.\nCry for the heart who surrenders to pain,\nfor the solitude of those, left, behind!\n\nBehold the pain and sorrow of the world,\ndream of a place away from this nightmare.\nGive us love and unity, under the heart of night.\nO Death, come near us, and give us life!\n\nThe piano that is greeted before these words are uttered is tear-jerking. It was sheer depression that really touched me as if it knew my pain. \n\nWhen you look at depressing music in metal and even outside of metal most is done without any convincing sound. It takes more than just depressing lyrics for a song to sound depressing, the music has to be incredibly bleak as well. You find a lot of that in the gothic doom category like Anathema, and My Dying Bride and even a lot of DSBM like Shining and Gris who have bleak music and incredibly bleaker lyrics. However, if there is one album that I would say is the most depressing metal album musically, lyrically, and vocally altogether my answer would be \"Arcane Rain Fell.\" This album will make you cry, angry, hopeful, yearn, and inspired by the emotional 60-minute journey you will endear. My vote for not only one of the best metal albums of the 2000s but one of the greatest gothic metal albums ever made. O, Miserable Sun.\n",
        "\nDraconian's Sovran successfully walks on the thin line between gothic and doom metal and convinces with ten emotionally gripping songs that develop an intriguingly bleak atmosphere from start to finish for an intense listening experience of sixty-seven generous minutes. \n\nNew vocalist Heike Langhans needs to be pointed out as successful addition to the band's line-up. The South African singer sounds like a mixture of tragically deceased Aleah Stanbridge of Trees of Eternity fame and Within Temptation's Sharon den Adel. Her soothing voice inspires hope in sorrow in a most enchanting way. Her angelic vocals are intensively contrasted by Anders Jacobsson's vibrant harsh vocals. Many bands that try this beauty and the beast approach end up failing as they are resorting to tired stereotypes but Draconian's singers complement each other perfectly and add atmosphere, depth and emotion to the songs.\n\nThe musicianship blends in perfectly. Sorrowfully distorted guitar parts, sinister bass guitar passages and thunderous drums make for a melancholic melting pot that is occasionally supported by decently employed string sections or short narrative parts. Despite keeping its mournful atmosphere from start to finish, the musicianship is diversified, dynamic and inspired enough to keep things interesting from start to finish.\n\nAll songs work particularly well but if I had to cite a highlight, I would go for the wonderful ''Rivers Between Us''. Rarely employed melancholic clean male vocals meet Langhans' angelic female leads and occasional growls that add a passionate sinister touch. The sorrowful guitar work is truly touching, the rhythm section keeps a slow but steady pace and occasional narrative parts add more atmospheric depth. The track manages to sound both consistent and diversified and remains particularly entertaining through its running time of nearly seven minutes.\n\nIn the end, Draconian's Sovran offers the perfect mixture of doom and gothic metal. If you like melancholic music with imaginative depth, you can't get around this release. The band was already outstanding earlier in its career but the addition of Heike Langhans' unique angelic vocals seem to be the missing element that could push the band from greatness to excellence. Enjoy the record's bleak magic on a cold winter autumn or winter night with a good glass of wine.\n",
        "\nDoom metal is a pretty difficult genre to listen to and unless you're seriously depressed it doesn't seem exactly appealing. Making it catchy seems like an unlikely thing to happen and something that I don't think I ever thought possible. However, with the song \"Stellar Tombs\", Draconian did exactly that and it was intriguing enough for me to try out the full length album. I wouldn't know to say if it was a good surprise or a disappointment but it's certainly not what I was expecting. They bring a strong blend of doom metal with gothic and death metal influences that definitely has a powerful sound and a lot of emotion. I guess the truth is somewhere in between. \"Stellar Tombs\" certainly the best way to get into the style of the album so I recommend you check that one out. \"Heavy Lies the Crown\" and \"Pale Tortured Blue\" also work well for first time hearing the band. In fact, I think these songs are the best on the album which is probably what made the rest of the album slightly disappointing. It's not bad but it does seem less. \n\nOverall I have to say Sovran is a solid album but it does also have it's flaws. The \"doom\" is well executed. Most songs are slow tempo, with a deep and heavy guitar sound and beautiful melancholic melodies. There's nothing massively impressive but they do have some very inspired themes and many things will stick in your mind quite easily. The atmosphere they were aiming for is clearly well achieved. There's a feel of \"beauty in sadness\" going throughout the record creating a pretty nocturnal ambiance. It certainly feels more appropriate to listen to this album after the sun went down. I guess there's also a romantic element in there but I'm not quite sure what it is. Anyway, most of the lyrical content is pure doom metal stuff.\n\nThe strongest trait of the band's sound, I have to say, is definitely the vocals. With a beautiful dynamic between Anders Jacobsson's harsh vocals and Heike Langhans' beautiful clean singing it really is what makes the band worth checking out. They stop the album from getting boring and get most of the emotion through. Especially Heike's voice is one that I've quite rapidly grown fond of. \"Heavy Lies the Crown\" and \"Stellar Tombs\" should once again be your \"go to\" songs if you want to see what I mean. She's quite hypnotic and will easily immerse you into the atmosphere. But the album also gets quite heavy and even good for headbanging on a few small occasions so don't think it's all grey and tears. Sometimes it's just grey. There's also a speaking voice coming in every now and then and I also liked the third voice that showed up from Daniel Anghede's guest performance on \"Rivers Between Us\".\n\nSo there's quite a number of reasons why you should take the time to listen to this album but I wouldn't advise any huge expectations. I was quite disappointed to find that many songs on the record, although still enjoyable are just less of what I already heard and it just feels like they're dragging too long after they've used up everything they had to say. \"The Marriage of Attaris\" for example had pumped my hopes quite a lot since it is the longest on the album and I'm sorry to say that it's not even necessary. It's not a bad song but it does feel quite pointless when you know what you already heard up until that point. I guess the album just sort of burns out before it's actually over and for the last bit you'll just be waiting for it to end. But I can't judge them for making it that long. After all one of the main purposes of doom metal is to make your songs too long isn't it? Still, diversity is where Sovran loses most of it's points. There is a lot of potential in here but it just isn't that well used. I think you should check out the album and enjoy it but I just have a feeling you won't really enjoy all of it.\n",
        "\nDraconian is a band I took way too long to discover relative to how much I currently enjoy them. I actually ended up seeing them live (albeit after Lisa departed) before really knowing any of their songs and that became my impetus to checking out their releases.\n\nI will admit that almost all the songs on this release follow a similar formula: an instrumental intro, one of the vocal styles (clean female or harsh male) for part of a verse, the other vocal style for the rest of a verse, a chorus with some combination of both vocal styles, some sort of interlude, and then a return to the verse and chorus. That said, the band executes the formula very well and uses the exceptions (both clean and harsh vocals together, occasional clean male vocals, and occasional acoustic guitar sections) to make this a great release.\n\nI don't have any production issues with this release. The guitars (Johan Ericson, also the principal composer, and Daniel Arvidsson) have the punch you’d want in the heavy parts and still come through crisp and clear on the clean and acoustic parts. I always feel like there could be more lead parts, but the ones included are well placed and well constructed. Bass (Fredrik Johansson) is more than just following the guitars, especially on verses, but there are times I find myself wishing for a little more active of a bass-line such as one might find from Rune Osterhus on the early Tristania releases. Jerry Torstensson has become one of my favorite drummers, especially in the gothic/doom realm, and this release lives up to the standards I’d expect from him. Andreas Karlsson is no longer an official member of the band, but does contribute keyboards as well as composing the sole non-Johan written track (“September Ashes”).\n\nAnders Jacobsson is the main male vocalist and principal lyricist and continues to build on the solid foundation one has come to expect. Lisa Johansson provides the clean female vocals and remains one of the biggest reasons for the band’s rise in terms of my listening habits and enjoyment of their releases. Paul Kuhr (from Novembers Doom) has a guest role of “Narrative Vocals,” which I think refers to the spoken vocals on “September Ashes” and possibly other tracks. Mina Eltaieb is credited with writing the chorus lyrics on “The Empty Stare” and Theres Bjork is credited as writing poetry Anders has adapted lyrics from.\n\n“Seasons Apart” is one of my favorite opening tracks on a release, and I’m not just talking about Draconian’s discography. The formula isn’t anything greatly different from what the band does elsewhere, but the slow instrumental build, the addition of Lisa’s vocals, and then Ander’s vocals flow exceptionally well. Even the little guitar stinger at the end feels like the best way to end things.\n\nThere are only two weaker songs for me on this release, and they are the last two: “The Empty Stare” and “September Ashes.” “September Ashes” is actually a little more complicated, because if I’m listening somewhere where the disc auto-repeats then it works very well as the transition back to the first track yet when it’s the last song on a single play it feels like it should have more to it relative to the rest of the songs. The lyrics on “The Empty Stare” don’t grab me quite as much as those on other songs and the main bass and drum beat pattern is a bit different in a way that doesn't work as well as on other tracks. Even with all that said, I don't typically end up hitting the skip button for either track.\n\nOut of the remaining songs I’d go with either “Not Breathing” or “Morphine Cloud” as my favorite. “Bloodflower” is also up there, but Lisa’s smaller vocal role prevents me from putting it on the same level as the other two, even with its great keyboard part to end the song. \n\nIf you like any track (with the possible exception of the last one) off this release, I would expect you to enjoy all the others. I really enjoy the combination of death, doom, and gothic metal elements that Draconian brings together (even going so far as say I'm a bit disappointed that I can't find any other bands that are similar enough for me), but can acknowledge that someone not into the gothic side as much as me wouldn't be in the same boat.\n",
        "\nI loved The Burning Halo from the very first listen, and I knew right then that Draconian was a band I needed to look into further. It was only natural then that I ended up at the album that followed, Turning Season Within. Overall I would call this a step down in quality, but it is still a great album and I would recommend it to those starting out in death/doom.\n\nI was full of praise for Anders and Lisa on the album that preceded this one, and all this one does is back up my initial thoughts. Lisa in particular is fantastic, capable of doing so much and fitting her voice into whatever style the scenario calls for. She's so consistently brilliant, always enhancing the music when she appears, and it all sounds so effortless. She's truly one of the best female vocalists that I've heard. Anders delivers deep crushing growls that contrast harshly with Lisa's serene cleans, and he's also got to be in contention for being the best in his field. While there are a lot of powerful vocalists out there, not many can portray raw emotion while growling, which is a skill that Anders seems to have mastered. There are bits where he appears soulless (unfortunately really, given that this was not the case on The Burning Halo), but as a whole he's very good at channeling the suffering of the character he portrays. But while both of these vocalists are great by themselves, when they duet with each other on tracks like 'The Failure Epiphany' the music goes to a whole new level. There's something about the contrast that's fascinating and I feel as though it ought not to work, but it does. It's a shame that they don't combine like that more often.\n\nThe music is fairly simple and there tends to only be three varieties on offer; one kind relies almost entirely on Lisa's vocals accompanied by a piano, while the other two are largely dependent on thundering guitars and either Anders's growls or Lisa's cleans. It's a style that works - to an extent. It definitely helps to build the music up and emphasise the more powerful sections, but doing the same thing over and over again is rather predictable and stale. Even on my first listen to songs on the latter part of Turning Season Within I was practically counting Lisa in before she appeared in the choruses. Some of the stuff they do is fantastic, and the melodies are brilliant right the way across the album, but something about the song structure just doesn't hit me the way that other records in their discography do. There are less subtle elements blending together than on The Burning Halo, and it's nowhere near as heavy and hard-hitting as Sovran. In comparison this seems so much more basic, and it doesn't have quite the same level of emotional charge as either of those records. I don't know think that the blame can be placed on one individual, but the package as a whole is simply weaker.\n\nSo while it makes for a good listen, compared to other Draconian records Turning Season Within is a little sub-par. The standouts are 'Seasons Apart', 'Not Breathing' and 'The Failure Epiphany', but even those tracks are quite a slow burn when held against 'Pale Tortured Blue' or 'The Morningstar'. When it gets to the chorus and the band are in full swing this is a wonderful listen, but when they're not it's quite underwhelming.\n",
        "\nI've been exploring a lot of doom/death lately and I suppose that it was only really a matter of time until I came across Draconian. The Burning Halo is without a doubt a masterpiece, there's really no disputing that. It has this ability to channel emotion in a way that I just didn't think was possible before listening to it. It's a skill that so many bands attempt to showcase, but only a very, very small minority pull it off to the level that Draconian do. The way everything blends together so finely to craft the music you'll find here demonstrates exactly how gothic music should be played.\n\nVocals are a major part of gothic metal in any form, and unfortunately I don't feel anything when the vocalist in half of your run-of-the-mill gothic metal bands sings. Anders and Lisa, however, are among the finest of duos I have ever heard. It would appear that getting emotion across while growling is a tricky skill to master as so few show anything beyond brutality when doing so. But there's something in Anders' voice that sounds different, and it actually connects with me, 'Serenades of Sorrow' in particular. There's a power in his voice, but also this mix of sadness and anger, like he's experienced all the pain that he sings about. It just adds this extra dynamic that's so often lost with other harsh vocalists. Equally, I have to say that Lisa is brilliant. As soon as she made her appearance on the first track 'She Dies' I was instantly convinced to stick around for the entire thing, long before the song started to climax. This release alone has convinced me that she's one of the greatest singers I'll ever hear, she's got such a beautiful and otherworldly voice that words cannot do her justice. She sounds so heavenly, particularly in the higher sections, and she contrasts so sharply with Anders' tortured growls but somehow her voice works in tandem at the same time, to great effect I might add. They compliment each other so well that I'm left simply astounded. Even the spoken sections that I would normally dislike are woven in perfectly.\n\nYou often find that a band that does the vocals perfectly offers very little in terms of the rest of the band, but again Draconian have no such issue. It's put together in an incredibly complex manner so precisely that I can do nothing to stop myself being blown away by its beauty. There are so many elements here, from the changes of pace from one section to the other, the crescendo to the diminuendo, the differing leads (be they from the guitar, the synths, the vocals or wherever the hell else), it all comes together to create The Burning Halo. It's a truly magnificent creation, full of weeping, sorrowful melodies that fit perfectly with the vocals and featuring a near-constant tinkering piano in the background that's incredibly minimalist and sounds vulnerable, yet provides the backbone for everything. The guitars don't tend to do much but yet they have such a huge impact on the music as a whole. Again it's the sorrow that they manage to make the listener feel that really makes it so exceptional, but the delicate coordination of their leads are so much more enjoyable than any technical wankery could ever be. Even the birds chirruping on 'She Dies' works far better than I could have imagined and adds another layer to the song. Just wow.\n\nMy one problem with this album is due to the two cover songs. All of the original material is perfect. All of the rerecorded material is flawless. The two covers however are not quite at the same high standard set by the rest of the album. They aren't awful, but when the rest of the album is so spellbinding it's disappointing that they felt they needed to put two cover songs in there. The songs they chose aren't typically gothic, and that's probably where the problem lies. They weren't intended to be done in the style that Draconian play in, and they just don't manage to make it sound as genuine as the rest of the record. And it's a shame, because I mean it when I say that the rest of this album is completely without fault. Anyone that likes death/doom or gothic metal needs to listen to this. You won't be disappointed.\n",
        "\nA glass of red wine in hand, world weary and sullen from trudging through yet another week. Sovran then, the long awaited sixth album from Swedish gloom merchants Draconian, seems a perfect fit for the small release from such drudgery. Despite a gap of only four years since A Rose for the Apocalypse, the wait for this latest opus has felt a lot longer. Perhaps in part because the aforementioned release was unfortunately largely forgettable, but mostly due to long term vocalist Lisa Johansson leaving in the same year, and being replaced in 2012 by Heike Langhans - we've been waiting three long years to see what she'd bring to the band and their new material. Fans needn't worry though, Sovran is a definite return to the doomy melancholy musings we've all come to love from Draconian, with Heike and her lovely voice fitting into the band as perfectly as if she'd been there from Draconian's early days.\n\nSovran is still very much Draconian, with a new vocalist there's not a huge shift in their sound, just more of a refinement compared to the previous effort. They still play a mournful and expressive style of gothic-doom that's unmatched by most of their peers. We can see this from the outset on opening track Heavy Lies the Crown, a slow gloomy riff punctuated by dramatic keys starting an impressive opening track. The guitar tone is heavy enough to suit it's purpose, but they don't go down the route of trying to barrage you into submission with distortion. The rest of the heaviness comes from the feeling put forth in the lyrics and emotional performances of Heike and Anders, having just as much of an effect as any ten ton weight guitar tone. One also notices the album's great use of spacing, the guitars letting up slightly to let Heike's voice take centre stage - and these passages are often the albums' best, when her voice breaks through with forceful emotions and providing a dramatic climax for most of the songs. Her voice is beautiful, with a similar tone to Within Temptation's Sharon Den Adel, and though much more powerful, that low trill to her voice does bring comparison to the iconic singer, and fits perfectly as a \"beauty\" counterpart to Anders' \"beast\" growls. A comparison to Lisa wouldn't be fair to either party, both have their own style, and both fit marvellously within the overall picture that Draconian paints. As usual Ander's growls are more emotional than they are needlessly brutal, and his dramatic spoken word passages are a trademark of his oft repeated through the album. Overall Draconian's sound is great, the strings brilliant as usual,which alongside the keys make a great counterpart and add an extra dimension to the crunch of the guitars It's more Turning Season Within than Arcane Rain Fell with it's focus on gloom over doom punctuated by dramatic high pitched lead guitar melodies through the album, and it's a lovely listen.\n\nPale Tortured Blue is led by Heike most of the track, showing just how powerful and filled with emotion her voice can be with a stirring performance, and it's a slow melancholic affair, dripping with atmosphere from the interplay of guitars and keys. However Sovran really reaches it's heights in it's second half with one of the longer tracks Dusk Mariner eclipsing all those before it, with the length allowing for more indulgence in their sumptuous melodies, and there's a more ethereal tone to Heike's voice, with Anders' brimming with a cauldron of emotions, and it's really a high point of the album. The dramatic and epic edge which has always been a part of the Draconian sound, and it really shows itself on the longer tracks. The lyrics are beautiful, the strings stirring, the guitar melodies hard hitting and the track - a triumph. Dishearten has the loveliest duet between Heike and Anders across the whole album, and the pounding drum rhythm and subtle keys make it yet another highlight. Rivers Between Us features a guest appearance from Crippled Black Phoenix vocalist Daniel Änghede, providing some lovely cleans in a lovely wistful duet with Heike over a sorrowful cloud of melancholic leads and gorgeous keys. Daniel's contribution is fantastic, the passion in his voice fitting perfectly into Draconian's brand of gloomy music, and his lyrics near the end of the track being among the album's best - but who knows what beautiful words would be said if one could provide a transcript for that expressive closing solo. \n\nIt doesn't quite match up to the first two albums, which by now are classics in their own right, but while lacking a lengthy epic such as The Cry of Silence, or Death, Come Near Me, Sovran shows a freshness from Draconian that shows why they're still stalwarts of the gothic doom scene, returning with an album that leaves you falling in love with it a little more each listen, with an electric atmosphere and of course with Heike's beautiful voice. Another incredible effort from the Swedes and an end-year list botherer for sure.\n\nOriginally written for swirlsofnoise.com\n",
        "\nBy the time I heard the Swedish outfit’s debut, I had already become fairly familiar with their work through the most recent release “A Rose for the Apocalypse” and the borderline classice status release “Arcane Rain Fell” so I went into the debut “Where Lovers Mourn” as one of the later releases I took a listen to and, as I said, it had to grow on me. But after a good four or five plays, I’ve developed a modest liking for the release, but still I can’t help but feel the imperfections that are very present throughout.\n\nBut no album is perfect, especially debuts, so it is forgivable.\n\nSo back in the band’s early days (demo period) the sound could be listed as black metal influenced melodic death metal. With the release of “Where Lovers Mourn” the band went for a more straightforward death/doom metal approach with the black metal and gothic influence being a more backburner thing and very much less apparent.\n\nSound wise, it’s a heavy and thick mix of the violence of death metal and with the depression and slow speed of doom metal peppered with black metal influence (mostly in the guitar work) and a gothic touch of symphonic metal. Very heavily down-tuned guitars, paired with some subtle bass work to thicken the sound and slow yet strong drums layered with some sparcely used but very much involved keyboards that ad a lot to the atmosphere of the album, and of course the vocals, with some nice throaty death growls, more black metal influenced mid range howling and some spoken word passages for good measure all done by Anders Jacobson. But it’s female vocalist Lisa Johansson who sticks out the most in the vocal department. Her range is borderline operatic and vaguely melancholic. She gives a good deal of contrast and beauty to play off of Anders vocals very well. She’s really what gives the band that small touch of character that separates them from the rest of the pack of the genre.\n\nThe whole band performs very well and everything sounds very tight and well produced. This is especially present on the first track “The Cry of Silence” a very slow and very heavy tale of a misanthropic man who wishes to live his life and die in solitude away from anyone and everyone else in the world. It’s probably the best effort for the doom aspect on the album (an aspect both good and bad in retrospect considering that it starts at its best and goes downhill from this point) as well as the longest, yet not long winded and offers a good amount of variety with a few mid tempo parts to break up the sound so that the twelve and a half minute piece doesn’t overstay it’s welcome. Next we have “Silent Winter” which goes to the other side of the scale and comes to us as the best effort for the faster, gothic and symphonic influence to show itself.\n\nUnfortunately, as I said, the album goes a bit downhill from here. The best has been displayed for the first two songs and the rest of the record is a mixed bag filled with a lot of good ideas and just as many misfires. For starters, let’s address the main issue with this record; there’s nothing wrong with the performance or production. Both aspects sound great. No, the problems stem from the very song writing itself. See the thing about most of the songs here is that half of them are remakes that appeared here and there across the five demos they released over the past ten tears. The demo period in which they suffered from things like poor and lazy song structure, repetitive writing and a disinterested vibe plaguing the whole thing.\n\nThe only songs here that are originals to the album are “Silent Winter”, “A Slumber Did My Spirit Seal”, “Reversio Ad Secessum” and “Akherousia”. The rest are all remakes and while some songs have actually been improved by being remade (and by some I mean just “The Cry of Silence”) the rest suffer from the most of the same problems that came with them on the demos, just with tighter production. They’re not entirely bad though, “The Solitude”, “The Amaranth” and “It Grieves My Heart” are decent enough, probably the best songs out of the demos that, once again, were less than great, they’re entertaining to listen to and greatly preformed, they lack any real reason to go back to or remember or in any way shape or form care about. Songs that are good to listen to but you don’t care all too much past the first enjoyable listens. Then you have the original songs that I listed earlier which, save for “Silent Winter”, are all complete filler tracks. “A Slumber Did My Spirit Seal” is the third track on the album, starting off pretty uninspired, staying that course for the next five minutes and ends before you know it. Completely un-impacted. Then comes “Reversio Ad Secessum” which is probably the most memorable of the trio (though that’s not saying much) with some interesting piano sections and nice vocal work by Lisa, but overall, nothing noteworthy. Then you “Akherousia” which is most guilty of this, a very brief (only two and a half minutes) piece that is the only ballad and the only one with Lisa doing all the vocals. It’s the most bored and uninterested song on the entire release and one to skip entirely, which is a real shame considering it could have been a good display of Lisa’s voice but ended up being wasted potential.\n\nSo in closing, the album as a whole, is decent. It’s not a bad release, but it has a great deal of flaws, enough so that I can’t say it’s a must listen. It’s worth a listen or two, but doesn’t go much past that. Besides that band would go on to garner a good deal of success with their 2005 follow up “Arcane Rain Fell” so it’s not that surprising that this release has been more or less forgotten about by both fans and the band themselves.\n",
        "\nArcane Rain Fell was a grower for me, in that the first couple of times I endured its morose wrath I wound up feeling like a real miserable son of a bitch by the time it ended. The compulsion to drown whatever ridiculous sorrows I could conjure up in a haze of double IPAs would manifest to levels that left me inebriated. I have better things to do than ruin a pleasant sunny day by trudging through something that will render me in that sort of state I would get after being dumped, fired and drenched by a passing vehicle that just barreled through a huge puddle positioned diagonally in front of me, all on the same day. Arcane Rain Fell wasn't bringing me down because it was terrible music I should be avoiding. Not at all. It was just extremely effective in its plodding, suffocating atmosphere of misery, erasing whatever joy I had in me at the time. This would not make for a proper soundtrack to a typical porn film by any means.\n\nAfter repeated revisits over time however, I was able to appreciate the quality of the music, vocals and lyrics themselves, and not just the album's capability to induce frowns and a sense of listlessness. The production is weighty and suffocating, dragging the guitars up front with the keyboards wandering around in the distance, adding a bit of cloudiness. The drum mixing works well in assisting the bleak atmosphere with a strong bass drum and a rather subdued snare, providing the melodies with an almost flowing backdrop. \n\nI've seen Draconian's work lumped in with the whole 'beauty and the beast' scene, but for this particular effort it's arguably not really the case. The bulk of the vocals are provided by Johan's forceful growls along with occasional spoken word passages (most notably Ryan Henry's contribution during the interlude track \"Expostulation\"), while Lisa's sweet antidote to the ugliness only chimes in sporadically. Her presence has the effect of a blooming rosebush in front of a burnt down orphanage. This actually works to the album's advantage, resonating like a classic death/doom album from the early 1990s, and Johan's delivery is far more convincing and ferocious than the vast majority of acts utilizing the whole male / female duo approach to lyric dispensing.\n\nAs much as I'm a fan of female singing in metal (no shit), in this case the track that stands out the most for me is \"The Apostasy Canticle\", which possesses no female vocals whatsoever. What it does have though are these thick dreary riffs emitting a hellish vibe. Gothic doom metal at its finest. As for the rest of the album, despite its oppressive nature, it's not a collection of funeral dirges by any means, with enough tempo shifts and some double bass enhanced beastliness to keep things from lulling me into eternal sleep. Hell, \"The Abhorrent Rays\" is a straightforward mid-paced track practically during its entire run. You could dance to the damn thing if you wanted to make a complete fool out of yourself.\n\nMusically the band isn't about showmanship, as the riffs throughout aren't the type that'll induce Berklee grads to cream all over the sheet music, and the overlaying guitar and keyboard melodies are somewhat simplistic in nature. The notes chosen, though, are borderline brilliant in how they capably drain the senses of any positive life affirmation, like a fucked up humidifier spouting unclean, polluted air. \n\nThe lyrics play an important role in establishing that sort of mood I get when I come home from work to discover my house in complete disarray thanks to my obnoxious toddlers while my wife yells at me for some reason. A word of caution; if you notice a cute, quiet studious Pakistani girl in class at your university, DON'T MARRY HER. A 'wolf in sheep's clothing' for sure. Anyways, the lyrics are well written and imbibed with enough old English to give off a borderline haughty air if the subject matter wasn't of such a lugubrious nature. An angel falls from Heaven, is basically pissed at God, feels like crap and wants to die. That's the gist of the album's storyline, albeit with better prose.\n\nArcane Rain Fell isn't the sort of thing I listen to a hell of a lot. There's certainly heavier and more miserable soul-sucking unrestrained doom out there, but I actually find this more emotionally draining than a lot of that stuff because there's just enough glimmers of light here and there throughout the album to endow the more despondent moments with an even more devastating power. The thing is, this is some good shit. Maybe there are times when a sunny day does in fact deserve a swift kick in the ass. They'll be plenty of other sunny days in the future to focus on happy crap, well, unless I die or something. Yeah, even just writing about this release is kind of a bummer. Another excuse for booze I guess (and yes, in retrospect, the reasons my wife occasionally nags at me are probably well-founded).\n",
        "\nWhat an atmosphere, deranged lunacy to the morbid settings that come arie when listening to this release. You'll get a bulk of an hour's worth of darkness seemingly to be visible. As a usual mild tempo of even slower guitars, musically that peaks as its' aura is deeply tranquil, yet quite alluding to death's door. A mixture not only of just heavy duty chunks of guitar work, it's filled with other braziningly moderate musical concoctions of piano work alongside spoken word overtures that don't stagnate, they keep the vibe at their unique genre. A very well produced release where everything just is in the right place, the way a \"gothic doom\" sound that blissfully is great to \"chill\" to.\n\nThe female vocals add a little variety to just heavy throat, plus the lyrics fit deeply well into this sorrowful chain of music that needs more followers. Not enough people know about this band and their blitz with frayed ends of insanity regarding the tonality of their releases. You get it all here, except the fact that their focus is not aggression, it's an open door to the gates of eternity. Such a well played release with unique sounds coming from all over the recording. The guitars focus mainly on such moderate blends of chords and melodies which are wholly original, never copping out always seeming to be so \"them.\"\n\nA sure band that invests in sounds that are so mild, it makes the mind seem at ease where the darkness is vivid with lost sanity in the lyrical compositions. Not only do they invest in just a moderate form of doom, but also take pride and write about such morbidity with creativity mixed with the music that devours the souls that are lifted into eternity. I only have this one and their 2011 release, but both are exceptionally well composed with death as their venture into existence gets spewed out of your speakers hearing only that utter words of blatant intensity. There is so much to this piece of work that holds true to their own sound, missing nothing, hearing everything that is death-like.\n\nAn album that requires no expectations of anything but just their own unique metaphysics in regarding to their artistic sense of demonic love of true doom and a presence of otherworldly encounters of such divine intervention. You get it all here, the spoken words, the occur of hoarse vocal outputs, female voice present in moderation, tempos that are so desolate they seem to touch the soul with tranquillity and music that is baffling to the listener because of it's sole presence of just emotion, driven to the essence of doom with destruction rampant. The release definitely posed capitalizing on originality in songwriting occurs.\n\nIf you're into some really mellow metal thats' premonition is that of darkness when listening to, Arcane Rain Fell holds the vivid truth in their essence living up to the stock of sheer morbidity with music that's spellbinding in metal that is great to listen to when you want a break from something that is truly an epic hour of 8 tracks flowing through the forests and drastic pillars of death lurking within their own essence of it all on here. I'd say from all I've heard from this band, this one is their best one. But on all to which they've released in album form, they dominate with such an atmospheric deathly doom of dreadery. Own it, you won't regret it at all!\n",
        "\nViverrant, lucid, and depressing, this band simply dominates! What's so amazingly clear is the lyrics fitting the music so well. What we have here is a conglomerate of atmospheric doom, equipped with time signature changes which bring about more morbid behemothic transcendence. A combination of darkly doomish vocals alongside a maiden's gentle heir on occasion, drowning this release into a sea of cosmic tears. The music especially the guitar is very slow, filled with distorted tones along with acoustics and bearing atmospheric synthesizers. It puts this into a whole realm of its own.\n\nI've never even heard about this band before and was introduced to it by someone which I'm surely opiated that I was able to hear about them. Definitely an aura so unimaginable and mellow. The songwriting is so amazingly calculated which if you're in a mellow mood, it'd be great to chill to. The riffs are filled in some cases with hardcore distortion mixed up with melodies that swarmed deep into the depths of depression. Whispered words alongside these kind of overtures and mocking at the end of existence. Just chillingly captivating, it would take countless hearings to be able to lead to unwavering bliss.\n\nA mellow mood overall, which signifies why they're into this sort of unknown, unwavering genre. Not only is the music amazing, so are the lyrics. They're filled with such depth and despondency. Truly gifted musicians to the core mastering in this drama of a release. There are so many different time signatures, none are fast, just some more upbeat than others. The female voice along with the hoarse throat deeply gives the release variety and vigor. Overall, the atmosphere on most songs are so unmistakingly grim, sounds original and melodies drifting alongside acoustics brazing along with the female voice.\n\nThe most of what dominates is the vocals and vibe, it's so aesthetic that it's lucid, grim, angry in the male voice whereas the female brings upon an utter utopia. A shame that these female vocals have been replaced with another, just appreciating her with the time that she spent with the band. A full viverent mixture of anger and joy, which reigns superior to other doom metal bands I've heard in the past. The voice brings with it a dusk of guitarwork that's so shifting and moving, true emotion expressed in clean and in heavy. A definite release that's calming to the soul and gothic due to the whole atmosphere.\n\nMore people need to know about this band and the wonder that they are to the metal community. The music is wholly original and captivating. My first impression was that I had to have this after hearing a song on YouTube. I was more than happy after hearing the whole album because it brought me into the realm of lucidity and exuberance. Finally a metal band that isn't just non-comprehensive waste of the human expense. So well worth looking into, songs like no other, lyrics so in depth and well thought out and production that's solid with everything so mixed well into the album as a whole. A band to definitely check out and admire. I'm curious to hear what they will sound like next!\n",
        "\nDraconian has always had a special flair to it. It has a very depressing and dark feel to it throughout the songs, but it always has those very special moments of pure, unfiltered metal. They always like to sing about death and misery and doom, yet they always manage to keep some moments nice and serene. With this album, they tone everything up a little bit to make what was originally good now incredible. \n\nProbably the best part about Draconian is how well the singer does his thing. An incredible moment in \"The Quiet Storm\" is the first verse sung by the male voice, and it is nothing less than pure. No high-pitched squealing of the voice, no really weird and disgusting low growling, just incredible screaming. And throughout the entire album, they don't try and squander the lyrical sound with invading guitar riffs so you don't know what to focus on, you can just let the singing fill you with emotion.\n\nThen there is the female vocals. It blends perfectly well with the male voice. Normally, she is the one singing during any \"depressing\" parts, such as the beginning of \"The Quiet Storm\". She has her moment throughout every song and some are more memorable than others, but she still is pretty skilled and is almost always complemented by some nice acoustic strumming.\n\nSpeaking of the actual music, it doesn't disappoint at all, either. In the beginning of \" The End of the Robe\" you have a nice metal riff going that turns into unabashed headbanging. \"The Drowning Age\" has the same effect, just throwing you straight into some crazy metal and not wasting any time. There are some nice varied music elements as well, such as a peaceful and harmonic distorted part in the intro of \"Deadlight\", and then comes the best song off the album featuring incredible female vocals, incredible male vocals, some acoustic strumming, and some good ol' doom metal. That song is \"The Death of Hours\". It perfectly symbolizes the album's whole, having every element in one eight minute song.\n\nAnd then comes actual music quality. There is one thing I would have to complain about and that is that the guitar, while lovely to listen to, is significantly simple. Johan Ericson is a great guitarist, but in this album there is no real depth to it, always playing the same overall type, which is just chord progression. He never gets to really show off some skill, but that isn't to say that the guitar playing is bad, because its not. It's good...no, in fact it's great. There could just be more of a dynamic to it and more of it. Probably the best instrument out there is the drums. They have some fast times, they have some very good beats, and they are just all throughout awesome. \n\nMost of the songs are fairly long, allowing you to soak in all the glory of Draconian. If you ever liked Draconian in the past, you should pick this one up. If you never heard of Draconian 'til now, you should pick this one up. If you don't like Draconian at all, then go listen to something else.\n",
        "\nThis is the self-released demo, released in 1999 by the Swedish doom machine Draconian. It's built on the concept of Milton's Paradise Lost with the lyrics dealing with the downfall of Lucifer after his rebellion.\n\nThe first time I heard this I was like \"FUCK\". It was the most awesome music I've ever listened to back then. Though Sweden is not very keen on doom metal, Draconian had the courage to try it and they did a great job.\n\nThe demo contains 11 songs, a prologue (Gracefallen), an epilogue (A New Paradise), and two instrumental tracks, \"Una Tertius\" and \"The Armies of Lucifer\". The songs are a real trip, with melancholy keys and hard-pounding riffs. Anders' voice seems ethereal and disembodied not only because of the poor quality of recording, but also because the songs have a touch of that rust that made old metal seem more awesome than it is right now. That poor recording quality gave music an inhuman touch. You can imagine while you listen to the songs that you can see Lucifer's downfall and his settlement in Hell. This is why Draconian promised a lot with this demo. Their music is more felt than heard. The lyrics are little jewels, reflecting Anders' creative power and, more importantly, a huge power regarding \"living\" poetry, creating songs in motion with keys pouring here and there to emphasize the atmosphere and creating Lisa' s vocal parts in the perfect place in order to make the songs perfect . The best song of the entire demo is \"The Morningstar\", a beautiful, sad song. I have never listened to something similar to this early Draconian release and I think no one can create something as beautiful and as deep as Draconian did and still do.\n\nFor all doom fans, I totally recommend this Swedish work of art. Draconian are the number one when you talk about doom metal. Poetry, sorrow and rebellion are all Draconian in a word.\n",
        "\nDraconian may have been the first doom metal band I ever got into. Although I had already experienced the powerful fusion of 'extreme metal' and melodic melancholy through bands like Opeth, Draconian's debut album 'Where Lovers Mourn' presented to me a different side of metal, one that took the tempo to the pace of a funeral march, with a dreary tone to match. Although doom is in no short supply of bands, and Draconian was certainly not the first to innovate this well-worn sound, they were the band who broke me into doom. In the years that have passed since then, however, Draconian have certainly changed their sound, to one that would not have been nearly as refreshing to me back then, but possesses as much emotional resonance as they always have. 'A Rose For The Apocalypse' continues Draconian's path towards a less obscure, and more harmonious sound. While the progressive and emphatic polish of Draconian will leave a weak taste to some, the band continues to mature and develop.\n\nThe death-doom category generally does not have much room for bands to separate from one another stylistically, without throwing away the label altogether. All the same, there is a significant development from their early material and this. Most notably, the band favours a much cleaner sense of production than they have in the past, and certainly in comparison with their first record. When you factor in the grief-filled growls, melodic guitar riffs and emphasis on epic composition, it's easy to joke that Draconian and Swallow The Sun are the same band, and that was the first thing I thought when hearing 'A Rose For The Apocalypse'. Regardless, this is not necessarily a bad path for Draconian to go down. As the incredible opener 'The Drowning Age' demonstrates, there is much potential for that feeling of epic, emotional impact that Draconian have always seen fit to deliver.\n\nThe vocals are structured around the often-used 'beauty and the beast' dynamic; that is, the contrast of pretty female vocals and a male growler. I have often found this gimmick to fall short and tread 'pure cheese' territory, although Draconian don't do a bad job with employing it. Lisa Johansson's voice is pure and the melodies she sings are stirring. As expected, the instrumentation is nothing to show off, but 'A Rose For The Apocalypse' feels very well produced and professionally performed. Where I feel that 'A Rose For The Apocalypse' falls off the wagon a bit is simply in the repetitive nature of the ideas on the album. That's not to say that any of these songs repeat themselves into monotony; the songwriting here is excellent. Rather on a hollistic album basis, it's difficult to be surprised even two or three songs into the record. Besides some ambient violin and an occasional mellotron, it becomes slightly difficult to maintain interest in what Draconian are doing by the end of the album, if only for the fact that these songs  sound so much the same.  Granted, there has never been a great deal of variety in their work or doom in general, but with the slightly more song-oriented, upbeat and produced nature, 'A Rose For The Apocalypse' feels like it runs in circles. On a song-by-song level however, Draconian are making some of the best death-doom out there.\n",
        "\nOverlooking Draconian was a hard thing to do. I am not someone that knows about the band since their formation. I encountered this marvelous band when they released their second album only. What I heard while listening it was stunning. Draconian is not the typical doom metal nor the typical Gothic metal band, it combines both genres and the result is purely fantastic, a harmony between these two styles I have not encountered.\n\nWhen I think that Draconian doesn't benefit from popularity, I think it is a real shame, because they offered so much quality in their works and without a doubt, they will have much to offer in the future. Draconian changed from a death/doom metal band into a Gothic doom metal band by the time Anders Jacobsson joined the band. Until then, the band did not release a full length album and it won't happen until 2003 when \"Where Lovers Mourn\" was released.\n\nA Rose For the Apocalypse is not an album that changes the musical style Draconian delivered until now, in fact, it takes it to a whole new level. It can be felt that in this album, the one that dominates it is not Anders but Lisa Johansson, thing that could be witnessed in a more earlier release called \"Turning Season Within\". This album proves to be a lot more melodic and also much more somber and melancholic than its predecessor, probably because Lisa's calm yet sorrowful voice mostly dominates it. From my point of view, Lisa is one of the most underrated female vocalist, her voice is not just good, it is not something that can be called \"talent\" or something that could be obtained through hard training, but she has feel in it, she can express emotions, and her calm voice in several songs such as Deadlight, Dead World Assembly or The Death of Hours is just stunning but frightening at the same time, giving you the exact feelings you should expect from a Draconian album.\n\nInstrumentally speaking, this album is the same like the other ones with minor changes. One change is that in this album you can barely hear the keyboard's sound, which on the first two albums was much more dominant but with Turning Season Within, it slowly started to go in the background. Draconian was never a band that would venture in complicated and unconventional musical structures. Stylistically speaking, their music is not complex at all and this is maybe what it is good about them, they manage to make a good product from simplicity, avoiding complex fields. What matters for this band is not song complexity and complicated stuff, but atmosphere and feelings, they just want to deliver to the listener what they expect to hear from a Draconian album, nothing more, nothing less.\n\nI feel that Anders is also getting old, his voice seems a little bit out of shape in this album and his growls have much lower intensity considering that in Turning Season Within, his voice was very aggressive. I might be mistaken, it might be that he reduced his voice intensity so that he could make more space for Lisa's performance. Though I find it better since in duet's there is much more harmony.\n\nOne thing that I also love about this band is the use of poetry in their music. Songs such as The Death of Hours also include a small fragment from Lawrence Hope and Dead World Assembly contains another small fragment from one of William Black's poems. The theme of these two poems, fit the image of the band and also the theme of this album.\n\nI remember some lyrics from a Draconian song, I think it was the remastered version of The Gothic Embrace saying something \"An ocean of tears I see\", this is what can describe A Rose For the Apocalypse. A very mournful album, a much more sorrowful one with much more feeling in it and much more emotional than the previous ones. This album also marked the release of Draconian's first music video for the second song of the album \"The Last Hour of Ancient Sunlight\", which is not really intended for promotion, but rather to send a message and to provide an image of the album to the listener.\n\nAn outstanding work coming from a rare, outstanding band. I really hope that we have not seen the last of Draconian's works, despite the fact that I mourn Lisa's departure from the band. I am sure that Anders and the gang will pull something up because I believe that this band has much more to offer since I don't consider their previous albums, nor this new album, a climax in their musical career. There is still room for more, and time seems to be generous as well.\n",
        "\nI happened to cross path with this band, sort of, about a few years ago. Having a little bit of edge for Gothic music, I did some research on metal bands that would fish my interest. Then I stumbled upon Draconian with the magnificent Arcane Rain Fell. Since then, they had frequented my regular playlists for God knows how many times already.\n\nWith quite a hopeful anticipation of new material post Turning Season Within, A Rose for the Apocalypse was another addition to their discography. Quite a strange cover art for Draconian I should say but after taking a seat back to contemplate, it all started to make sense. The Drowning Age came forward to present some new traits that I believed would continue to evolve on Draconian later works. Anders still managed to display similar vocal style as with previous releases. Nothing new to be expected at this point. Melody was of course their mainstay, with Lisa complementing Anders vice versa. Monologue was also present on this album with Anders performed this part as if he was about to hang himself. There were some good moments on this album. Elysian Night contained riffs that might be uncommon to Draconian yet they chose to experiment with them a little bit. The vocals especially that of Lisa were nevertheless delivered gracefully which negated their own proclivity from becoming too banal and redundant. Building up the atmosphere around 3:17 toward the song, this beautiful soundscape was then embraced by even more amazing slow moments accompanied with a monologue. At least I knew this album wouldn’t truly disappoint me in some ways and it was very rewarding at that.\n\nIn my opinion, Dead World Assembly was another good track that helped to rescue this album from drowning in the murky depths of Draconian futile attempt at creating a masterpiece. Although the song itself would be interspersed with minimal use of keyboards, still Dead World Assembly was able to carry the whole picture effortlessly. Around 4:10 into the song, the brief rest was painted with a dark palette of tranquillity prior to be crushed by Anders’ vocals, drums and guitars. Just when I thought that would be the end of what made this album a worthwhile listening experience, A Phantom Dissonance greeted me with awesome acoustic passage and the ever-charming voice of Lisa. Somehow, I was quite annoyed in miniscule quantity when Anders joined in to perform his role. Ironically, the prospect of him being absent from this track might as well leave a hollow impression altogether so I would like to call this as a love – hate relationship between their vocals. While the name itself echoed unperceived dissonance, there was none that could be tracked on this song. The solace was quickly reconciled as The Quiet Storm came into being. Doom and gloom, the song’s attack was quite insignificant but its longing ambiance was something that one should not overlook.\n\nThis might be the weakest point in Draconian career. Although I tried as much to give it ample amount of appreciation, it still couldn’t match the greatness that we’ve had familiarise ourselves with. Lucky enough, the great moments on this album had somehow got me hooked to listen to it again and again. I approached this album with healthy amount of gratuitous fondness and attempted to keep my minds open all the time. They offered nothing new to a greater extent but still A Rose for the Apocalypse was somewhere between the good, the bad and the ugly. Anybody would want to give this album a warm welcome and considerable toleration for something that proved to be nothing new in contemporary watered down metal scene.\n",
        "\nA Rose for the Apocalypse is Draconian’s fifth studio album. Like Turning Season Within, the new album experienced a great studio production. All instruments can be clearly understood and the voices fit the overall sound. \n\nThe lyrics fit the theme of apocalypse as expected. But no one can say that the lyrics just like the music don’t sound like the old down-looking Draconian style. However the album cover is something not expected I would dare to say. \n\nThe album opens with The Drowning Age. Starting with an almost horror movie-like ambiance, the drums kick in accompanied by Anders Jacobsson bestial growls. It’s the most energetic thing I’ve ever heard from them. There’s (obviously!) a monologue, just like the others Anders has accustomed us with and then Lisa’s vocals melodically softs the sound. And once more the riffs return with “Let's bring our gods to the gallows / A new light will shine on us all“.\n\nThen it’s time for The Last Hour of Ancient Sunlight, track chosen to have a video clip, the very own single from A Rose for the Apocalypse. Here we can hear a mix of Turning Season Within style with the old ways of the previous albums. Overall it combines the drums and guitars style from the last album with the strings we’ve heard in Where Lovers Mourn. In spite of that, the riffs from End of the Rope as the singing of Lisa also make a few years back us travel back to Arcane Rain fell, but the piano on this track is something totally new for them. \n\nOne of the best tracks is without doubt Elysian Night, where it’s possible to hear a well-structured drum and bass line lead by a synergy of growls/guitars or clean vocals with echo-like effects. Anders growls are the best growls in doom/death metal ever in my humble opinion, and as always, they’re good in the entire album with no big difference from track to track. Au contraire, the best production of Lisa’s voice is in The Quiet Storm, multiple layers of vocals merging quietly with acoustic guitars. Also the best drum part of the entire album can be heard in this track. \n\nDeadlight may have a simple rhythmic line but the way it is adorned with guitar feedbacks just like the low bass notes and acoustic guitars, plus the intro and outro, gives it a second layer with more or less complexity.\nThe heaviest riffs can be heard in The Death of Hours just as the best leading guitars. In A Phantom Dissonance there are also pretty hard riffs, but there are the sweetest vocals performed by Lisa too. However the most beautiful song is Dead World Assembly, flanking the kindest voice with acoustic guitars or violins to enraged growls. \n\nClosing the album there is Wall of Sighs. At the end of this journey through the apocalypse it contributes with a blazing strings/guitars climax for more than a whole minute.\n\nAlthough being a good album with a very good production behind it (and this is no surprise), basically A Rose for the Apocalypse goes through the new musical direction Draconian began when they stepped out of their previous path. However it doesn’t add anything significant to their journey, perhaps just allow them to construct a small bridge from the old and the new.\n",
        "\nIt's worth prefacing this review by saying that following up a release as great at \"Arcane Rain Fell\" is no easy task. And they certainly did not manage to do it, at least in my opinion. While TSW is not bad, the direction of it does worry me a little bit as a long time Draconian fan. While previous releases fit pretty neatly into the category of \"Gothic Melo-doom\" this record fits more neatly into the category of... \"Melogoth\" (yes I'm tossing genre labels together, wanna fight about it?)\n\nI mean, it's certainly catchy. There is pretty much no denying that. But it lacks the really doomy and chunky vibe that was present in much of their previous releases. This is exponentially more 'pretty-sounding' than anything they have done so far. It also simply does not have the replay-ability that Arcane Rain or even Where Lover Mourn did. You can listen to the entire CD once, get the basic idea of what's going on, and not really feel compelled to go back and listen to it again. I would say I got bored of this CD after probably a month and have not really listened to it much since despite the fact that I still regularly listen to older releases. Where TSW succeeds in how pretty it sounds, it fails pretty strongly in implementing a haunting, chilling, or overall foreboding and dark musical experience. Often times I would liken it to teenagers hanging out in a graveyard writing the kind of poetry you'd expect to find teenagers hanging out in a graveyard writing. \n\nGet this record if: You are fairly new to metal and want something that is accessible. This is definitely the easiest of their releases to enjoy if you are not particularly well-rounded in the realm of doom but still want something depressive that is easy to catch onto.\n\nDo not get this record if: You like actual doom. Simply put, this is not going to do it. If you are new to Draconian I would strongly recommend Arcane Rain Fell or Where Lovers Mourn first. They are very enjoyable releases and worth giving a listen if you like hauntingly beautiful and melodic doom style metal.\n\nAlso consider getting: To explain the title to this review, Johan Ericson (Draconian guitarist) has a side project called \"Doom:vs\" and he also made a release in 2008 named \"Dead Words Speak\"... if you are looking for a true churning, powerful, and moving Doom experience that is the CD you should be going after. No elements of gothic, just mid-paced funeral style doom metal. I don't want to turn this into a review for that but I would recommend checking it out of TSW is too tame for you.\n",
        "\nIt is hard, at least for me, to find a genuinely good Goth/Doom album, since many bands in this particular subgenre seem satisfied in ripping off \"The Peaceville Three\" forever (and not doing a very good job at it, I might add). However, bands like early Theatre of Tragedy were able to go beyond the original sound set by these pioneers and release great gems before falling into oblivion (read: worthless techno, in ToT's case).\n\nLet us acknowledge this isn't a particularly easy subgenre to write good music on, since it has a tendency of becoming stale quite fast, so it requires a healthy dose of talent and songwriting skill to create such long and dragging songs in a way that they come off exciting and moody instead of boring. Draconian is a band that undoubtedly has such skills.\n\nI don't know if this is a concept album, but each song in here seems to tell a story in its own particular haunting way, and the lyrics are exactly one of the elements that can be compared to early ToT, though I consider them slightly more compelling here.\n\nProduction is pretty good, with the rhythm guitars packing a powerful crunch and the leads possessing a smooth, fluidic presence (and tone) that goes pretty well with the gorgeous melodies played. Keyboards are frequently used, yet never sound overbearing and you’ll notice how greatly the atmosphere is enhanced by their presence, especially when piano parts are used, like in ‘Heaven laid in Tears’ and a great solo near the end of ‘Death, Come near Me’, where it blends seamlessly into the beautiful vocal melodies, ending the album in a way that can only be described as masterful.\n\nDrums and bass are nothing special, unfortunately, but they don’t fail. Sometimes we get a nice dose of double bass here and there, but that’s all.\n\nAs one can expect from this genre, the vocals are relatively diverse. We have a talented female singer whose voice tends to sound like an angel’s, and we have the male, growling singer. Nothing new, but I can say both are very good. Sometimes the male singer goes into a well done black metal rasp and some spoken dialogue, which I usually dislike since it sounds like he is unable to carry a normal, sung melody and instead resorts to talking when feeling tired of grunting. It’s distracting, but not bad per se (especially here).\n\nThis is one of those albums you’d better listen to at evening while watching the rain or something like it. If you don’t feel like dozing off on Filosofem, that is. Absolutely essential and entrancing Goth/Doom album.\n\nHighlights: All songs.\n",
        "\nGranted, once you’ve reached the top of the mountain, there’s little option left apart from going down again. Bands which managed to constantly stay at said top could probably be counted on a single hand. Therion might come to mind, but it’s a case I’m so biased about I wouldn’t dare developing, apart from the fact dealing with Draconian Therion isn’t the most unexpected name, if only for the ties both bands have shared with the occultists of Dragon Rouge. That’s not the point. The point being, after the doom masterpiece of Arcane Rain Fell, Draconian returned to a somehow softer, more gothicized sound. So far, not surprising, as Draconian’s always been a bit more of a gothic than a doom band, as shown by its earlier works.\n\nBut, taking Turning Season Within as a melodic/gothic doom album, the comparison with the act’s debut, the gorgeous Where Lovers Mourn, becomes unfortunately mandatory. Just in case you hadn’t understood, there’s even an explicit reference by the band itself, in the second track When I Wake: So break this seal where the quiet remains / Where lovers mourn, broken and torn. Alas, the comparison is all but advantageous for Draconian’s third full-length. While on the debut almost every song was remarkable, with a behemoth like The Cry of Silence walking alongside the upbeat Silent Winter, with the acoustic curio of Akherousia or the unforgettable Amaranth which could almost receive the catchy tag, here by contrast everything sounds formulaic, predictable, mechanical. Soft parts alternate with heavy parts, female vocals with growls in a pretty standard way – a way many bands which are NOT Draconian are perfectly familiar with. Like a good dog repeating its tricks, Draconian plays its mix of gothic and doom metal in total security – the recipe has long been mastered, there’s no faux pas to be feared. Oh, at least they don’t abuse of keyboards, poor consolation. Come, there’s sugar for you, dog.\n\nOf course it may be objected Arcane Rain Fell was, in some respects, mechanical, and even repetitive – probably more repetitive than this one. But the mood was here, this irrepressible melancholy of the graveyard poets, thanks to those immortal doom leitmotivs, and the almost total absence of Lisa Johansson’s voice which made her few apparitions even more precious. Now with less emphasis put on doom riffing, with every track exhibiting the same slow mid-tempo, with Johansson again sharing approximately equal vocal duties with Anders Jacobsson the mood has necessarily become lighter, less oppressive, even if the production doesn’t particularly differ. The melancholy remains, but on a friendlier side. \n\nActually, the flaws become all the more obvious given the guys included ONE song suggesting what this album could have been had they, let’s put it crudely, felt a bit more involved into it. Earthbound. Though the opening of this track doesn’t fundamentally differ from the others and doesn’t seem to go against the established formula, there’s already hints that at one moment or another something has to happen – the guitars might sound slightly more menacing, the sound might be slightly heavier – it’s merely subjective. When, after a disquieting quiet part, suddenly at 3:05 the storm breaks in. Now you’ve got it, that’s DOOM – one of those occurrences where anyone not writing the word all in caps is displaying a total lack of both taste and comprehension, y’know – just to remind you, finally, it’s Draconian playing, the band which recorded The Cry of Silence, Death Come Near Me or She Dies. And soon, topping this crushing, hopeless, slow as death progression, Lisa Johansson’s ethereal voice, more fragile as ever:\n\nSo frail the veil of life – so beautiful the face of death\nSuddenly reveries bloom into night's heavy drenching...\n\nAs the title of hallucinating fairy should remain the sole property of the one and only Sona Kozakova (if you don’t know Sona Kozakova there’s some documentation for you at http://www.metal-archives.com/band.php?id=4203), maybe dying angel on acid could work as an accurate description weren’t it equally senseless, but there would be little point remaining fully sensible dealing with an album which lyrical content is hinting to drugs in so many places. Besides, it’s amazing how much Johansson’s voice seems to transcend itself when backed by really heavy music. Sadly, it just seems the band itself still hasn’t understood it.\n\nDevoting so many words to a single track could seem futile, all the more the other ones are far from bad. When I Wake or The Failure Epiphany for instance, taken separately, can compete with most melodic/gothic doom out there, however on the album as a whole they don’t particularly shine – while Earthbound, with its unique middle part, does. And that’s what can be rightfully expected from a band from the standing of Draconian; releasing not only good tracks, but tracks with stunning individualities, tracks that shouldn’t have to be studied for more than twenty listens to reveal their full potential. Turning Season Within is just Draconian’s weakest full-length to date and, what’s perhaps more worrying, lets an unpleasant taste of laziness. Let’s hope it’s nothing more than an impression.\n\nHighlights: Earthbound, The Failure Epiphany\n",
        "\nThis band has gained some popularity in the doom scene, and not really undeserved. \"Arcane Rain Fell\" was good and I was hoping for them to continue down that path. Like most other newer bands populating the genre they draw their influences from My Dying Bride, Katatonia, Anathema and Paradise Lost.\n\nDraconian's problem on the last album was definitely centered around one thing; Not enough guitars. Many of the songs were almost entirely flat in terms of guitars. It's hard to exactly describe it.. there simply wasn't enough going on. Just a melody here and there. This is however corrected here as there generally is more rhythm guitar work and drive going on.\n\nUnfortunately the band has gained a problem they didn't have on the last disc.\nAfter enjoying some solid doom metal for about a minute of \"Seasons Apart\" the song pulls to a stop for a piano break. What seemed very promising is more or less shattered by the female vocals, which are quite annoying. I know it's the same vocalist but the quality has dropped shockingly. \n\nInstead of the often comfortable range presented on the last disc the pitch seems constantly forced. The chorus part at 3:05 is the grand example. It sounds grating and emotionless, I don't know what's happened. The goth level has also been upped, with more and more romantic and theatric themes making its way into the sound. Really reminds more of Within Temptation more than the last Draconian album. That's an influence I don't like to visit.\n\nGenerally this problem re-occurs. Many of the song have strong, Katatonia-like guitar parts and growls that really catch my interest. Then comes the female vocal break again and kills it for me. It just doesn't get there. \"Bloodflower\", \"When I Wake\", \"Seasons Apart\", \"The Empty Stare\". All great songs musically, and the growl smokes. Then comes this nasal, high vocal approach that just flat out kills them.\n\nThe general improvent of all the other aspects in their soundscape is what seals how frustrating \"Turning Season Within\" is. Production absolutely smokes, the band is getting heavier instrumentally, the growler keeps delivering. I really hope they can keep going down this path musically. Please just correct the female vocals for the next release and tune down the goth influences. There's potential for something much better.\n",
        "\n“That which we are, we are…\nMade weak by time and fate, but strong in will\nto strive, to seek, to find, and not to yield.”\n\nSo spoke Lord Tennyson and so Draconian saw fit to remind us in the booklet to The Burning Halo. So what are Draconian? Draconian cites the reason for this release as a way to show the evolution of the sound, where it is now, and where it is going. The Burning Halo contains three new tracks, three re-mastered ones, and two covers revealing the early influences of the band. The old tracks are a nice look back to those familiar with the band’s early sound. More than that, with the advent of Turning Season Within, the new songs offer a glimpse into where the members would take the sound next.\n\nThe opener, ‘She Dies,’ is the perfect blend of all the elements of the Draconian sound. Gothic style keyboards that make you want to stroll through open graves, guitars and drums droning on in an eerie mix of doom, and vocal performances that remind us why Lisa and Anders are the ones purring and belching out lyrics respectively. The core melody of the song is repetitive but mercilessly captivating. I can’t think of any other song that makes me smile about loss and wanting to die. The other two new tracks return to more of a darker death/doom sound reminiscent of Arcane Rain Fell with the keyboards patching up the weak spots. One might notice Lisa making more of a pronounced appearance on all three as well as more instances of harmonizing with Anders. Indeed, this would also be the case on Turning Season Within. In short, these new songs are Draconian at their best.\n\nAfter feeling perfectly comfortable in the misery crafted for you, some blasts from the past explode into life to knock you from your reverie. These old tracks reveal much of what has changed even after being rerecorded – namely what happens when keyboards and attempts to create emotional melodies drown a song. ‘Serenade of Sorrow’ is reminiscent of faster paced songs from Where Lovers Mourn and again strangely prophetic of the more gothic focus to grace Turning Season Within. Both ‘The Mornigstar’ and ‘The Gothic Embrace’ carry some unfortunately silly synth segments which are almost redeemed by excellent re-mastered guitar work and typically excellent performances from Lisa and Anders. Nonetheless, all the things that make a Draconian song great are there. Rerecording them helps strengthen the full length release disguise.\n\nThe two covers of Ekseption and Pentagram respectively diverge greatly from the overall tone of the album but offer insight into Draconian’s very early influences. After listening to the Ekseption cover, it’s now painfully clear where Draconian found inspiration for some of the cringe inducing symphonic moments of their earlier more awkward efforts.\n\nThe Burning Halo presents Draconian as they are. Unlike the Tennyson quote, nothing here has been made weak by time. Draconian remain as strong as ever as evidence by the new songs, and the older tracks presented here represent some of the best of their older material even if it is overbearing at times. This release is good for new fans interested in learning a little about the stylistic history of the band.\n",
        "\nDraconian’s sophomore effort was good but flawed. This album is a step up and away from their last effort shedding the bulk of the Gothic in their Goth/Doom tag and moving towards a more straight forward Doomdeath approach. The band also lost much of the 'Black Metal' riffage that they had been utilizing as well.\n\nThis is arguably the bands Doomiest effort to date and in saying that one of their best albums. There are some major flaws in this album however with the first and most flagrant being that this is almost a 100% rip off of Mourning Beloveth's sound entirely. Most of the guitar riffs are borrowed from the Irish Doomsters. This wouldn't be a problem if they had made it their own, but alas, they didn't. \n\nThe production is better than the bands first release. The guitars are monstrous, heavy and depressing. There are long dirges with melodic and sorrow filled leads weaving their way in and out of the various passages. The guitars are also heavier on this than on the last album.\n\nThe bass follows the guitars but this works for the sound the band is working with. The drums are pretty good but not as creative as on later releases. The keyboards are one of the saving graces as they fill in the cracks.\n\nThe vocals are, as usual, outstanding. Both male and female vocalists showing why they are the ones holding microphones. The lyrics are in the same vein as the previous release but perhaps better/deeper.\n\nOver all, this is a pretty good album, it does tend to drag in places (especially the spoken word track) and the lack of originality is apparent. Draconian has a problem with releasing even numbered albums as so far the odd numbers are much better and original. Still, for its short comings you could do much worse.\n",
        "\nDraconian is a curious entity in that they seemingly came from out of no where into the spot light after a few rather high quality releases. Lisa Johnson is by far a stand out singer and certainly one of the best female vocalists in the Metal field today.\n\nThe production is good enough for the songs within. The guitars have a very Black Metal feel to them opting for more opened chorded/single noted passages then the crunch the band would later use. They are a surprisingly epic yet incredibly melancholic. There are no solos but the leads are solid and misery filled. They only accentuate the sorrow in the lyrics.\n\nThe bass more or less follows the guitars and drums but it does sound good all the same. The drums are more or less standard Goth/Doom patterns, but they do work well with the material. The keyboards add to the vibrant atmosphere and help with the backbone of the guitar dirges. The lyrics are more typical for the style, about love and loss with a poem thrown in for good measure.\n\nThe vocals from both singers are brilliant. The male vocals go from spoken word to more mid-ranged Blackish howls to more guttural Death Metal growls. The female vocals are vibrant and sharp. They add a more drastic yet tasteful contrast to what has become one of the more played out trademarks in underground Metal. \n\nOverall the only complaints about this album are that after the halfway mark some of the songs start to blend together. That and that Lisa isn’t featured more prominently. Aside from these, this is a very good debut album from an up and coming Goth/Doom Metal band. Highly recommended.\n",
        "\n”Beauty and the beast” metal started about 13-15 years ago with bands like The Gathering and Theatre of Tragedy. And it is the first and the only female-fronted metal genre. Sadly, lots of people misunderstand this idea. I mean that today people think that if there is a girl on vocals, so it’s gothic metal. Being a fan of the genre, I am always looking for new bands. I am always happy to see that group X has a woman fronting it, and they sing gothic metal. So, what does further searching give? Google gives a picture of five glamorous people, especially the female vocalist, last.fm gives necr0satanic kvlt evanescence ”gothic metal”.\n\nFrom all this, Draconian stands like a pylone in this musical genre, true ”beauty and the beast” metal. A band that represents gothic/doom/death and Sweden at their best.\n\nThis album and Arcane Rain Fell are more death/doom, the last two being more gothic/doom.\n\nWhere Lovers Mourn starts with what I think to be one of Draconian’s best songs: The Cry of Silence. Vocalist Anders Jacobsson stated in an interview that he has written it in a day when he tried to commit suicide. And one can feel the emotional intensity of it. Slow, then fast, then slow again, then the fast final part and it ends with a calm piano play. Poetically, I suppose that it is the soul of the song’s inner man who battles in agony and solitude, and finally finds redemption in death.\n\nSilent Winter is a mid-paced gothic/doom piece with nice music and lyrics. A Slumber Did My Spirit Seal or, if to be more precise, the lyrics or, if to be more precise one more time:), the fact that they belond to William Wordsworth, gives a hint to one of the influences of Jacobsson, the band’s lyricist: English Romanticism of the XVIII-XIX century. \n\nThe Solitude is another of Draconian’s best. Starting with a cello, it is a slow 8 minute journey through a lonely path of existence. The sadness of the lyrics simply kills. ”I slowly bow my frozen features, in grief, in sadness and in woe…in grief, in sadness and in woe…” Wow…\n\nReverio Ad Secessum is another example of amazing death/doom. Also, it is the only song of the album which seems to have a fine thread of optimism and happiness in it.:) As for The Amaranth, the next song, it is a fine example of beautiful songwriting by someone who has read a lot of books in his life and has a reach vocabulary. \n\nThe only acoustic piece of Draconian’s creation is the seventh track of the album – Akherousia. The title reminds me something in the vein of Blashyrkh – an imaginary utopia where the song’s inner self finds happiness, very far away from this earth. \n\nThe last track is It Grieves My Heart, which has a strong antichristian message, a topic which is explored more on Arcane Rain Fell and The Burning Halo.\n\nOverall, it is an extraordinary debut. The music is simple, but it’s the atmosphere that matters, and for that the guys get an A+. \n\nMost metal listeners will appreciate the album’s musical harmony and lyrical beauty. As for the ones for whom doom is for their soul as rain on a flower dying in heavy drought, this album is definitely for you. Believe me, because I am one of you.\n\nThe only reason why Where Lovers Mourn doesn’t get 100% is that it is not the best Draconian album, imho. Arcane Rain Fell is.\n",
        "\nDraconian as a band have been somewhat inconsistent in their music, although I would certainly say all of their albums are excellent. The problem always was that certain sections within song have often been turgid; they feel directionless but are often followed by a section of true brilliance. These sections for me always made it worth listening through the uninspired chugging parts. All their albums have a certain appeal about them and something I cannot quite place makes them special. \n\nTurning Seasons Within is certainly their best album to date, everything about the album seems to work, the growl sections are not overly long and strained in a Trail of Tears manner, but at the same time the female vocals are not overly used a la Sirenia. They seem to have struck a decent balance. \n\nThe rhythm guitar and bass sound has alot of depth and as a result the songs feel epic without making the mistake of trying to fuse Hans Zimmer with Gothic Metal which some bands seem to think is the only way, after all there are many other ways to achieve vast sounding music. The drumming on the album is more interesting, as the drummer has really been given room for innovation with this release, which is a pleasant change from their previous releases where the drumming felt slightly mechanical at times. The lead guitar sound although distorted is pure and is high in the mix, So it cuts across the wall of sound to great effect, the end of \"when I wake\" is a good example of this.\n\nIt would be very easy to say this album is generic gothic/doom metal done well, However I would disagree, the overall feel of this album is generally different. For example most Gothic or Doom metal creates contrast between atonality and tonality, however the atonality feels like it’s discordant for dischordants’ sake. This album feels like the atonality has a purpose, the tritone is used to great effect being included in less obvious places to create tension, the female vocals aren't just used in the lighter textures as is the convention, but the heavier sections as well. There are other examples as well but this certainly isn't meant to be a music theory article so I will leave it at that. \n\nThe lyrics as always are full of sorrow and despair as is to be expected, but they do feel more articulately and thoughtfully written than others of their genre, this for me was definitely a highlight of this album.\n\nThis album is an example of what the gothic/doom genre can be, but Draconian also make the style their own. It has all the crunching guitar sounds, growls, soaring female vocals and (at the risk of sounding like a pretentious black metal reviewer) atmosphere that you would come to expect but with their own spin on it. Turning Seasons Within is definitely one of the albums of the year so far.\n",
        "\nThis album should have been as amazing as the last their last album. This album could have been as amazing as the last as their last album. Sadly, this is not the case however; because just like 'Arcane Rain Fell', this album (while good) borrows heavily from its contemporaries (specifically Mourning Beloveth). \n\nThe production is good and the music is alright but like the prior review states, this album is a Gothic affair. There is only one \"true\" Doom track on this recording, the rest is more or less watered down Gothic Metal. \n\nThe guitars are very melodic and tight over all, but they don't sustain or drag like they have in the past. The atmosphere isn't there, even with the keyboards (which sound pretty good for all intents and purposes). The bass and the drums don't do much to add or detract from this. This album is just too fast for its own good (relatively speaking of course).\n\nThe vocals from both singers are outstanding. Lisa has got to be one of the top three female Metal vocalists of all time; her range, prowess and conviction are very convincing. Anders has one of the more intense grim voices in Metal as well, with excellent mids and highs and intense lows. Lisa is also more prevalent on this recording.\n\nAs stated above this album borrows from its contemporaries, for example the song 'Earthbound' sounds like a more interesting (and Gothic) version of something Swallow the Sun would've done; while the track 'The Failure Epiphany' (featuring some spoken words from Novembers Doom vocalist Paul Kuhr) sounds like it could have been from ND's 'The Pale Haunt Departure' only more melodic. The song 'Morphine Cloud' sounds like a song that My Dying Bride would have written on 'Turn Loose the Swans' only more melodic. \n\nOver all, this is a good recording, but it’s not what you've come to expect from Draconian. Hopefully their next album will sound more Doom and less like a Gothic Swallow the Sun rip off.\n",
        "\nAfter the debut Where Lovers Mourn and the masterpiece Arcane Rain Fell, I was beginning to view Draconian as a source of stylistic stability. With each release I expected, and received, a somber blend of gothic, doom, and even neoclassical elements I had come to love. The advent of Turning Season Within has brought a slight deviation to the norm by focusing more on the gothic aspect of the Draconian formula. The end result is faster paced, more melodious, and a bit less atmospheric.\n\nWhile a few things have changed, much remains the same. Draconian continues to create a dark soundscape. Growling male vocals still contrast sweet, ephemeral female tones. Lisa’s vocals are utilized more on this album than any other previous release. Guitars, once languished with notes seemingly stretching into eternity, are a bit more up tempo with sparse solos and more instances of harmonizing. Lyrically, the songs deal with various aspects of love or stages of romance. Some even include supernatural touches. Though there exists a marked shift from languid, droning compositions, the hopelessly remorseful atmosphere remains. It is simply created in a new way musically.\n\nFor Turning Season Within, Draconian adapted lyrics from the poetry of Therés Björk. Mina Eltaieb also provided the chorus for the track “Empty Stare.” Both the poetry of Therés and the lyrics of Mina fit the album like a glove. Anders’ lyrics for the album consist of endless remorse, despair, and concessions to death and misery. His adaptations of Therés’ poetry contribute to this effect well. Portions adapted from Therés appear to reflect on the overall message of each song, while Anders’ lyrics fill in the details, making the broader scope of the adapted poetry all the more meaningful with the conclusion of each song.\n\nWith all these aspects done well, Turning Season Within somehow seems incomplete. So used to agonizingly slow compositions, it’s almost as though Draconian had a hard time fitting their powerfully sad songs and lyrics into the faster tempo they’ve decided to work with. A couple songs sound as though they end mid note, as if they band couldn’t or didn’t want to think of a way to tie them off. I was left with the feeling that the album was an awkward transition away from the more pronounced doom metal elements into this dark, yet faster style. I suppose this is the cost of experimenting with a tried and true style. While done well, it’s still something new, and perhaps Draconian didn’t feel as confident working with it.\n\nEither way, Turning Season Within continues the gloomy story of Draconian with a slight twist. The packaging may be a little different, but the same Draconian is there beneath it all. In a way, it’s refreshing to see Draconian can deviate from their doom metal roots and still manage to produce a terribly depressing album. Turning Season Within is a must have for any Draconian fan, old and new.\n",
        "\nSo here we have it, the latest offering by Draconian, \"Turning Seasons Within\". Anyone who read my review of their masterpiece \"Arcane Rain Fell\" knows that I have a very high opinion of these guys, and I still do. \"Arcane Rain Fell\" is a milestone in the now crowded doom/death scene. So, how exactly do you go about following up on a masterpiece. Well, in this case Draconian did not do that. However, I believe it was a smart move on their part. Draconian have taken eight songs and dialed down on the doom knob just a bit. Instead of making \"Arcane Rain Fell Part II\" by making more crushing, more doomy, and even slower songs, they have actually created a very worthwhile gothic/death metal album. After the Thanksgiving feast that was \"Arcane Rain Fell\", \"Turning Seasons Within\" is like the pumpkin pie afterwards, with extra \"death whip cream\" mind you. \n\nSo what's there to say about this album musically? Well in all honesty, not much. If you've heard Draconian, or just about any other depressive death metal band, then you pretty much know what to expect from this. This is not a criticism however, this a damn fine album. As said every song is mid-paced, the instruments do what they've always done and that is create a dark and oppressive atmosphere, and the tortured vocal delivery only adds to this. Surprisingly, as average as this may sound, it works. It's just good, there's really no other way to describe it. However, there are a few key moments on this album that make it worth the purchase. Lisa Johansson's voice is one of them. She actually begins this album, and is used far more than she was on the previous entry and I would almost go as far as to say that she is the star of this album. There are moments of absolute ethereal, where her voice and the instruments are in pure harmony together, the results are no less than mood changing. The mains verses of \"Seasons Apart\", \"Earthbound\", and \"Not Breathing\", are actually some of the most impressive and depressive material Draconian have ever turned out.\n\nOne of the reasons Lisa is probably utilized more is because this a concept album about the failures of love and the happenings in between. So, I'm thinking that Draconian thought by using Lisa more, they gain a woman's perspective, as well as a mans, making it a more human album by all accounts. Speaking of the man's perspective, Anders Jacobsson's vocal delivery is as passionate as ever, and in lots of cases, more ferocious as well. He screams fit the content of the lyrics very well, because believe me if you were singing about what these guys were singing about, you would scream it too. As far as the lyrics themselves go, they are very well written, however there is a huge downside to this. Draconian have almost always borrowed passages from various well known poets to use in their own songs, such as John Milton in \"Arcane Rain Fell\". This time they took some passages from a poet named Theres Bjork, and the results at times are no less than eye rolling. \"Would you help me slit my wrists? See me cry, watch me...die!\". Wow. I'm all for romantic tragedies, but do you think we can be a little less blunt here? It seems as though Draconian found the best Myspace poet and just had Paul Kuhr of Novembers Doom speak them mid-song. Many of these passages are terrible because Anders' lyrics are more metaphorical, and these all out \"woe is me\" lines just really do not fit in the songs. They do not appear often and really don't hinder the songs much, however they are the least desirable trait of this album. \n\nAs said the instruments on this album are well done, as always. Draconian seem to be no longer content with the doom side of doom metal, and have written some passages that you can actually tap your foot to. Hell, there's even a solo here and there and they didn't stick out negatively at all. Every note just seems to fit the mood of the song very well, and as usual no instrument goes out of bounds in an attempt to give the song \"more life\", solos or not. The keys play a bigger role this time around, however they are kept in the background to ensure that they don't dominate the song. Trust me kids, this isn't Dimmu Borgir, Draconian are professionals and my hat is off to them for creating such well balanced music, while still retaining that gloomy atmosphere. \n\nThis album probably wasn't what any Draconian fan was expecting, and I think that is a good thing. While the change is slight, it's great to see that they have more tricks up their sleeves than just making incredibly slow, misery laden songs. They are also capable of making mid-paced, sometimes fast misery laden songs. This is not a masterpiece by any means, but it's still noteworthy in Draconian's small discography, and there are some genuinely beautiful moments held within it. I'd recommend it to any Draconian fan or to those who can't get enough of the earliest doom/death albums. It's a fine addition to any collection, even if it isn't a very adventurous one.\n",
        "\nAnd so it was that a rain fell from the sky, in a grey, wooded area. The mammals that usually stirred within the lush, green woods were not to be seen on this day. Deeper in the woods still, where trees block out any measure of sun and all but a few rain drops, sit six entities, all of whom come together to form a single being; Draconian. This being, a child of great bands such as Paradise Lost, My Dying Bride, and Anathema. These bands being gods of their genre, have had many children, and have opened the way for sombre musicians all over the world. Yet these gods are tired, with bloodshot eyes and grey hair, many of them have changed their sound in order to adapt with the times, or are caught up in the tempest of natural musical evolution. Enter Draconian, the forgotten peasant son, who has heard the calling and is ready to take the ebon throne for his own. The path is long, depressing, and at times exhausting, yet with his weapon \"Arcane Rain Fell\", I believe he has succeeded. \n\nDraconian, a doom/death metal band from Sweden, have taken the long tired subject of sorrow, and have breathed new life into it. I consider myself to be somewhat of a connoisseur of the doom/goth/death hybrid of metal, and it's no secret that many believe My Dying Bride's opus \"Turn Loose the Swans\" to be the breadwinner of the genre. It's an intense album for sure, but in a move of unprecedented blasphemy Draconian have taken, with trembling hands, the thorny doom crown. \"Arcane Rain Fell\" is the best doom/death metal out their today. Why? Because it does exactly what the genre says, it dooms you. It will make you see the pettiness of existence, the futility of hope, and the darkness that awaits near the frayed strings of death. Granted, many albums do this, but \"Arcane Rain Fell\" is so grand and authentic, that it makes child killers cry. \n\nIt's probably appropriate that this album begins with the sound of rain fall leading into \"A Scenery of Loss\". This song shows off one of the main features of the album, spoken word passages. These passages take more than just a few cues from John Milton's \"Paradise Lost\", and really fit in with the overall concept of the album, the fall of Lucifer. The strings on this album literally weep through your speakers, with only the deep voice of Anders Jacobsson to interrupt, and actually enhance, the mood. His is a raw, deep growl that is trademark within the doom/death genre, but his intensity at times is remarkable. His voice literally cuts through the air on \"The Apostasy Canticle\" as he spits out line after line of frustration and blasphemy.Yet his is not the only voice on the album. Lisa Johansson, Draconian's female backing and fairer half, almost makes the album on may occasions. Surprisingly she is utilized few times, and those few times are at the most crucial and effective moments. This is not Lacuna Coil ladies and gents, her voice is no gimmick. The ethereal feeling surrounding \"Heaven Laid in Tears\" is unmatchable thanks to her, and her dramatic entrance in the aforementioned \"A Scenery of Loss\" is shockingly effective. So here we have the voices in \"Arcane Rain Fell\". A tortured poet, a sorrowful maid, and an omnipresent narrator. Oh but that isn't all the album has to offer. Not by a long shot. \n\nThe instruments on display here are used so effectively that it's almost ridiculous. And really, the ridiculous part is that they are so simple. Every instrument does exactly what it has to do, they're underachievers. The melodies are (of course) drenched in misery, as seen in \"Daylight Misery\" and \"The Apostasy Canticle\". There are no out of place solos (there are no solos actually) and neither guitar ever steps out of line for the sake of flashiness. What's there to say about the bass, really? It's the thunder in the background, the foundation upon which this burning palace lays. Like any good bass should be, it is audible, yet kept in the back. The drums, like the guitars, are simple. They are a faint heart beat in this dying body, and never speed up or slow down to accommodate the atmosphere. They stay exactly where they should, along with the keys. Really, whats doom metal without keys? Some would argue not doom metal at all, however the keys do not make the songs here, they merely enhance them, being the sad sounding instrument it can be. Sure, occasionally they take the spotlight to further drive you down into misery, but these moments do not happen often, so the keys never feel forced upon the listener. Simplicity is commonplace on this album, and it works so very nicely. Why use a rocket launcher to assassinate a king, when a simple dagger hidden in the sleeve is an effective, and overall shieker way to get things done. \n\nOn an album like this there is no room for filler tracks, and trust me when I say there are none. Every track is a monument to misery, and yet one may be surprised to learn there are few tracks that go over the eight minute mark. The songs are not extended to make the album seem more \"doom\" oriented. On the contrary, the songs are of perfect length, and believe me most of these songs are so depressing that eight minutes may just be too much for the soul to bear. \"The Abhorrent Rays\" and \"The Everlasting Scar\" are grade A slabs of mid-paced doom that exist to lift you up, only the to bring you back down. Every song, and pretty much the whole album, ends right when it needs to. And I'll tell you right now, it ends on a high note. \"Death, Come Near Me\" has officially replaced \"The Crown of Sympathy\" as THE doom metal song in my mind. I can't even rightly describe it, it's just so tragic. However it features an incredibly charming duet with Lisa and Anders, and both vocalists are at their most desperate in this song. This is the anthem for suicide, at an excruciating fifteen minute length, no other song in the genre comes close to it's bleak outlook. \n\nAnd so there we have it. The son has defeated his fathers, and in turn, the student has become the master. Draconian have crafted the elite album in the doom/death genre. It's just crushing, there's no other word to describe it. If depression is your thing, get this album. If it isn't, you should experience it anyways. It's monumental. \n\n\"Adonai, Elohim, El-Shaddai. Thou hast become the father of lies and I serve thee henceforth...no more!\"\n",
        "\nDraconian plays interesting doom gothic metal. Those guys do not write brutal-head banging metal. This is atmospheric, epic, and heavy music. Well, songs are rather long - about 8 minutes each with tight riffing, epic keyboards, beauty (female vocals), and the beast (death metal vocals). Songs are not entirely slow, and monotone; they have nice tempo changes, always on the spot. For example, “Serenade of Sorrow” is the shorter up-tempo song with groove, and catchy keyboards. Keyboards play important role, the guitar is well written too. “The Morning Star” has some of the pure head banging riffs. Other songs have those riffs too. Sometimes the melodies repeat a bit too much, but there are enough variations to be not monotonous. Compositions mostly contain melodies with minor scales, creating dark atmosphere. There are no cheesy-happy melodies at all. However, I did not like Pentagram cover. I thought it was pointless, and did not fit the Draconian music at all. Other listeners may think otherwise… \nIn my opinion, fellow metal heads, listener has to hear album more then 3 times to feel its atmosphere. First time you may just grasp the basic ideas. Second, and third listen spin will give you better feeling of Draconian compositions. Read the lyrics too, they are pretty splendid. Excellent dark poetry! I will not quote them in my review, but please read them carefully! Listen it in the fucking darkness (at least sometimes), to feel the atmosphere.\n",
        "\nDraconian is a Doom/Gothic band out of Sweden. I really don't see much Doom influence other than the tempo, I like to call it Dark, but that is besides the point, it's just genre dropping. But Dark is such a better way to describe this work of elegant beauty. This cd is for the more \"sophisticated\" metal listener. If you're into \"KISS ASS BRUTAL METAL!\" this album is NOT for you. This album is for the metal listener who can take in atmosphere, vision, depth, and beauty that metal has to offer. Metal is so expansive, and when a group of people can incorporate such elements of metal and have music sound this expressive, sorrowful, and depressing it must be mentioned.\n\nThis is of coarse a compilation of older works, two new songs, and two covers. The album starts off much like Arcane Rainfall their second album. A very slow, depressing melody with a slight chant in the backround. Once the death style vocals hits it just gets into a state of melancholy and sorrow. Than the female vocals hit and it just feels like you have nothing left in life. Now I'm no artist, but when you can express this through sound, you have got to be on the hierarchy of artist in your respective genre. This sound is so pure, so true it can put a smile on your face through all the gloom knowing this can be expressed. Midway through the song you hear a light acoustic guitar, birds chirping, a very moving spoken passage and to the most depressing melody on the whole album. From violins, to birds chirping, this song uses a lot of instrumentation to really let you gt a sense of what Draconian wants you to feel. And they don't fail.\n\nSerenade of Sorrow is more like their first album, Where Lovers Mourn. It it more Gothic based, but still has a very doomy/dark touch to it. This song is more upbeat than other songs on the album and has the most emotional passage in the whole song, and in my opinion the entire genre. At 2:31 you feel the guitars making more pf a presence, and once the 2:54 mark hits its such a beautiful 10 seconds with the females vocals, growls, and guitars. I've never heard such mastery of being able to convey feelings through instruments used mainly today to \"Rock the fuck out.\" It's uplifting knowing that there are people out there who can compose modern day music with such a passion.\n\nThe only reason this was not scored was higher was because there are re-release tracks and a cover song that is so terrible I won't even speak of it. When Draconian does release a new album expect it to sound like a mixture of the previous two full releases. They will not dissapoint.\n",
        "\nI recall, some 3 years ago or so, a friend of mine handed me an album called \"Where Lovers Mourn\" by a then-unknown band called Draconian. He described it as \"Better than Swallow the Sun and My Dying Bride\" - and nearly instantly got my curiousity about the find. I then heard Draconian's debut album for the first time - and was astonished. Where Lovers Mourn had perfect balance between everything I ever liked about Doom metal - Clean singing carefully combined with vicious, dark growls. Long, Monotonous riffs, accompanied by serene piano melodies one second, and nearly death-metal riffs combined with vicious drumming the other, and much more. I was very happy with the new artists I've discovered, and thus - also very disappointed with their 2nd album, released back in 2005, called Arcane Rain Fell, or in short - ARF. \n\nSomething about ARF just didn't fit as well as Where Lovers Mourn did. Maybe it was the fact the band decided to take a much more gothic approach to music, and twist the balance between clean singing and growling to the clean singing's favour. ARF didn't get too many spins on my stereo, as it simply bored me. Even though the line between gothic and doom metal is thin, I am not too much of a goth-fan, as much as I like dark, moody doom metal.\n\nWith the whole ARF disappointment, I was kind of sceptic about Draconian's latest release - The Burning Halo. Unlike when ARF was released, that I stormed the closest CD-store and was one of the first to purchase the CD in my country, with The Burning Halo I have waited until recently to even acquire the CD, and I can say that was a mistake, because those four months it took me to decide to give Draconian a 2nd chance were four months I could use to listen to this masterpiece!\nThe Burning Halo is, to me, Draconian's declaration of uniqueness. This album shouts, unlike ARF, \"There's standard, old-school gothic metal, and there's us!\" . With The Burning Halo, Draconian managed to reach an even better balance between their softer and darker sides. Songs like \"The Morningstar\" best describe their Doom/death sides, while songs like \"She Dies\" show a softer side, often shown in ARF, only in the perfect dosage and timing. \nAnother nice thing about The Burning Halo is the 2 covers sealing this album, \"On Sunday They Will Kill the World\", originally by a progressive rock band called Ekseption, and \"Forever my Queen\" , of the heavy metal legend Pentagram. Draconian manage to make both songs sound, in my opinion, much better than the origin, with \"On Sunday They Will Kill the World\" becoming excellent fusion-doom metal (first song of that genre to have ever been created, I guess :), and \"Forever my Queen\" becoming some sort of odd industrial-death metal that sounds bloody great!\nDraconian prooves yet again that they're one hell of a band, and unlike in their former albums, even experiment a little with things that don't always go hand in hand with doom or gothic metal.\n\nExcellent work + excellent band = excellent album.\n",
        "\nPresenting Draconian would probably sound a tad futile, especially after they’ve released their masterpiece Arcane Rain Fell not so long ago. If during the last few years they’ve become a somewhat popular band amongst gothic/doom metal fans, let’s admit they’ve fully deserved it up to now. And if they’re currently not totally escaping the temptation of making some easy money with this little compilation, I nonetheless don’t think many of us will complain. Because The Burning Halo is, all things well considered, rather good. So first let’s see how the band itself justifies it: “The motivation for this special release is to present the Draconian sound, past and present, as a whole with a honest face”.\n\nAnd of course, it’s also a way of making another full-length release while writing only three new songs (tracks 1-3 here) – that’s why I called it a disguised EP. But after all, the three following tracks from the 1999 The Closed Eyes of Paradise demo are enjoyable as well, even if the so-called “honesty” of the band could be questioned – as the guys naturally selected the songs they must have considered as the best there. True fairness would have implied a complete re-recording of the aforementioned demo, what would have indeed enabled us to get the excellent Cauda Draconis as a supplement.\n\nTo be honest (you’ve understood by now, it’s all about honesty here...) The Closed Eyes of Paradise was far from being the best release the band ever did. It reeked far too much of fake gothicism with its useless orchestrations, clichéd melodies and mediocre female vocals (Lisa Johansson hadn’t joined the band at that time). It may have been the necessary step leading to landmarks like Where Lovers Mourn and Arcane Rain Fell, but nonetheless a forgettable step. Now, even if the three songs presented here have been entirely re-recorded by the nowadays Draconian, their inherent songwriting weaknesses are still leaking out here and there. A perfect example may be Serenade of Sorrow with its catchy but rather ridiculous orchestral leitmotiv, its iffy structural breaks or opera-type female vocals. Coming to The Morningstar, a blastbeats/keyboards part which reminds more of CoF than anything else, and in The Gothic Embrace, well, the title itself are likely to make you smile.\n\nThose tracks aren’t bad. They just show a dubious taste for keyboards and the overall grandiloquence of an immature band, that’s all. But you can’t prevent yourself from liking them, exactly like you can’t prevent yourself from loving this 5-years-old who however keeps on bothering you with his endless silly babble. No, the only questionable tracks are actually the two covers, the mindless and ridicule classical-influenced On Sunday they Will Kill the World or the even more grotesque hard-rock tune Forever my Queen.\n\nBut now let’s come back to the three opening songs and listen to the true, the doom-ish Draconian again – the one and only, right? For those familiar with Arcane Rain Fell there would be no surprise, as the material here is exactly in the same vein. What means, slow and hopeless, with a little predominance of growled vocals, even if Lisa Johansson and her eerie, flighty voice is more present than on the previous release, especially on the third track. Of course the band got rid of the orchestrations and easy tunes from their early days long ago, which have been replaced by the half-suffocating guitar leitmotivs which are now inseparable from their sound, plus the discrete atmospheric keyboard in the background. And eventually, could it be a more melancholic instrument than the grand piano when used well?\n\nAnd don’t tell me Draconian may have fallen into self-parody with the titles of the first and third tracks, and its artwork once again dealing with old, venerable cemeteries. When you listen to Draconian, you WANT cemeteries. You want songs about Love and Death. You want a Tennyson citation, ivy-crowned stone angels and graveyard poetry. And you want this opening track of pure genius, built on hardly more than three bars, a sort of Dies Irae the whole song is then revolving around. A track showing a short, explicit title acting like a condensate of the whole Draconian art, ladies and gentlemen – SHE DIES.\n\nConsidering the three new tracks undoubtedly can stand the comparison with the ones on Arcane Rain Fell, they make the listener all the more longing for the next genuine album. For the rest, The Burning Halo amounts to a very agreeable release when you except the two covers which are by far the shortest tracks anyway. Superior gothic metal does exist, good sir.\n\nHighlights: She Dies, Through Infectious Waters (A Sickness Elegy), The Dying\n",
        "\nComing to doom metal with gothic and death influences, few albums seem to have reached the same perfection as Draconian’s second effort Arcane Rain Fell, except maybe My Dying Bride’s The Dreadful Hours but it’s another story. One hour of slow, both melodic and melancholic doom metal with low growls and the occasional touch of female vocals which should convert the most reticent to the genre (at least I hope so), that’s what it’s all about. \n\nFirst let’s notice that Arcane Rain Fell is a concept album about some fallen angel, what fortunately doesn’t have too much influence on the music except for the occasional presence of the usual (and useless) narrator, which works fine when he tells one sentence or two into otherwise excellent songs, but as expected sucks when he does his own track of babbling backed by crappy sound samples and keyboards. Fortunately it happens only once, so as soon as you know you have to skip the two minutes long abortion called Expostulation you now can fully enjoy the proper music.\n\nAnd man, how great it is. This album is fully guitar-driven. No orchestrations or overwhelming keyboards – those are still present, but only to add some depth to the background. It consists in slow riffs I would rather call leitmotivs as it’s the idea: sad and beautiful melodies repeated over and over again in one song. The result is simply impressive, and the genius of the band consists in never making it a single bit monotonous, by introducing subtle variations as well as occasional piano chords which add to the overall melancholic feeling. And, of course, there are the vocals.\n\nThose who are familiar with previous Draconian works will notice that female vocalist Lisa Johansson is less present on this release that on earlier ones. Granted, growled parts had always been predominant in this band, but while they consisted in around 60% of the vocals before, they consist more in around 75% on Arcane Rain Fell. That just works fine: though I like Lisa Johansson’s voice, she could just sing a single line on some songs - that’s pretty much the case on tracks like A Scenery of Loss or The Apostasy Canticle, two massive and uncompromising ten minutes long doom anthems – I wouldn’t care as soon as that’s at the right time and at the right place. That is. In comparison to Anders Jacobsson’s deep and impressive growls, she may have never sounded so fragile, almost childish. If you only have one part to listen to, it would be this small two-verse intervention at the end of The Abhorrent Rays: genuine perfection.\n\nAnd of course, even if I hate singling out too much a precise song, one can’t avoid mentioning this album boasts the fifteen minutes long epic Death, Come Near Me. There are a few songs which represent a landmark in metal history, but this one surely does, at least in the gothic/doom subgenre, that it pretty much sums up. It is actually an older tune which figured, in a rawer version, on their 2002 demo, and which has been more or less awkwardly incorporated into the story of the fallen angel, but who really cares. The first gentle semi-acoustic and orchestral, then monolithic, guitar-driven intro alone could have made it for the song, but the following ten minutes just fulfil its promises. I would compare it to Bathory’s One Rode To Asa Bay: long, slow, majestic and without any radical change of tempo or style, but at the end simply the kind of track you have to bow down to. \n\nI know, I already said it about previous Draconian releases, but this album is the kind of masterpiece which can turn the sunniest summer day into the rainiest autumn afternoon, when the desperate poet may seek some comfort in the arms of the stone angels of the neighbouring cemetery. \n“O Death, come near us, and give us life”... Death had rarely been so seductive.\n\nHighlights: Daylight Misery, The Apostasy Canticle, Heaven Laid In Tears, The Abhorrent Rays, Death Come Near Me\n",
        "\nIf you’re getting tired of pop-symphonic-mainstream so-called “gothic” bands like Suckin Temptation, Epicrap or After Forever, whose only gothic element might be the name, just get Draconian. Here you won’t find overwhelming orchestrations which only aim is to hide the bandmembers’ inability to play their guitars properly, nor happy catchy melodies, nor a chick who can’t sing but stays there to attract the fifteen years old crowd. You will find talented musicians, depressing and slow doom leitmotivs, intelligent poetic lyrics and a chick (Lisa Johansson) who can sing and knows when she has to shut up and let her fellow growler (Anders Jacobsson) play the main part – he provides as usual around 60% of the vocal duties on this recording.\n\nThis demo from 2002 constitutes a very good introduction to the band. Let me first say that the sound on this recording is excellent and, though it’s self-produced, the production and the band’s mastery is far better than on many full-lengths from many acts, what is not really surprising given the band had already released several works before. Only the drums sound a bit low sometimes, but nothing awful as it adds to the misty feeling of the music. It actually constitutes a demo in the sense of it’s more or less a draft of the band’s two following masterpieces, especially Where Lovers Mourn. And in the sense of it’s self-released, but who gives a fuck.\n\nSo there are three songs which will end up on Where Lovers Mourn, and which are present here in slightly different versions. The demo opens on the mid-tempo gothic hymn The Amaranth, still one of my personal favourites, in a slightly rawer version that I almost prefer to the final one, this one exhibiting more depth, the violin (or keyboard, who knows, actually I’m pretty sure there are both) being mixed on the foreground. The following song might be called The Return to Solitude, but is actually an earlier version of Where Lovers Mourn’s Reversio ad Secessum, which is the Latin translation. As you can guess the Latin verses of the final work are here replaced by their English equivalents, but the most striking difference is the prominent presence of the piano which make this slow-paced doom-oriented song sounding here even more melancholic, especially on the parts sung by Lisa Johansson. Another masterpiece! The last song used on Where Lovers Mourn is the closing track It Grieves My Heart, which is here exclusively sung by Anders Jacobsson contrary to the final version, from which that one is not really different, except from the hazier sound and the fact that the Lovecraft quote only appears at the end of the song and makes the transition with the orchestral outro, Dark Oceans (On an amusing sidenote the original quote, from The Outsider, reads “(...) and I play by night in the catacombs of Nephren-Ka” while Mr Jacobsson says “(...) I play by night in the catacombs.” Ancient Egypt didn’t seem to fit a doom-gothic band!). It’s rather strange that the aforementioned outro has been lost in the final recording of Where Lovers Mourn – maybe simply because it sounds more like a movie soundtrack or some Rhapsody interlude than a gothic/doom piece of work.\n\nAnother song of this demo have been used on the second Draconian album, Arcane Rain Fell – the epic Death, Come Near Me. For those who don’t know this track is the ultimate embodiment of the gothic and doom beauty: from the title which evokes the “graveyard poets” of the 18th century to the slow, impressive and deep down-tuned guitar and violin (or keyboard, who knows... I’m repeating myself) intro, without forgetting Lisa Johansson’s both melodic and fragile voice backed by the endless growled complaints of Anders Jacobsson and the eerie solo parts – I my be unfair by always mentioning only the singers’ names, as the other musicians are not less gifted. It lasts fifteen minutes, so what? It could have as well lasted one hour, as stated before the band isn’t here to play radio-friendly tunes. However if you already owns Arcane Rain Fell (you are strongly advised to do) this version is again very similar to the final one and you won’t be really surprised.\n\nNow to the tracks which are specific to this release... Actually there is only one, as Memento Mori is just some short “über-gothic” interlude where the band seems to make fun about itself, admitting it knows what the word “fun” means of course. It’s actually quite hard to describe what it really is: some agonizing child cries, graveyard-by-moonlight ambience, church bells and minimalist piano chords. Again, I’m quite convinced it’s nothing more than a joke. The song Chtulhu Rising – Lovecraft is back again – is far more interesting. This eight-minutes long creepy track is exclusively sung by Anders Jacobsson, at his best, alternating between low growls, spoken parts and whispers, backed by slow and plaintive doom guitars and some atmospheric keyboard. Again some samples of screaming people add a bit of (relative...) fun to this otherwise utterly gloomy song - Chtulhu’s rising, people! But who could have ever taken Chtulhu seriously?\n\nTo sum up this release could be considered as the last draft of what this band will become: the heralds of old cemeteries by a drizzly autumn day, where ivy-crowned stone angels seem to look melancholically on the passer-by. That’s what gothic metal should be all about, hadn’t it been contaminated by... you must guess what.\n\nHighlights: The Amaranth, The Return to Solitude, Chtulhu Rising, Death Come Near Me\n",
        "\nSlow, dark and beautiful, that’s how this album could be summed up. There has always been a thin line between doom and gothic metal, and walking on this thin line like Draconian and a few others do usually leads to great results, like this album. And don’t be stopped by the fact they begin by a semi-epic track (12 minutes): it is easily the best on the album.\n\nDraconian usually walks on one side of the thin line or another. Songs like Silent Winter or the wonderful The Amaranth are typical mid-paced gothic songs with only a few doom elements (the pace slows up a bit in the middle of both songs), sounding quite close to old After Forever, only ten times better and without tons of orchestrations, while A Slumber Did my Spirit Seals is a doom song with barely no other gothic element than the female vocals. Longest tracks, like The Cry of Silence, It Grieves my Heart or Reversio ad Seccessum usually show both sides of the band for the listener’s greatest pleasure.\n\nThe vocal duty is almost equally shared between Lisa Johansson (female vocals) and Anders Jacobsson (growls), maybe with a slight preference for the last. Both are more than decent singers fitting perfectly both gothic and doom parts. Other musicians don’t disappoint as well, though technicality is never at the order of the day, but after all we’re not talking about prog metal here. Production, crucial in this kind of music, doesn’t put them at a disadvantage: guitars and drums sound crushing, piano sounds crystalline, singers sound so, soooo sad, and the bass can even be heard! \n\nGranted, The Solitude is a very repetitive track which seems to miss the point of both gothic and doom metal: neither dark nor oppressive, mostly built on whiny female vocals backed by quite uninspired and boring melodies. To sum up it sounds like most of self-named “gothic” bands sound: it fails building up any atmosphere, while atmosphere is the key of this genre. But the seven other tracks! The album always reinvents itself between doom crushing chords, gothic piano melodies, plaintive keyboards, tempo changes (especially in the first and last tracks), some unexpected flourishes like latin verses, or a discrete violin which sometimes does an apparition to add thickness to the music. There is even in the gorgeous first track a break which sounds closer from melodeath than from anything else and which could as well have easily taken place in any Dark Tranquillity album, while Akherousia is nothing more than a folk-inspired song showing Miss Johansson backed by acoustic guitars and some traditional fiddle. As stated before, the band isn’t fond of bombastic orchestrations, proving if necessary that those are rather useless as soon as you’re talented – and God, these guys and this chick are. \n\nConcerning the overall mood of the album, you must have understood by now that you can’t expect a good laugh with it, these endless lamentations of some desperate poet crying in the cold wind being rather likely to pour litres of the darkest melancholy into your poor heart or to bring back some painful memories you thought you had forever forgotten. Actually, Where Lovers Mourn – a well-chosen title, for once – is the ideal album to listen while enjoying a good walk in a cemetery. Well, just look at the cover, it speaks for itself... \n\nHighlights: The Cry of Silence, A Slumber Did my Spirit Seal, Reversio ad Seccessum, The Amaranth\n",
        "\nThis band is one of my more recent discoveries. Some of my metal \nfriends praised \"Arcane Rain Fell\" as one of the best releases of 2005. After getting acquainted to it, I can't do anything but concur.\n\nDraconian play slow, rhythmic keyboard-layered Doom Metal featuring a deep growling vocalist as well as a very solid female voice. Bands like early Theatre of Tragedy, Anathema and My Dying Bride have clearly influenced them.\n\nAside bringing the usual aesthetics (sorrowful lyrics, dark concepts, pulsating rhythms) of gothic and Doom to the table, Draconian also feel a lot more brutal, in lack of a better word. The growls are uncompromised Death Metal-barks and they rely on guitar very often for a band with keyboards. This is of course all positive. \n\nThe songs are quite well balanced as they follow the Doom Metal formula by being long and occasionally repeating passages. Riffage and vocal passages remain interesting as they never overdo the repetition. Atmosphere is also often present, especially in opener \"A Scenery of Loss\" where we are treated to spoken passages as well as sounds of rain. \n\nThis is where newer Death/Doom bands like Rapture and Swallow The \nSun tend to fail. The music rarely displays the emotion of masterpieces like \"Brave Murder Day\", \"The Silent Enigma\" or \"Rain Without End\". Draconian however, have no problems conveying great feeling into their sound instrumentally as well as vocally. The female vocals are well performed and the growl also carries a lot of passion.\n\nConclusion: If you like Death/Doom with a Gothic influence and \nstrong atmosphere, you'll enjoy \"Arcane Rain Fell\".\n",
        "\nIt´s not a particularly good idea to start off with a 12 minute track if you want to get fast attention from the listener. Draconian don’t give a shit about fast attention; actually they don’t seem to be too bothered wit anything that has any connection with the word “fast”. The opener “The cry of silence” is at times pure My Dying Bride worship, and anyone acquainted with the british doomsters knows that speed is not exactly their game. But, to dismiss Draconian as MDB clones is making it a bit easy for oneself, as they have more than this to offer.\n\nThey are equipped with some good tunes, and not all of them are slow, doomy efforts, even if that is their dominant feature. To their credit they mix up the tempos a bit within the songs to make them slightly more varied. Not all of the songs are ultra-long either, but even the long ones are good enough to hold your interest throughout.\n\nThey have both male (growling) and female (not so growling) vocals, which fits well to their musical style. They complement each other well, sometimes in a way resembling early Theatre of Tragedy works. Lisa Johansson has a clear and impressive voice that lifts several of the tracks on offer here to heights otherwise not reached.\n\nThe male vocals are also adequate, with just the right depth and power to breathe life (or death) into the music. The instrumental performances are equally well performed; they paint a musical landscape that is based on moderation well-crafted moods and melodies rather than full-on attack on their respective instruments and make sure that they don’t lose track of their original purpose. The songs never fall astray in their sometimes lengthy structure.\n\nFor a debut album, this is very impressive. This band have managed to steer their creative wills into an album that shows great promise, and that already is good enough to compete with several bands that are currently held in higher esteem. They are original enough, but if there is one area in particular that could be improved, that would be the one to go for first.\n\nAs for now, this album goes a long way towards proving their value to the metal scene.\n",
        "\nThis album starts off really slowly, but by the second song it pulls itself back up. The male vocalist has a pretty good, deep growl, definately suitable for the music, and the female vocalist has an amazing voice. It's a shame it's not used more, otherwise this would get a higher score.\n\nThis first song is very doomy, and then moves into a fast riffing part, while being growled over, and the occasional string section behind the music, and then falls back into the doom. Brilliantly beautiful.\n\nThe second song is definately the stand-out track for me on here. With some great riffing, the growls stand out quite a bit, and when the female vocals come through, they're absoultely amazing.\n\nAlthough, in general, this album keeps skipping from doomy riffs, and onto fast moving sections, being encompassed by strings. And, most of the time, the growled vocals don't really seem to stand out anywhere.\n\nI'd say, pick this up if you're a fan of gothic music, and want something a bit heavier, or for doom metal fans who want something a bit experimental in their music.\n"
    ]
}