{
    "Band Information": {
        "Country of origin:": "Sweden",
        "Location:": "Gothenburg, Västra Götaland",
        "Status:": "Active",
        "Formed in:": "1999",
        "Genre:": "Heavy/Power Metal",
        "Lyrical themes:": "Dragons, Fantasy (early); Heavy Metal, Evil, Love, Battle",
        "Current label:": "Century Media Records",
        "Years active:": "\n? (as DragonSlayer),\n1999-present ",
        "Number of Reviews": 42
    },
    "Band Reviews": [
        "\n\"Dragonslayer\" is a power metal classic, maybe even essential. Gus G., as always, does amazing guitar work on this album, utilizing many different tunings (but mostly drop D on most of the songs) to fit the tone of the song. Anyone who thinks metal is all \"evil and satanic and not real music and the musicians are talentless\" should listen to this. The album cover to \"Dragonslayer\" is not bloody and shocking, but one that would make fantasy fans go \"Whoa! Awesome!\" As for the music, one could also tell a metal hater that they actually sing in this album because the vocalist on this album is fabulous. \n\nMy personal favorite song off \"Dragonslayer\" is \"The Prophecy\". My favorite part about it is the key change in the guitar solo. (The guitar tuning on this song is drop D so the key played that it would sound like in standard tuning would be a whole step down, so D minor for example would sound like C minor.) The first part of the guitar solo contains arpeggios, then suddenly (after a transition using a diminished arpeggio lick), BOOM! This evil-sounding, yet musically awesome, key change to D minor (E minor if it was in standard tuning). \n\nMy only complaint about this album is that at some point, many songs just don't \"pull you in\" as much as \"The Prophecy\", \"Chasing The Dragon\", and \"Kingdom Of The Damned \". You got those songs that are totally epic and \"pulls you in\", then it's just kind of easy to lose interest. I liked it, but almost phased out when listening to it for the first time. I like the songs, but they just get a little... stereotypical. Typical musical qualities you can expect in just about all metal music but simplified. Doesn't mean it wasn't good, but it's easy to lose interest. \n\nIn closing, this is a great album if you are looking to listen to a few songs (unless you are a die-hard power metal fan and can't help but listen to the whole album). I really loved it and the songs were very creative (except in a few places). If you are going to show this to a friend, I would show them the exciting songs first if they aren't a die-hard power metal fan.\n",
        "\nTraditionalism, like anything else, is not fully immune to be reduced to a gimmick, especially wherein heavy metal is concerned. This isn't to say that a gimmick-driven approach to metal necessarily yields a negative result, but too much reliance upon it can find a band coming off as an awkward joke rather than entertainment. In this regard, Dream Evil has generally come off as a number of different things, but a truly serious and passionate musical venture was never in the cards. In their earliest days, they functioned as a solid yet very derivative power metal band focused on the usual fantasy-based subjects, and on a high note, helped to introduce the metal world to one of its favorite ax-slinging sons Gus G. This sort of tag-along tendency became a bit more blatant when the mid-2000s rolled in and The Book Of Heavy Metal was unleashed, turning a decent Hammerfall emulator into an overblown Manowar clone. Nothing ever came off as downright terrible, but at best, this outfit seemed like little more than an occasional creative outlet for studio producer Fredrik Nordström, who's work in the Gothenburg scene has been beyond repute, but also who's association with said scene has served to prejudice his approach a bit in relation to the power metal world.\n\nAll of the aforementioned historical context is important when approaching Dream Evil's latest studio offering Six, as the mixed reception it has received is part and parcel of something that has always kept this band in lukewarm territory as far as this reviewer is concerned. Making clear use of Nordström's cumulative knowledge of studio magic over the course of the past couple decades, this album comes in an extremely well produced, heavy-hitting, impact-based package that has generally been the norm for this band since it's exception. It hits with about the same power as a typical Mystic Prophecy or Firewind album (naturally a couple of bands that have enjoyed said producer's services over the years), but features far less dynamic songwriting that comes off as contrived and even reductionist at times. Things generally tend to work a little better when the tempo is kicked up a bit, which is surprisingly less often of late when compared to the Gus G years, and despite some occasional signs of activity in the riff and lead guitar department, the driving force keeping things from being stagnant is Nick Night's powerful and effective amalgam of Klaus Meine's high-end roar and Rob Halford's banshee wails.\n\nAt first glance, this is a fairly engaging and catchy collection of songs that seems to listen as well as any of their past offerings, but over time much of this wears thin and doesn't really have much in the way of staying power. The more mid-paced, groovy character of the majority of these songs finds a band too reliant upon cliches for their own good, and apart from a couple of somewhat memorable retreads into the band's own past like the might as well be sequel to \"Children Of The Night\" dubbed \"Sin City\", or the similarly melodic tinged yet somewhat swifter \"44 Riders\", much of it just poofs where the short-term memory terminates. A couple in this category like \"Hellride\" and \"The Murdered Mind\" are so utterly comical in their delivery and awkward that they make Manowar's \"Blow Your Speakers\" sound scholarly. Nevertheless, when the tempo is kicked up a bit like on the sing-along fanfare with a swift and heavy bent \"Antidote\" and the nimble nod to the faster side of Dio and Ozzy Osbourne's high-period 80s output \"Too Loud\" are quite compelling, and even the band's eponymous opening anthem \"Dream Evil\" manages to deliver some old school Tony Iommi-inspired heaviness in the guitar department that sticks with the listener.\n\nIt is perhaps expected that one drone on about the good old days when Dream Evil was sticking to their guns, but truth be told, this band has always been something of a lukewarm affair that would only occasionally break out and cook with the best of them. Whether it's the fact that Nordström is less in his element when songwriting versus making the creations of others into a polished, final product, or that this band's format has always been unnecessarily limiting and derivative, this is not a band that most would consider the pinnacle of their style. But this album in particular sees a band that seems more interested in dwelling upon the traditional heavy metal side of their style here, largely at the expense of the dynamic and intricate nature of power metal that has made Firewind and Mystic Prophecy superior acts. Even when citing the most obvious influences of Hammerfall, Manowar or Majesty, there is no triumphant speed metal anthem or unforgettable epic spectacle after the mold of \"Black Wind, Fire And Steel\", \"The Dragon Lies Bleeding\" or \"Lord Of The Damned\", but rather a compact collection of safe, mostly mid-paced songs that check off all the obligatory boxes but don't really seal the deal. It's another mediocre affair with a few bright spots that rests at the end of a 15 year trail of gradual decline, and for all of its sonic bluster, falls well short in the power department.\n",
        "\nHas it really been 7 years since we last heard a peep from Fredrik Nordström’s baby? In all honesty, time isn’t at all a factor for the Swedes of Dream Evil. Subsequent albums don’t build upon the foundations of the last – they just simply exist in the same middle-of-the-road heavy metal universe. It may as well be 2002 for all the progression we are to expect from 2017’s Six (kudos to the creativity of the title – this being their sixth album and all…). Now, I love my metal with huge swathes of cheese – I even admit to heartily enjoying both 2002’s Dragonslayer and 2005’s The Book Of Heavy Metal. In their own, pompous way, these are fun records with over-the-top clichés and genuinely heavy riffs. However, this simply isn’t the style of band that can pull off a ‘big comeback’ unless serious alterations are made. And have they been made? I’ll give you two guesses…\n\nIf you enjoy anything else this band have ever done, or anything by Manowar, or Majesty, or…you know what I’m getting at… then you’ll like Six. But that’s the problem, you will just ‘like’ it. It’s so unspectacular it almost becomes insignificant. Now, if there were a tongue-in-cheek, humorous aspect to the music then it might have scored higher because self-awareness takes away the edge of pomposity. But these guys are deadly serious. Take a listen to “The Book Of Heavy Metal”. What happened to that attitude? Some of that shit is SO cheesy, it’s laugh-out-loud entertaining and barrels of fun! This grave tone undercuts the admittedly heavy-as-fuck guitar tone, almost undermining themselves. The palm-muted chugs on this album are some of the best moments due to the sheer weight of that guitar sound. “Under Attack” especially is full of it. It’s so chunky, I want to bite a slice out of it.\n\nBass, drums and guitar are all mixed perfectly, but Nick’s vocals – despite being powerful after all these years – are way too far forward in the mix. At times he’s piercing, especially in his upper register. Thankfully he’s backed up by the uber-manly chorus at many points throughout the album, which are a delight to sing along with. If you needed proof that these guys were attempting to stage a ‘comeback’, then look no further than the opening track, which they titled not-at-all-narcissistically “Dream Evil”. When a band does that, it definitely means something. Thankfully, this is one of the best tracks on the album with its pounding, martial pace and massive chorus. The follow-up, “Antidote”, is also one of the highlights thanks to its Firewind-esque main riff and Accept-esque refrain (‘AND WEEEE’RE THE ANTIDOTE!”).\n\nUnfortunately, by the time tracks three and four (“Sin City” and “Creature Of The Night” – I know, could this get any more generic?) pass you by, you’re ready to peel your head off the desk and press, nay, punch the stop button. There are some glorious moments littered throughout this record, but they get eclipsed by the maelstrom of mediocre din surrounding them. The sixth track on Six, “Six Hundred And 66” (I’m gonna vomit), may have the worst title since Annihilator’s Metal, but damn it has a groovy main riff! Same goes for the swinging “Broken Wings”. But all is in vain – this entire affair is sixty minutes long for goodness sake. I’m surprised they didn’t make it sixty-six minutes long…with sixteen tracks! Frankly, the fourteen we are presented with is more than enough. Go buy this disc if you need to have everything Nordström has ever done, but don’t come crying to me if you end up on a shrink’s couch with hexakosioihexekontahexaphobia.\n",
        "\nSome things in life just go really well together, black and white, fish and chips, chicken and mayonnaise and heavy metal and cheese. Over the years, heavy metal has shamelessly adopted many clichés and we love them, sometimes, the cheesier the better and Sweden’s Dream Evil are up there with the cheesiest.\n\nIt has been seven years since the last Dream Evil album with the band insisting that they have not been on hiatus, but in their own words: ‘very busy’. This is hardly surprising really considering behind the pseudonym of Ritchie Rainbow is esteemed Gothenburg sound producer, Fredrick Nordström. It would take an entire article alone dedicated to the résumé of Nordström to list his achievements, but finally, this year we have a new Dream Evil album aptly titled ‘Six’.\n\nNo introduction is needed here, ‘Six’ storms into action with a crushing riff for ‘Dream Evil’ complete with hoo ha’s designed for raising your fist in the air and this feeling continues throughout the song with its almost hypnotically chanting cult like chorus. ‘Dream Evil’ fantastically kicks off the album, it is a perfect slab of balls to the wall heavy metal infused with power metal with the guitars of Nordström and Mark Black prevailing throughout. Listening to ‘Six’ is like being an acolyte at a devilish meeting, the large emphasis on an impactful chorus only serves to hammer each song home, ‘Dream Evil’, the superb ‘Antidote’, the party hard Manowar attitude of ‘Too Loud’ and the defiantly sombre closing track ‘We Are Forever’ give connotations of unity and strength in numbers against a common enemy, especially towards the end with the music fading out leaving nothing but the vocals.\n\nAs an album, ‘Six’ takes a much darker turn than other Dream Evil releases, many of the recurring themes throughout the album revolve around evil, darkness and the occult; ‘Dream Evil’, ‘Antidote’, ‘Sin City’, ‘Creature of the Night’ and ‘Six Hundred and 66’ all directly reference these themes. However, ‘Six’ never becomes boring, from fist throwing, soaring vocals and extremely catchy chorus’, Dream Evil will have you, yes, there are some songs on ‘Six’ that aren’t as good as the others; ’The Murdered Mind’ with its Megadeth style chug, ’44 Riders’ and ‘Broken Wings’ do not stand up as strong as some of the songs that come before them, but you can hardly call them filler, ‘Six’ runs exceptionally smoothly and clocking in at just over 50 minutes, it is the perfect length to fully enjoy.\n\nFredrick Nordström is a man who takes everything within his stride and obviously he does not only produce and mix, he takes little bits from each band he gets the pleasure of working and with Dream Evil, no band is more prevalent than HammerFall. At times there is such a scary parallel between Dream Evil vocalist, Niklas Isfeldt and HammerFall’s Joacim Cans that occasionally you feel yourself having to check that it isn’t a guest spot from the HammerFall frontman. From the heavy pounding of the double bass drums of ‘Antidote’ provide the perfect backdrop for Isfeldt to issue his best Cans impression whilst the Aleister Crowley inspired ‘Sin City’, ‘Six Hundred and 66’ and ‘Too Loud’ wouldn’t be out of place on any of the later HammerFall albums.\n\nThe best thing about ‘Six’ is that it is highly addictive and above all fun to listen to, it serves as a nice reminder that Dream Evil have been away for far too long. There are some people out there who do not like cheese and that is fine, however, cheese is the perfect accompaniment for heavy metal and for that, look no further than Dream Evil and ‘Six’.\n",
        "\nI've always taken a liking to bonus tracks, often finding they are my favourites from a given album. This album is true to that pattern. The core album hosts a variety of killer songs that certainly are in step with Dream Evil's previous efforts. From the heavy and speedy duo of the two first tracks, Dream Evil and Antidote, you are setup to expect the momentum to continue. And it mostly does, though a couple of filler songs breakup the pace. The album lacks a ballad in the traditional Dream Evil sense. The closing song, We Are Forever, fills that slot, however it is a disappointingly low energy slog of a song.\n\nAnd that is the true Achilles heel in the songwriting; there are too many samey mid-paced songs within while the band's stronger efforts are from higher tempo songs. This is where the bonus tracks come. With the exception of Conquer the Power, the bonus tracks are incredibly strong. All of which are either groovy, heavy, fast, or all of the above. The core setlist would've benefited greatly if some of the bonus tracks swapped the midtempo tunes. \n\nRegarding the sound, it is all there: excellent heavy guitar tones that chug HARD, drums that fill the song in and are played extremely precisely, bass that fills the room, and Niklas' vocals are as great as ever (Crush It is a great example of his power and smart production). One critisism is the lack of notable guitar solos, which will disappoint fans from the Gus G. days. Rhythm is up, lead is down. Reverb can also be a bit high on the vocals at times for my liking.\n\nThere are many things I would like to have seen done differently to make this album go from \"great\" to \"excellent\" because it really is that close to the threshold. But as the album is and has been realized according to the band's vision, it is a very respectable album and one I will be listening to day in and day out.\n\nFans of United and In The Night will feel right at home in this step of their evolution (or evilution I should say). Everyone else? Give it a listen, there is something for everyone in this album, just be ready to skip a couple tracks to find the gold.\n",
        "\nIt would invariably seem like Dream Evil does not hold back, when after seven long years of hibernation they release their sixth full length album, aptly titled Six. It is the follow to acclaimed In The Night (2010). Right from the start, in the band’s self titled song, you can feel energy hit you. Dream Evil hits the height of some of Manowar’s greatest, while also reminding of their own classic album The Book Of Heavy Metal (2004). Fredrik Nordström and Markus Fristedt chugs som Dio like riffs, and the latter showcases some serious skills on the lead guitar without going too melodic. The strength of Niklas Isfeldt’s vocals makes you think those seven years were just yesterday. For five whole minutes Dream Evil manages to keep the flame burning.\n\nThen the album falls apart into a mish mash of filler, same-old same-old and shitty tries at tongue in cheek comedy. Less power, more heavy; dirty riffage - sometimes not bad at all, mind you - are filled up with bland structures, unoriginal melodies and choruses that seem to repeat around each other, as well as repeats of the previous albums.\n\nThing is, Six is well played, well done and Nordström’s production job says everything should work. Yet it doesn’t. Dream Evil has somehow managed to suck the life force out of most of the music on here, as they kind of did on the last two records. The traditional heavy metal style they aim for should be full of attitude - like Astral Doors recent album did fairly decent - but just ends up feeling tired. Take for example Sin City, Hellride or Six Hundred And 66, all meaningless filler with little in the way of momentum, while Too Loud and Broken Wings - both toward the end of the album - picks up some speed, rougher riffage, but still manages to fall into nothing thanks to empty choruses and bland performances from Isfeldt.\n\nThat said, Six isn’t that horrible. Some things do work. For example, Creature Of The Night is a mid tempo masher that works thanks to a comfortable rhythm section and slick melodic leads. The serious intonation makes the song work, but it’s far from perfect.\n\nThere are those moments on Six, the ones that grab your attention and go “shit, why don’t they do more of that?” And with a few listens the album does grow on you - a little. The Judas Priest feel plucked out in 44 Riders for instance is sweet, and makes for a highlight. The chorus takes a melodic twist, and while the lyrics are cheesy as shit the humor is more subtle, making the song feel more like a tribute to the whole biker thing (as made famous by Priest and Manowar), rather than mockery. Dream Evil were always at their best when they weren’t trying to be funny, and Six doesn’t see enough of that. Maybe it’s Century Media not knowing how to handle power metal the right way (just look at the comments on the Dream Evil track video on Youtube to see what I mean).\n\nIn the end, Six is nothing new, but more of what happened on United (2006) and In The Night, without capturing the feel of The Book Of Heavy Metal, even though it does try. A handful of decent songs in 13 years is not good enough; when Gus G and Snowy Shaw said “bye guys” Dream Evil should have done the same.\n\nStandout tracks: Dream Evil, 44 Riders\n",
        "\nIt is very difficult not to love Dream Evil. There simply are so many factors to discuss about this band and every aspect is interesting to touch upon. So the year is 2002 and we're standing in the aftermath of the grunge period; a time that sought to break music down to its most simple form as a reaction to the big sound of the 80's. The stage is set for new bands to make their mark and leave an imprint on the musical scene, and here Dream Evil really steps it up boasting with a fantastic line-up with musicians that simply are top notch. We have the very well renowned (not as much back then) Gus G of Ozzy Osbourne fame, Frederik Nordström and Niklas Isfeldt both involved in Hammerfall, Peter Stålfors and last, but not least, Snowy Shaw. Lots of talent, lots of potential, but could they work together? Is their debut worthy of praise?\n\nAt the first stroke of thought, you'd imagine something Dio-ish from this group as their name is directly inspired from the Dio album Dream Evil, and you could say it holds up to that in a few ways: mainly the lyrics. Dream Evil can take credit for writing some of the most hilarious and cheesiest lyrics in the entire metal universe, in fact the whole album is essentially one big story about slaying a dragon (very dio-esque). A song like Chasing the Dragon really helps to cement this fact: \"Something soars through the sky - It's the dragon, fly!\". Songs like H.M.J and Heavy Metal in the Night take a very traditional metal stance and is all about rocking out and having fun. When the band finally decides to take a serious lyrical approach in a song like Kingdom of the Damned it just feels odd. The song has enough cheese, alright, but up until this point (and afterwards as well, mind you), you will be laughing and rocking out... but then you hit this loose brick in the road, stumble and wonder: \"what is this even?\". Very misplaced song for that fact. \n\nLet's look at the music. The album is very generic by today's standards. I imagine that back in 2002 it was a breath of fresh air, but it certainly hasn't aged too well. The songs are just predictable rockers that rely on their very cheesy hooks. There's nothing exciting except for the solos. Listen to Hail to the King, The Chosen Ones and the ballad Losing You and you'll see this pattern going on and on. The song structures are just so similar, and you'd think with someone such as Gus G at the helm that you'd have some really interesting parts to spice things up a little... you just don't get that at all. Where the album really succeeds is on their slow rockers: Heavy Metal in the Night, Chasing the Dragon and the slightly fast paced H.M.J. Those tracks are balls to the wall tracks that don't mess about, and they really get your blood pumping. Here the cheesy hooks really work well and support the songs as a whole. As mentioned before, the solos are absolutely out of this world... but to no one's surprise of course. Gus G is legendary at neo-classical shredding and it really shines through. Mr. Isfeldt puts on some really great vocals and I have not to this day heard anyone with a voice quite like him. He has this strangely satisfying hoarseness when he sings in his high register. It really fits well with the choir segments he adds to most of the songs as well. The only problem I have with his vocals also goes for the music: so predictable and so safe. He doesn't experiment in the songs, or add an occasional \"yeah!\" or \"alright!\". To me it just seems a bit too professional and polished, and it takes the fun out of the metal that they're actually trying to make hilarious, therefore it feels contradictory. Also Mr. Isfeldt comes across incoherent at times, which is a terrible shame since the lyrics are really fun to listen to.\n\nThe production is phenomenal and there is no finger to be put on that. You have a nice, fat & meaty bass that just pounds away, some roomy bass drums and an angry snare, crisp guitars, ominous keyboards and the spotless vocals. Of course this is to be expected, as Mr. Nordström is an exceptional producer and his work is often hailed as top-notch. I actually wish more bands today would adopt this sound as it really makes sure that every instrument gets to shine in their raw nature. \n\nThe cover artwork is definitely the best and most suited to the album that the band has. We have this horned monster wielding a big battle sword, ready to kick some ass as he is bathed in the dragon's fire! How could you not want to buy this album while looking at the epicness that unfolds? It is over the top and therefore it really matches the contents of the album as well.\n\nAll in all, this is a fun and safe album to listen to. You will not be shocked and excited about it, but you'll have a good laugh and some music to really bang your head to (I especially recommend The Prophecy for the headbanging part). It is definitely worth to add to your collection as the album captures the work of some exceptionally great musicians in a period before their careers really took off. \n\nThe highlights are in intentional order:\n1: Chasing the Dragon\n2: Heavy Metal in the Night\n3: H.M.J\n4: The Prophecy\n",
        "\nSwedes re-invented the steel in 90's, and saved the whole heavy metal genre. Classic heavy/power metal titans HammerFall were the ones to end the false metal reign. Power metal legions like Sabaton, Bloodbound, Saint Deamon, and the new classic heavy metal bands like Steelwing followed. Dream Evil is one of the followers too, but I wish I could say that they are as great as the bands I mentioned. In fact, they are not. This is not that bad, but it's not great at all. Almost every song, not just from this album, but from their entire discography is full of crappy lyrics, uninteresting ambient, unmemorable riffs, sometimes annoying singer's voice, specially when he sings like a girl. Niklas Isfeldt has really great voice, but if he sang more often like he sang in the song Back From The Dead from United album, that would be some major ass kicking.\n\nInto The Moonlight, Chapter 6, No Way and The Book Of Heavy Metal (March Of The Metallians) are not just highlights of this album, but the highlights of their entire discography. Although they have only few more excellent songs from their other studio albums, this one has them most. These songs show great potential and the talent which band members possesses, but they lack creativity. Neither Gus G could have done anything better in a band where the band members don't work great as a team. Into The Moonlight is a hell of an awesome song which sounds like a battle anthem, with these powerful and blazing riffs, dark and doom symphonic background, epic drum pounding and excellent soaring vocals supported with strong backing chorus. Chapter 6 is darkened by the wicked organ and Gus' evil legato. It's really heavy and mainly fast song, but the tempo slows down a bit in some parts.\n\nOther memorable excellent songs do not have any symphonic arranged parts. No Way is really heavy song, and singer sounds a bit like Ozzy Osbourne, can you imagine that? But Ozzy can only dream of singing like Niklas. Song is fast, it has excellent drum work, and guitar solo rapes. The Book Of Heavy Metal (March Of The Metallians) is the absolute highlight of this album, and first thing you will remember after listening to it. Why? Those monster heavy, unique and blazing riffs, incredible slow and fast tempo combination, insane vocals, specially when singer starts to scream like legendary Ralf Scheepers, are the answer. However, these four songs are not enough to make Dream Evil have special place in any book of heavy metal. The Enemy and Only For The Night are two very good songs which raise the rating of this studio album, but they could have been improved.\n\nThe Enemy could have had better lyrics, and singer could have done better job, while the rest of the song (riffs, tempo, ambient, guitar solo) is totally ok. The same thing for the song Only For The Night. The rest of the studio album is not memorable and anything special at all. That is the bitter truth, and that's the same thing with their other studio albums. There are few good riffs here and there, some good parts of the songs, but nothing worth mentioning. Chosen Twice is the only memorable mediocre song. It has strong chorus and great ambient, but tempo doesn't fit well with that, power chords are nothing special, lyrics have some painful parts to read and singer sounds lazy, and annoying when he repeats certain words in the song.\n\nGood sides of this release:\nThis studio album has few, but monster mind-blowing songs. Band members have great ideas, talent and skills, but they lack creativity. Creativity is one of the most important factors.\n\nBad sides of this release:\nLots of mediocre songs, and few songs which could have been improved. Unfortunately this is not special classic heavy metal band. Sweden has much better heavy metal bands to offer.\n\nHighlights:\nInto The Moonlight, Chapter 6, No Way and The Book Of Heavy Metal (March Of The Metallians).\n",
        "\nDream Evil (as their name might suggest) has spent most of their career attempting to capture the magic of Dio-era heavy metal. Although most of their older work falls flat in many areas, their latest album has finally captured exactly what the band has always tried to, for better or for worse (but mostly for the better).\n\nThe guitars here are powerful, catchy, and keep perfectly in time with the drumming, which is just as loaded with energy. The general composition of the songs is ridiculously simple, but it works perfectly with the band's theme. You don't really need to use your brain to enjoy this album, but in all honesty, it's really kind of refreshing to be able to listen to some brainless metal every once in a while.\n\nThe album's lyrical themes seem reminiscent of 80's heavy metal, and mostly have to do with battles, love, and rocking out while banging your head. Once again, you're not really going to have to use your brain to comprehend these lyrics, but who listens to Dream Evil for original lyrics or philosophical insight? No, this is brainless 80's ripoff metal all the way, and much better because of it.\n\n\"Bang Your Head\" is easily the best song here, with a catchy chorus that actually does make you want to bang your head. The album's only moment of imperfection is \"The Ballad\", which seems less like a fun tribute to early heavy metal and more like a moldy ball ball of musical cheese. Of course, Dream Evil releasing an album with only one fuck-up song is unheard of, and even this fuck-up is unnoticeable with a quick jab at the \"skip song\" button.\n\nDream Evil isn't doing anything progressive or original here, and some metalheads will find the blatant ripoff of 70's and 80's heavy metal to be cheesy or unoriginal. However, copying classic heavy metal is exactly what they're trying to do, and in all honesty, they're doing a damned good job. The band had as much fun recording this album as you will listening to it, and anyone who says otherwise needs to get that stick out of their ass. This album is cheesy, but it's also powerful, catchy, and a hell of a lot of fun.\n",
        "\nI count myself amongst a sizable minority of followers of Dream Evil who were not terribly impressed with “The Book Of Heavy Metal” and all of the pretension that came with it. It struck me a little odd that immediately following the release of the album that suddenly people decided to start drooling over this band, as if what they done hadn’t already been done better by Hammerfall or Metalium 5 years earlier. Fortunately the lineup chaos that ensued after the release of the overblown fit of shallow fanfare guising as an album seemed to have shook the band up a little, and an album has emerged that is safe for the lactose intolerant.\n\n“United” sees this band turning back the clock a few years in some respects, going for a sound that is more in line with the darker concepts on “Evilized”, while having maybe a slight helping of the mystique of “Dragonslayer” here and there. The makeup is uncannily 80s in character, the vocals still have some semblance of the Klaus Meine character of old, though Nick’s newfound love of Halford screams is still present from time to time. Perhaps my biggest gripe about this album is that newly recruited guitarist Markus Black overdoes it on the lead fills, attempting to no doubt channel Gus G’s sound for sake of stylistic consistency, but coming off as an overcompensating version of Jake E. Lee’s over the top contributions to Ozzy’s “Bark At The Moon”.\n\nFor the most part, things tend to hang out in mid-tempo heavy metal territory, as the band has taken the old school character as their dominant influence, save a few exceptions. “Kingdom At War” and the opener “Fire! Battle! In Metal!” feature a dual approach of heavy thudding verse riffs with a gritty vocal approach, immediately followed by a triumphant anthem chorus that is all but directly out of the Manowar playbook. Likewise, “Evilution” and “United” take the same approach but with a riff set more reminiscent of the rocking grooves of Accept. Things get kicked up a little bit on “Blind Evil”, which is somewhat more along the lines of a Helloween-like fanfare, really kicking up the heroic factor on the chorus. But the true high points come in when the band goes back to high speed power in the typical German fashion ala “Falling” and the Japanese bonus track “Pain Patrol”, both reminding heavily of 80s era Judas Priest.\n\nAs a whole, this is something of a middle of the road album. It’s not quite something that can be qualified as essential from a genre standpoint, though it is a decent album and probably worth the time of those who like the 80s revivalist sound propagated by a number of Swedish and German bands. Don’t expect to be wowed by the band’s prowess as purveyors of socially relevant causes or mastery in storytelling, but definitely prepare yourself to be entertained by a band that is reasonably good at what they do.\n",
        "\nOne has to lower oneself in order to truly get where Dream Evil comes from, not merely in creative expectation, but also in freshness if the last few albums have anything to say on the subject. Any apologist who tries to justify the continued existence of their brand of cliché, metal worshiping power/heavy Metal run into a liability the minute their name comes up. While musically they’ve always been competent at getting the job done, the image, the words, and the overall concept just doesn’t wash. While one could point to their stellar production practices and competent front man, when compared with Hammerfall or Metalium, let alone the colossal founder of the style Manowar, there is a lot to be desired.\n\nAfter losing two highly credible musicians in Snowy Shaw and Gus G, nearly breaking up completely, and a middle of the road album in “United”, 4 years of studio silence has further given us all a chance to cool off from the excess goofiness. But unfortunately this wasn’t long enough in the case of “In The Night”, which seems hell bent on trying to out tongue-in-cheek “The Book Of Heavy Metal”. From a stylistic standpoint, this is actually a pretty solid bit of Judas Priest worship that sees Nick Night actually sounding like a slightly more nasal version of Ralf Scheepers, and the simple songwriting is almost akin to a stripped down version of “Devil’s Ground”. But when it comes to how this is all presented, particularly from a lyrical standpoint, this is the sort of album that all but cries out from a mountaintop that it wants to sound like it was written over a weekend.\n\nFrom song to song, there is actually a strong level of continuity and a good sense of brevity. Most have limited and basic content, and primarily fly by the strength of the vocalist and the punch of the whole arrangement. A nice smattering of up-tempo rockers with distinctive melodic content and lyrical clichés are pervasive, as particularly is the case with “Immortal”, “On The Wind” and the shred happy “See The Light” which sees new guitarist Dannee Demon attempting to invoke Gus G’s wild sweeping style with adequate results, though no substitute for the original. The afterburners get turned on a bit with the title song “In The Night”, which really lays on the “Painkiller” influences. But the best representative in congress is the closing “The Unchosen One”, which sounds like a reinterpretation of “Children Of The Night” with a more Halford-infused vocal assault.\n\nUnfortunately, with most of the better songs on here even, one would have to sing along without even given the slightest bit of credence to the words. At best, what is heard is 3rd rate rehashes of the “We play metal, look how badass we are!!!” stuff that Manowar brought to the equation as far back as 1982, and they at least had the biceps to back it up. At worst, it sounds like a horrid fit of self-parody such as is the case with the awkward quiet slump otherwise known as “The Ballad”, which is lyrically idiotic enough to paint a picture of Spinal Tap with members of Nanowar’s craniums immersed in their rectal regions. But even if this song wasn’t preoccupied with booze, buffoonery and “that fucking Snowy Shaw”, the radically derivative and shallow music presentation would sink this thing instantly and brand it as a weekend songwriting flop meets a bad version of an Elton John song.\n\nFodder for the bargain bin is what we are ultimately dealing with here, and even at $7 this should be approached with an imaginary warning label of potential death by cheese poisoning. I’ve been able to enjoy this album primarily by employing the skip button on a few songs and bearing in mind that this is about as far removed from a lyrically deep album as can be encountered. But for those who liked either “The Book Of Heavy Metal” or “Dragonslayer”, or someone just looking for something that sounds 80s to the point of trying to relive it minus the loud production, this is not beyond worthiness of acquiring.\n\nOriginally submitted to (www.metal-observer.com) on March 16, 2011.\n",
        "\nDream Evil has grown to be one of the mainstays of Swedish heavy metal. Here they are with their 5th full studio album, named 'In The Night'. With a new guitarist, and new pseudonyms the band is back with a full-on humorous metal effort this time around.\n\nDream Evil has always been a band that takes it all over-the-top. And this time around they have taken it even further, both musically and image wise. All of the members are now operating under outrageous names. And the lyrics are so out there that the word cliché is no longer applicable. Just check out this line from the opening song, \"Immortal\": We are immortal, we rule the slaughter\", or how's this for a sappy lyric in a song called \"The Ballad\": We believe in lots of love...., we believe in drinking beers and booze and wine,... we believe in of love, we believe in drinking booze and act like swine, when the children cry\"!! They have also used the title of the album as a text phrase in almost all of the songs on the album. So you have to have a sense of humor when it comes to this band, and realize that this is entertaining as heck!\n\nLyrics aside though, Dream Evil has also always delivered classy melodic power metal. And 'In The Night' is no exception. These are some ultra catchy melodies here, driven by powerful and punching guitar work, and smooth vocal acrobatic. Songs like \"Immortal\", \"Bang Your Head\" and \"Kill, Burn, Be Evil\" are not only metal hymns, they are also hymns to metal, and the metal life. Everything I loved with the bands prior work is still in tact, and I actually feel that Dream Evil has delivered one of their strongest effort this time around. Sure, they are balancing on a fine line with their tongue-in-cheek approach. But you'll be hard pressed to find anyone who claims to like the genre who'll say anything really bad about this album. And if you can sit through \"The Unchosen One\" without banging your head, stompin' your feet or throw your fist in the air, chances are you ain't a metalhead after all! Yes, this is darn catchy, and well done melodic metal! So when every song is as strong as the next, I can only conclude that Dream Evil has once again delivered a strong album to their fans.\n\nThe limited edition digibook comes with 2 bonus tracks, and a killer patch for your denim vest. \\m/\n\nKiller tracks: Immortal, In The Night, See The Light, The Ballad, In The Fires Of The Sun, The Unchosen One\n\nfrom http://www.metal-metropolis.com/dream_evil.htm\n",
        "\nAh, Dream Evil, proof that you don’t have to have any artistic integrity or change a damn thing about your sound at all to get a record contract and release music and be a generally famous metal band worldwide. But goddamn if they aren’t entertaining as fuck anyway. This is In the Night, almost a decade after formation and their fifth album into their career, and how does it fare up? Eh, it’s about what you’d expect.\n\nThe most astonishing thing about this is just how much fun it is at times even in the context of being shallow and artistically bereft candy metal. I mean…this is just silly all around. It’s a Power Metal album released in 2010 still holding onto clichés like album title In the Night and song titles like “See the Light” and “Immortal.” That either takes a huge amount of balls to not feel like you’re doing something redundant or a complete disregard for every outside influence that could ever possibly inflict itself upon you. They obviously didn’t spend more than ten minutes tops writing these lyrics and picking song titles, which would be horribly asinine if the album weren’t still so much fun. Good god, they even used the rhyme “They come to take my life/They come to take my wife”! This…this is just stupid, but I’ll be damned if I’m going to say I don’t like it anyway.\n\nI am serious. Even despite the fact that I’ve been listening to this band for half a decade now, songs like the epic “Immortal,” the heavy, booming title track, the melodic firestorm of “See the Light,” the crunchy “Frostbite” and the blazing “Kill, Burn, Be Evil” are still hugely entertaining to me. The whole first half of this is damn good, with big riffs and renewed energy and charismatic vocals galore. Without Gus G., the band seems to be having a lot more fun, and the energy just goes through the roof on every single track. We do hit a serious dead zone in the form of the terrible “The Ballad” – about as funny as a stubbed toe. What’s the point of taking the piss out of conventional stereotypes like this when they could have just as easily AVOIDED that and released an album with no ballad at all? “Mean Machine” sucks too, with a really lame chorus, but luckily that’s about as far as this album dips in quality.\n\nI probably shouldn’t be going so easy on this album, as I doubt the band was even really trying past the point of just writing the hooks, and there are tons of bands that are putting forth ten times more effort and getting ten times less recognition in the underground. But goddammit, this album is still too catchy and too much fun to ignore. Dream Evil is only about one step above a joke band, but at least they are an enjoyable farce, at that. Recommended if you can’t get enough of this chorus-and-riff bare bones heavy metal. Cheeky fuckers.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nThe reviews I have read so far for this magnificent album focus on the ‘comparison fact’ with D.E past albums. It is true it is inevitable comparing albums and especially (which can be both a course and a blessing) when such past albums were anthemic killer heavy metal records.\n\nWell my fellow metal heads, I am taking the side of a newbie. ‘In the night’ was the first album I actually purchased. I must confess I was reluctant in regards to true metal because of the generic sound I have found so far. Pretty much it goes next to power metal. It takes really long to find a good band or at least something that stands out and/or provides you real entertainment through the entire listening experience. I have found this with Dream Evil. This album ‘In the night’ upon the very first listening I was blown away. Up to today I still consider it an outstanding album for many reasons, which I will detail right now.\n\nFirst and foremost I will not compare this album to previous albums. I am reviewing as standalone album. Secondly: the most important thing for a heavy metal album should be: entertainment. Certainly they know how to keep you interested through the entire album. There are fast tracks, mid pace tracks, only one ballad, really ‘epic’ true metal sound based on heavy metal 80’s influences. Anthem songs are as well present. I say this because nowadays if there is something truly difficult to achieve is creating ‘catchy’ tunes (btw I am not saying commercial alright?). I mean, when listening to Stratovarius or Edguy they master this wonderful. They are yet able to create melodies and choruses that will stick to your mind for long. Dream Evil has achieved this to me. Since there are a lot of songs on this album you will find yourself whispering, whistling long after the first or second spin.\n\nThird: what if the lyrical content is for some people cheesy? Half of the metal community states that the lyrics are not important and that when it comes to reviewing albums it is supposed to be focused on the music alone. Now when it comes to true metal then a lot of people state that the lyrics are cheesy, silly, lollipop for kids, etc etc. Thus we are forgetting what the genres stand for. True metal was supposed to exalt metalians around the world. This is cheesy by itself but we need to stand up and defend our likes in music, especially since the mainstream is overcrowded with nothing but shit: saying over produced stupid pop (Britney Spears), alternative rock (90’s utter acoustic crap), bullshit media divas (J.Lo), lifeless & talentless rock bands (Maroon 5, etc) so we need to be united and raise the banner of metal. Does it still sound cheesy to you? Probably yes, but it is indeed true.\n\nForth: when you listen to a singer that most of the times sounds like Klaus Maine but the screams are very Halford-esque then we have an awesome singer. He is not one of those high pitched Kiske clones. No, he is one o fthe driving forces of the band and although his voice can be compared the style of music creates a totally different sound for this band. Where else, should I dare to say, would you find a band let’s say: Scorpions with huge balls plus Rob Halford invited? Nowhere else but with these guys you will find such.\n\nFifth: it is really hard and heart breaking when an awesome guitar player leaves a band. This is the case with Gus G. but even so, new comer Daniel does a great job providing quite heavy riffs and especially a crushing guitar crunch plus cool guitar solos. I am not comparing him just in case. I am saying that for a newcomer to the band like me this is a truly killer album regardless of what we they have done in the past. You don’t need warp speed rhythm sections all the way through to keep you interested but even so, if you are the like go and listen to Dragon Force or Dark Angel’s Darkness Descends but being heavy and powerful without the speed (saying not light as the Strato guys or even Skylark), then you have something to think of.\n\nSixth: the excellent production. As far as I am concerned taking advantage of technology is not bad at all. Mixing albums correctly could become a difficult task and it is easy to screw up a good recording (‘…And justice for all’ by any chance? LOL!) so there are no good songs if the production will not help. In this case Fredrik N. is not an amateur so he did an awesome job providing a really thick sound. It does sound heavy metal, not power metal or any other. This is straight heavy metal the way it is meant to be.\n\nI have not been even detailing the songs since there is no need. The album has it all as explained before. But even so and to be fair with those who need proof of what I am saying is not pure cheap talk let’s just say that ‘Inmortal’ opens and this is the kind of monster that you want to start head banging. The guitar crunch is delicious, vicious, evil (pun intended) and the double bass drums are very well balanced. They are not too fast or weak by any means plus the outstanding vocals of this awesome singer Nick. The party follows with the title track which chorus is although simple very effective. In here the rhythm sections are the most powerful parts of the song plus again the stand out vocals. So on and so forth the songs follow basically the same pattern: powerful riffs, tight drumming sections, superb vocals, and good guitar solos with nice mid tempo (the majority) of songs which enhance the epic and crushing atmosphere of the entire album. Perhaps the only complaint I have which does not take away any points as far as I am concerned is that for the guitar solos they sometimes sound a little back comparing them to the otherwise powerful rhythm guitars. This only happens when the guitar solos come up. But if you take for example the track ‘See the light’ which is my favorite because of the catchiness of the vocal melodies and flowing riff plus the guitar solo fills since the very beginning which sound magnificent to me. Next we have ‘Electric’ which is pure 80’s delight because of the obvious jazzy rock ‘n roll influence. Curiously, the heavier tracks are in the beginning whereas the faster tracks are in the middle providing a good album structure.\n\nDo I need to say more? Let me think, I don’t think so. I believe I have described for any newbie what the band is about. Perhaps for someone who has been following the band this might be an average album with some filler tracks. As for me who just met them this is killer and pure entertainment. The way heavy metal is supposed to be played with balls and fun. Get it! I was not disappointed at all and I am actually trying to get the rest of their catalogue. Guys, keep recording I keep buying!\n",
        "\nYou must know where you stand with Dream Evil by now, and their 5th CD, ‘In the night’ isn’t going to do anything to sway your view of them one way or the other. Fans of their brazenly silly take on heavy metal should gather with interest, while those of a more humourless disposition ought to run for cover.\n\nIt has taken them a while, but the 3-1/2 year wait for this CD – the longest ever between Dream Evil releases - after the excellent comeback-of-sorts ‘United’ has shown no serious visible effects on their way of doing things, and ‘In the night’ is another strong collection of songs that cover all the expected stopping points the band have established so far.\n\nThis general slowing down over the last few years – even if the rather tidy live/rarities compilation ‘Gold medal in metal’ no doubt took a bit of work to put together – maybe highlights the differences in priorities that saw Snowy Shaw depart back in 2006 (going from 3 CDs from 2002-2004 and only 2 in the 6 years since), but good things come to those who wait, and if patience is needed to keep the core of this band together then that’s the way it will have to be.\n\nStylistically, ‘In the night’ is probably closest to ‘Evilized’ (my personal favourite Dream Evil CD) in the sense that it has a little more variety in style than the others, and that it also is sometimes possessed of a slightly heavier, darker feel than its 2 immediate predecessors. Slightly less inclined towards the more epic songs found on ‘United’, there are a few more of a more straight-up, pounding persuasion, built on meaner riffs, such as the excellent “Frostbite”. Of particular note on this song is the solo, which is a really memorable bit of neo-classical widdling, which more than makes up for a slightly abortive chorus.\n\nUnfortunately Mark Black, the guy who stepped into Gus G’s not inconsiderable shoes, is gone after only one recording and has been replaced with Daniel Varghamne. I’m not sure where Dream Evil keep finding these extraordinary lead guitarists, but here’s hoping they manage to hold onto this one as surely they can’t keep unearthing these unheard-of gems forever.\n\nNeedless to say, he makes a massive contribution to the CD’s successes, starting with an immediate impression on the opener “Immortal” with a stunning, doubled-up solo. Niklas Isfeldt really re-affirms himself on this song too with a commanding vocal performance, not least when he goes it alone for a brief a cappella rendition of the chorus at the conclusion. This combination of powerful, distinctive vocals and colourful lead guitar have always been among the band’s best attributes and they play to their strengths whenever they can. The other members all play their usual rock-solid roles in providing rhythm, with Patrik Jerksten continuing to impress behind the kit with his flashy fills providing moments of character in place of flat predictability.\n\nSimilar scorchers to “Frostbite” include “In the fires of the sun” and “On the wind”, which rage with an increased sense of intensity, while “Kill, burn, be evil” is a bit more familiar-sounding, a fist-pumping anthem with a massive gang vocal chorus.\n\nSadly, despite all its strong moments, there are also some weak points that are actually among the worst efforts the band have made to date. The filter-effect intro to “Electric” doesn’t exactly start it on a promising note, and while it eventually gets going at the chorus, the sputtering guitar playing on the verses lacks any fluidity and adds up to a real misfire.\n\nBallads have never been this band’s strong point, with Snowy Shaw and Gus G the only members to be any good at writing them, so it’s maybe understandable that they’ve decided to finally just go for an outright piss-take with the lyrics this time around. Such an obligatory thing to include that they’ve just gone ahead and called it “The ballad”, the music is pretty tired and by-the-numbers. The lyrics offer an occasional snicker but it is too broad an effort at humour even for this lot, and it genuinely feels like Isfeldt is just making it up as he goes along. If they were really going through the motions as much as they seem to be blatantly admitting here then they’d really have been as well scrapping the song altogether in favour of something more wholehearted.\n\nHighlights are far more frequent than these pitfalls though, and in “See the light” they have come up with easily one of their best ever songs. Characterised by some killer 80s melodies and bursting with energy, it is capped by a truly superior chorus and another stunning bit of shredding from Varghamne, and stands out as the CD’s clear highlight. They also throw the fans of their slightly more power metal-ish early work a bone with the bonus track “The return” which, even ignoring the self-referential dragon-themed lyrics, reintroduces some of the Hammerfall gallop of their debut CD and makes shelling out the extra cash for the special edition version worth considering.\n\n‘In the night’ may lack some of the consistency of past efforts and as result doesn’t quite match up to Dream Evil’s best work, but there are so many individually impressive moments that it really doesn’t matter. Equally resolute in their contrasting philosophies of no compromise and laid-back humour, they remain purveyors of heavy metal in one of its purest forms, and for that alone there is reason to be grateful; long may it continue.\n\n(Originally written for http://www.metalcdratings.com/)\n",
        "\nThe not-too-bloody-serious Heavy Metal warriors from Sweden, Dream Evil is finally back with a new album, new guitarist and some new classic rockanthems. There is no real reason to worry when it comes to this band, they have found their style and I have a hard time to see that they will ever change it. We who know the band from before know this style. Wide-legged, simple, yet energic Heavy Metal with big choirs to get the crowd raise their fists and yell. This combined with some softer and more melodic tunes here and there...as usual! On top of it all we have the great singer Niklas Isfeldt, delivering ultra-cheesy lyrics dealing with the subjects steel and fire in the night of metal, always with a gleam in the eye.\n\nThe album is once again produced by the band’s guitarist and well-known producer, Fredrik Nordström. And let me tell you that the sound is fat and punchy, may be the best production of any DE-album so far. Niklas does a great performance as usual with the vocals, and is starting to sound a lot like Ralf Scheepers (Primal Fear) in the tone nowadays, and even does give some fantastic Halford-like screams in the chorus of “Bang Your Head”. His voice lay perfect in the mix, and the big background choirs does also sound very good. The good production does of course make the album very pleasant to listen to.\n\nWhat about the songs then? Unfortunately, the album is quite inconsistent. So everything isn’t great with the release, obviously. The album starts out neat however, with 3 awesome songs, and 2 good songs. “In The Night”, “Bang Your Head” and “Electric” does all deliver solid, classic Heavy Metal with no intentions to be technical or bandmembers overplaying – just simple metal that you can’t avoid to rock to and play the airguitar to. Album-opener “Immortal” is also a nice and heavy one, but lacks good chorus. “See The Light” is a softer and more melodic track, but has some catchy melodies and riffs. But from the fifth track, the album starts descending down the spiral a bit and loses the quality somewhat. Towards the end, 2 heavy songs return in the galloping “Mean Machine” and “Kill, Burn, Be Evil” with it’s great shout-along chorus. The album ender “The Unchosen Ones” doesn’t really work for my taste. An obvious follower of the debutalbum’s “The Chosen Ones”. Well, that song is way better. A quite ridiculous chorus destroys the song totally. It has some entertaining lyrics, though. They come in their right costumes when playing the a bit heavier stuff, and so it has always been.\n\nThe general feeling of “In The Night” is that it’s a solid piece of work, but not fantastic, and asbsolutely not bad. Dream Evil seem to aim at the glory 80’s days, the classic metal that was alive then, and they do absolutely succeed with it to a certain amount. So, if that is what you’re looking for, you won’t be disappointed with this album. It’s easily a shake-up compared with their last album “United”. Remember as I said, that the lyrics are silly at most times, but the band is 100% aware of that, compared with bands that actually are serious with these kind of lyrics. But don’t mind the lyrics too much, and just have fun and rock. That’s the best way to make use of the album.\n\n\n3 best songs: “In The Night” - “Bang Your Head” - “Electric”\n",
        "\nWhen it comes to a band like Sweden's Dream Evil, I've always been of two minds. The first mind is that they play a pretty fair quality brand of power metal, with a loud and proud polish, talented musicians, decent vocals, and a wealth of experience which helps translate their old school intentions into the modern world. The second mind is that they are another band who are almost entirely void in the creative department. That is to say, they are simply content with re-hashing the same old stupidity that might have felt novel in about 1983, but seems reluctant and redundant by the 21st century. I mean, just how many songs can we have out there with the titles \"Bang Your Head\", \"Mean Machine\", \"In the Night\", and \"See the Light\"?\n\nI understand the band's disposition towards glorifying and reliving the good old past of heavy metal, but for Christ's sake, put a little time and effort into more than just the music for once. I may have given the band a by for Dragonslayer or Evilized, since the idea seemed a little fresher at the dawn of the century, but by now it's just tired, and all the HammerFalls and Dream Evils of the world could do a lot by simply upping the ante in their lyrical development. So by now you can tell the absolute dregs of this album are the lyrics, many of which are atrocious tributes to the very style of music they play, and not even in a clever or sarcastic or funny way like some other bands do (for example, the Armour debut, or the over the top absurdity of Abigail or Metalucifer, which is so insane that it cycles through shit into diamond).\n\n'Just like lightning strikes a fire IN THE NIGHT.\nMetal is the only way\nThe devil's sign confirms you're ready for the fight\nBuilt to last and here to stay. It's electric!'\n\nFor one thing, you do not worship the devil. For another, WE GET IT. You are playing heavy metal music. Fight and kill for metal because the stereotype of metalheads being a bunch of sodden, beer-swilling jackoffs with an IQ of 12 is the one we REALLY want to last forever! Seriously, there is tongue in cheek, and then there is foot and mouth, and Dream Evil are wasting a fine pair of boots here to massage their tonsils with these awful lyrics. Now, I should be fair here and admit that not all the writing is quite so lame. That isn't to say the lyrics are ever good, but they often focus on other generic elements like wind and power and skies and the remainder of the power metal drivel we've all heard a thousand times.\n\n'Sometimes we get tired\nOhh...of being metal stars\nSometimes we get hired\nTo play on Jupiter and Mars'\n\nYes, those are actual lyrics...from a track called \"The Ballad\", which I suppose was titled for a sense of the profound. That is the level of humor we're working with...\n\nHaving already given myself a stroke over the lyrical content, I'm now going to admit that musically, the band is just as explosive and energetic as their debut, and quite talented at crafting simple riffs and blinding, melodic leads that will certain grasp your attention. The band still features three of its original members: Fredrik Nordström, Peter Stålfors and of course Niklas Isfeldt, whose clear and cutting vocals have truly become the mainstay for this band. His performance here is top shelf. You've got a few of the more thundering tracks here ala \"Immortal\", \"Frostbite\", \"Mean Machine\" and the raucous \"Kill, Burn, Be Evil\", which all have their moments in the spotlight, rocking fierce and hard even despite the derivative riffing which dominates them. \"On the Wind\" has a great melodic hook, like a Maiden with a lot of crunch, and reminiscent of older Dream Evil 'classics' like \"Children of the Night\". But of all the tracks here, it was probably \"In the Fire of the Sun\" that had me rocking the hardest, laid back and melodic but hard hitting like something Riot might have written.\n\nI can only imagine what the results might be if Dream Evil ever got off their duffs and composed some great lyrics, maybe even a concept album about something other than heavy metal itself... Their musical delivery is 100% professional, accessible and could earn them airplay just about anywhere that hard rock and metal still survive, and the songs are generally somewhat catchy. But, no matter what their intentions (and I am sure they are probably innocent), the lyrics here are simply awkward and embarassing, and represent only the dumbing down of an artform with few limits when properly applied. I'm all for having some cheese with my crackers (see my Metalucifer reference above), but replace that cheese with manure and they become a lot more difficult to digest, or even desire to begin with.\n\nHighlights: In the Fire of the Sun, Frostbite, Immortal\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThis is Dream Evil’s fourth full-length effort, and many are skeptical. Mainly because of the line-up change. Through this bands existence the band has maintained the same line-up. With Gus G. and Snowy Shaw both departing (arguably the most famous band members) this bands existence felt shady. \n\nHowever, you’re doubts will be dispelled rather quickly. Pat Power is a better drummer than Snowy Shaw (yes, I did just say that) and Markus Black is every bit as talented as Gus. G. An line-up questions need to be destroyed, because it’s not worth arguing. “Fire! Battle! In Metal!” opens the record, which is also the single. Another metal anthem to add to the Dream Evil collection and it’s a good one. “United” is my favorite song here, really good vocals from NIklas Isfeldt. The entire record contains amazing vocal work, like all Dream Evil records. “Evilution” is awesome in every sense of the word. This record has a similar feel to “Evilized,” it’s just much better. Not as much filler and it doesn’t feel rushed. “Let Me Out” is a speedy track with great drum work, cool bass from Peter Stalfors too. “Higher on Fire” and “Kingdom at War” are both mid-tempo tracks, both of them are nothing special but not bad. “Love is Blind” is one of the better Dream Evil ballads, which isn’t saying much but it’s good. “Falling” has odd lyrics, but the overall feel is speedy and heavy, which is nice. “Back From the Dead” and “Doomlord” are both repetitive and uninteresting, very disappointing and some of the worst Dream Evil songs. “My Number One” is a cover of a song from someone I’ve never heard, but it’s actually good.\n\nOne thing to notice is the improved songwriting. Mainly from the departure of Snowy Shaw, who did most of the writing for the band. New energy has been pumped into this band, and I love it. We all know previously the writing was weak, but you will enjoy it here. However cracks still show in songs like “Falling.” Overall though, much improved. The production is also improved over previous efforts.\n\nThis band got a kick in the ass and delivered. With the new members etching their names in Dream Evil history, and the much improved song writing this bands future is brighter than the sun. To be honest, you won’t be missing Gus G. and Snowy Shaw. There is a minimal amount of filler here unlike “Evilized.” This arguably the best Dream Evil record so far, worth a purchase if you’re a fan of the band or just checking them out.\n",
        "\n“Evilized” is the second album for the power/heavy combo Dream Evil. Now, after their solid debut “Dragonslayer,” I expected this to be a winner. However, that isn’t exactly the case.\n\n“Break the Chains” and “By My Side” open the album and drag you into a somewhat positive void with well written choruses and catchy hooks. At this point you think the rest of the album will be extremely good. Then, “Fight You Till’ The End” begins playing, and those dreams run into the negative zone. Tracks like “Invisible,” “Bad Dreams,” and “Live a Lie” all leave that bad taste in your mouth known as boredom. These are the inevitable skip tracks. “Evilized” is a nice song with a slower tone and soaring vocals we know and love from Niklas Isfeldt. “Forevermore” is the ballad here, with some cool piano playing. It does drag it a bit which can make it hard to deal with, but I wouldn’t call it bad. “Children of the Night” is one catchy track with good riffs from Gus. G and Fredrik Nordstrom, who play well on the entire album. “Made of Metal” has anthem written all over it, for good reason. What’s not to like about song, the chorus is catchy, it’s funny, and it’s about metal. Go figure.\n\nThe production is good, and the line-up is the same as the debut, so it’s solid. “Evilized” is hurt by the lack of overall depth and the “dark” tone of the record itself. Sophomore slump? I’d say so, mainly because their debut was so good. Overall this isn’t a bad album. Many songs are enjoyable, but most of it just feels weak and unpolished. If you’re a Dream Evil fan, you’ll like this but it won’t be your favorite, if you’ve never heard Dream Evil, check out any other of their albums.\n",
        "\nWhen you run into a metal band who’s main lyrical themes are warriors, dragons, self confidence, and metal itself, you know what this will end up being. Some uplifting power metal with nothing special to offer. We’ve all been there, finding a band that sounds and looks really cool but ends up being a disappointment.\n\nDream Evil’s debut begins with the song “Chasing the Dragon,” a catchy opener with soaring vocals from Niklas Isfeldt “In Flames You Burn” opens with a nice acoustic passage and blows up with bombarding drum work and heavy hooks. “The Prophecy” is a faster track, typical of the genre, but it’s still quite good. Of course, horses, steel, power, metal, and beasts are the lyrical them here. “The Chosen Ones” is probably this bands most popular song, for good reason. It’s the best on here with it’s ballad like feel and emotional tacks here and there. \n\n“Losing You” isn’t too bad, but it lacks the magic the rest of the album has.. “Heavy Metal in the Night” is one of the anthems here, which leads me to one of the oddest songs I’ve ever listened to. “H.M.J. (Heavy Metal Jesus) is about, well, a heavy metal Jesus. Without analyzing the lyrics, this song is absolutely nothing special. However, it’s so funny it’s hard not to like. Odd, but enjoyable. “Hail to the King” is also pretty good, but it also lakes quality like “Losing You.”\n\nThe Production is strong, everything is audible, no problems there. Snowy Shaw is here on drums. I’ve never liked Snowy Shaw, very overrated drummer. However, I must admit he does a good job here. Peter Stalfors is a great bass player, actually one of my favorites. Fredrik Nordstrom and Gus G. (whose considered to be one of today’s top shredders) are both fantastic guitar players. A great duo who perform well together, all the main riffs on this album are catchy in some way. As I mentioned earlier, Niklas Isfeldt is an amazing singer. His powerful, soaring, and productive voice drives this album to a new level. \n\nThis album is catchy as hell and will be stuck in your head. The overall feel of this is monotonous and somewhat overdone, but I suppose that’s all in the fun. This is a solid record and worth checking out for sure. Just try not to take it too seriously, great purchase.\n",
        "\nOnly recently have I been introduced to this powerful band, and I am extremely glad that I was. Dream Evil is a classic speed/power metal band that will bring harmony to the otherwise bland mass of utter shit (Waking The Cadaver, I'm looking at you).\n\nVocals: Niklas has always had a great voice, and on this album he bolsters that fact considerably. His voice drives powerful melody into the music, his singing soaring above and beyond the call of duty. His lyrics are sometimes corny, but it is a very small price to pay for being treated to his skill.\n\nGuitars: Fredrik and Daniel both crank out some great riffs in this album, the drop D tuning enabling them to add melody and still stay heavy throughout their songs. They command respect on this album with shredding solos and matching melodies that accentuate the vocals in a wonderful way. The soloing is not only fast and technical, but it also adds even more melody to the songs.\n\nBass: While Peter may not be high profile in the songs, he does manage to add some great atmosphere and add depth to the double bass rhythms grace this album. The basslines are flawless, and they flow very well with the music.\n\nDrums: Pat is a drum machine with a heart; his rhythms are powerful and perfect, and his beats will blow a hole in your chest. His double bass and snare patterns match the guitar very well, and proves to pump anyone up in no time!\n\nOverall: This is one of the most solid bands I have heard so far. All of the musicians are incredibly skilled and work very, very well with each other. The songs are very distinctive and original, with inspiring riffs and beats that will have you playing along happily.\n",
        "\nI've known about this band for a while, and have always been faced with a strange question, Are they a serious band or a joke band? I'd only head the title track of The Book of Heavy Metal, and Made of Metal from this release, and was constantly perplexed by the solid musical output, and the absurdly cheesy and over the top lyrics and vocal performance. So, after eventually settling on \"Joke band\" as my final decision, I pushed the band out of my mind. That was until recently, when I decided to show Made of Metal to a non-metal friend, assuming he'd get a kick out of it, which he did. But quite surprisingly, the next day he showed up with Evilized for me to listen to. So, a few days later, while bored, I decided to give this album a listen for a few good chuckles. To my surprise, I discovered that Dream Evil is a truly serious band, just a serious band that wants to have some fun sometimes too.\n\nDream Evil are a very streamlined band, they have their own little sound combining fairly simple Judas Priest/Hammerfall/(Insert fairly generic mid paced NWOBHM influenced power metal band here) worship with an assload of fun, and sadly, a large amount of accessibility too. There's nothing really wrong with being as accessible as they are, in fact I like the fact that they keep everything nicely in check so as to not risk being irritating, they’re just a little on the boring and predictable side after a few listens. They don't throw that many musical curveballs. Most of the songs are fairly midpaced, all of the songs have far too many choruses in them, all of the songs rely on a backbone of chuggier style power chord riffs, all of the songs are completely devoted to being catchy, with occasional bursts of shredding insanity, and all of the vocals are fairly big and powerful, but restrained so as to not annoy you, unlike the previously mentioned Hammerfall. Really, in some ways Evilized is a pretty average to poor album, because it is that redundant in comparison to many other bands, many of which don't make you worry that they're just pulling a big joke on you. But there is one thing on Dream Evil's side; This is about as fun as music gets.\n\nEverything is guided towards being a giant sing-along, the over abundance of choruses as I mentioned earlier being a major characteristic in this, but most of the songs seem to based at throwing the brilliant vocals of Isfeldt at you, with a nice supplement of catchy gang vocal parts. The vocals, which don't have the huge falsetto wails of later albums, are basically the only thing that jumps out at you on Evilized, the music is just so streamlined and tightly arranged that it really just showcase the vocals more. The solos are successful in breaking the mould for a few seconds, but again, they are so precisely placed and arranged that they don't really go anywhere; they’re just a few seconds of high speed notes to get you pumped up again.\n\nThe lyrics are pure cheese and goofiness, the songs have simple melodies that are addictive, as are the vocal lines which are delivered in a mid range wail as good as you'll hear, and most of all, it just never seems to take itself too seriously, it's just purely based around being fun. But despite being as care free as it is, it doesn't drop off into levels of straight ahead comedy for the main part like later albums. There's the well known \"I am his wiiiiife\" part, but that’s it, the rest of this album is straight ahead metal tastiness delivered with a cheery party-like attitude.\n\nThe music isn’t particularly gripping or heavy, it’s just good simple metal riffs that'll get your head nodding and your mouth smiling, and that's all the band wants to do, which is really where the band suffers; Dream Evil far too comfortable and content with what they do. They have no urge to aim higher than what they do, so they just don't really cut it for focused or repeated listens. It's a fun listen for when you just want something to happily bounce along to.\n",
        "\n(Note: I’m reviewing the Japanese version with the tracks in the “correct” order following the storyline and with the extra track Dragonheart)\n\nDream Evil’s debut has often been tagged as a ridiculously cheesy, over-the-top bunch of unoriginal, fantasy-driven songs. And while that tag is correct, they have taken this often bad recipe (e.g. Rhapsody) and turned it into something worthy of repeated listens.\n\nEverything that makes the standard power metal album is there: medium to high pitched and lean vocals, mid-heavy guitars, choirs, cheesy keyboards, lots of catchiness and a super clean production. But this album adds one more thing to the overdone formula and it’s its charm. Not the most exact explanation I know, but I can’t find a better one.\n\nIsfeldt’s vocals are very spot on and are a good change among all the Kiske and Kotipelto imitators that plague the genre. He sings mostly in a medium to high pitch and can definitely hit the higher notes without much problem, while he retains the super clean trait. A more poppish voice can be heard in Losing You, track no. 4 in my version, which by the way is an over-cheesy ballad.\n\nThe main thing in a metal album is and should always be the guitars, and here the team made of virtuoso Gus G. and the renowned producer Fredrik Nordstrom (who also took up keyboards) is very good. The guitar tone is very spot on and heavy but not over-distorted. To this heaviness also has contributed the slight but hearable down-tuning applied, probably to Drop D or Standard D. The riffs are rather unoriginal but still well executed and these guys definitely know how to write a bunch of songs, the main riffs in “Chasing the Dragon”, “Hail to the King” and “The Prophecy” can prove this by a long shot.\nThe soloing is handled by Gus G. and, as has been expected of him ever since, is top notch. While not innovative or revolutionary Gus can shred in a neoclassical vein or in a more “classic metal” way, both of which are fast yet catchy.\n\nThe last factor remaining here and the one which generates more controversies are the cheese and the funny stuff. The lyrics are on the cheesy side, and tell a typical story about chasing a dragon and fighting for your king etc etc, with the inclusion of “Losing You”, a ballad about losing a girl when going to his trip to kill the dragon. Needless to say, some mozzarella might actually come out of your speakers at this point. Also, for a lesson in cheese, check “Chosen Ones” with its huge choirs and march-like drum beats, while singing about how they are heroes now after killing the dragon and returning home victorious.\nThe fun is also there, especially in “Heavy Metal in the Night” but mainly in “H.M.J.”, short for Heavy Metal… Jesus. These lyrics are a complete lol, and are a must-read.\n\nThere is some filler however, like “Kingdom of the Damned” or the aforementioned “Heavy Metal in the Night” which despite the funny things seems less inspired musically than some of the other tracks. The band shows here and will confirm with later albums that they just can’t produce excellent mid-tempo stuff and should stick to the fast numbers in order to avoid writing complete filler.\nHighlights? “The Prophecy” along with “Chasing the Dragon” due to their extreme headbanging qualities.\n\nIf you like cheese in your daily metal, get this.\n",
        "\nAs far as I’m concerned, Dream Evil is the most overrated band in the power metal genre. This doesn’t necessarily mean that they are bad, they have an excellent line-up of top notch musicians, but the music they compose is very dry and predictable, not to mention lacking in the memory retention department. But if I had to pick one album that was really close to matching all the heraldry they receive, it would have to be this rather well organized and tightly arranged collection of 80s style power anthems.\n\n“Evilized” takes the same road as the other albums under the Dream Evil banner, keeping it short and concise, but puts a greater deal of emphasis on trying to give each song the ability to stand alone. If you were to hear the title track or the spooky sounding “Bad Dreams”, you’d have little trouble separating them from the massive collection of generic Hammerfall and Metalium sounding power metal efforts that populate their other albums. Likewise, even the faster paced album opener “Break the Chains” and the two similarly paced songs that follow it give the much needed attention to the riffs and melodies that make the genre work.\n\nUnlike the album that followed this one, Isfeldt doesn’t attempt any fancy vocal acrobatics, but sticks to singing something that sticks in your mind. Sure the banshee wailing heard in “The Book of Heavy Metal” is impressive sounding when it’s being heard, but it doesn’t shack up to the catchy, easily identifiable and triumphant chorus of “Children of the Night”, which still remains my favorite song by these guys to this day after 2 years of being exposed to them. Indeed, their greatest weakness is their greatest strength on here, as Isfeldt is what tends to carry most of this band’s stuff, proving that the parts are very often more than their sum.\n\nGus G’s guitar soloing is as subdued on here as it was on “Dragonslayer”, but it works better in this case because the songs are more tailored to the mainstream 80s sound exhibited by the Scorpions and Judas Priest, who are the two most active influences in their sound. I prefer Firewind to this project because I don’t believe in a guitarist of Gus’ caliber being restrained, but I must say that there are several points in the music on here where I can hear bits and pieces of “Burning Earth”, particularly the faster songs on here. For the best lead guitar work, look no further than the same song that has it won in every other category, “Children of the Night”.\n\nIf you have to own just one Dream Evil album, this would be the one to get. It lacks all of the comical, over-the-top nonsense that dragged down most of “The Book of Heavy Metal”, and it’s not quite as overt of a Hammerfall homage as their debut was. Although I’ve yet to hear “United”, I’d say with a good deal of confidence that this is the best thing that these guys have offered us. If you wonder what Judas Priest would sound like with Klaus Meine doing the vocals, this is pretty close to what it would likely sound like.\n",
        "\nDream Evil got a good deal of heraldry with the release of the album that followed this single, and a good amount of it came from non-power metal fans. At first I was at a loss for why people who normally listen to death metal, black metal, traditional metal, and melodeath all thought highly of this while there has been a mixed reaction from most I know who are core-power metal fans. But as I listened to this single a few months earlier, as well as the LP that it came before, I began to understand why this was.\n\nAlthough a fairly solid power metal band from their inception, Dream Evil is essentially a quasi-caricature of what most non-power metal fans view the genre as, unoriginal 80s cheese with little accounting for variation. The same way that this applies to their first two albums could also be attributed to Hammerfall, Metalium, Saxon, and even those who carry it the best such as Manowar and Lost Horizon. However, the famed “The Book of Heavy Metal” release lyrically and musically exaggerates this so much that it becomes a joke. When someone says that they don’t care for power metal but that they like Dream Evil (particularly this album), what they are saying is that they view the entire power metal genre as a joke and that that album is the greatest and most listenable culmination of that joke, which I personally take offense to.\n\nThis doesn’t necessarily mean that I believe Gus. G and company intentionally put out an album that would sell big and simultaneously self-satirize what I see as a great music genre. Like everyone else who plays power metal; they're in it because its fun, it’s a challenging style to master, and you don’t have to do something stupid or illegal in order to make the scene. It puts a greater emphasis on melody and something that can be recalled, unlike extreme genres which mostly tend to leave impressions and are easily forgotten due to needless complexity or toneless noise. \n\nThe title track of this single, which is also that of the LP that has been so popular, has been chopped up a good deal and listens extremely short even for a radio single. Yet they still managed to keep that ridiculous narration that makes Metalium’s spoken intros to their work sound like Dylan Thomas, to speak nothing for the comical and utterly ridiculous lyrics in the rest of the song. The vocal delivery is pretty solid Halford worship, but aside from that and a few well placed lead fills, this whole thing just oozes stale cheese, from one cliché riff to the next.\n\n“Tired” is another radio friendly track from the LP in question. Picture a heavier and more modern sounding homage to “Love at First Sting” era Scorpions, only a little bit more redundant and completely unoriginal. Gus G’s solo is way too controlled and constrained, which works against his style, a flaw that can be easily recognized when compared with the climactic nature of his lead work on Firewind’s first 3 albums. The non-album track “Point of No Return” almost sounds like a complete knock-off version of Maiden’s “22 Acacia Avenue”, no doubt adding to the implication by fans of this album that power metal is overtly derivative.\n\nDo I hate this band? No, they’re pretty good at what they do. I do, however, resent the claim that this band is the greatest representation of power metal, because that is about as far off base as saying that Metallica is the greatest and only representation of thrash metal worth listening to. If you like your power metal re-processed and cheesy, or if you hate power metal and want to make a statement about how you think that this is the best of what it’s capable of (which is an utter lie), then go ahead and pick up this single. If you like Dream Evil because you like the genre and they play a decent version of it, just pick up “The Book of Heavy Metal”, because there is some good stuff on there, but it is not the end all be all of the genre, either as it was 5 years ago, or as it is today.\n",
        "\nDream Evil is one of those bands that I can’t help but like, yet simultaneously be baffled at in terms of their appeal. There isn’t really much going on here that can’t also be heard on early Hammerfall, Black Majesty, Mob Rules, and The Storyteller; all of whom I would consider better bands. Vocalist Niklas Isfeldt does have the edge over Klaus Dirks and Joacim Cans in the power department, but other than that and Gus G. providing some exceptional soloing, they aren’t the greatest thing to happen to power metal.\n\nAlthough overrated, Dream Evil has had some brilliant moments, and a good deal of it is found on this EP. The best comparison I can make in terms of recent albums would be Hammerfall’s “Legacy of Kings”, which was also a heavy influence on the somewhat overdone “Book of Heavy Metal” that came soon after this. The songs avoid the hyper speed fury of Rhapsody and Gamma Ray, and stick mostly to conventional structures with a large emphasis on choruses, something not unique to this band and their basic style, but differing in levels of emphasis.\n\nThe EP’s title track “Children of the Night” is my favorite song by this band. It sounds like a heavier version of the Scorpions classic “Big City Nights” (great song), the lyrics are a cheesy variation on Dio’s poetic approach, but once you’ve heard it you can not forget it no matter how hard you try. “Dragonheart” is a mid-grade speed metal track that probably was a b-side from their debut album, where they sounded the most like a Hammerfall clone. “Betrayed” is a slower heavier number, but still listens somewhat lightly with Niklas’ vocals still invoking the spirit of Klaus Meine. The acoustic version of “Evilized” is vocally exposed, which works well for this outfit, and almost reminds me of Dio’s “My Eyes”, but without the electric guitar sections.\n\nIf you have to pick up a single release by this band but want to avoid the price of an LP, or you want to spend a little money to find out what you’d be in for with this outfit, this is the album to get. It is a perfectly happy medium between the dragons and magic of their debut and the dark imagery of their follow-up “Evilized”. If you want to skip ahead and get an LP, “Evilized” is the first to get, but I’d still recommend this one because the 2 unreleased songs are definite keepers.\n",
        "\nBefore they got into the whole metal as a religion craze and basically turning themselves into a quasi-tribute band, Dream Evil played power metal geared towards the rank and file Dungeons and Dragons metal head. One look at the album art on their debut draws up images early Hammerfall and Nocturnal Rites releases featuring armored warriors off to some epic battle with blazing riffs and blistering Malmsteen-influenced leads as their trumpet calls. Even the album’s ending track features an orchestra tuning their instruments before exiting (put this at the beginning of the album and you get NR’s “Tales of Mystery and Imagination”).\n\nMusically we get a fair mix of up tempo power metal riff monsters, mid-tempo 80s rock, Manowar true metal anthems, and even a cheesy power ballad in the same mode as Hammerfall. Originality isn’t really much of a concern with this outfit on any of their releases, but at least here they’ve avoided becoming the metal cult wannabes that try to write themselves into the book of heavy metal. Gus G’s guitar soloing is probably the most unfettered of anything he’s done outside of Firewind, which is a definite plus as his solos tend to get better the longer he goes.\n\nThe vocal approach on here is surprisingly unpretentious, mostly due to the lack of half-hearted attempts at invoking Rob Halford. Niklas Isfeldt tends to shine the best in his middle and upper-middle range, where he tends to sound a bit like a hybrid of Klaus Meine and Joacim Cans. When he hits the high notes it doesn’t sound forced and he is able to blend in well with backing vocalists during the choruses, something which a few bands don’t seem to quite be able to pull off well, particularly seasoned veteran Timo Koltipelto, who was likely an influence on Isfeldt. \n\nWhen considering the songs individually, everything is compact but well realized, except perhaps the ballad “Losing You” which drags on and brings out the worst aspects of Hammerfall’s hit or miss ballad approach of late. “In Flames You Burn” is fast and catchy, almost like a better produced “Where the Dragon Lies Bleeding”. “Kingdom of the Damned” has a solid opening riff, solid Priest emulation with a touch of knight-like gallantry. My pick for the best song on here is “The Chosen Ones”, mostly for the triumphant chorus which sounds like an army of Vikings chanting hymns of Valhalla. “Hail to the King” is also pretty solid; the riffs are a little be derivative of Hammerfall’s “Legacy of Kings”, as is the case with the speed metal bruiser “The Prophecy”, which sounds extremely similar to Nocturnal Rites’ “Pentagram”.\n\nAmongst power metal’s stronger 3rd tier bands is where Dream Evil hangs its hat, nothing original to speak of, but competent enough to rival many of their elders. “Dragonslayer” represents a less comical band that still knows how to have fun rather than sweat about sounding too much like someone else. If you want power metal with a bit more edge, Firewind and 1990s Nocturnal Rites would be where to go. However, if you do pick up a Dream Evil album, get either this one or “Evilized”, you’ll thank me later.\n",
        "\nOne thing I will definitely concede to this band, they picked a great album to name themselves after. Although one might expect this to listen like a Dio tribute band, the actual sound that Dream Evil puts forward is sort of a hybrid of “Screaming for Vengeance/Defenders of the Faith” era Judas Priest; early 80s Scorpions, and a strong helping of Saxon and Manowar worship. Niklas Isfeldt’s vocals are mostly a dead ringer for Klaus Meine, although he seems pretty capable of doing some Halford style acrobatics and can dirty his voice up more effectively than Joacim Cans, to whom he is often compared. \n\n“The Book of Heavy Metal” was clearly the most hyped of their offerings, as it was difficult for me to visit any metal oriented website that gave credence to their genre that didn’t feature rave reviews of it. Suffice to say, if you are lactose intolerant, I’d suggest loading up on extra Pepto Bismol if you plan on giving this a try. Between the Metalium style metal worshipping lyrics and Gus G’s somewhat cliché rock riffs, you’ll either run in fear of having your manhood questioned by the elites, or become indoctrinated and party like it’s 1985.\n\nThe songs themselves are definitely catchy enough to have staying power, but I’ve heard this style done better 5 or more years before by equally competent acts, most particularly Axel Rudi Pell and Dungeon. If I had to pick the most worthwhile sing along anthems from this collection I’d go with “Into the Moonlight” and “Crusader’s Anthem”, the latter of which has that classic Heaven and Hell/Holy Diver rhythmic groove that consistently works and is almost impossible to screw up. Isfeldt’s vocals and a solid production carry most of weight on these and most of the rest of the music, and although Gus G takes a more restrained soloing approach than his work with Firewind he also gives a little extra punch to what would ordinarily be pretty generic cheese.\n\nSome other songs are quite blatant tributes to other bands in both sound and subject matter. The title track is loaded with Judas Priest worship, perhaps a bit heavier than anything that exists in Priest’s Halford catalog, but the vocal work is clearly Painkiller inspired. Likewise, “Chosen Twice” sounds like one of those bombastic guitar harmony driven numbers the Scorpions were known for, while the closing ballad “Unbreakable Chain” can’t help but sound very similar to “Still Loving You”. I can’t fully knock them for their choices in influences, but sometimes these guys lose their own identity between their various chosen idols.\n\nAll in all, you can’t really go wrong with a band like this if you want a well packaged power metal sound with no apologies. Personally I’d check out Firewind for something a bit more exciting, more vocally and musically original and less concerned with paying lyrical homage to their genre. And if you still have room in your budget after checking them out, you’ll probably want to look into their first two releases, which present a good deal less pomp and a bit more intricacy in the riff and songwriting department.\n",
        "\nWith the first two albums Dragonslayer and Evilized, Dream Evil had established a very interesting (albeit cheesy) power metal sound. The group was solid and the songs were good, and the production was great. And there were plenty of great guitar solos to accompany this. But then the clunker known as \"The Book of Heavy Metal\" came down the chute, and it was a step backwards for the band. There were a few good tracks on it (like \"Into The Moonlight\" and Only For The Night\"), but it really was a downturn for the band. And then Snowy Shaw and Gus G left the band (plus there were various lineup changes that happened there, but then Niklas and Peter came back). I have to say I was skeptical that Mark Black could pull off replacing Gus G in the guitar solo department... But he does a damned fine job!\n\nThis album sees the band returning to a sound more like Dragonslayer and Evilized, and it starts off with the classic \"Fire! Battle! In Metal!\". Laugh all you want about the name of the song, (I know I did when I picked this album up), but on first listen you will be blown away. The band holds nothing back as they slam into your ears full force with this powerful song. This album is packed with songs full of great choruses and guitar solos, and unlike earlier albums, there's no songs I would skip. Even the 5 tracks on the bonus disk are just as good as the rest of the album, with \"Calling Your Name\" being good enough that it could've easily been the second track on the album.\n\nMy favorite song on the album has to be \"Let Me Out\". I was surprised at how well the lyrics were done for this entire album, but especially this song. The premise is that somebody sold their soul to Satan for success, fame, power, and all that, but then decided that it was a bad plan and he sold his soul too cheaply, so he recants and wants his soul back and to get out of hell. So, upon this being granted, he decides he wants success again and to rid his life of pain, so he sells his soul again. It's really well written and the music pairs up with it perfectly. The real standout track from this album.\n\nOther than that, the track \"Doomlord\" is very catchy and pleasing. They also do a very good cover of the song \"My Number One\" by Elena Paparizou. There's a couple of good laughs too from choruses like \"Higher on Fire\" and \"Blind Evil\", and the entire album flows very well but isn't so similar that you get tired of listening to it. And, as I mentioned before, the bonus tracks are all very good (at least the 5 US ones, I don't have the Japanese import).\n\nIt seems like Dream Evil has transformed nicely into a very good power metal band. I am pleased. Even though I do miss Gus G's epic guitar solos, for some reason the band seems to have fared well after his and Snowy Shaw's departure. Hopefully the band will continue in a fashion and release more material like United, where they just continue to improve on their sound and don't fall back into the rut they hit with The Book of Heavy Metal. \n\nIf you like power metal, or if you are leary of this album because you got burned out on Dream Evil because of The Book of Heavy Metal... Definitely pick up United. You will not be disappointed with it!\n",
        "\nYou know I had always thought that Dream Evil were just a laughably terrible band, that played nothing but cheesey, fluffy weak power metal. But after giving them a chance and listening to this album in it's entirety I realize these guys kick ass. I mean they have such a reputation of being cheesey beyond belief, but the music(at least on this album) is seriously good and seriously heavy most of the time. Lyrically they sound like they spent too much time in their parents basement playing D&D and listening to Sign of the Hammer, but it's all in good fun.\n\nThese guys are all great musicians as well. Some of the best, heaviest riffs I've heard from a modern band. And the drumming is always spot on. I do think their vocalist suffers a little bit from James Labrie/Joacim Cans syndrome, in that he has a pretty good voice and he's very technically sound, but he doesn't really have alot of range. And sometimes his voice is just TOO clear and comes off a little bland, but that's being pretty harsh because most of the time the guy kicks ass. And his sense for melody is awesome, tons of catchy as hell choruses to be found on here. \n\nI'll give a quick run-thru of my favorite songs off the album:\n\nThe aptly titled In Flames You Burn kicks serious ass, probably my favorite song on the album. After a nice little accoustic intro(their vocalist sounds great here) the song kicks into high gear and turns speed metal on us. Awesome verses and an even better chorus, this is really heavy, quality power metal here. Near the end the music kinda stops and a shredding solo comes in, awesome awesome song and one of my favorite power metal songs ever.\n\nSave Us is a nice heavy rocker like Chasing the Dragon only a little better, with a nice driving rythym. Although the vocal melody in the verses does seem a bit akward, they make up for it with great riffs and I love that part where he goes \"you got to fight!\" and a heavy chug comes in. Kingdom of the Damned is another great power metal song, very infectious chorus and some great riffs and melodies.\n\nThe Chosen Ones is incredibly epic, like mid era Blind Guardian in it's epicness. Very over the top, ridiculous lyrics but I love it. That solo is crazy, very inventive and with a great sense of melody. Heavy Metal in the Dark is about as cheesey as you might expect a song with that title to be. The verses have an awesome driving rythym that sounds like an army marching swiftly to battle. Some really heavy riffs and a nice vocal delivery. And Hail to the King closes off the album nicely, another heavy rocker.\n\nI would definetly reccomend this album to anyone who likes Hammerfall, Gamma Ray, Nocturnal Rites, etc. Just good, heavy power metal(not too fluffy because it still has some balls.) Just put this album in and rock out.\n",
        "\n...Dream Evil finally makes a really great album after the loss of Gus G and Snowy Shaw, two extremely talented musicians whose shoes weren't easy to fill. After two albums that were enjoyable yet rather lackluster overall, this is like a breath of fresh air, like coming up to the surface after a long time under the ocean. 'United' is surprisingly consistent for this band, which is a real shocker, considering how bland some of the songs on past releases were. Snowy Shaw is not around to dominate the songwriting this time, and maybe that's part of the reason for the change in Dream Evil's sound. The band has hearkened back to their speedy power metal roots here instead of going further down the 80s rock road, and it's a welcome change! Several songs here are amongst the best Dream Evil have ever done, all of which can stand up against catchy, melodic masterpieces like \"Chasing the Dragon\", \"Heavy Metal In the Night\", and \"Save Us\" from the debut. I think that's what this album was trying to accomplish. 'The Book of Heavy Metal' was a departure from their former sound, and this album, while not breaking ground, is an attempt to regain their footing and show that they can still pump out killer shit like the songs from the debut. And I daresay it succeeds in this respect.\n\nThe amount of really solid heavy metal here is stunning, and Dream Evil have created a very good album chock full of energy. This is very much the true sequel to the 'Dragonslayer' album, with no overly dumb lyrics (not to 'Evilized' level), and no butt-rock influence. Just about 50 minutes of poignant and energetic heavy metal that's bound to get your fist pumping. From the blazing \"Fire! Battle! In Metal!\" to the anthemic title track, and to...several other shining metallic crackers that show how damn good this band can be when they want. \"Blind Evil\" and \"Falling\" are volleying displays of heavy metal arrogance with a few of the catchiest choruses this band has ever done (and that's saying something!). \"Evilution\" and \"Let Me Out\" are darker, grinding tunes with some pretty damn cool lyrics for Dream Evil, very nice stuff. At the end we get two comedic tracks very remniscent of Edguy's newer work, \"Doomlord\" and the cover of Elena Paparizou's \"My Number One.\" The former has an insane Swedish rant in the middle of it (I wish I understood what he's shouting about) that reminds me of Edguy's \"Catch of the Century\", and the latter is embarassingly catchy, finding it's way onto my single playlist quite a lot.\n\nThere are a few filler-ish tracks here, like \"Higher on Fire\", but these aren't nearly as numerous or as bland as the ones on previous albums, with catchy choruses or riffs to back them up. And there are only two absolutely terrible songs, one of which being the lone ballad \"Love Is Blind\", which doesn't sound like the other DE ballads, but...worse, actually. Skip button fodder. \"Back from the Dead\" is just abominal, and I'm not sure how or why the band made a song this bad. It might be an attempt to be epic, but it fails horribly. Is this like some sort of sign that Dream Evil automatically suck when they try new things? I'm glad they didn't experiment too much on the other songs.\n\nThe musicianship here is slightly different from past albums, due to the lack of manic guitar shredding of Gus G. and the skin-pounding fury of Snowy Shaw. New guitarist Markus Black is certainly a formidable force, but his soloing feels more restrained, not as wild and acrobatic as Gus's. But then again, Gus is a prodigy, not many people can match him. Same story for new drummer, Pat Power (dear god, that is fun to say, what a great name). He's rather weak compared to Snowy, but he does an adequate job all the same and there's nothing at all to complain about. Snowy Shaw is a veteran, and not every new drummer will have that level of talent. I'd say both of the new recruits are doing an excellent job thus far, and Dream Evil certainly shows no signs of showing down. Hell, even the lyrics are better this time! This is quite a solid and delightful album, and essential for fans of the band (as it is their best output since the debut). Highly recommended.\n",
        "\nDream Evil is one of my favorite power metal bands, for some reason. A guilty pleasure, if you will. Their combination of catchy, powerful vocals of Niklas Isfeldt with heavy rock riffs, great drumming courtesy of Snowy Shaw of Mercyful Fate fame, and a full, modern sounding production that actually doesn't bother me too much here just...works for me. Dream Evil is the product of producer/bassist Frederik Nordstrom and (now ex-)guitarist Gus G, and this was their third outing. It gets shit on a lot for being too blatant, childish, and overly cheesy, and maybe it is all of those things. But I like this for the same reason I enjoy Edguy's 'Rocket Ride'---the fact that it is more fun then a fucking barrelfull of monkeys. Dream Evil may have outmatched the Metal Gods Manowar in terms of cheesiness and bluntness, but I like it anyway.\n\nOn this album, they took a new direction to their sound, going for a much more 'party-metal' oriented approach, and with about four songs out of the crop being dedicated to the greatness of metal/rock music. The songs are mostly midpaced with very heavy riffs for a power metal band (I take it that this is due to Snowy Shaw handling so much of the songwriting, as this is different from the other three albums they have), and all the instruments are played very well. Gus G.'s guitar shredding is amazing as usual, but here the riffs are much more rock-oriented, feeling slightly 'drier' then on previous releases. The choruses are arena rock fare, and they're quite a lot of fun, different from what I usually listen to at least. Some fans of more serious metal will be utterly repulsed by this goofy monkeying around, and it does have quite a lot in common with 80s hard rock, but if you just want a good time, then you should be able to listen to this without complaints or grievances. \n\nThe CD is pretty inconsistant, and that's what I don't like about it. We have some total killers like the title track with it's monstrous riffs and fun, singalong chorus, and the very solid and midpaced \"Into the Moonlight.\" We then dip into mediocrity with \"The Sledge\", and then we get another good one with \"No Way\", which still isn't even THAT spectacular. We come up for a breath of air with the best fucking song the band has done to date, \"Crusader's Anthem\", a fantastic midpaced melodic number with a stomping, hypnotic chorus and some great somber guitar lines. It's also the most serious song, lyrically, they've ever done, and I wish they tried this more often. Alas, most of their songs have this really joke-y vibe, such as the next one, \"Let's Make Rock\", which is surprisingly my second favorite song here. It's cheesy, with extremely stupid lyrics, and it's remniscent of the dark side of 80s glam metal, but it's catchy and full of this...attitude, that I've come to love about Dream Evil's music. It's hard to explain in words, but these songs are just so damn full of themselves and so completely arrogant that you can't help but grin on hearing them. \"Unbreakable Chain\" is a good ballad, maybe a slight step above the rest of the ballads Dream Evil puts out.\n\nWe then descend into more filler-ish stuff with \"M.O.M.\", \"Only For the Night\", and \"Chosen Twice\" (a ripoff of \"The Chosen Ones\" from the debut, just weaker). \"Tired\" is pretty good, but it's not the best the band can do. While \"The Mirror\" isn't great, it's got a cool chorus and some surprisingly good lyrics (well, for this band at least). So, that's the real problem with this album...the songs are catchy and fun, but nondescript. Every Dream Evil album has been like that, with a few great tracks and then a bunch of fillers, but this album is by far the worst example and the least consistant to date. They could've done much better, really, as I don't see the point in having so many lackluster fillers on every damn album these guys put out. Try harder, please.\n\nI like this album, though, as overall it's quite a fun listen. It might not be serious and it may not have philosophical, thought provoking lyrics, and maybe it's not kvlt and underground, but Dream Evil is the band I turn to when I want an easy listen, something that gets my head banging, my fist pumping, and puts a grin on my face. This album may be inconsistent, but I can overlook that, as it also has some of the band's strongest material. Highly recommended to Dream Evil fans and to those who can take a joke.\n",
        "\nAverage for 2 reviews is 97% on this album? What? Now, I like Dream Evil quite a lot, but the 90+ scores I give out are usually reserved for albums that break the mold and create something truly awesome, asskicking, or innovative, three categories which Dream Evil have not completely succeeded in over the past few years. Their music has been more fun then most bands of their ilk, and they've got a great group of musicians behind their name, yet they don't really exploit this to their full potential. They insist on making short and simplistic heavy metal anthems without much longevity or substance at all. I have no objection to writing songs like this, but dammit, can't Dream Evil at least pull off one gigantic epic to show off their songwriting skills? They certainly have the musical talent to make songs outside of their little mold, but they don't. I'm not asking for 70 minute prog wankery sessions, just for them to put their enormous level of musical talent to creating some sort of magnum opus of songwriting mastery, something that shows off every level of their guitar shredding and riffage combined with their acoustic passages, the powerful drumming of Snowy Shaw, and Isfeldt's amazing vocals. But they don't do this, insisting on staying firmly within their little rut of commerciality.\n\nThis album seriously pissed me off by the end of it's running length, and mostly because of the closer \"The End\", too. While that's not a bad song in the least, it's a ballad. And that says it all for those of you who are familiar with the band. Dream Evil's ballads are all interchangable with eachother. I know you hear that a lot about random other bands, but all of this band's ballads seriously sound EXACTLY the same, and none of them are that spectacular. This trend has continued throughout all four of their albums, believe it or not. It's actually the same thing with their fast songs, too, on this album, as none of them are that different from eachother. The whole thing is just so fucking generic that I took off about 5 points from the rating of this album. Everything is so pre-processed, so polished and run-of-the-mill that it makes you want to scream. Dream Evil have had this problem for a long time, but this album is by far the worst in that respect. The riffs are good and heavy, the choruses are perfect to shout along to, and the ballads are touching, but...it's all been done before! Even by Dream Evil themselves on their far superior debut album! And that's exactly what I hate the most---the ballads here sound the same as the ballads on the debut, and the faster songs here sound the same as the faster ones from the debut. It's like you could've just slapped this as a bonus disc onto that album and forgotten about releasing it as a full-length.\n\nAnother point of griping is that the lyrics SUCK. Their 2003 output 'The Book of Heavy Metal' had cheesy heavy metal worshipping lyrics that embarassed the more conservative fans of the genre, and those weren't nobel-prize winners, but the lyrics on this album take the cake for the worst lyrics I've ever heard from a metal band. I don't know what it is with this band in the lyrics department, but these lyrics are so juvenile, childish, and utterly banal. 'Evilized' as a whole album seems to have been meant to be a 'darker' album ala Helloween's 'The Dark Ride', but it failed miserably, as the lyrical storytelling presented in ''Bad Dreams'', especially, is more suited for children's campfire stories, if that. And \"Invisible\" seems to be some sort of 'oh, nobody pays attention to me' type bullshit. Absolutely pathetic. The lyrics of 'Made of Metal' are awful, too, but at least they make for a really funny song instead of trying to be evil and dark. I always claim I never pay attention to lyrics, but when I see something that insults everything good about English literature as much as the lyrics of these songs do, I have to put my foot down.\n\nNow, aside from all that griping, this album doesn't suck at all. It's got a handful of really good Dream Evil songs, and some that instantly click. \"Break the Chains\" has some very aggressive borderline-thrash riffage and a killer chorus. \"Children of the Night\" is probably the catchiest song the band has ever done, and it's the only reason I'm a fan of the band today, as I heard it at random and was instantly enamored. \"Invisible\" has these cool rasping vocals in the chorus, and Dream Evil have never done this before, so it makes this one surprisingly original. Too short, but one of their best songs. \"Bad Dreams\" continues the trend of trying to sound more sinister, and it almost works (only ruined by it's terrible lyrics), as this song just barely misses the mark for sounding 'menacing.' And \"Made of Metal\" is the goofiest song the band has ever written, bar none. I mean, how many other bands are as shameless to include something like that 'I am metal and so is my wife / I am his wiiiiiife! / SHUT UP!' bit in a serious metal song? It's so stupid and deriative of the entire heavy metal genre, yet it's funny as hell and I love it.\n\nThis is definetly Dream Evil's weakest album. Probably due to the fact that it was released not even a year after the debut, and was basically riding on the success of that album. It's generic, the lyrics are dumb, yet it's still fun and catchy. If you want Dream Evil's entire discography, then go get this, you'll love it. It's not a bad album, but the band can do better. As they would prove on their next two albums. Only recommended to Dream Evil fanatics, as the debut is much better than this.\n",
        "\nDream Evil have had a pretty tough time of it over the last couple of years. Founding guitar player Gus G. departed towards the end of 2004 to focus on his own band, Firewind, but was instantly replaced by the unheard of Markus Black, who swiftly won over anyone lucky enough to catch Dream Evil on tour with Saxon. It was over the following year or so that things looked as though they were in danger of falling apart – midway through 2005 Niklas Isfeldt and Peter Stålfors both left under somewhat mysterious circumstances before returning less than a month after their departures were officially announced. After several months of silence from the Dream Evil camp, it was drummer Snowy Shaw's turn to leave, followed by another long period of secrecy from the rest of the band. \n\nIn a sudden flurry of activity, they announced Shaw's replacement - the ludicrously-named Pat Power, and the CD under current scrutiny, 'United', was released shortly afterwards. After such a period of upheaval, including the loss of 2 virtuosic musicians and primary songwriters, I have to confess I was unsure of what to expect from Dream Evil. Thankfully, they haven't skipped a beat – listening to this record you would wonder what all the fuss had been about. The songs continue in the fashion of previous Dream Evil releases, and are almost exclusively of the very highest calibre. The choruses are powerful and catchy, the solos are flashy and Niklas' vocals have never sounded better. Indeed, listening to the uncharacteristic screams he pulls off on \"Back from the dead\", a casual listener would have no idea he had urgent surgery on his throat less than a year earlier. A massively underrated vocalist, Isfeldt is, in my little opinion, one of the absolute best in melodic metal and he takes many of Dream Evil's songs up a level with his fantastic delivery. \n\nIn something of a departure from the previous release, the widely-praised 'The book of heavy metal', the speed has been jacked back up to the levels found on the band's first 2 CDs for extended periods. The songs found here tend to shift between uptempo, soaring rockers and mid-paced anthems – in this respect the pacing is probably closest to 'Evilized', a CD I prefer to its somewhat unbalanced successor. Songs such as \"Let me out\", \"Blind evil\", and the utterly magnificent \"Falling\" all tear along at full speed. The latter 2 songs of these 3 both feature fantastic choruses that just demand to be sung – screamed – along with at full volume. \n\nFans of Dream Evil's more conservative numbers need not fear, however, as songs such the title track and \"Kingdom at war\" offer considerable mid-paced stomp with massive choruses along the lines of previous efforts such as \"The book of heavy metal (March of the metallians)\" and \"Chosen twice\". Indeed, \"Higher on fire\" is a track very much in the same vein as the previous CD's title track with the chanting choir vocals being almost directly transplanted – unfortunately, the chorus is a little weak and it does not match up to previous efforts by Dream Evil in this style. \n\nIn another departure – one I was inwardly hoping for – there are far less songs glorifying heavy metal music. 'The book of heavy metal' was a good offering and the over-the-top cheesiness was something of a breath of fresh air among the sea of deadly serious power metal bands, but had Dream Evil continued repeating this formula for another CD they would have been in danger of becoming a novelty act. Thankfully, we have lots of songs here about sword fighting, being evil and various other more comfortable metal clichés mixed in with songs like the excellent full-speed-ahead opener, \"Fire! Battle! In metal!\". The tongue-in-cheek tone is still to be found from time to time, however – check out the crazy rant in the middle of \"Doomlord\" or, God help us, the borderline-insane cover of Eurovision-winning \"My number one\" that closes the CD. \n\nSnowy Shaw's departure, after monopolising the songwriting on the previous CD, has clearly allowed the remaining band members to get back to what they were doing on their first 2 efforts, with a far greater balance over the songs – while the previous CD started to drag for me after several listens, 'United' is one that feels like it's over before you have had time to catch a breath. \n\nUnfortunately, apart from his excellent and inventive drumming, in Snowy Dream Evil have lost seemingly the only band member able to write a great ballad – \"Love is blind\" is a bit of a weak point here, more in line with the rather sappy Fredrik Nordström efforts of the first 2 CDs than the beautiful, powerful ballads Snowy contributed to the band's catalogue of songs. It also has to be noted that while the new musicians, Markus and Pat, deserve immense credit for filling the massive void left by their predecessors, they do not quite match up to them as players. Markus is an excellent lead guitarist, but just can't match up to the over-the-top shredding of Gus G. (few can) and Pat's drumming is slightly more 'generic' than the more unconventional work of Shaw. \n\nThese, however, are minor complaints against what really is an excellent CD. Dream Evil fans have nothing to worry about approaching what some may eventually come to consider their best release, and fans of catchy, melodic heavy metal will find themselves with an album of the year contender on their hands.\n\n(Originally written for http:www.metalcdratings.com)\n",
        "\nI'm a major fan of all of this band's work, but this album was much more hard hitting than Dragonslayer or The Book of Heavy Metal. In fact, if you put the songs Chasing The Dragon and Into The Moonlight onto this album... You might have one of the greatest metal albums ever. But, I digress. It's just odd, because Dream Evil is so very heavy for a power metal band. They may have cheesy lyrics, but you can headbang like crazy to this stuff. It's upbeat and fast paced mostly, and has blistering guitar solos and great vocals that are very unique. It also has some of the most fitting drumming ever, it flows so well with the music.\n\nThe album starts out heavy with a thrash like power metal song called Break The Chains. This is where we start to see the greatness of Dream Evil with amazing guitar harmonies coupled with keyboards. And Gus G lays down one amazing solo for this track (in fact, all his solos on this album and with this band are spot on).\n\nAfter this you get By My Side and Fight You Til The End, which are amazingly heavy and the latter of which has a very tastefully done chorus. After that is the title track which starts out with an clean arpeggio intro that goes into a very slow paced yet heavy song, which is a nice change-up mid album.\n\nInvisible and Bad Dreams are two more fast paced songs, then you get to Forevermore which starts out with this great piano intro that later has distorted guitars kick in over it. Then you get to Children of the Night, which is a standout track with an amazing intro solo and very well written lyrics.\n\nThen you get Live a Lie, Fear the Night, and Made of Metal. Nothing standout about them, but the last one has the best guitar solo on the album and some really hilarious lines. Namely: \n\nVocalist: \"I am so ****ing metal, and so is my wife.\" \nWoman: \"I am his wife.\"\nVocalist: \"Shut up!\"\nChorus: \"MADE OF METAL\"\n\nIt's just perfect, and very metal. These guys are the epitome of what metal is, to and through.\n\nThen you get the clean arpeggio outro track The End. Then you get slow and sludgy power chords at a decent tempo to carry this song until it is over. A very good way to end the album. In fact, the album flows so well I almost wonder if it is a concept album. But regardless, if you want a place to start with Dream Evil, this is the CD to start with. It will launch you head first into the band. It contains flavors of both Dragonslayer and The Book of Heavy Metal, while maintaining its own unique feel.\n",
        "\nFrom the very first word on Dream Evil’s The Book of Heavy Metal, you know exactly what this band is all about. They care about two things, playing heavy metal and the preservation of metal. \n\nDream Evil is, of course, the brainchild of Fredrik Nordstrom, one of Sweden’s most prominent metal producers, having done work with In Flames, Dimmu Borgir and the Haunted. Dream Evil is basically Fredrik’s dream come true, an 80’s style power metal band who not only has all the heavy parts in place, but a certain flair for melody in their style as well. Thus, with a producer putting the band together instead of the members, Dream Evil almost seems like the metal equivalent of a boy band. The difference is though, unlike American pop boy bands, this collaboration of musicians doesn’t suck. \n\nIn their third album, The Book of Heavy Metal, they have certainly proved that they can riff, solo and scream with the best of ‘em! The album is a testament to the power of heavy metal, and the band’s obvious love for their preferred genre. The album won’t win any awards for its lyrics… \n\nLet me hear - it loud and clear\nA sound of steel that pierce my ears\nThis is my Achilles heel\nI want an overdose of steel\n\nA lasting first impression\nright there I was crushed\nBy the sledge of rock (rock!) \n\nBut it’s clear that this band is truly talented and not together to write masterpieces that will be forever cherished as “classics”, but a band that just wants to get together and have a little fun with metal. A combination of songs that praise rock music, traditional 80’s style metal love songs and other similar styled songs draw a heavy influence from the works of classic rockers like Judas Priest, Iron Maiden and the other metal gods from the time when metal ruled the airwaves. \n\nThe album begins with “The Book of Heavy Metal”, the album’s title track. It kicks off with a Halford-esque scream followed by a grinding, aggressive guitar riff that any metal fan needs to love. This will set the tone for the next twelve tracks you are about to hear. The song itself is simply about how the band wishes to only be remembered for one thing, to be written in “The Book of Heavy Metal”. It’s this kind of masochistic love of metal that makes DE (Dream Evil) truly “charming” in their music. The song itself is very catchy, aggressive and hokey all at the same time. If this song won’t get you hooked on the band, then I fear nothing will. For five minutes it hits you with its relentless metal assault, with a slow, driving beat, a high-soaring vocalist complemented with the aggressive roar of “In the book of heavy metal” makes for a wonderful balance that any fans of the genre should be able to at least get a little smirk out of, and it also happens to be my favorite song on the album and a nice one to use to hook your buddies into Dream Evil’s world of power metal. I know it hooked me pretty well. \n\nThe second track, “Into the Moonlight” is a traditional power metal romp. It starts with an aggressive riff and some nice complements. The song is cookie-cutter power metal at its best. Slow lyrics combined with an aggressive beat and a catchy yet beautiful refrain comprise this nice little tune. Not the best on the album, but certainly one of the tracks that will be stuck in your head when you’re done listening to the album. \n\nOn “The Sledge”, Dream Evil shows their true inklings. A short, fast, aggressive song about the band’s love of rock. This is quintessential Dream Evil. A nice headbanging rock that will have you yelling “ROCK!” in response to the refrain. It’s just a fun song, nothing more nothing less. \n\nTwo songs about how great rock music is in a row? Have I died and gone to metal heaven? “No Way” is another typical short and fast DE song, but that isn’t bad in the least bit. This song definitely has a throwback feel to it. With one of the best Ozzy Osbourne impressions I’ve ever heard with riffs and solos I could imagine being on a Megadeth album in the 80’s, Dream Evil truly shows off their devotion to their craft. \n\nThey turn it down a few notches on “Crusader’s Anthem”, harkening for a slower rhythm and a bit more technical sound than the previous frantic tracks. It’s a bass driven song that sounds like it could be taken from the Iron Maiden playbook. The lyrics are much more poignant and meaningful than the average DE song. Although at a only 4 and ½ minutes, this definitely has a more epic feel to it than the most other DE tracks with a strong, almost choral sounding refrain and a more melodic, emotional feel to the entire song. \n\nWith a title such as “Let’s Make Rock”, you should know exactly what you’re about to get. Almost sounding like a heavier version of earlier Kiss, this is another song which praises how great metal music is… do we see a trend here? This is just another simple track, but very catchy and will stick into your head long after it’s over. Surely after hearing this you’ll agree that “making rock” is a worthy pursuit. \n\n“Tired” is the next track, and probably one of the best on the album. It kicks off with a nice solo that should have you headbanging immediately. After that, it turns into your typical 80’s love and loneliness themed song, but it’s got a great combination of quieter and heavier parts, and Niklas’ voice fits the song perfectly, along with their powerful backup vocals. The song also has some very nice guitar and bass work all through it. It really is a fine song. \n\nThe choirs of metal arise for “Chosen Twice”. Seriously, what is an 80’s metal CD without some track where a choir sings the refrain? This is one of the slower tracks, starting with a much more melancholy sound than the other songs on the album. It keeps the downtrodden feeling throughout the entire song and is probably one of the least energetic, but still aggressive song on the album. A much deeper, slower piece than most of the album. It’s really strays from the rest of the album, and is a unique track. Not one of my favorites, but something that will appeal to more prog metal crowds than the rest of the album. \n\n“M.O.M” is your heavy metal war anthem, in the tradition of Accept’s “Balls to the Wall”. A classic progression of vocals/guitar/vocals/guitar and a catchy war cry of “Are you a man or a mouse?” and this old school metal romp is complete. \n\n“The Mirror” is another excellent track, and definitely one of my favorites. It begins with a deceptively calm tone before the song breaks out into its metal fury. What proceeds is a plethora aggression, anger, self doubt and metal. I believe this song has more emotion in it than most of the others on the album. From the tone of Niklaus’ voice to the almost haunting guitar solo, this song is definitely one to remember. \n\nAn awesome riff starts off “Only for the Night”, but don’t be fooled, this is another one of their kinder, gentler pieces. This song is a nice mix of slow, calm, soothing heartfelt music and vocals followed by a high soaring refrain. Everything about this song sounds very sincere. It’s a very nice example of how the theme of a song doesn’t have to be aggressive just because it’s metal. \n\nThe album, in this reviewer’s opinion, ends on more of a whimper than a crash though, as “Unbreakable Chain” pulls the album to a close. After 11 tracks of the best tribute to 80’s style power and thrash metal, I don’t think this slower, calmer monster ballad does the band or the album justice. It does have a few heavy parts, but if this song had appeared early on in the album, I think it may have been more effective. Ending the album with this song just doesn’t feel like the proper final chapter to The Book of Heavy Metal. \n\nOverall, this album is a testament to how a positive sound can come from the general negative energy of heavy metal. These guys just sound like they want to have fun and rock, and that’s where my true attraction to this album comes from. It’s just a fun album to pop into your CD player, get a few smirks from the lyrics, sing along with some of the cool ones and bang your head to. It’s not the most technical, heavy or intense album to come out this year, but it’s just good fun rock & roll.\n",
        "\nWell, this latest album from Dream Evil has got me scratching my head. Is it the same band doing all these songs? The vocalist sounds like four different people in one. The Book has chapters of party rock (Let’s Make Rock, Only For the Night), traditional metal (title track, No Way) and power metal (The Mirror). When you open the booklet, these guys look so tough and metal and … something else. That face paint really ruins their image, dear Lord I am gonna puke, just had a Mudvayne flashback. \n\nThe opening title track is a thumping mid-paced Ac/Dc-like headbanger, also released as a single. The guitars rip the place apart, then there is a nice break with “to be or not to be”. The vocalist delivers so much power in his voice and electricity in his screams detonate on impact with the speakers. “Metaaaaaaalllll”. Fuck yeah. \n\nThe spectacular entries are the ballads. They have a similar vocal delivery and here is where Dream Evil demonstrate their uniqueness. Crusaders’ Anthem – catchy anthemic track with slow pace picking up into a sing along chorus. This is a song that will be most likely to stay with you after the first listen. Two tracks down- Tired, opens up fast, again the instruments slow down for the verses, and reappear at the chorus. Really catchy stuff, the vocals carry both tracks, a la Avantasia. Also, the closer Unbreakable Chain – this one is a pure ballad, with soaring vocals and instruments somewhere in the background, however the whole thing is so well orchestrated that it turns out as the epic track on the album. \n\nThe album is consistent; there are no glaring skippers. It sometimes does feel that some tracks do not belong due to different vocal styles adopted and due to not bad music in places, just a mediocre and pedestrian one (see party rock tracks). The overall result is that the gut-wrenchingly beautiful is placed so close to simplistic and a little too simplistic, and right now I am pissed off at what could have been.\n\nRecommended, I am left intrigued with Dream Evil and will check out more of their work.\n",
        "\nNormally im not a big fan of power metal, infact i loathe it, but this is one of the few records that has won me over. I dont know why, but Dream Evil just have this brilliant, catchy and cheesy style of music that you cant say no too. Where this album does it for me is that i dont think they are taking themselves seriously in their cheesy lyrics( see Heavy Metal Jesus, The Chosen Ones, Heavy Metal in The Night) as opposed to other bads ie. Blind Gaurdian. \n\nThe instruments arent playing anything ground-breaking however they know how to write a great riff, such as The Profecy and Heavy Metal in the Night. The drums have some nices kick patterns in Save Us and are constant throughout. The vocals are my kind of power vocals, the ability to sing in a relativly normal key( ie. not 3octaves higher) however songs like Losing You do nothing for me.\n\nAll in all this is a good cheesy, mostly fast paced offering. Where as i cant stand Blind Gaurdian bands as such because of their stupid lyrics, choir vocals, hyper speeds and serious attitude, Dream Evil play a more 80's fast catchy and definatly tounge in cheek brand of Power/Heavy metal.\n",
        "\nBy now I'm sure you know who Dream Evil are but just in case you don't I'll say this, cheesy metal with big name metal producer Fredrik Nordstrom, ex-Mercyful Fate/King Diamond drummer Snow Shaw, and guitarist of a million bands Gus G. \n\nThis new album is the obvious progression for Dream Evil. The band started out on Dragonslayer in 2002 playing straight up power metal with moments that harkened to the 80's that was much too cheesy for some (Heavy Metal Jesus anyone?). Last year the band came out with their new album, (less than a year since the first was released) Evilized, which pushed the more traditional 80's metal elements to the forefront, sounding less like Hammerfall and the like. Now here we have The Book of Heavy Metal, there is NO power metal here. Yes, that's right, none whatsoever. \n\nThis album is pure straight up 80's heavy metal. Think early 80's Judas Priest, with a heavy leaning towards British Steel with some touches of Manowar and Def Leppard (most notably the track Let's Make Rock). The lyrics are still cheesy as all hell too, I mean just look at Let's Make Rock, The Sledge, and the title track. The cheese isn't really a bad thing and I know I never hated that element of their music but I know MANY people who find the cheese element too overpowering. \n\nAnother thing to take notice of with this album is the lack of speed. There are no fast double bass songs here. For some this might make things a bit boring but there is still dynamics on the album and it never feels like the songs are running together. \n\nI think this review is long enough already but just to give a bit better idea I'll say that with this album you will get a solid heavy metal album. From Judas Priest to Ozzy (some of the vocals in No Way) to even a touch of arena bands (Let's Make Rock). \n\nIt's a good, no frills heavy metal album that you can lose yourself in, headbang, and feel the power of metal.\n",
        "\nDream Evil was my favorite power metal band back in 2002 when they released their debut Dragonslayer. They used to be an heavy/power metal type band wiho would differentiate itself from other such bands by their impeccable musicianship and especially their vocalist Niklas Isfeldt who would sing much lower than most power metal vocalists (read: Hammerfall's, Blind Guardian's, Stratovarius', etc.) Their sound evolved into an heavier form with Evilized and pursued a similar direction with The Book of Heavy Metal. \n\nThe title is not lying, this album is real heavy metal, the underlying powerish side of the band resurfacing only in the few ballads. Other anthems like 'Let's Make Rock' and 'The Sledge' go all out worshipping classic 80's heavy metal. What is there else to say? They stick to the tried and true formula and dish out some solid songs album after album. Accomplished drummer Snowy Shaw keeps it interesting (especially in 'No Way'), guitarist and producer Nordstrom knows how to make every instrument sound clear and this is how this kind of music sounds best. Gus G rips out some interesting solos. He may be the only young member of the band but he sure sounds as experiences as the rest.\n\nSo while this band really impresses me with the quality of the guitars and drumming, I'm a little disappointed that Isfeldt is singing higher than in the previous albums in the Book (though he keeps it varied - he has a nice range), and it doesn't look like the band has someone with a talent for writjng lyrics - they're as cheesy as ever. Not necessarily in a bad way though as Dream Evil are obviously not taking themselves seriously and are just about playing solid classic heavy metal like very few bands play anymore today. They're not better than Priest or Maiden or Jag Panzer on Ample Destruction, but it's always nice to hear a fresh new band playing heavy metal like it should be played. \n\nOverall, this loses points for having so many ballads but this just means there's room for improvement and as long as Dream Evil churns out some of these solid riffs and melodies they can count on my support. I wouldn't say that the Book is an essential of its genre but it's an album that anyone who likes classic and power metal should get - I don't see anyone being disappointed.\n",
        "\nOk guys, are you ready for one Hell of a mix between Power Metal and Traditional Metal? because that's what this is. But then again, what can you expect from Dream Evil, who brought us the instant classic \"Dragon Slayer?\" I have a feeling that these guys are going to remain very consistant throughout their career.\n\nWhat we have here is a beautiful mix of songs. There are a couple of fast songs thrown in between a larger number of faster tracks, ensuring that this album will not bore you. I find it very easy to listen to the entire CD in a single sitting. The guitar work is amzing. Gus may be a young guy (22 years old I believe), but he is one of the best guitar players I have ever heard. The solos that he performs will leave you gaping. The rythm guitar and bass hold the beats steady throughout the song, with no fuck-ups to be found... and they are excellent beats, I must say. Ya know, the kinds that will stick with you for a long time after you've turned off your stereo. The very clear recording also adds tot he effect. Snowy Shaw's drumming is simply stunning. I guess he's had enough practice after playing with Mercyful Fate, huh? He actually uses complex beats unlike some other drummers (like Jimmy DeGrasso, Megadeth's current drummer), to help spice up the song. Listening to his fills and short solos makes you wonder how a guy can move his arms about so fast, using such a small drumset! The vocalist fuckin' blew me away. He is definitely one of the best I've ever heard. For the quieter songs, he is able to make his voice nice and soft, and for the louder, faster songs, he can make it fittingly intense. The chorus parts in the songs are extremely catchy, and I garuntee that you will be humming them to yourself even days after you've listened to the CD. They will undoubtedly stick with you for a looong time.\n\nOverall, this is just an awesome record. If you are a fan of the classics like Iron Maiden and Judas Priest, or if you are into Blind Guardian and such, this is record is a must-have.\n\nSTAY EVIL!!!\n",
        "\n Based on the music, this is a fantastic album, one of the best power metal albums I have heard and probably my favorite album so far of 2002. It does have a couple of weird flaws that I will detail later.\nThe music is top notch, especially the great guitars with lots of fast and intricate work throughout. The singer is also very good. At no time was I left needed more musicianship.\nA few of the lyrics seem to be Christian themed and certainly the song \"H.M.J.\" (Heavy Metal Jesus) is Christian themed. However it's not preachy, I don't even call it Christian metal, it's just there. If you are a Christian you will probably appreciate it and if you are not Christian you will probably not notice it. \nThe songs together tell a tale, not so oddly about hunting and killing a dragon. However the songs seem to be out of order. In #1 they spot a dragon. In songs #2-5 they are fighting and chasing the dragon back to it's homeland. In song #6 they return home conquering heroes having killed the dragon. Then in song #8 they are back arriving in the dragon's homeland ready to fight it, this really confused me. I think song #6 should be at the end of the album. The song in question is \"The Chosen Ones\" and is the best song on the album so perhaps they sacrificed the storyline to move it to the heart of the album.\nAs stated above \"The Chosen Ones\" is the best song on the album, it's theme about the glory of conquering heroes is a recurrent theme in power metal and one that I personally cannot get enough of. \"Chasing the Dragon\", the album's opener is also stand out as is \"Losing You\" the album's power ballad. In several places the word usage on the album is odd, I think the lyricist might not have a complete grasp on the English language. The lyrical themes are of might, glory and dragons found so often in power metal. These types of lyrics usually have people loving it or hating it, I am sure you already know to which category you fall. Personally I love it.\nPointing out the couple of small flaws is just nit picking on my part, this is a phenominal album and if you like power metal you should pick this one up.\n"
    ]
}