{
    "Band Information": {
        "Country of origin:": "Austria",
        "Location:": "Vienna / Salzburg",
        "Status:": "Active",
        "Formed in:": "2011",
        "Genre:": "Post-Black Metal",
        "Lyrical themes:": "Depression, Suicide",
        "Current label:": "AOP Records",
        "Years active:": "\n2011-present ",
        "Number of Reviews": 7
    },
    "Band Reviews": [
        "\nAfter three years, Harakiri for the Sky came back with a new work that at first I thought would be a continuation of Arson, where I supposed that I would find a very similar sound. However, I came across something that, although it has similarities with his previous work, is not the same.\n\nMære is the new work of the Austrian duo where I notice two main points: the emotion of the lyrics and the long duration of the songs. With the first I can affirm that they comply in every way. The first song called I, Pallbearer is huge both musically and lyrically, where Michael shows brutal honesty, as if he were relating his personal diary.\n\nThe work on the guitar is very solid, especially in the solos that, although they get to be quite long, are effective, they perfectly fulfill the emotional role of the album. The work on the drums is probably what stands out the most, Krimh is an excellent drummer. Sing for the Damage We've Done is probably the roundest song on the album, with no glitches, no ends, no loose ends, and it's the one I also enjoy the most.\n\nAlthough I have to admit that while I have enjoyed listening to this record, it is not even close to the best they have done. Mære has left me with a bitter taste, where I am thinking about what could have been, about the best that this job would have been. It is something common in Harakiri for the Sky that the songs are of long duration, it is something marked in their style, but in this work they abuse that resource to the point of creating long intros, lengthening the tracks too much with riffs and solos that comply with the tragic setting of the album, but they become very monotonous.\n\nSomething that if I get a little annoyed is how guitar solos are used as mere decoration, but not only in a section, but in an entire song. Such is the case with Us Against December Skies, which has incredible riffs, but goes too far. It is the same with Three Empty Words, which is a beautiful song but also sins of being unnecessarily very long. I find more sense in that the song that closes the album, titled Time Is a Ghost, has that elaborate introduction, since it is the preamble to the closing of this work, although of course then we find the surprise of a cover of a Placebo song , called Song to Say Goodbye. \n\nMære is a complete work, but it sins of being excessively ornate, extensive and quite redundant on some occasions, but despite all that I have enjoyed it. If this album were fifty minutes long, it would be so much better. Sometimes, less is more.\n",
        "\nThere are periods in our lives that are defined by the art we consume. Whether that’d be a movie, a videogame, or in this case, an album. Harakiri For The Sky’s III:Trauma came in my life during a transitional period, and has since become one of my favourite albums. The music and themes presented through it resonated greatly with me, and have stuck with me for the better part of the last 4 years.\n\nThis album marks the point where the band truly comes into its own and establishes the trademark sound they’re now known for. The songs ooze atmosphere thanks to acoustic instruments that are used sparingly to punctuate the more emotional moments. That being said, the album is far from being a riffless affair like most of the albums permeating the post-black subgenre. There’s a slew of aggressive tremolo riffs that wouldn’t feel too out of place on a black metal release, and they’re often interlaced with subtle melodic leads that really help elevate them to the next level, like in the track “Thanatos”, which is arguably the record’s greatest moment. Their all around excellent grasp of dynamics is also worth noting, seeing as every piece flawlessly shifts between calm introspection and raw aggression, which is particularly noticeable in tracks like “The Traces We Leave” and “Viaticum”. The excellent instrumentation serves as the backbone of the whole experience, and drives the album’s themes home.\n\nBut what truly delivers the emotional weight of the project is the lyrics. On a surface level, it’s about an unnamed protagonist trying to unsuccessfully cope with the loss of a loved one, but it’s the emotions that are explored throughout that truly resonated with me. It’s all driven forward by nostalgia and ruminating on the past, as well as a general feeling of isolation and estrangement in the world, which, at the time of listening, were things that struck a chord with me. I can still remember the first time I listened to “Thanatos”, which is what prompted me to listen to the entire album, and in turn led to me diving into the band’s catalogue.\n\nThe production is also worth discussing, since there are some subtle differences that set this album apart from the ones that followed it. While the guitars do maintain that light ethereal sound that is common to the genre, the drums and bass are quite punchy, with the bass in particular standing out for its rattly tone, which isn’t present on subsequent releases. It really helps enhance the album’s more mid-tempo moments, as well as add another layer to the songs.\n\nIII:Trauma is a marker for me. It defined a very important period in my life, and listening to it always takes me back to it. It’s one of those albums that I value not only for their musical quality, but also their emotional resonance, and such albums are few and far in between for me. I could spend hours talking about how important it is to me, but I still would fail to competently put my feelings into words. Give this album a listen if you haven’t already, you won’t regret it.\n\nHighlights: Calling the Rain, Thanatos, The Traces We Leave, Viaticum\n",
        "\nAfter 4 months of waiting and 1 delay it's finally here! Harakiri For The Sky's Mære has without a doubt been my most anticipated release of the year so far and I'm pleased to be able to review it. I've been following these Austrians' endeavors since 2018, having gotten into them through their 2016 effort, III:Trauma. 4 years and 1 live show later, this is the first \"fresh\" release of theirs I've actually experienced the release of, singles and all. It is with great pleasure that I say that it was worth every second of the wait, with the band delivering another fantastic album where they further tweak and improve their sound.\n\nThings start off on a very strong note with \"I, Pallbearer\", which, following a lengthy buildup, launches immediately into one of the band's trademark spacey tremolo riffs. It has no shortage of cool moments, but the most notable are without a doubt the one at 3:19, where the band layers the lead and rhythm guitar, decorated by gentle piano notes and double bass, as well as the piano section that ties the entire track up. It flawlessly sets the tone for the entirety of this release with its emotional intensity and haunting instrumentation. Another notable track on the first third of the album is \"Sing for the Damage We've Done\", featuring Neige of Alcest fame. His presence on the song is mostly limited to its final quarter, but his delivery there fits perfectly. From his ethereal cleans at 4:59 to his raspy shrieks at 6:35, he only serves to further the song's emotional potency.\n\nThe midsection of the album is where things fall off ever so slightly, and that's because of one song: \"I'm All About The Dusk\". It is not terrible by any means, but the fact that it maintains a slow tempo for most of its duration, alternating between slow riffs and acoustic guitar/piano sections makes it drag a little, slightly blemishing an otherwise perfect album. The band has an expert grasp on dynamics and varying tempo, and it's a shame to not see those show up on a track that is in dire need of them. It still has some nice moments in it, like the section at 4:01, with the piano keys melding with the guitar lines, and a really cool bass segment at 9:04, but those are few and far in between. Thankfully, it's followed by \"Three Empty Words\", a much more varied song that is among the best tracks on offer. It has the dynamics the previous song lacked in spades, with sections like the acoustic guitar being played over a slow riff at 2:19, and the lead section with the driving double bass underneath it at 8:34, ending with a short acoustic section shortly after.\n\nThe final third of the album sees the band sticking the landing, with two very strong songs bookending it, \"Silver Needle // Golden Dawn'' and \"Time is a Ghost\". The former of the two features Gaerea's vocalist (who we will refer to as John Gaerea), with whom Jay trades vocal lines in some of the verses. John Gaerea’s deeper growl provides an excellent foil to Jay's mid-ranged shout, creating an interesting vocal dynamic between the two. That being said, the vocal performances aren't the only thing on offer, with the song having quite a few cool segments, like the mid-paced riff that comes in after the intro at 0:30, or the lead at 5:45, which is underpinned by the bass. \n\n\"Time is a Ghost\" is the album's final original song, and its tone fully fits that of a closing track. It follows a similar structure to the rest of the album, ebbing and flowing between faster and calmer sections. The song progressively builds up to a powerful climax, thus bringing the album to a close.Placebo’s aptly named “Song to Say Goodbye”, acts as an epilogue, continuing the trend the band established since their debut.The song is the same as the original structurally, but the band's performance transforms it into an entirely different beast. The song feels desperate and chaotic, in stark contrast to the original's melancholy vibe. It also surprisingly enough doesn't ruin the finality of the song that preceded it, seeing how it fits in the general concept of the album. \n\nWhich brings me to another notable aspect of the album, the lyrics. They've remained largely the same, with the band writing about mental health, depression and addiction, but the overarching theme of the album is that of loss. Every song talks about some aspect of loss, particularly that of people growing apart from each other. There's this feeling of nostalgia about what was, ruminating over what could've been. All that is passionately delivered by Jay, who employs the mid-ranged shout he has utilised in the band's previous works, which, coupled with Krimh Lechner's fantastic drum performance give the lyrics an even more manic and intense character.\n\nThe production on the album is not all that different from what we've heard on the band's previous releases, with ethereal guitars accentuated by a rumbly bass, with the drums having a crisp sound, and with the atmosphere being further enhanced by the reverb applied to the instruments. The mixing is also pretty good for the most part, especially during the busier sections where other instruments join in, with everything being audible at all times and not turning into a grating wall of sound. The only outlier in this situation is John Gaerea’s performance on \"Silver Needle // Golden Dawn\", since he's a bit low in the mix and can be hard to hear at times.\n\nNow, while Mære is an excellent album, there might be a couple of things that could prove to be deal breakers for a lot of people, such as the duration. The album clocks in at a massive 84 minutes, making it the band's longest album to date, beating out III:Trauma by 10 minutes. It's without a doubt a daunting listen and might become tiresome for a lot of people, so if you plan on giving it an attentive listen you should make sure you have some time to spare. There is also the fact that the band hasn't really changed their sound much since they started, which might prove to be an issue to some people. In my case it doesn't cause any problems, especially considering the fact that they're still very much capable of writing compelling music, even if it might feel a bit samey at times.\n\nMære is the product of a band full of passion, and proves itself to be a worthy addition to the band's discography so far. Its powerful expression of emotion and beautiful instrumentation make it not only one of their best albums, but also my personal frontrunner for album of the year.\n\nHighlights: Sing for the Damage We've Done, Three Empty Words, Silver Needle // Golden Dawn, Time is a Ghost\n",
        "\nOver the past few days I have been doing a run of Harakiri For The Sky's discography in preparation for the upcoming Mære, which I was originally planning to review. Sadly, news of its release date being pushed to February 19th changed that plan, which led me to their 2012 self-titled debut. While it's undeniably a Harakiri For The Sky album, it is a bit of an outlier in the grander scheme of their discography, thanks to some small details that set it apart from its brethren.\n\nA melancholic acoustic guitar against the sounds of rain falling sets the tone for \"Lungs Filled With Water\" to come in with a slow riff, giving us an immediate example of what the band is about: moody and spacey soundscapes The band deftly weaves acoustic instruments with the rest of the music, creating a depressing atmosphere. One thing of note when it comes to this release is Jay's vocal performance. Instead of the mid-range shout that he uses on future releases, he opts for a more typical black metal scream. While it's not bad, and actually fits the music quite well, it definitely sticks out compared to his performances on the band's later output.\n\nFrom that point forward, the band continues at a similar pace, with the tone and vibe of the release being consistent throughout, though each song does have its own standout moments. Sections like the layered vocals near the end of \"02:19 AM, Psychosis\", or the melodies at 2:25 of \"Drown In My Nihilism\", and moments like these make this album as hauntingly beautiful as it is, enhancing its emotional impact. The album is full of such little details that really help each song stand out, despite their similarities. \n\nWhich brings me to my next point, and my one gripe with this release: the songwriting. While every song has some cool moments in it, they all have a very similar structure, with most of them starting off with a moody acoustic guitar before going into a slow riff (\"Drown In My Nihilism\" bucks that trend by skipping the intro altogether, though the rhythms still feel a bit samey). This leads to the tracks running together to some extent, which knocks the enjoyment down a bit. The album is quite short, clocking in at 37 minutes with a mere 5 tracks, which helps alleviate the issue of the songs feeling overlong, as well as the sameness . If there’s one track that could be singled out for its monotony it’s “From Yesterday To Ashes”, as it’s static for most of its duration without any fluctuations in tempo. \n\nThe lyrics here aren't anything out of the ordinary if you've listened to the band already, with them dealing in heartbreak, loneliness, and self-destruction (very happy subjects I know). They’re competently written and the despaired vocals help further their impact, fitting this album perfectly. They’re definitely one of the things that grew on me as time went on, having gotten into the band through III: Trauma, where Jay sounded different to what he does here.\n\nThe production is also one of the things that makes this album so powerful. The guitars have an ethereal, somber tone to them, supported by the bass pulsating underneath, while the drums have a punchy sound, which really comes forward during the more hectic moments on offer (3:24 of \"Dancing on Debris\"). There's also the fact that the instruments have a touch of reverb applied to them, which is particularly noticeable on the cymbals, giving the music a dirge-like feel during the slower moments. The mixing is also quite good, with the instruments being well layered, occupying their own space and not fighting to be heard.\n\nHarakiri For The Sky's debut is the work of a band who has a very clear vision of what they want to do, and for the most part succeed in it, with only a few faults detracting from the experience. It's still a very powerful album that I would wholeheartedly suggest to people looking to get into post-black metal, or people who are interested in the band. While their future releases have some differences compared to this one, it's still not an album one should overlook.\n\nHighlights: Lungs Filled With Water, 02:19 AM, Psychosis, Dancing on Debris\n",
        "\nI'll admit that this is somewhat outside of my usual wheelhouse. When I reach for black metal, I tend to prefer it to keep itself far away from the post rock/shoegaze trappings that have become so ubiquitous in the atmospheric camps as of late. I have soft spots for Altar of Plagues and Wolves in the Throne Room but for the most part it just generally bores me to tears. This is why the Austrian duo, Harakiri for the Sky, is such a huge surprise to me, because I love the absolute shit out of Arson.\n\nFrom what little I can gather, most fans of the band find their fourth album here to be somewhat of a disappointment because very little has changed throughout their discography, but honestly this just tells me that I'm missing three other incredible albums by starting this late. On paper, Harakiri for the Sky plays a fairly by-the-numbers brand of post-black, consisting mostly of melancholic melodies layered over simplistic mid paced riffs with distant vocals playing second fiddle to the melodies, but where I think this band excels is actually through their other fiddles. The band takes the Anaal Nathrakh route of the two-man-band ideal by having M.S. handle all of the instrumentation while J.J. just stands there and screams, but I feel like choosing to take on a session drummer for Arson (the current drummer of Septicflesh) was probably a huge boon to the overall feel of the album, because he absolutely fucking murders his performance. He seems to have an almost Kollias-level addiction to speed in his lower half, because almost the entirety of the album is comprised of him blasting his fucking heart out, and even when he slows down it's only through his upper half, as his feet continue pummeling away at insane speeds. It lends a frantic dissonance to the experience that I adore, changing what would otherwise sound like \"I'm dying and I'm very sad about it\" into \"I'm dying and I don't want to fucking die please help me.\" Nothing about this sounds like a triumph, it's all instead a mournful dirge played with incongruent ferocity, and it's an extremely cool effect. I'll take this speedy and riff-heavy approach over the weepy bleakness of Alcest any day.\n\nAnother thing that absolutely deserves mention is how brutally long every song is without ever feeling truly drawn out. It never falls into mindless repetition, with each track being a dynamic journey complemented by seemingly dozens of riffs and patterns. The most impressive parts of the band to me are the more peripheral aspects, but the songs all live and die by the strength of the melodies regardless. There really aren't any moments where I find myself bored or wishing a certain section would hurry up and end, instead finding myself enraptured in gorgeous clean and/or soaring guitar lines over the frantic rhythm section. It's pretty impressive to have the shortest song still fall north of the eight minute mark and never fall into a rut. The meaty production helps a lot in this regard, because even if you do tune out, it remains quite full and never really results in passive background noise.\n\nThere are a few problems here though, and admittedly they're all fairly large. For one, while the songs themselves are very dynamic and shift through many different sections with appropriately intense climaxes, they all tend to shift through the same dynamic. The tempos are almost entirely dependent on a brisk mid-tempo or a desperate blast, the moods are all melancholic and depressive, and there are very few truly unique sections throughout the runtime (like the absolutely crushing quasi-breakdown riff in the climax of \"Fire, Walk with Me\" or the hopelessly gorgeous outro of \"You Are the Scars\"). There's no fully calm song nor any fully blast heavy full-metal-assault. It's one mood, that's all you get. I've skimmed a few reviews of the album online and many of them mention an almost Korpiklaani-esque folk metal section somewhere in \"Stillborn\" but that's... not at all true? I think they're talking about the section at roughly 2:30 but really it's just the same basic thing they do for the rest of the album, just with a slightly more active guitar line. I guess if you really squint your ears it sounds a bit like early Ensiferum but that's really stretching it. What the hell? Did one reviewer throw that reference in as a joke and everybody parroted it without actually listening? \n\nIt's also the opposite of succinct, with every song avoiding the problem of needless repetition but still following a similar structure throughout lengthy runtimes. Including the Graveyard Lovers cover from the digital version (which I'm using to review), it clocks in at an excruciating 71 minutes. With the songs all being so similar, this is one of the few albums where I would actually say that putting it on shuffle and listening to roughly three songs before just moving on to something else wouldn't devalue the experience at all. That's about all it takes to get a full idea of what the album contains. The first handful of tracks seem to have more individual standout sections but the last three tracks are probably tighter and more consistent on the whole, but even then it's a negligible difference. \"Tomb Omnia\" and \"Voidgazer\" aren't really all that different from \"Heroin Waltz\" and \"You Are the Scars\" despite this distinction. \n\nThere's really no place to put this, but the vocals are worth noting as a flaw as well. J.J. isn't a bad vocalist by any means but he's noticeably the only truly static element of the band. His screams are all a monotone bellow, with no variation whatsoever between all of his lines. He hardly even has a \"metal\" voice, entirely devoid of black metal screeching or howling. It's just a gruff holler, and it wouldn't sound too out of place in a particularly moody (post) hardcore band. I don't particularly mind it, personally, but it's noticeable and worth mentioning.\n\nNow, here's where we peel back the curtain a bit and see how all of this relates to my own personal philosophy on music and reviewing. To me, music is art. There are different kinds of experiences and goals that any given metal band will tackle, but it's art all the same. Taken as a piece of art as opposed to a clinical deconstruction of the elements at play within Arson, all of those flaws amount to essentially bupkis. Yeah the songs are all fairly samey and it's agonizingly long, but... man who gives a shit? I don't need a fuckin' math problem to tell me how much I enjoy something. If you plug in the individual components and weigh them however you choose to weigh them, you're going to encounter a lot of negatives that drag the score down. If those negatives actually do impact your enjoyment then hey, more power to you, but for me they just... don't. If I used some sort of formula to score this album, it'd land somewhere probably as low as the high fifties or low sixties. But in my heart of hearts, if I just ask myself \"How much do I like this album?\", the answer is a very simple \"A shitload.\"\n\n\nOriginally written for Lair of the Bastard\n",
        "\nWhile Aokigahara was certainly a worthwhile slab of depressing yet beautiful post-black metal, III: Trauma improves the band's sound on every level. The production is more clean and crisp, and although some may argue that might make the drums sound a little bit too clinical, I think it really works based on the speed of some of the double kick patterns. When you're playing stuff that fast, you really need to feel every drum hit. The double-kick sections in \"The Traces We Leave\" wouldn't have nearly as much weight were it not for the steady bass drum clicking away in the background. While Aokigahara had a perfect aesthetic, the one thing I did find it lacked in was those standout, infectious riffs. I enjoyed the album while it was on, but never felt the need to go back and listen to it again in the same way I find myself spinning songs like \"Funeral Dreams\" \"Thanatos\" and \"Viaticum\" repeatedly. Each one of those songs has an insanely catchy moment that just begs to be heard over and over again until you're sick of it. The opening verse of \"Thanatos\", the skank beat part in the middle of \"Viaticum\", and basically the entirety of \"Funeral Dreams\" are the highlights of the album for me personally. The songwriting and riffing on \"Funeral Dreams\" in particular is just impeccable--in fact, that's probably my favorite song of 2016. Never have I heard a post-black song that sounds so emotional and grandiose while still adhering to a fairly coherent song structure. If you're going to check out anything from this album, make it that, as it captures all of the best qualities of the band. Holy shit, the drumming just manages to sound absolutely massive during the faster moments, and even during the more laid-back moments the drums seem to know exactly where the emphasis needs to be.\n\nInevitably, with the high points of this album being so unbelievably good, there's going to be a couple of low points just by virtue of comparison. The opening track, for example, is probably the weakest part of the album. It's not necessarily a bad track, it's just a little overlong and falls into the same trap a lot of moments on Aokigahara did. It just kind of wanders about, with nothing really jumping out at you or taking things to the next level for the entirety of duration. That almost ends up being a good thing, because it builds and builds and builds with no real release, and \"Funeral Dreams\" kicks in for nine minute of nothing but spectacular release, so maybe it was an intentional choice by the band to make \"Calling the Rain\" an intro track that just sort of sets the stage and gives you an idea of the general aesthetic you're looking for. That being said, did they really have to make it eleven and a half minutes? A lot of the riffs on the opener seem as though they could have been cut out with no real consequence, and an effective buildup and introduction still would have been achieved.\n\nEven the lesser moments have their purpose, playing into the huge, larger-than life approach that the album takes. No one track is shorter than eight-and-a-half minutes, so you can tell the band was really trying to make this as epic as they possibly could. Fortunately, nothing is so repetitive that it wears out its welcome, even though there aren't too many divergences in sound made within the bloated hour-long runtime of III: Trauma. It's difficult to say that an one song should have been cut out (aside from \"Calling the Rain\" as was discussed above), but I will say that this album does lose a little bit of steam towards the end. It's not that the last two songs are lesser in quality or anything, but after \"Viaticum\" has concluded, one does start to get weary of huge post-rock style buildups of super-melodic black metal riffs. \"Dry the River\", sort of works as a ballad-style closer, but \"Bury Me\" essentially just sounds like a mix of all of the traits of the previous songs with no real distinct identity of its own. \"This Life as a Dagger\" probably would have been a better end to the album because it serves a similar purpose. Really, though, when I'm suggesting that a song I thoroughly enjoy from start to finish should have been cut out, you know I'm getting hella nitpicky.\n\nIn short, if you trimmed down the intro track, maybe cut out \"Bury Me\" and saved it for a later album or a re-release or something and then moved \"This Life as a Dagger\" to the end, III: Trauma would pretty much be perfect. This has tons of energy and massive, gorgeous black metal riffs woven into huge, long songs that are still remarkably easy to follow. I haven't mentioned the vocals much yet, but the hoarse, mid-ranged yells do everything they need to, providing a catchy vocal line here and there while also giving the riffs plenty of time to develop on their own. Like the rest of the music, they come off as emotional and powerful without sounding cheesy or forced. This style of (pseudo)black metal has gotten a little bit less trendy over the years; once it was fully co-opted by American acts like Deafheaven and Bosse-de-Nage and made waves in the \"mainstream underground\", it sort of seemed like it was getting a little bit stagnant. However, there's a small sect of bands within Germany and Austria like these guys, Der Weg Einer Freiheit and Agrypnie that are taking the vibe pioneered by bands like Alcest and Amesoeurs and adding a healthy dose of good old fashioned metal riffs, and it's breathing new life into this subgenre if you ask me. Harakiri for the Sky have proven they're the best of the bunch with this spectacular album. If you're a post-black metal fan and aren't praising this to the high heavens, your priorities must be hella out of whack. Ever want to hear what Mgla would sound like if all of the band members got dumped at the exact same time? Look no further.\n",
        "\nThis album has been out for a few months now and I have been listening to it every single day since. Being a huge fan of the Seppuku band since their inception, this being their sophomore offering, I was looking forward to it. If you love bands like ‘Austere’ & ‘Argypnie’ (have picked them specifically) you will feel the perfect blend & depth of both in this album. Like its being said by all experts, black & post black are meant to be together and this album just warrants it.\n\nNeedless to say, the first song on the album \"My Bones to the Sea\" is monumental. It’s sad, depressing & suicidal yet extremely soothing to the senses. The tempo on this song is somewhat distributed between slow discomfort & decent guitar riffs. But personally, the vocals on this song are solid & the screams have been perfectly distorted with the guitar tone which makes it even more beautiful & tormenting. Expecting the same rhythm in the rest of album, I was pushed back to reality with \"Jhator\". These guys wasted no time in throwing you out from the drowning sea in front a blood-red sunset crying for mercy. It’s fast, old school and an instant classic when it comes to the flavor of post-rock. It sounds more apocalyptic in nature rather than atmospheric but delivers nevertheless. Homecoming: Denied has an excellent guitar solo which will resonate in your ears for a long time. As you progress through the rest of the tracks, you will feel a certain level of monotony but there are distinctive symphonies in each which make up for the mediocrity and is a worthy compromise.\n\nThe only let down on the whole album was the cover and I had more expectations from an album which had such a solid title like Aokigahara (suicide forest or Sea of Trees). I still wonder why there have been not enough reviews for this band since they are extremely talented and do what they know best, i.e. heavy depressive atmosphere, emotional kill & suicidal lyrics. Keep it up guys! There are a lot of fans out there who are looking for exactly the above elements and you are nailing it.\n"
    ]
}