{
    "Band Information": {
        "Country of origin:": "International",
        "Location:": "Birmingham, West Midlands, England / New York, United States",
        "Status:": "Split-up",
        "Formed in:": "2006",
        "Genre:": "Heavy/Doom Metal",
        "Lyrical themes:": "Sorcery, Mysticism, Fantasy, Depression",
        "Last label:": "Rhino Records",
        "Years active:": "\n2006-2010 ",
        "Number of Reviews": 27
    },
    "Band Reviews": [
        "\nIf there’s one take I have about the Sabbath discography that’s extremely unpopular, it’s that The Devil You Know under the Heaven & Hell title is the single most overrated album they ever did. Note: not the worst, but the most overrated. I’m obviously a huge fan of the band, I love Ronnie James with all my heart, and doom metal is something that I can dive into from time to time (obviously). But man, I really do not see the huge appeal in this. It’s not bad, but it really is not that great, and I have to wonder how much of it was hype-based on such a massive lineup reuniting in 2009.\n\nMost likely, it would be pointless to go on about how this thing is way too damn long for its own good, which seems to plague all of the lesser Sabbath records. But I can’t pretend it isn’t true. I won’t even act like Dio doing doom doesn’t work (though I prefer his more up-tempo, vocal focused works), because some of his solo stuff that went that route was solid, as was Dehumanizer. But I don’t think this birthed particularly great songs. The intensity of Iommi’s riffing and the burning blackness of the structural integrity is certainly something I can see the appeal in. But by the time I hit “Double The Pain” I find myself getting bored. Hell, even the riffs themselves are pretty stellar; “Bible Black” opens on a soothing soft/dark lick and rides out with a bang, but this bang went on (ha!) past its expiration date.\n\nAs is the case with most of The Devil You Know. I find this to be one of the hardest records to talk about because it’s such a task to get through and there’s so little to point out. Let’s even go as far as to say that some of it is repetitive, generic doom throwback worship. “Rock ‘N Roll Angel” has some of the least amount of innovation that anything this stellar group of musicians has ever played. Others add a little more epicness to the writing but then stretch it out too far; see the closer “Breaking Into Heaven.” Also, sidestepping the songs, does anyone else find the tones on this to be just a bit too dense for what they’re going for? The band has treaded this line before, and would do so again a few years following, but it certainly doesn’t hold back here.\n\nI suppose it sounds like I really hate this with how hard I’m being, but I really don’t. “The Turn Of The Screw” is probably the strongest song here, and had the album paced itself and wrote the instrumentation the same way they did this one, things would sound a lot smoother. Opener “Atom & Evil” is also a bit of a fun go-to that I can’t deny being good. A dash of needed speed can be found in “Eating The Cannibals,” and this middle section of stronger songs probably saves the album from the majority of the beginning boring me to death. But as a whole, I can’t justify praising this the way many others do. As is with the case of other types hammering down on a style I’m not quite as equipped with, it could just be me, and this is not my first choice.\n",
        "\nI don't think I need to introduce Black Sabbath to anyone in here. They basically laid the foundations of heavy metal and is widley considered to be the first band of the genre. While this album is not officially a Black Sabbath album, I think it's safe to say that most of us consider it to be. After all, the marks the reunion of the \"Mob Rules/Dehumanzier\" line-up of Black Sabbath, consisting of the vocalist Ronnie James DIo, guitarist Tony Iommi, bassist Geezer Butler and drummer Vinny Appice. It also marked the final studio album by vocalist Ronnie James Dio prior to his tragic death in 2010. So in many regards, The Devil You Know can be considered a milestone album, not only for Black Sabbath but for heavy metal as a whole. Thus I had high expectations when I started to listen to this album, and it's with a smile on my face I can say that it not only meets them but also exceeds them sharply. \n\nFirst and foremost: This album is INCREDIBLY heavy. Boosted by a fresh and clear production, The Devil You Know not only manages to capture the brutality and heaviness of 1992s Dehumanizer but also to amp it up even more, resulting in a sound that sounds like a hybrid between Dehumanizer and Dio's solo album Strange Highways. The heavy nature of this album is one of it’s biggest strenghts for me. It makes the album sound angry and brutal and it fits perfectly with what I want to hear from Black Sabbath. Despite it’s heaviness though, The Devil You Know still manages to remain emotional and pure, mostly thanks to the vocals of Dio and the simple yet effective drumming of Viny Appice. I have always believed that Black Sabbath was where Dio felt most at home. As much as I love the 3 albums he did with Rainbow and most of his solo albums, I have come to the realization that it’s when Dio teams up with Iommi, Butler and Appice that he truly finds his way. There is something about the combination of these 4 guys that makes me feel emotional and warm, and that clearly affects how I feel about this album. \n\nWhen it comes to the songs, the album more than delivers. As you can imagine with Black Sabbath it’s Rifforama City all the way, and while most of the songs are slow and eery they still manage to remain interesting and memorable. Unlike Dio’s last studio album Master Of The Moon, which for me suffered a lot from having too many unmemorable songs, The Devil You Know is filled with memorable vocal lines and choruses that gets easily stuck in your head. That especially is expressed in songs like ”Atom And Evil”, ”Double The Pain”, ” ”Follow The Tears” and ”Neverwhere”. These songs are complemented with some longer and more epic tracks like ”Bible Black” and ”Breaking Into Heaven”, the former probably being Sabbath’s most epic and bombastic track with Dio since the Mob Rules album. ”Bible Black” is an opus that delivers everything I love about Dio-Sabbath, and it makes me happy to hear that they managed to create one last song of that type before they hung up the hat.\n\nAs a whole I think this is a very strong album, and the fact that this was the last album we got from Ronnie James Dio makes me happy. If he would have ended his career with the mediocre slog that is Master Of The Moon, it would have been an underwhelming swan song to one of the true masterminds of heavy metal. Luckily he reunited with Iommi, Butler & Appice and made this album, thus ending his career with an album worthy his name.\n",
        "\nHeaven & Hell's The Devil You Know marked the third reunion between influential singer Ronnie James Dio and drummer Vinnie Appice with Black Sabbath masterminds Geezer Butler and Tony Iommi. This promising new chapter in their careers was cut short by Ronnie James Dio's illness and death only four years into the creation of this new band. This shows that time is precious and shouldn't be spent arguing but creating your own legacy. This line-up could have achieved so much more throughout the years but one should be grateful for the four records these four musicians were able to put together in three decades after all.\n\nPerhaps those tragic circumstances have clouded the evaluation of this slightly overrated album. My first impressions back in the days were actually rather negative. The songwriting is repetitive and even bland at times. The riffs on several songs sound repetitive to a point that they become exchangeable. The rhythm section is solid at best but often fails to stand out and leave a significant mark. Even the great vocal patterns often sound the same. Optimistic reviewers might call this consistency while it's actually a lack of creativity. It almost feels as if the songwriting had been rushed. It might have benefitted from leaving it alone, rediscovering and finetuning it for better results.\n\nTwo tracks manage however to stand out and have also grown as time went by. First single ''Bible Black'' is a haunting track that cannot only be described as doom metal but checks all the cases for gothic metal as well. The song is slow, melancholy and emotional as it's carried by dramatic vocals, gloomy acoustic guitars in the outstanding overture and thunderous riffs in the main part. The song is best enjoyed on a rainy autumn night in a cold room lit with black patchouli candles.\n\nAnother highlight right at the heart of the album is the playful ''Rock and Roll Angel'' that convinces with several songwriting ideas that walk off the beaten path. This is the only song on the record that features some heartfelt melodies that don't inspire the usual doom and gloom. The smooth middle section with blues solos laid over appeasing guitar melodies has just the right length to unfold all its magic. The vocals are rather catchy for once and might even inspire to sing along. The acoustic guitar closure gives the diversified song a timeless campfire atmosphere. This song might sound slightly puzzling at first contact but the different parts slowly start fitting together as the track starts to grow.\n\nThe album features a few more decent songs that can't however reach the quality of the aforementioned highlights. Overall, the record suffers from numerous fillers that fail to grow and leave a deeper impression. In the end, what had been marketed as one of the biggest reunions of the decade in the metal scene wasn't as outstanding in retrospective as its dramatic circumstances might have indicated. Heaven & Hell's The Devil You Know is a solid to good doom metal album with a few gothic stylistics that includes two outstanding tracks that have stood the test of time. Aside of its ambitious start and heartbreaking ending, the most remarkable thing about this band and its only studio album is the wonderful cover artwork that would make for an astonishing flag, poster or t-shirt motive.\n",
        "\nLets get this out of the way. I couldn't care less what the official artist of this record is. \"The Devil You Know\" is a Black Sabbath record. Period. End of story. Calling them by a name they took just to appease Ozzy fanboys who didn't have the ability to separate the two eras is pointless to me. Especially considering this was Black Sabbath's greatest lineup/era anyway. Just so there is no confusion (not sure why there would be regardless), moving forward, I will be referring to Heaven & Hell as Black Sabbath. It took over 15 years, but Sabbath's \"Mob Rules\"/\"Dehumanizer\" lineup of Dio, Iommi, Geezer, and Vinny returned for one last rumble before Dio's death forced them to call it quits. What \"The Devil You Know\" might be lacking in youthful energy compared to the other Dio era Sabbath albums, it makes up for in veteran experience from all four members of the band. The one REALLY big negative to note is that Vinny sounds absolutely neutered on this record. I read in an interview once that the band basically wrote the album on a drum machine and essentially forced him to match the machine and not add much of his own flare, and it absolutely shows. Can't say why this was done, but it makes me feel awful because Vinny is such an underrated drummer.\n\n\"Eating the Cannibals\" is a track that really shows how the band aged like a fine wine. It's a quick paced track for Sabbath's standards with some really aggressive Iommi riffs. Dio's soaring vocals are still right on point despite his aging since \"Dehumanizer,\" and the rhymes he makes on this track are very unique, and show just a bit of that pissed off energy that was all over \"Dehumanizer.\" The tracks theming is a very unique one for Sabbath, and the mixture of tongue in cheek rage combined with the heaviness and soaring melodies only this lineup could create make this one a special track. The opener \"Atom and Evil\" provides us a bit more of that traditional Sabbath doom. Iommi's riff on the song is simple enough, but Dio's sad, downtrodden vocals make the track a wonderful taste of what is to come. The way he layers his vocals in deliberate fashion helps the mood shine exactly where it needs to. Geezer is also adding a ton of small accented bass work to enhance the mood. Iommi's accent work that further bring the doom-y energy home is even better than his solid riff work on the track.\n\nGeezer's greatest moment to shine on the record has to be \"Double the Pain.\" The intro is all about his fantastic bass work, and he adds a really cool distortion to it. Once the song explodes after the short bass intro, its still gives him that powers as it progresses forward. Iommi's riffs are still fantastic, and he adds some backing, light acoustic guitar work on the pre chorus for flavor. Dio's at the top of his game during the pre chorus segment, too. He multi tracks his vocals again, and he is just soaring with his beautiful high notes. It makes the small section entirely captivating. His verse vocals are also beautifully delivered as is the standard for him. His notes are perfect, and the amount of emotion he's able to deliver only amplifies the notes. Iommi's solo is killer on the track, despite how short it is. \"Follow the Tears\" is an absolute journey of a song. Iommi gives a stomping style riff and Vinny Appice adds some marching snare work behind it until it marches right into the incredibly heavy doom filled riff that comes next. This is another track where Iommi's riffs do no wrong. Every single one he introduces seems to be a lesson in one-ups-manship. Dio's chorus vocal melody is brilliantly haunting, yet still beautiful. His verse melodies are deliberately held back to tell a story and arm the listener for the fantastic chorus. They're theatrical and ominous, which is fittingly so for the song.\n\n\"The Devil You Know\" has no better track than \"Fear,\" for me. Iommi's main riff absolutely sets in the theme of fear even before Dio enters. It's a riff that sounds like something that'd play inside a terrified individual's head. Dio is just dripping with his theatrical vocals on the song. Every line spoken by him has that same terrified nature lurking inside of them. The chorus of the track is shouted by him, and it's just SO unique due to the fact that the layering over the word makes him sound cold and terrified, but also makes the line sound almost hushed. As if said in a whisper despite the fact that it's yelled. Iommi's solo is hands down one of his all time greatest. It's in my top 3 Iommi solos without question. The melody is such an incredibly catchy one for a solo, but still has that signature Tony Iommi feel. It doesn't get much better than \"Fear.\" Of course, the song that got the most attention from \"The Devil You Know\" was \"Bible Black.\" I don't know why I feel this way, but I always feel that \"Bible Black\" is a continuation of \"The Devil Cried\" from their boxset a few years before this album. \"Bible Black\" is prime story telling from Dio. The acoustic intro sets the stage for him to gather a crowd around him to start his story. It has such a natural progression to it both musically, and just as a tale. Right before the song gets heavy, Geezer has some really underrated bass flourishes that shouldn't go unnoticed. Iommi has trademark heavy riffs to make way for the rest of the song. Dio continues telling his story without missing a beat. Still making the tale feel consistent, but now adjusting to the heavy instrumentation by adding some more gruff and anger to his singing. After the chorus that follows the solo, I really love how Iommi uses the same main riff he has been, but adds a twist to the ending notes of it that make it feel even heavier. It's subtle, but adds so much.\n\n\"Breaking into Heaven\" is a very bittersweet song for me. I adore it, but there's something poetic and saddening about the fact that the name of the tune ended up becoming Dio's last song on a full length studio album, as he'd die from cancer just a bit over a year after this album was released. The entire song is all Dio, too. Iommi's riffing isn't bad, but they're simple parts. Dio is absolutely soaring, though. He's able to give the track such an immensely forlorn feeling. The pre chorus especially sounds like his vocals are strong enough to pick you up and make you fly. The choir sound of the keyboards behind only further flesh his vocals out. Geezer also gives a LOT of subtle but majestic basswork all throughout this track that should be listened for. \"Breaking into Heaven\" remains such an underrated Sabbath masterpiece of a track, and is a true testament of what a legendary singer Dio was, even at his mid 60's. \"Rock and Roll Angel\" is probably the one and only below average track on the record. Still, it's not a bad one, though. Geezer gives another stunning bass performance, and I love Iommi's opening riff. Unfortunately, the opening riff doesn't last long, and his main riff that follows is a really subpar and boring one. Dio's vocal melodies also aren't too special for his insanely high standards. The chorus is an average one at best, and Iommi just never really gets out of the gate throughout the entire track. The acoustic segment in the middle, and then that fades the song out later, set up to be really cool, but Iommi really just does very basic noodling solos over them, so they kind of fall flat. It's a song that probably would have been better with a four minute run time instead of a six minute one. Not a bad song, but a very, very average one for this lineup.\n\n\"The Devil You Know\" ended up being the closure of Dio's book, and I'm just really happy that the final album he left us with was such a strong one. Even though this closed the curtain on the Dio era, Sabbath still had one final chapter in their book with a final reunion with Ozzy a few years later. However, the differences between \"The Devil You Know\" and \"13\" show the differences in Dio and Ozzy, too. \"The Devil You Know\" was a mastercraft made by veterans who had a world of passion. The praise it received still rings true to this day. Meanwhile, \"13\" was nothing but a cash grab of rehashed, reconstructed material that received the same lukewarm response as nearly ever Ozzy era album should have received from day one, quite frankly. For now, though, I just want to give a final posthumous thank you and goodbye to Ronnie James Dio, who truly shared a world of magic with us all.\n",
        "\nBlack Sabbath hasn't release a new studio album in many, many years. After the Ozzy reunion, then the Dio reunion and the subsequent tours, fans have been anxious for some new material for years. Finally in 2009 the masters of heavy metal returned to give the masses another compact disc release. A couple years before this record, the band released a collection titled Black Sabbath - The Dio Years in which they recorded three new songs. Those three songs are excellent however The Devil You Know does not always measure up to these three previous tracks. This album features the thick layers of heavy sound built around Tony Iommi's crunchy guitar sound, Geezer's thick bass, Vinny Appice's steady drumming and, of course, the unmistakable vocals of Ronnie James Dio. However a lot of the songs here end up being too slow.\n\nI was expecting this album to start with something heavy and up-tempo, not unlike Neon Knights or Turn Up the Night. Fear kicks up the tempo slightly, but nothing on this album hits the speed or intensity of the aforementioned tracks. Instead, the album starts off with Atom & Evil a slow, doomy, goth-dirge complete with Dio's theatrical, mythological lyrics. This song is nothing special. The first single from the album Bible Black has a an undeniable hook and is easily as good as anything the band has recorded before. The song also sports a great solo in the middle. Double the Pain is a standout cut with a great riff, a very dark feel and a nice bridge. Dio's vocals sound fantastic throughout. The man has lost something over time but not much. The Turn Of The Screw features some very off putting lyrics and guitar parts from both guitarists. I do not like it at all. Follow the Tears however is perhaps my favorite song on this disc. The song could have easily been part of the first two Black Sabbath/Dio records. The opening moments with Iommi's menacingly heavy guitar tone is spellbinding. The song is slow and melodic, but heavy as a freight train packed full of razor blades and bombs. The solo is trademark Iommi both menacing and awesome all at once.\n\nAs usual, the imagery and lyrics paint a rather gloomy picture. Dio's lyrics rarely paint a picture that is easily understood. Instead he rhymes and weaves the lyrics into a sort of dark poetry, that sounds spooky but in reality doesn't have much meaning. Buzz words like devil, evil, death, dark, black, and of course, rock and roll have been a part of Dio's arsenal since his days in Rainbow. His goth-tinged poetry hasn't changed much over they years and is no different here. Of course, there is the purposely offensive cover art depicting some demonic creature holding a nail riddled crucifix that is sure to cause an uproar in religious circles. Frankly, the cover art reminds me of Celtic Frost's, HR Geiger illustrated cover To Mega Therion. Wal-Mart has an alternate cover that may appeal to some fans whom are squeimish when it comes to this form of expression. \n\nBut overall much of the song craft on this record is simply just too slow to be enjoyed more then a few listens with Follow The Tears, Double the Pain and Bible Black being the standout tracks that will not get old even after many listens. Just keep in mind that ultimately this record is just not fast paced enough to be enjoyed as a whole and should as a result be approached with caution more then anything else.\n",
        "\nWhen reflecting upon the past, particularly after the passing of the subject of the recollection in question, each recorded moment becomes an invaluable keepsake. Whatever flaws may have endured with those moments of splendor become welcome marks of uniqueness, especially when they are minuscule, as they tend to be when dealing with a mainstay and veritable perfectionist of a craft. Dio's illustrious career, spanning many decades under various projects, was arguably the personification of perfection, not so much in the modern sense of flawlessness, but the archaic one where something is in a state of fulfillment. With rare exception, his music was an exercise in mastery that would captivate audiences the world over, but his true home was in the live setting, and towards the twilight of his time with us he embarked on yet another short-lived collaboration with his mates in Black Sabbath, though it came to be known officially by the name of Heaven And Hell due to the \"official\" version of the band still being an active player at the time.\n\nThe first official offering under the new moniker turned out to be a live offering, due in no small part to there already being an EP worth of new material recently released under the Sabbath name and creating a wave that supplanted the original lineup's slavish adherence to being an OzzFest promotional gimmick. True to this lineup's reputation, the presentation walks a fine line between exuberant pomp and humble gratuity that makes for a far more engaging live performance, especially in the video medium where the enthusiasm and execution of the performers count for a lot more than the familiarity of the songs themselves. On the song selection front, this sense of balance finds itself with an adequate representation of the Dio era's entire catalog, including two out of the three latest offerings, though the largest plurality of songs came out of the iconic Heaven And Hell album that kicked off Dio's time in the Sabbath fold. It's a doubly enthralling affair given how effortlessly the band transitions from the rocking smoothness and epic tenor of the early 80s material to the more industrialized and dark feel of the Dehumanizer and current offerings.\n\nDio himself was often quoted as believing that a band is a collective effort, and it is arguable that this notion came through the most during his time in Sabbath, and the performance takes it to its logical conclusion. Every member of the outfit has their time in the spotlight with no real edge given to one over the other, though how and when this occurs varies a bit from one song to the next. Tony Iommi finds himself stealing part of the show at the onset of \"Die Young\", a song that tended to feature his talents in particular, and he takes the occasion to expand upon the introduction of the song and turns it into an extended solo slot for himself, banging out expressive, singing notes that focus a bit more on quality than quantity. Vinnie Appice takes a drum solo for himself towards the middle of the set that occasionally features some background keyboard work and samples, though he comes off as a tad more restrained when compared to how Simon Wright would handle drum solo slots with Dio's solo band. Geezer all but chimes in with flashy bass fills through just about every song, but the creeping, atmospheric work he brings to their rendition of \"Sign Of The Southern Cross\" is where he shines the brightest.\n\nNaturally a performance is about more than just the individual achievements of each member and how they equal themselves out, as much of these songs are primarily rooted in a basic structure that caters both to impact and atmosphere, and the selection of songs heightens this to the point of seeing this band perfectly balance their doom and heavy metal personas. The choice of following the creepy \"E5150\" intro that was featured in the Heavy Metal film prominently with \"After All (The Dead)\" shifts the overall feel of the show to the darker side of things, and though there are many lighter and epic moments to be enjoyed between \"Children Of The Sea\", \"Neon Knights\" and \"Lady Evil\", they tend to be equaled out by combination of selections from Dehumanizer and the newer offering \"Shadow Of The Wind\" (which could have been from the same album). Nevertheless, the faster rocking moments have their turn, and surprisingly enough Dio gets so jazzed up at the onset of \"The Mob Rules\" that he ends up belting out a high A note right out of Iron Maiden's Number Of The Beast that I don't recall ever hearing out of him, at the ripe old age of 65 to boot.\n\nPerhaps the best way basis of comparison between this glorious performance, where the band would come off as 20 years younger were it not for the video footage, would be to Dio's recent outing with his own band playing the Holy Diver album in its entirety, among some lesser known offerings. This follows the same basic scheme, but has a slight bit more enthusiasm behind it, perhaps in large part due to it occurring in a larger venue with a group of musicians that had not collaborated in a very long time. But no matter what past performance including members of this fold, this was a powerful performance unto itself, and one that would launch what would sadly be the last wave of original output with Dio at the helm. It's hard to get used to who was arguably the second king of rock n' roll being gone, but as sure as the setting sun in the western sky, he will not be soon forgotten.\n",
        "\nI can't remember what I was doing in 2009, but even I was aware that there was going to be an album from a former line up of Black Sabbath. I don't think I knew it then, since I wasn't really into more classic metal, though now I've gotta say - isn't this the highest quality line up Black Sabbath ever had? I mean, Ozzy and Ward did great things early on and the early period proved the most influential, it's just Dio has an empirically better voice than Ozzy and Vinny Appice doesn't give away much behind the kit. Anyway, it took this album to teach me about Dio's voice, since I'd never listened to much of his stuff before.\n\nI remember the first time I listened to The Devil You Know, 6 years ago. I loved it. I would listen to it often and it fitted fairly snugly into a doom phase that I was going through, acting as a slightly more upbeat bedfellow to the likes of Candlemass, Cathedral, My Dying Bride, Paradise Lost, and Solitude Aeturnus. It has the same kind of lead heavy, broad guitar sound that those bands used, though nowhere near as murky or extreme as the doom death hybrid. Whatever some people might argue about Black Sabbath's early years being doom metal, this kind of doom is quite different, since one can hear how Iommi's riffs on a song like 'Fear' or 'Double the Pain' are based on notes rather than chords, not actually moving that slowly but imparting the sense of doom through the mood of the melody rather than the trudging pace. That said, there are genuinely fast parts here, not only on the speedier 'Eating the Cannibals' and 'Neverwhere' which go off like NWOBHM or even bonafide speed metal songs with a gruffer guitar sound, but also during the moving and grooving verses of other songs such as 'The Turn of the Screw' and 'Double the Pain'. Finally, there's a hard rock sense of swagger and strut to a few moments, particularly 'Rock and Roll Angel', which is rather unusual and certainly takes the edge off the oppressive feeling exuded elsewhere.\n\nIn this mixture of moods and styles, Napalm Satan's largely negative review of the album makes some valid points about how mismatched or tryhard a few moments sound. When placed side by side, 'Eating the Cannibals' and 'Follow the Tears' are totally opposite, with the former bounding out on energetic riffs and screaming solos as Dio gleefully tells a tongue in cheek tale, while the latter opens with horror movie keyboards, trudges on a (pretty uninspiring) chugging low-end riff, and has a desperate sentiment to the lyrics. 'Eating the Cannibals' works well for this band, but one feels that Solitude Aeturnus or even the melodramatic My Dying Bride could have done much better with 'Follow the Tears', since their singers are much better suited for such depressing subject matter. The same issue sligthtly dogs the slow 'Breaking into Heaven' too and those two songs, despite fitting in well with my musical tastes at the time, feel unsatisfactory now. 'Rock and Roll Angel', on the other hand, has never suited me and is the song that I most often skip, lacking in riffs, emotion, and purpose, while the style is wishy-washy in an otherwise powerful album.\n\nThat said, there are some superb songs on The Devil You Know. 'Bible Black' is a fucking excellent epic doom song with drama in the acoustic opening, a gripping storyline, and guitar bliss towards the end, while both 'Fear' and 'Double the Pain' are inventive takes on a rather more fun formula, turning in good riffs and movement. Along with 'Eating the Cannibals', those are the highlights, though there are things to like in all of the other songs, barring the exception I've already mentioned. The best thing about the album is not that all of the performances are sublime (they are good, but not perfect), more that there is a sense of fun and freedom alongside the sheer heaviness and darkness of the doom style, so that the album feels a pleasure to come back to and is detailed and atmospheric enough to remain lost in. Therefore, despite the grumbles that I have about a few songs and the overall unity of the album, it is always an enjoyable listen and remains on regular rotation in my collection.\n",
        "\nThis is a review I've been both dreading and dying to write. It's weird to think that this album five years old at this point and I could very well be writing this for people who weren't metal fans when it was released, so if you fall into that category, please make sure you understand: this was the absolute biggest fucking deal in the universe when it dropped in 2009. Not only was there all the drama surrounding the band's mere name at the time (I saw this lineup twice and still steadfastly refer to them as \"Black Sabbath concerts\" and I'll never, ever, ever back down from that), but pretty much all four guys in the band had done precisely nothing of note in eons. This situation would stick most bands under these circumstances as \"has beens\", and no matter how true that may have been, Dio and Iommi are special.  They're both grandfathers of heavy metal, elder statesmen of an entire genre of music that had grown so much since they were young. I don't mean to leave Geezer out of the equation since he's a massive part of Sabbath's sound, and believe me when I say that he and Vinny were just as hyped up as the two main men, but the thought of Ronnie James Dio and Tony Iommi collaborating again for the first time in nearly two decades just sent generations of metal fans slipping off their chairs.\n\nAnd this is where the deification stops from me, and where the inspiration for picking up the Jerking the Circle series again begins. I'm sorry guys, The Devil You Know is lame and boring.\n\nThis is an album that's more... I dunno, inspirational or admirable than actually any good. See, it was great to see these shambling geriatrics wheelchair themselves on stage and then just rock the fuck out like they were in their 30s again, and it was so refreshing to see that the classic icons of the genre still gave enough of a shit about the music they helped create to continue performing and writing it. The problem lies in the fact that, barring the flukey Dehumanizer (which in itself is only half great anyway, but I'll explain that in time here), nobody in the band had really made anything worth listening to since the early 80s. Dio started on an incredible streak, farting out classic albums left and right with Rainbow, Black Sabbath, and his solo band in the 70s and 80s, and Sabbath was phenomenal in the 70s before a slight dip and resurfacing in the early 80s when Dio joined the fold, but after The Mob Rules, they just turned to churning out dull, skippable albums that weird people will swear up and down are among their best (you will never, ever convince me that Tony Martin is better than Dio or that The Headless Cross is better than Sabbath Bloody Sabbath). \n\nBasically all that history lesson was meant for was to illustrate something that most people never seem to acknowledge; Iommi/Dio hadn't touched anything other than skippable crap for almost 25 solid years before The Devil You Know. So in all honesty, I really shouldn't have been surprised that this album does next to nothing for me. It's almost 54 minutes long but it feels like it's almost two hours before the album ends. Most of Tony's good riffs had been used up by The Mob Rules, and no matter how good he was in his prime, this is an everlasting testament to the fact that he's just not as creative or fresh with his songwriting as he used to be. The album is inspirational in its attitude, but not in its execution, and as a result there are a whopping six plodding snoozefests to start the album off on the worst foot possible. I can concede that \"Bible Black\" has a good chorus and the verse riff of \"Double the Pain\" manages to get the blood moving, and I adore the main riff to \"Fear\", but that's three riffs across six songs that elicit any emotion out of me other than overwhelming apathy. That's a frickin' terrible batting average. It's sort of like Sammy Sosa coming out of retirement and leading the league in strikeouts while everybody showers him in awards and adulation because once upon a time he was super good and now here he is doing that thing again (let's just pretend the cork and the steroids never happened for the sake of argument, I'm not good at baseball dammit).\n\nI think the biggest problem stems from the fact that the album's single focus is skull squeezing heaviness, which it does admittedly achieve to an extent with an absolutely monstrous guitar tone, but it's overall ineffective because the riffs just never go anywhere. It's so clearly the result of four old men gathering around and trying to be all wise and weathered and whatever other positive synonyms you can think of for \"so old you can see through their skin\", and it just comes off like there's no vigor anywhere to be found. Like 85% of the album lumbers around at this leisurely lurch, like an ice giant out for a stroll. There's so little energy here, songs like \"Breaking Into Heaven\" and \"Rock and Roll Angel\" meander around for upwards of seventy six minutes with no fire or passion behind them. Almost the entire album is full of these dull chugging exercises that have to be unbelievably boring to play on stage. I know what they're going for, this is supposed to be pure, oppressive doom metal, full of apocalyptic dread and bone shattering crunch, and I suppose they achieve that if you really think about it.\n\nThe problem with that is that that's not what Dio does. Absolutely not, Dio has always been at his best when he's carrying a sense of wonder and grandeur. Really, think of all the best songs he ever sang on. \"Man on the Silver Mountain\", \"Die Young\", \"Falling Off the Edge of the World\", \"The Last in Line\", \"Rainbow in the Dark\", fuckin' \"Stargazer\", \"Kill the King\". All of those songs have one thing in common, they feel like they're showing you something greater than yourself. They all have this indescribable sense of magic surrounding them, and they're all just these huge sounding songs with an almost childlike sense of wonder. Precisely zero of the best Dio songs (barring the exception in \"Heaven and Hell\" (and I guess \"Sign of the Southern Cross\" is really popular too but personally it bores me) are slow and doomy. None of them feel like a hungover titan sleepily pawing at his alarm clock like \"Atom and Evil\" does. Dio doesn't do doom, and that's why the heavier Dio albums suck and the best song on Dehumanizer is \"TV Crimes\". You know, the fast one. He's woefully miscast in this role simply because he's essentially this ancient wizard at this point in time, but his voice was still as powerful as it was during his classic era. He didn't need to tone down his performance, but the rest of the band did, and so Dio's always immaculate voice rides dull melodies over boring, go-nowhere plod riffs.\n\nThat's not to say the whole album is bad, it's just fundamentally flawed. There are two uptempo songs to be found in \"Eating the Cannibals\" and \"Neverwhere\", and unsurprisingly they're the best songs on the album by a long shot. That's what Dio does best, he requires some semblance of energy behind him in order for him to reach his full potential. \"Bible Black\" may be heavy and dark, but it's not energetic, and that's why the vocals fall flat when put into the whole unit. It's so sad to say but really every member of the band brings largely an inconsequential performance to the table. Vinny Appice plays the most standard timekeeping beats imaginable with almost no fills to speak of, Geezer has very few of his famous runs (oddly enough, the two do get some brief moments of entertaining showboating in the background during \"Bible Black\" and essentially nowhere else), Iommi pens a whopping seven or eight good riffs across ten songs, and Dio stands out purely because his voice is so recognizable. If there was a different personnel behind this album, I feel like the metal fandom as a whole would give less than a single shit about it. The songs themselves have moments of past brilliance scattered here and there but for the most part they're devoid of enjoyment, replaced instead with an abundance of fillery non-riffs that go nowhere.\n\nMaybe I'm wrong for wishing this album is something that it wasn't, but to be fair, isn't that the reason we don't like... well, anything? How many times are you caught telling yourself \"Well this album does exactly what I want it to do, it ticks all the boxes, buuuuuut it's lame\"? Never. That's why the only songs worth listening to are \"Eating the Cannibals\" and \"Neverwhere\" for the heightened pace and thus thicker groove, and \"Bible Black\" for just being the only song to really get the formula they're going for right. I still recommend listening to it because it's a curious little oddity at the tail end of a couple legendary careers, and the swansong of one of metal's greatest faces, and also because everybody but me seems to love it so chances are you will too. For me? It just reinforces my belief that Dio/Iommi/Geezer all have about thirty solid years of forgettable crap going on right now as long as you grant an exception to Dehumanizer. \n\n\nOriginally written for Lair of the Bastard\n",
        "\nAfter reviewing Black Sabbath's brand new CD \"13\" and not being very impressed I decided to dust off this 2009 CD released under the moniker \"Heaven And Hell\". It had been awhile since I played it. I always felt it was very very good but the least of the four Sabbath albums Ronnie James Dio sang on. I still feel that way but in no way suggests it's a subpar release since the other three are all near perfect.\n\nAs I mentioned I had just reviewed and listened to \"13\" so when I popped this in I was immediately reminded (already knew) what a difference there is between Ozzy Osbourne and Dio. Even on the slow, sludgy opener \"Atom And Evil\" Dio's voice makes the song alive, especially compared to the crushingly dull performance of Ozzy on \"13. That album would have been 10x better with Dio at the mic.\n\nThe production sound reminds me of \"Dehumanizer\" more than the other two Dio-fronted Sabbath LPs (\"Heaven And Hell\", \"Mob Rules\"). Several of the songs are slow and creepy but there's also uptempo pounders like \"Breaking Into Heaven\" and “Eating The Cannibals”. While the presence of Dio always completely ferments anything he sings on this album feels like all three are equally present at all times. Iommi is as always a brilliant creator of riffs and Geezer Butler's menacing bass sets the tone. especially on for the crunchy “Double The Pain”. It's one of the best basslines I've heard since Queen's \"Under Pressure\"\n\nA little studio compression but not irritatingly meticulous like Rick Rubin's habit of ruining rock albums (think Metallica's \"St Anger\"). \"The Devil You Know\" benefits from a little sludginess rather than overly separated instruments typical of Rubin, evidenced on '13'. \"TDYK\" was produced by Dio, Tony Iommi and Butler and resembles a Dio album to me. \n\nI recall the album was preceded by the absolutely monstrous single, \"Bible Black\". Everything about this track is spot on. The arrangement is vintage Dio. Slow, often acoustic intro and then the hammer comes crashing down full strength. That's what happens here. It reminds me of Dio's \"The Last In Line\". On that song the groove kicks in with the word \"home\" from the line \"we are coming hooooooome!\" but \"Bible Black\" hits harder with Iommi introducing a killer riff when Dio delivers a throaty \"black!\" from the line \"Don't go on/Put it back/You're reading from the Bible Black!\".\n\nButler is usually the band's word man but when Dio comes to town the elfin one gets the job. When one thinks of Dio images of dungeons, dragons, rainbows, etc but with Sabbath he tends to explore tales of good vs evil and moreso his belief that the life one lives now can be 'heaven or hell'. Songs like \"Double The Pain\", \"Fear\", \"The Turn Of The Screw\" and especially \"Follow The Tears\" are Dio's way of singing the 'blues', albeit with a fighting spirit.\n\nTen tracks. Lots of music. The only slight drawback is a feeling of 'sameness' in some of the songs. It could have used a wildcard like \"Planet Caravan\" or even \"Zeitgeist\" from the Sab's new album. That quibble aside this album delivers the whallop needed.\n",
        "\nThis 2 disc compilation is the first collection that covers nearly his entire career from his time with Elf, through Rainbow, through Black Sabbath, through Dio (band) to his last days with Heaven & Hell (Black Sabbath). Rhino's decent 2 Disc \"Stand Up And Shout: The Anthology\" stopped short at his final Warner Brothers LP (\"Strange Highways) but is a better overall (but still flawed) set since there's some glaring omissions on \"Mightier Than The Sword\" that were logically included on the Rhino set (\"The Last In Line\" being the most shocking). Only those not familiar with all the albums Dio was involved with will be pleased with this sampler. It does give a more comprehensive portrait of the man's career but it simply is not possible to fit all the essential tracks from Elf to H & H on two discs (not even three could cut it). It earns a point for including one track from his guest work on Roger Glover's \"The Butterfly Ball & The Grasshopper's Feast\" (\"Love Is All\") , which was ignored by the Rhino set but loses more points for omitting the most popular Rainbow track (\"The Man On The Silver Mountain\") and some essential Dio band tracks (\"Stand Up And Shout\", \"The Last In Line\", \"Hungry For Heaven\", \"Dream Evil\", \"Lock Up The Wolves\", etc.. Now, being that there was limited space only the absence of \"The Last In Line\" is completely unforgivable. They chose only \"We Rock\" from the \"The Last In Line\" album instead but since the disc clocks in at only 69+ minutes space was left for atleast one more track and \"The Last In Line\" is a no brainer!)\n\nElf was not a metal band but a boogie-woogie blues rock band so not much is needed despite three full albums being recorded by the group. It's not who Dio became and not what made him famous. Only \"Carolina Country Ball\" from the LP of the same name represents Elf of the 27 tracks offered here. After The Glover track that follows comes the Rainbow years- represented by a surprising 8 tracks. While the great \"Stargazer\", \"Catch The Rainbow\" & \"Run With The Wolf\" are here where is \"The Man On The Silver Mountain\" for crying out loud?!\n\nThe first two Black Sabbath stint is represented by six tracks (\"Heaven & Hell\", \"The Mob Rules\", \"Children Of The Sea\", \"Voodoo\", \"Die Young\" & \"Country Girl\"). This is acceptable even though \"Die Young\" & \"Country Girl\" could have been replaced with \"The Sign Of The Southern Cross\" & \"Turn Up The Night\" and made it slightly better. There's nothing from the infamous \"Live Evil\" set but \"Neon Nights\" appears later being the live version from Heaven & Hell's 2007 tour and subsequent album/DVD \"Live From The Radio City Music Hall\".\n\nNext up is the Dio band years. Not including the weak live EP \"Intermission\" Ronnie's namesake band released five albums before Ronnie rejoined Black Sabbath. Those five Dio albums are represented by a paltry five tracks. Two from \"Holy Diver\" (title track, \"Rainbow In The Dark\"). one from \"The Last In Line\" (\"We Rock\"), one from \"Sacred Heart\" (\"Rock And Roll Children\"), one from \"Dream Evil\" (\"All The Fools Sailed Away\") and nothing from \"Lock Up The Wolves\". Now while all five of these tracks belong here more tracks from these albums should have been chosen in place of too many Rainbow tracks (based on the premise something would have to be cut to make room).\n\nThe Black Sabbath reunion LP \"Dehumanizer\" is represented by \"I\" (not a bad choice even though \"Computer God\" is better) and then three more Dio band albums are completely ignored (yep, nothing at all from \"Strange Highways\", \"Angry Machines\" & \"Magica\") as the collection jumps to 2002's \"Push\" from the album \"Killing The Dragon\" followed by \"One More For The Road\" from the LP \"Master Of The Moon\". While these were the logical choices for the \"KTD\" & MOTM\" albums \"Magica\" deserved at least one track here (such as \"Fever Dreams\") instead of \"Shadow Of The Wind\", one of three tracks recorded by H&H for the \"Black Sabbath: The Dio Years\" compilation. Then comes the aforementioned live \"Neon Knights\", the penultimate track before we get to the fantastic final cut, \"Bible Black\". It was the best pick from an overall great album by Heaven & Hell, entitled \"The Devil You Know\" in 2009- one year prior to Ronnie James Dio's death.\n\nThe first lesson is that you shouldn't try to cram onto two discs a career that consisted of over 20 studio albums, many live albums and guest appearances. The second is that if you're gonna try find someone hip who will narrow it down to the bare essentials. Sometimes they got it right (\"Stargazer\", \"Heaven & Hell\", \"The Mob Rules\", \"Holy Diver\", \"Rock And Roll Children\", \"Push\" & \"Bible Black) and often they got it wrong (leaving off \"Man On The Silver Mountain\", having too many Rainbow tracks, the omission of \"The Last In Line\", \"Hungry For Heaven\" and nothing at all from four Dio albums: \"Lock Up The Wolves\", \"Strange Highways\", \"Angry Machines\" & \"Magica\").\n\nAll in all. Another incomplete \"best of\" comp that will have a short shelf life until someone does it right with a four disc box set.\n",
        "\nThe finest Black Sabbath is Dio's Sabbath. Yes, we all know that (regardless of what AOR wants us to think). We got the mythical Heaven and Hell, then the speedy and doomy Mob Rules, and finally, Dehumanizer, a stoner-doom metal approach and one of the finest albums ever by BS.\n\nAfter three majestic pieces of heavy metal by the darklords themselves of the genre, BS entered in a sort of right-wrong working. Flirting with Ozzy was unfruitful, he likes the american popularity, he enjoys playing himself as a lostminded clown, and he forgot, back in 1972, how to do good music, so, the best for Iommi and team was to do something different... Yet... Usual. Here is when Ronnie James and Vinnie are summoned for the last time and they deliver the goods.\n\nDehumanizer is doom. Oh yes it is. And this follow-up has the same feeling. Nevermind how much Iommi explains that this was a parallel project, we get more of the same. The major criticise to Black Sabbath (or Heaven and Hell, it's the same) is that there are no new ideas here. We get what we know we will get and that's it. Since \"Sabbath Bloody Sabbath\", Iommi keeps on bringing the same riffing style, almost the same tune for the most of his compositions. An hybrid between his classical sound and Dio-era Sabbath. In \"The Devil you Know\" we listen a dirtier and more raw version of, say, \"Mob Rules\" and there we are. No more, no less.\n\nNotwithstanding, despite the laxness of new ideas, the musicianship and talent of the performers here is unquestionable. Iommi, Dio, Appice and Butler are metal gods in their own term and they need no introduction. And we get amazed by Tony with a couple of outclassing-newcomers solos in here, specially in \"Eating the Cannibals\" and \"Follow the Tears\". The Guitar Devil proves once more that he can do more than deadly riffing. He is a virtuoso, as well. Maybe not as good as Ritchie Blackmore or Andy LaRocque, but not far away from them. Another extra point is for Geezer Butler. He is, probably, an average metal-bass player. But when it's about following the lead by the guitar and filling the emptyness, he breaks it. In \"Bible Black\" and \"Turn of the Screw\" we can taste a little bit of this.\n\nAnd yes, yes, yes. Dio. Of course, I'll talk about him. But we can't forget Vinny. He is a little bit under-appreciated in my opinion, but he is a solid drummer. He fills the spaces and remembers us constantly what's about drumming in heavy metal. He actually beat the irons. In \"Fear\", \"Eating the Cannibals\" and \"Breaking into Heaven\" he get his best.\n\nWe all know this was the last recording by Dio. He died around one year later. Despite this, he gives us one of the finest performances in his career, only matchable with \"Mob Rules\" and a little inferior to the legendary \"Rainbow Rising\", his first metal band (have you heard about a band named Ritchie Blackmore's Rainbow, where Dio started his metal career? If you didn't, you are probably just a poseur). In \"Bible Black\", \"Rock and Roll Angel\" and \"Breaking into Heaven\", one of the legends of metal singing blast it all away. The lyrics are made specially for his style. Dark and gloomy. Being this said, the swan song by RJD is majestic, brilliant, mature and pure. (We will never forget you, Dio...)\n\nWhat we can't find in originality and inventive, we get it here in the shape of talent, metalness and some bits of virtuosity. To be in heaven and in hell in the same time is not difficult with these guys. We know them, they are the devil and they can't fail.\n",
        "\nBlack Sabbath is a band that has gone through a lot of line-up changes. And although there is a golden stature to the Ozzy Osbourne era, the Ronnie James Dio era seems to have just as competitive a fanbase. With the three classic albums Heaven and Hell (1980), Mob Rules (1981), and Dehumanizer (1993), this fact became pretty apparent to Black Sabbath’s label (Rhino) in 2006. Thus Rhino released a Black Sabbath — Greatest Hits compilation featuring the best of the Dio years, for which Dio and the rest of the band got together and recorded a new song. Even though the band had reunited with Ozzy in 2001, they had actually been pretty inactive save for a few Ozzfest gigs. So when the compilation and new material became a mass success, the early ’80s-era line-up of Black Sabbath (Tony Iommi, Vinny Appice, Geezer Butler, Ronnie James Dio) decided to re-form under a different name (as the band had not fired or replaced Ozzy). That name was based on the debut record of Dio with Sabbath: Heaven & Hell.\n\nWith Ronnie James Dio back in the fray, the band was able to settle into the comfortable writing space they had always had with Dio. Although Ozzy was always the most iconic front man of Black Sabbath, he was also notorious for his unreliable attendance, still struggling to work together with the band for new material in 2001, which never surfaced. So it was almost a shock to the band when they went in to record Heaven & Hell material in 2008 and had it done within a few months, with the result being the monolithic The Devil You Know.\n\nTo describe this record, I would have to say it’s at the top of what I have always wished for when it came to Dio’s era of Black Sabbath. It has the heavy, chunky, slow, and gloomy doom metal riffs which won the band for me with Ozzy, while also containing the virtuosic singing ability and epic melodies of Dio’s style. So by all means, this record is a perfect fusion of the two eras and MY GOD is it a bloody fantastic result. \n\nThis album is absolutely crushing. While the work Dio did with the band previously was still definitely heavy metal, it wasn’t in the heavier, gloomier, monolithic, and slower style known as doom metal (think songs such as “Black Sabbath,” “Iron Man,” “Electric Funeral,” or “Under the Sun”) that Ozzy and co. perfected in the ’70s. That is remedied on this record with some of the darkest, doomiest music that Dio, and even Sabbath, have ever been involved with. Tony Iommi’s riffs are almost heavier and more sinister than in his prime with Black Sabbath, dwelling within that slow, almost atonal guitar-riffing style with equally chunky and evil bass lines from Geezer Butler and pummelling, crushing drum work from Vinny Appice.\n\nOther than the sinister riffs, another reason this record has such a dark vibe is the fact that it took Dio’s fantastic lyric writing and Sabbath’s general dark imagery to conjure images of demons, fallen angels, and sin, which work together to give the album quite a hellish mood and atmosphere. But despite the quite fantastical imagery, the album still has a very personal edge to it. It’s given to you from such a very real point of view, going in-depth about the emotions, that you can have some sort of relation to it. It also lets the songs that are more purely about emotion and don’t quite have the fantasy element blend right in as well.\n\nAt the end of it, this is one of the most powerful Black Sabbath outputs in the groups history. Tapping into what made Black Sabbath the defining metal band they are to create the most truthfully Sabbath album in a really, really long time has left this as one of my all-time favourite Black Sabbath albums and my favourite featuring Ronnie James Dio. Unfortunately, this would be Ronnie James Dio’s last musical outing before succumbing to stomach cancer in 2010. I can’t think of a sadder moment for the metal world than that day, and he is a force in metal that will be missed forever. I guess all I can say is that I’m glad his last output was a bloody fantastic one, as it ends his career on a very high note. Now that the soul of Black Sabbath, Toni Iommi, has the big C as well, and it seems the Ozzy-era Black Sabbath reunion of 2012 is hitting some rocky ground, if The Devil You Know is also the last Black Sabbath record, it’s one hell of a swan song for everyone to go out on. Pure, evil, doom metal magic. 10/10\n\nBest Songs: Atom and Evil, Bible Black, Double the Pain, Rock and Roll Angel, Eatting the Cannibals, Follow the Tears, Breaking into Heaven\n",
        "\nListening to a band like Black Sabbath, sorry, Heaven & Hell, I wonder: why can't all bands just be good? Y'know, I'm fed up of bands going through life adding nothing, attracting a star-dazzled fanbase and then disappearing back up the record label bosses arse two weeks later. Such is the seeming consummate ease with which this group of near pensioners can produce a doom metal record is staggering, with not a jot of cliche nor hint of dollar signs appearing on the horizon. Let me just clarify on the age bit: the combined age of the four here is 237! Eat that you stinking BMTH's of this world...\n\nIn my eyes as a Black Sabbath fan of a measly 8 years the professionalism of this group has been to the utmost, resulting in \"The Devil You Know\" not being lumbered with the same usual hyperbole and sense of occasion that usually bring down such a high profile release. And this is sensed immediately with \"Atom & Evil\". A lumbering beast of a doom metal tune, it is just huge - Dio's impregnable vocals, Iommi's God-like riffing and the mighty rhythm section of Butler and Appice all in perfect sync with one another to produce a pure majesty that results in doom greatness, not just slow lethargy. The album's lead single, \"Bible Black\" begins like a certain Led Zeppelin classic and finishes catchy, invigorating and memorable.\n\nRiffs are always leaden weight in the land of Heaven & Hell, and rarely do they dip below the ‘brilliant’. Even if \"Rock & Roll Angel\" gets a bit tiresome, for every one of these there is an \"Eating The Cannibals\", a song which recalls not only groovier Cathedral and recent Candlemass but exposes the value in Ronnie James Dio. The little man gives the song new direction where for anyone else it might have been that an upbeat song in the middle. And just incase The Man Who Invented Heavy Metal (the capitals are entirely justified) needed to prove a point, Tony Iommi follows up his flashy soloing in \"Eating...\" with an \"Iron Man\" of a riff for next song \"Follow The Tears\". His work needs no more introduction than this.\n\nThis album is of course very different to that of the band's moniker released under the Black Sabbath name in 1980 as the benefit of greater technology has given a considerably weightier production and verve, exemplified in songs like \"Atom & Evil\". Whilst the missing fragility of \"Children Of The Sea\" is missing in this new guise with its modern production is a discussion worthy of a thesis itself, the point is that any Black Sabbath fan could hardly ask for anymore. When things could so easily have gone wrong, the old masters return to show the world how to grow gracefully. Well, as gracefully as is possible when doom metal occupies your 60 year old heart... \n\nOriginally written for Rockfreaks.net\n",
        "\nThe Devil You Know is a great comeback from a line-up that many people never dreamed would reunite for the third time. This album is all around fantastic. This album is virtually perfect in every single way except a couple minor things, which I will get to later on in this review. When they released the single for this album, 'Bible Black', I already knew that the album was going to be great and that it would be an Album Of The Year candidate, and I wasn't wrong!\n\nDio's vocals on this album are just some of the best and most aggressive sounding vocals he's ever put on an album. His vocals match the intensity that the album art for the album gives off as well as the album title itself. For being a couple years shy of seventy years old, Dio has still got it. In this album, Dio blends the perfect mixture of melody and aggression together to create some of the best vocals he's ever done on an album, if not the best. Dio's lyrical ability is also top notch and on this album he created some of the best lyrics he's ever written for any other album. The lyrics on this album are just great.\n\nTony's riffs on this album are just killer all throughout the album. There is not one single bad riff on this whole entire album and it really shows that Tony still has the ability to create fantastic riffs, he hasn't lost a step. This album features some very unique riffs, especially on the tracks 'Fear' and 'Bible Black', the riffs on those two songs are just great. The riff on 'Rock & Roll Angel' has some similarities to the riff on 'I' from Dehumanizer but Tony managed to tweak it enough so it's not exactly the same. 'Follow The Tears' has a very heavy riff that is no doubt the heaviest riff on the whole album. It has a great blend of melody and crunch to it that really makes the song along with the lyrics. Tony in my mind is the greatest riff writer in the history of music. The man is still a genius!\n\nGeezer's time to shine on this album came on the song 'Double The Pain' where he starts the song off with a nice little bass solo and his bass is very audible throughout the song including a break in the middle of the song for another small bass solo. Geezer is on the ball on this album as he usually is. Geezer!\n\nNow, the worst part of this whole entire album is Vinny Appice. I've always laughed at his drumming and always looked at him to be no better than an amateur. His drum fills on this album, as always, are laughable and just very bad. I mean, the man plays with the opposite ends of his drum sticks which no doubt effects his tone, but not in a good way. I really wish Bill Ward could have been on this album so he could show Vinny the proper way to get it done. While I'm on the subject of Vinny Appice, his live drum setup is one of the goofiest setups I've ever seen. Vinny is all around a very lame drummer and really stops me from giving this album a higher percentage.\n\nThere are a couple minor flaws on this album which is how long the track 'Breaking Into Heaven' drags on. Now, it's not a bad song by any means but I just feel that they could have cut it short by a minute or even two minutes. Plus, I think that it should have been the first song on the album to kind of create this theme, I guess you could say. You're Breaking Into Heaven, which is this great album. I feel that this would be the proper way to start of the album.\n\nIt is definitely hard for me to pick out any weak tracks on this amazing album. All tracks are enjoyed equally by me, and I would feel sort of guilty if I were to pick what would be the weakest track.\n\nThis is no doubt the Album Of The Year, not even in the metal genre, just overall. There really isn't an album that's come out so far or that is coming out this year, that can rival this album. Well, maybe the new Tenet album or the Blatant Disarray album or even the Candlemass album that came out a couple months ago but overall this album is just fantastic.Tony, Dio and Geezer have not lost a step in their old age and can still kick any younger band's asses! I really recommend checking this album out if you haven't already. You'll be blown away! Believe me! The riffs are just killer!\n",
        "\nHeaven & Hell is, of course, the lineup of Black Sabbath from when Ronnie James Dio was the singer. Or at least, most of the time, as Bill Ward was still Black Sabbath’s drummer on Heaven and Hell and was later replaced by Vinnie Appice who drums on this album. The band took the name Heaven & Hell in order to respect Black Sabbath who had recently been inducted into the Rock ‘n Roll Hall of Fame. Tony Iommi, who at this time, owned the rights to the name “Black Sabbath” decided that this band should have its own identity and fans should not expect to hear “Paranoid” or “Iron Man” at a Heaven & Hell show. So thus, Heaven & Hell was born.\n\nPrior to the name change, the lineup had gotten together for a tour and recorded three new songs for a Best Of compilation for the Dio-era Black Sabbath. These three new tracks laid the groundwork for the upcoming new album. But first, the band changed its name. \n\nThe album The Devil You Know is the first album of new songs recorded by the band, and is the first album of new songs recorded by any form of Black Sabbath. It was one of the most highly-anticipated albums of 2009 and for good reason. There had not been a new album from Tony Iommi since 2005 and from Ronnie James Dio since 2004. Knowing that these two icons had gotten back together and recorded new material was enough to send metalheads into a frenzy. When the new album artwork was posted, again fans were abuzz.\n\nSo, how is the new album?\n\nHonestly, it’s something of a letdown. It is a perfectly good album, but it was a victim of its own hype. The interest in the album had risen to a fever pitch and very few albums could have adequately lived up to that hype. That is not to suggest that it was a bad album, very far from it. It just was not as good as everyone hoped it would be.\n\nThe band fits very neatly into the traditional doom genre. This was to be expected as Black Sabbath had been the purveyors of the doom metal sound. When Dio came on board, the band perfected that sound. Heaven & Hell is slow and extremely heavy and somber. There are some faster songs on the album, but even those still easily fit within the doom genre. The album does have a more traditional metal flavor to it as well, to go along with the doom elements. The album would not have been out of place coming out immediately after the Dehumanizer album, which also had Dio fronting Black Sabbath. It sounds that true to the style.\n\nThe music, as implied, is often very slow with lumbering riffs, and heavy bass. The bass is audible and is some of Geezer Butler’s best work in years. It is the driving force of the rhythms behind the riffs. Tony Iommi has not lost a step in his age. He is still very capable of writing some amazing riffs, and does so many times. It makes the album interesting to listen to and many of the riffs are infectious, getting stuck in the head and not leaving for days. Iommi also provides some great guitar solos, with a clean tone and good technique, particularly the solo on “Fear”. The drumming is efficient but definitely not one of the major features of the band. It is there for rhythm only and filling in where needed, and while there are some interesting drum parts, it mostly takes a back seat for the riffs and vocals.\n\nThe music is mostly played in minor keys, obviously to take advantage of the natural tendency to sound more imposing. The band does do a decent job of staying away from standard verse-chorus-verse structure. This makes the individual songs stand out more and keeps the album from running together. Unfortunately, many of the songs do tend to stay at one speed. Some tempo changes would serve to make the songs stand out even more. \n\nRonnie James Dio is one of the all time great vocalists in metal, and perhaps any genre of rock music for that matter. His vocals are still great, despite his advancing age. He is still able to reach that awe-inspiring, rich tenor tone that he has become known for over the years, and his ability to continue to do so is one of the highlights of this album. His vocals also fit seemlessly with the music. He does not sound at all out of place as his higher vocals balance out the deep bottom end of the music. If anything, this interplay makes the music even doomier. \n\nLyrically, this is definitely similar to a Black Sabbath album. Many of the themes are dark. The only song that seems to have bad lyrics is “Rock and Roll Angel”, which would have been a perfectly acceptable song in the 1980's but sounds pretty cheesy now. \n\nThe better songs on the album are “Bible Black” and “Eating the Cannibals”. “Bible Black” starts out with a powerful, solitary guitar solo and the vocals of Dio. It then slowly builds upon this loneliness into a heavy power chord progression. The song is very similar to classic tracks like “Heaven and Hell” and “The Mob Rules”. “Eating the Cannibals” is the fastest song on the album and is exactly the kind of song that fans expected out of the reunited lineup. It is a straight-ahead, classic metal track. \n\nThe album as a whole is a strong release and will probably be one of the better traditional metal albums released this year. However, it does not possess enough new and original ideas to match the hype that was built up for it. It is a very good, sometimes great album, that is a victim to its own impossible expectations.\n",
        "\nRegardless of the name at the top of the cover slip, the personnel involved in the recording of this CD quite rightly mean that it is always going to be regarded as a Black Sabbath release. Not only does this mean it is a serious event – far more so than any of the work the members have been turning out in their respective individual projects in recent times – but of course also put an extra onus on Dio, Iommi, Butler and Appice not to balls the whole thing up. \n\nThe quality of the 3 Dio/Iommi-penned tracks that were written for ‘The Dio years’ Sabbath compilation just before The ‘Mob rules’ line-up properly reformed (or formed, or whatever) under the Heaven & Hell banner strongly suggested that there was nothing to worry about though, and this 19th full-length/debut CD follows suit accordingly. \n\nMusically and lyrically, ‘The devil you know’ is very much a logical continuation from where this version of Sabbath left off on ‘Dehumanizer’, the more upbeat melodiousness of “The mob rules” and “Neon knights” discarded again in favour of pounding, dark anthems of paranoia and isolation. Though despite being a natural successor to the first comeback of this line-up, it is not quite ‘Dehumanizer 2’ – the defiant chest-beating of “I” and “TV crimes” is not delved into this time around, and despite the overall downbeat, doomy vibe, the chilling menace of “After all (the dead)” is never quite reached again, and as a whole the songs sit in the middle ground between the 2 extremes. \n\nPresumably the lack of tension in the studio between the musicians that no doubt drove much of the aggression on ‘Dehumanizer’ is responsible for this, and the newfound comfort they have as a band has quenched their fire a little, but that is maybe doing the songs a disservice. Truly its own CD, ‘The devil you know’ offers something that is both immediately familiar but not an example of habitual repetition. \n\nPerformance-wise, the assembled veterans deliver exactly what would be expected from each of them. The vocals of Ronnie Dio, despite his ever-advancing years, are still a joy to behold. Anyone who has been paying attention knows his register has lowered over the years, and the snarling edge has mostly gone from his voice, but he remains the master of captivating melodies and hasn’t lost an inch since his last full studio performance on ‘Master of the moon’. Butler and Iommi’s playing skills are naturally less susceptible to age than those of the frontman, but despite a lack of standout instant classic riffs and solos, the 2 are in fine form as well. Butler’s bass playing may not be as unique as it was 40 years ago, but he retains a distinctive style and offers many unexpected little quirks as the CD progresses. The doubled-up intro to “Double the pain” is typical outside-the-box thinking from the bassist. \n\nIommi of course has always been the rock on which the endless Sabbath permutations have been built on, and his display was always going to be the make-or-break factor as far as this CD is concerned. The foreboding riff that opens the CD on “Atom & evil” more or less sets the tone for what is to come and confirms, as if anyone had any doubts, that the grandmaster has still got it. The skulking, sinister playing that follows in the later verses of this song is just pure, simple inspiration from Iommi and even though there aren’t many riffs that feel like they’ll achieve truly iconic status like so many of his previous concoctions, the most important cylinder in Black Sabbath is without a doubt still firing. The ubiquitous phrase “Bible black” is finally committed to song on what is possibly the best track on ‘The devil you know’. Some stellar acoustic playing in the mournful intro couples with a perfect vocal display from Dio, before the anticipated heaviness kicks in on a menacing doom-fest wrapped up in some enthralling lyrics. One of the few ventures into the expected occult territory, they could nevertheless also be read as another treatise on temptation and man’s thirst for knowledge whatever the cost that make up much of Dio’s work on this CD. \n\nThe most noteworthy and commendable about thing about the quality of ‘The devil you know’ is that it shows the rejuvenation and freshness that this reunion has provided for the 3 main members (no disrespect to Appice intended), as it is most definitely the best product any of them have delivered in some years. Dio’s own band has been rather stagnant for a while now (while still providing a terrific live show), while Iommi’s last solo outing with Glenn Hughes back in 2005 was diverting if entirely overrated. The less said about Geezer’s industrial tomfoolery the better, and that the 3 of them have collaborated on such a strong undertaking just goes to show the magic this version of Black Sabbath really had, and indeed still retains. \n\nWhen all the euphoria over the fact that the CD has actually happened eventually dies down, the cold light of day will reveal that it is not a classic, but that is not to say there is anything disappointing about it. The Dio-fronted Sabbath always set the bar very high, and the fact they have not quite managed to match the amazing quality of their previous works 15 years after their last collaboration is nothing to be ashamed of. Seeking this one out is mandatory. \n\n(Originally written for http://www.metalcdratings.com/)\n",
        "\nWhile I am a fan of just about every era of Black Sabbath's history (Yes, that includes \"Seventh Star\"), I've always had a soft spot for the Dio era. His majestic voice and intirguing lyrics have always gone well with Tony Iommi's dark guitar riffs, Geezer Butler's sludgy bass lines, and Vinny Applice's solid drum work. Needless to say, I was quite euphoric when it was announced a few years back that the players during that time period would reunite to give it another go. Now that they've got an actual album out and have done more in three years than Ozzy Osbourne couldn't even accomplish with them in ten, I must say that they made the right choice...\n\nIn terms of style, it's best to say that this album basically picks up where \"Dehumanizer\" left off. The guitar/bass playing continues to be dark and hard hitting with hints of melody found throughout, the vocals are as soaring as ever, the lyrics are generally melancholic and downtrodden, and most of the songs stick to a slow or mid-tempo pace. Of course, there are faster exceptions found in \"Eating the Cannibals\" and \"Neverwhere,\" but they aren't quite in the same mold as \"Neon Knights\" or \"TV Crimes.\" In fact, they may be my least favorite tracks on this album, though they aren't really bad by any means...\n\nWith the band not content with simply rehashing their past glories, there are plenty of new, experimental elements found throughout the album. \"Double the Pain\" immediately comes to mind with its ominous bass line sounding like something Alice in Chains would've come up with and its subtly infectious chorus. As much as I enjoy the sinister themes of \"Bible Black,\" I personally feel that \"Double the Pain\" would've been a better choice for a first single and may be my personal favorite song on the album. \"Follow the Tears\" is another particularly interesting tune with its mournful lyrics and unusually brassy interjections coming in during the simple but sweeping chorus.\n\nGiven that Ronnie James Dio is back behind the mic, the lyrics are inevitably worthy of note. While they aren't as monumental as the lyrics on past efforts, they are mysterious as ever and may have gotten a little stranger over the years. A few highlights include the foreboding silthers of \"Atom and Evil,\" the Promethian imagery of \"Fear,\" and the previously mentioned depression of \"Follow the Tears.\"\n\nAs expected, there are very few flaws to be found on this album. I imagine that those who are expecting a second \"Heaven and Hell\" (the album, not the band) will be in for a shock, but the songwriting is still intelligently writtena dn the band's performance is smoothly executed. All in all, it's the first great album of the year and is mandatory listening for anyone who dares to call themselves a Sabbath fan.\n\nPros:\n1) The band's overall chemistry is overwhelmingly inspirational\n2) The songs are intelligently and interestingly written\n3) A few new elements keep things interesting\n4) How the hell did four guys in their 60's create something this goddamn heavy?!\n\nCons:\n1) May be a little too slow for some listeners\n2) Dio's lyrics may continue to be too strange for some\n3) Vinny Appice's performance is solid, but doesn't stand out too often\n\nCurrent Favorites:\n\"Atom and Evil,\" \"Fear,\" \"Bible Black,\" \"Double the Pain,\" and \"Follow the Tears\"\n",
        "\nIf absence, as they say, truly makes the heart grow fonder, than this group of four veteran musicians would enjoy eternal reverence from the black masses of metal for all eternity based on that alone. But unlike many other longstanding franchises that have come and gone since the inception of heavy metal, this one does not survive by faithful adherents alone, but instead delivers high quality cuisines whenever it reforms itself. Within their very much orthodox and consistent mode of song creation, there seems an infinite number of possible ways for them to write perfect songs without need of quirky gimmicks and stylistic crosspollination. Everything here, as it has been all of their previous, though sparsely placed opuses, is pure unadulterated heaviness delivered in its simplest form.\n\nBy all accounts, this is a Black Sabbath album, excluding technical legalities brought to us via the Ozzman, aka mister washed up media whore. It is a testament to the fact that in spite of the name being scuttled, that the parts that made up the same sum are still alive and well, which is more than I can say for the original front man of this group given his output both with these musicians and others in the past 17 years. Perhaps it was out of jealousy that Ozzy can’t accept someone actually putting together a full length album under the Sabbath name, something that he has failed to do since he reunited with them and turned them into his own personal sideshow attraction. But regardless, Heaven And Hell bears little difference from its former name in terms of quality, nor spirit.\n\n“The Devil You Know” is exactly what its own title suggests; a familiar recapturing of the spirit of Sabbath styled doom metal that was long thought to be lost more than a decade ago. It features a collection of well crafted, punishingly slow and heavy anthems to woe and discord that has embodied Metal since it first rebelled against the illusionary world of flowers, peace and love that blinded many to the true nature of the world in the 60s. Powerful guitar riffs and traveling bass lines battle each other for which one will reign as the darkest aspect of these trudging tributes to darkness, while the drums exhibit this duality of looseness and dryness that keeps things organized and also stirs the cauldron a little with unexpected ornamentations and fills. But the greatest charm to be found here is the simplicity at work and the utter lack of pretention. There’s no effort to impress, but simply a blunt honesty that can rival even the most and grandiose of epic compositions in the doom style, but with about half as many riffs.\n\nThe leading aspects of the band are also noteworthy, as they further differentiate this release not only from the rest of the pack out there, but also from previous works under the Sabbath label. Tony Iommi has gone through various stages of basic and complex soloing, the former of which peeked during “Vol. 4”, and the latter character came to dominate his leads during the 1980s. What emerges here is a much more moderated approach to an instrumental break, having a very melodic character that is quite different from the rapid streams of pentatonic runs that triplet licks utilized on previous Ronnie Dio and Tony Martin collaborations, but also not nearly as formulaic as the more primitive solos heard during the 1970s. A good example of this is the expressive lead work during the acoustic intro of “Bible Black”, which has more of a singing quality to it than even the intro to “Children Of The Sea”, which is among Iommi’s more catchy and memorable lead moments from his more technical era. Likewise, the steady stream of notes heard on the solo of “Eating The Cannibals” is about as far away from the formulaic leads of “Snowblind” and “Sabbath Bloody Sabbath” as they come.\n\nRonnie Dio’s vocal work is basically flawless, still remaining a step ahead of his semi-operatic emulators Tony Martin and Robert Lowe. At the ripe age of 66 this colossal vocal answer to Napoleon Bonaparte still fills the microphone with high end majesty as if he just hit his early 30s. Decades have passed since he cut his first single in the late 50s, long before the concept of heavy metal came into being, and in spite of all the trends that have come and gone, the same vocal style and character has remained, forcing every genre of music that it has ever accompanied to assimilate to its will. It’s basically an expressive combination of clean sung glory and gravely yet tonal shouts common to both rock and metal music, but with about four times the attitude and twice as much control as what you’d get out of most in the former style.\n\nWhen dealing with these songs on an individual basis, comparisons to “Dehumanizer” could be made, along with a lot of other Dio and Sabbath albums that came out after said release, and even a few from before it. There isn’t really one era of their project that defines this album, but more of an even mix of them all, compressed into a modern yet not overdone production. Songs such as the creepily slow and dark “Atom And Evil” and the dissonant yet catchy “Fear” could be compared to material heard on “Cross Purposes”, “Strange Highways” and “Magica” and still not quite describe the character of the sound in its entirety. Likewise, faster songs such as “Eating The Cannibals” and “Neverwhere” carry a dueling “Dehumanizer” sense of darkness and a “Mob Rules” meets “Holy Diver” feeling of riff familiarity and majesty. Some other songs such as “Double The Pain” and “Follow The Tears” get so heavy on the bass and low end riffs that they cross over into sludge territory. There’s essentially a little something for every fan of every respective era of these musicians’ careers to grab onto.\n\nAs was the case in 1992, the triumphant return of this outfit has resulted in a lesson that can school any and all adherents of metal music. It is definitely one of the best, if not the best album to come out this year. It isn’t a matter of this band being capable of doing no wrong, but simply that every time their in the studio, nothing ever comes out that way. They reprove their worth every time, starting nearly from scratch at each instance, and have once again put out something that will be talked about and listened to years after the novelty wears off. This is the devil that all of us know and love, forever unchanging, and forever a master at his craft.\n\nOriginally submitted to (www.metal-observer.com) on May 8, 2009.\n",
        "\nIt certainly is a feat to remain relevant in any musical scene for as long as Black Sabbath have been around. Just think about how many long-standing bands are out of touch these days. I don’t feel the need to start name calling; you should know who I’m talking about. I’m not saying that Sabbath haven’t released any duds, but not with this line up they haven’t!\n\nI don’t think it’s necessary to go into a lengthy introduction of the band. Anyone who claims to be a metalhead should be knowledgeable about this band. So let’s just get on with the music, shall we? Heaven & Hell kick their debut(?) off with an excellent doomy rocker, Atom And Evil. Just from reading the song title you should be able to tell that you’re in for a real classic treat. When Iommi crunches out that slow paced mother of a riff, just turn your speakers up because it only gets better. Atom And Evil slowly bulldozes its way along, proving to be a great opener. The album soon speeds up with Fear, a faster tune reminiscent of the Dehumanizer era. If you listen to this band for the epic choruses, Bible Black is the song you should check out first. This is truly a massive tune where the whole band comes together to create something really special for the fans. It opens with a nice acoustic melody and Dio’s golden voice to make an intro that immediately reminded me of Children Of The Sea. But then - BAM - more crushing riffs from the godfather himself. This one’s a real gem for the catalogue.\n\nFillers? You won’t find them here. Some tracks are a bit weaker than others (Rock & Roll Angel) but every one has something to offer. Diversity is something else that impressed me about The Devil You Know. Fast tracks such as Eating The Cannibals nicely contrast with the slower songs (Breaking Into Heaven).\n\nYou seriously wouldn’t know that this was the bands first album in, hell, how many years? They really are as tight as they were in the hey-day. Each member steps up to the plate and delivers with all their balls. I think Iommi gets MVP for this album though, because the riffs here are definitely on par with his old classics. My personal favourite is Double The Pain, but they’re all fair game. Being a big Dio fan, I was glad to hear that his angelic vocal chords are still in mint condition. The drums and bass are pretty standard, but shine here and there.\n\nIf this is Heaven & Hell’s final album, there would be no shame in that. I’d safely dub this a modern classic, and certainly a highlight of 2009. This belongs in the hands of metalheads across the world.\n",
        "\nI don't suppose I need to delve into the story behind this band much, because chances are you already know it, but on the off-chance that you don't, I'll sum it up in one sentence: Black Sabbath couldn't be called Black Sabbath anymore due to Ozzy Osbourne not wanting anything too awesome under that name anymore, so his old band teamed up with former singer Ronnie James Dio to rock the world once again. And here it is, the album we have all been waiting for, the product of months and months of hard work and true metal mastery, The Devil You Know.\n\nFirst question, is it good? Fuck yes, it is, and if you had any doubts, you can stop reading this review right now and go back to your knitting circle, because this isn't for you.\n\nSecond question, how good is it? Well, I don't think anyone really expected these guys to re-invent the wheel (despite this reviewer's smidgen of hope that they would do something surprising), and they pretty much didn't. I mean, after doing metal for so many years, there are only so many ways a band can take their musical limits, and Iommi, Dio, Butler and Appice are just doing what they do best. That's pretty admirable from my point. No sell-out, no pussifying their sound, just Heavy Metal as solid as a goddamned anvil. And considering the minds at work here, I don't think I have to say that this is just pure magic from a musical and songwriting standpoint.\n\nThe basic sound here is like the three new songs off the Dio Years compilation, which themselves sounded like Dehumanizer except even more modern and oppressive, and a bit less varied. The guitars are heavy and...well, they're just really heavy, there's no other word for it. Iommi's tone is as thick and rich as molasses, and the riffs he plays are just pure class - perhaps not better than any of the classic Sabbath riffs, but still, in this day and age, these kind of riffs are a blessing. Dio's voice is in fine shape as he powers out ironclad, unstoppable vocal lines that show no sign of him slowing down at all. His ear for melody and hooks is still intact, as many of these songs pack choruses or even verses that will get lodged in the listener's head for days and never come out. The drums are thunderous and powerful, keeping up the slow tempo with a confidence unrivaled to this day, and Geezer's bass is still heavy enough to register on the Richter scale.\n\n\"Atom & Evil\" kicks off this metal maelstrom with a stirring force, heavier and more primal than most anything the metal scene has seen in years. Dio's vocals are slooooooow, and the guitar riffs even moreso, and the whole thing generally oozes along like the oldest primordial slime. All of these songs generally follow the same formula, with the variation only being in riffing and in the general themes, and how can I really complain? It sounds absolutely stellar in every sense of the word. Standouts include \"Bible Black,\" with its devilishly hooky closing riff and killer wailing chorus, the charging and vehemently attitude-filled \"Double the Pain,\" the somber, bluesy epic \"Rock & Roll Angel\" with its more complex riff changes and guitar arrangements, \"Eating the Cannibals,\" a faster song with an absolutely punishing musical motif and \"Breaking into Heaven,\" which is just about the best soundtrack to storming the ivory gates in black flaming chariots that I've ever heard, with its epic stomp being refreshingly riveting.\n\nSo, at the end of the day, how does Heaven & Hell's first foray into the new millennium size up to their contemporaries? Extremely well, in fact! The good old Sabbath boys don't have anything to prove to anybody, and here we see them stubbornly holding a collective middle finger at the throes of compromise. The Devil You Know might not be a crowning accomplishment in the mammoth discography of the parts of this band, but it is a nice testament to consistency, and when one considers the year in which this album has been released, it really is quite a stunning comeback. Very good show, boys.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nIf you asked anyone just a few years ago, they would have said there was no way that Black Sabbath would ever be joined by the one and only voice of metal, Ronnie James Dio. We have all been proven idiots yet again, and I for one couldn't be happier.\n\nAfter the band got back together and toured the world under the name Heaven & Hell, including the masterful playing on their \"Radio City Music Hall\" DVD, the response was overwhelming enough that they decided to resurrect their careers one last time to put out an album. But could anything these legends put out live up to the legacy that they had created?\n\nYes it can.\n\n\"The Devil You Know\" is a different beast than any of the three Dio fronted Black Sabbath records, but hints at all of them. The epic melodicism of \"Heaven and Hell\" permeated the closer, \"Breaking Into Heaven\". The energy of \"Mob Rules\" infuses Eating the \"Cannibals\". The sludge power of \"Dehumanizer\" reinforces the strength of \"Fear\". This is an album created by four musicians who know their strengths, and have a century's worth of experience behind them.\n\nFrom the opening note of \"Atom & Evil\", it is clear that the band means business. This is a seriously heavy affair, but not without bringing enough melody to contrast the metal fury Tony Iommi's guitar has created. Geezer plays his trademark runs, including an effects-laden intro on \"Double The Pain\" that harkens back to the good old days. Dio, the ageless wonder, dominates over the top of the mix, his voice showing almost no wear despite his age. He weaves familiar melodies, telling stories that he has told many times before. But that's exactly what we want from him.\n\nThe fears that this album would be a dirge were unfounded. The tempo ony really picks up on \"Eating The Cannibals\" and \"Neverwhere\", but the majority of the album stays in a solid mid-tempo slightly faster than what might be expected. The true surprise is the use of acoustic guitars, as a soft intro for \"Bible Black\", a coda for \"Rock And Roll Angel\", and layering the chorus of \"Double The Pain\", much like the band did years ago with \"Wishing Well\".\n\nNone of the songs immediately strike you with the force of \"Neon Knights\" or \"Heaven and Hell\", but they have enough subtleties to draw a distinction from the almost one dimensional onslaught of \"Dehumanizer\". This is a professional album bearing the name of four professionals who aren't content to rest on their status as the founding fathers of heavy metal. \"The Devil You Know\" doesn't live up to the very best that any of these men have put out, but it was never going to. Those albums have been mythologized to the point that such a thing is impossible to achieve. What this album does do is show the world that age is just a number, Heaven & Hell is just a name, but the spirit of Black Sabbath still flows through their metal veins.\n",
        "\nI never thought I'd see the day where Ronnie James Dio would be fronting Black Sabbath again (yes, they're called Heaven and Hell now, but it's the same band with a different name – it's almost like you could say that they're The Devil You Know...). Then I was treated to three new tracks on The Dio Years. They were pretty good; at least better than the two new Reunion tracks with Ozzy were. And then we got the live DVD at Radio City Music Hall. This was great because it replaced the MIA video for Live Evil, which may or may not exist, depending on who (or what rumors) you believe. Also, I think the cover art for this album is wicked (that's a good thing, by the way). Even the alternate Wal-Mart exclusive cover is pretty cool.\n\nAs it stands, this album delivers on all levels. It's got some fast ones, and quite a few doom tracks. The basic way I would summarize this album is that it is a doomier version of Dehumanizer. It is up there in quality with Iommi's last solo album, Fused. The riffs on this album are very reminiscent of classics like “I” and “Letters From Earth”. I think most notable is that the album is mostly in Eb tuning (same as Heaven and Hell, Mob Rules, and Dehumanizer), but two songs are in the old Sabbath standby C# (first seen on Master of Reality), with those tracks being “Rock N' Roll Angel” and “Follow The Tears”. It really gives them a heavier, doomier feel.\n\nI think what strikes me most is that there are a lot of riff changes on this album. Iommi really went to town with this. There's several monster riffs, such as the chorus to “Atom & Evil” and the intros to “Double The Pain” and “Breaking Into Heaven”. There's even a completely weird riff for the start of “Rock n' Roll Angel” that doesn't sound like something Iommi would do at all. And the solos are good, too. The whole album has a good rhythm and feel to it, sometimes plodding, sometimes very... well, saying it has a groove to it is probably a bad way to describe it... but it has a good balance of fast and slow. Iommi proves yet again that he is the master of the metal riff. He probably has forgotten more riffs than most people could write in a lifetime.\n\nAs for Ronnie, his lyrics are fine. It sounds more in the vein of Dehumanizer, with more 'occult' style lyrics and staying away from rainbows and things of that nature. I like the story-through-song approach we have going on, where a song is like a whole concept. Reminds me a lot of Dio's solo effort Magica and maybe even Strange Highways. “Atom & Evil” and “Breaking Into Heaven” seem to have the best lyrics, from what I understand of the songs so far, and they make a good opener and closer.\n\nAs for the other members, Geezer can be heard well in the mix, and he has plenty of sweet bass fills and great rhythm lines. I wonder how much of a hand he had in coming up with riffs for this album, since I know he was more involved with this writing process than he said he would be if it was Ozzy-fronted. I do know he came up with the album title, at least, as well as the 25:41 on the cover (a very pointed reference to Matthew 25:41 from The New Testament of The Holy Bible). And as for Vinny, his drumming is fine. It sets a good rhythm, is in time, and I actually like his fills (I don't understand why he gets ragged on so much). I'm not a big fan of overly complicated drumming, I just like it to fit the music and hold everything together.\n\nOne thing I will say about this album, is that I did not “get it” the first time around. And by that, I mean for the first couple of listens, I was kind of ambivalent towards it. Much the same way I was with Fused. However, after about four listens, I think this may be one of the highlights of the entire Sabbath band catalog and it's solo band offshoots. It's nice to hear Iommi play an acoustic guitar again, which he only has done sparingly for Sabbath songs like “Children of the Sea” and “Nightwing” (the latter is from Headless Cross). \n\nThe acoustic intro to “Bible Black” is reminiscent of “Sign of the Southern Cross”, and for a radio-friendly single it is very good. There's also a middle section of “Rock N' Roll Angel” that has acoustic guitar with a distorted lead guitar over it, and an acoustic outro (reminiscent of “Heaven and Hell”). However, back to “Bible Black”, I must say that am not impressed with the single 'radio play' edits of this song - they butcher an otherwise awesome song with out of place changes. So listen to the album version before you pass judgment on it. \n\nAs far as the album goes, it is a definite musical masterpiece. If this is the last thing we get from a Black Sabbath entity, then they definitely went out on a high note. They were very ballsy and the opening song for the album, “Atom & Evil”, is doom. I didn't expect it, but it works well. I'd say that the highlights of the album are “Atom & Evil”, “Bible Black”, “Double The Pain”, “Neverwhere”, and “Breaking Into Heaven”. I also like how the album begins with a take off on Adam and Eve (aka. 'the beginning'), and it ends with the angels of hell trying to break back into heaven. \n\nThe weaker tracks to me are “Rock N' Roll Angel” and “Eating The Cannibals”. I think they are a bit weaker in lyrical content than the other songs. However, “Eating The Cannibals” has an amazing use of the wah-pedal for the solo (like “Lady Evil” did), and the song is overflowing with guitar fills. As for the other tracks, “Fear”, “The Turn of the Screw” (which has the greatest intro riff, IMO), and “Follow The Tears”, they're also very good. The whole album has a good flow and is very listenable straight through, and a good length of 10 songs for around 55 minutes of music.\n\nAlso, for those of you fortunate enough to get the Best Buy Exclusive version with the bonus DVD, I hope you enjoy it. I did not get a copy with it, but usually such bonus content is rare with Sabbath-releases. There's usually not a lot of extra frills on their stuff. So I'll take what you can get. \n\nHopefully after this, we'll get another great tour (and possibly another live DVD, but I wouldn't hold my breath) with a few more classics from the Dio-Sabbath vault (“Letters From Earth”, “Turn Up The Night”, and “TV Crimes” for starters) and three or so songs from the new album. And after that, perhaps Iommi will give us a follow up to Fused with Glenn Hughes, and Ronnie will go back to Dio and give us Magica II/III. At any rate, The Devil You Know is metal done right. A lot of these new upstart bands should take a listen to this album so they can hear what real metal sounds like. \n\nDoom on.\n",
        "\nThis is a classic band in disguise as a new band and man this kick ass! That classic but new band is the legendary Heaven and Hell! While the band name is new, you might know these guys better as Black Sabbath. Well the Black Sabbath that featured Dio, Toni Iommi, Geezer Butler, Vinny Appice (and Scott Warren)! A few years ago, this lineup reunited to do tour together and perform songs from those days under the name Heaven and Hell (as not to infringe upon the original Ozzy-fronted lineup). The creative and metal spark was so strong that this group of metal legends decided to record a new album. This song comes off of that album that comes out in April.\n\nThese musicians are still in full glorious metal form! Dio sounds the best in years, still incredibly powerful is his vocals while not being overly aggressive. Just the perfect blend of melody and evil. Iommi is still a master of the riffs, churning out powerful, awesome, crushing audible doom. Geezer is in full form laying down the low end backup to Iommi. Vinny Appice isn't the most incredible drummer in the genre, but his simplicity works well with the music created by the band. This song is an awesome combination of pure doom heaviness, rock sensibilities and evil storytelling. With lyrics like:\n\n\"He reached for a book all bound in leather\nSomething that he knows he's never read\nAnd the first page says beware you've found the answer\nThe next one says I wish that you were dead...\"\n\nA little cliched, but still awesome! (totally love that part!) The track is a natural evolution and continuation of the style and sound they created with the three songs they did for The Dio Era best of package. The song starts off slow and haunting before exploding into dooming epic-ness. It's infectious and wonderfully singalongable (I found myself singing along with it). It's weird, the first couple listens I absolutely loved this song, but after awhile it started to drag in parts. Now it's one of my favorite songs and I'm totally excited for the new album. It's a perfect and brilliant addition to the Black Sabbath/Dio legacy!\n",
        "\n...To the anticipated follow-up to Dehumanizer. It starts off with a melodic duo of Iommi on acoustic guitar and a soulful vocal passage by Dio, which builds into a crescendo of classic Iommi riffage, supported by the unspectacular but always reliable Vinny Appice, and the ever solid Geezer Butler.\n\nSurprisingly a rare acoustic piece with haunting wails layered underneath, along with a mellow Dio is how they decided to start this monster. The haunting electric guitar then leads into a Sabbath doom assault (That conjures up thoughts of the ever so great Candlemass, which carried the life of doom after Sabbath's creative well dried up) with Dio vocalizing his passion in true form. The main riff is relentless, and one of the best that Iommi has written since the classic, Dehumanizer. Geezer undoubtedly makes his presence felt, keeping it on the ground.\n\nAfter a few verses of powerfully sung fantastical lyrics and a typically catchy Dio style chorus, Iommi reveals a solo that fits the occasion. Then it's back to the grind. Another verse and a few more choruses then unexpectedly Iommi breaks into a more traditional solo that fades out, ending this killer song that really took me by surprise with how great it is.\n\nOverall, I give Bible Black a ninety-one percent for the writing and execution of the killer music found within. Minus nine percent for Vinny Appice, being the most basic mucisian, contributing the least.\n",
        "\nOkay, when Tony Iommi and Geezer Butler announced they'd be working with Ronnie James Dio again and tour with the songs from that era, one could have expected it wouldn't be any less than good. But what the hell? When I hear 'Live At Radio City Music Hall', I hear a bunch of classic Metal heroes that have rejuvenated in every aspect. Every member simply hasn't sounded this good since the last time they played together.\n\nAnd yes, I am surprised. Okay, Tony Iommi has recently smacked me in the face with the amazing 'Fused' (with my favorite singer Glenn Hughes). That album was the proof that this man still had a lot of meaning to the Metal world. And Ronnie James Dio is of course still a great singer, but he hasn't sounded this energetic and powerful in the last ten to fifteen years. Compare these recordings to the recent Dio-live albums. I'm not saying he was bad, not at all, but it's as if he has suddenly gotten twenty years younger. Or maybe even thirty.\n\nThe songs are delivered with a sense of hunger and an energy that isn't equalled by a lot of bands that are a lot younger. Dio is a more vital front man than Ozzy (though that is sort of a given) and when you have the DVD, you'll notice that especially Tony Iommi is visibly enjoying playing these songs again after all these years. The sound quality is nothing short of fantastic and that offers the heavily underrated Geezer Butler the space to really shine.\n\nYou can try, but there's no way to escape the goosebumps-level of this album. Whether it's the expected classics ('The Mob Rules', 'Heaven And Hell', 'Neon Knights', 'Children Of The Sea'), the surprising selection of songs ('Falling Off The Edge Of The World', 'Lonely Is The Word', 'Lady Evil', 'I') or the excellent new tracks ('The Devil Cried', 'Shadow Of The Wind'), everything sounds great, sound quality-wise, performance-wise and vocally. Of course, anyone probably has at least one complaint about the song selection - I myself would have loved to have heard more songs from 'Dehumanizer' ('Masters Of Insanity'!) - but the fact is that the songs that are there are nothing short of excellent.\n\nRecently, announcements have been made that this isn't just a one-off thing and I really hope that'll stay that way. Because, let's face it, this lineup is simply one of the best things Metal ever had to offer and all the people involved still sound amazing. What else can you wish for as a fan of real Metal? I'd take this over any Manowar release any day. I wish them all the best and a lot of great releases in the future!\n",
        "\n“In the misty morning, on the edge of time.....”\n\nMy friends and I found ourselves embarking on one hell of a journey. Our destination was roughly two hours away, and our prize to be collected was immeasurable by mortal standards. Why? Well my friend, we were on our way to witness the gods of heavy metal perform. Starting off by breaking our necks to the bay area thrash of Testament, followed by the purest and oldest of heavy metal from the lords of evil Heaven and Hell, and then we were to have another thing coming when the almighty Judas Priest took the stage. The performances were all utterly amazing and it is one show that I will never forget. I had acquired this live CD for Christmas this past year and for some reason it didn’t have as much of an impact on me as I thought it would have.\n\n“....What do you say to the dead....”\n\nI’m not sure if it was my sub standard knowledge of Black Sabbath during the Heaven and Hell era that shunned away the immense entertainment that this CD has to offer, or if I was just too ignorant to really get into it. I know, Thor probably deserves to smash me for not knowing much about the band that started heavy metal, but my extent of it only runs through their first three albums which I think had misconstrued my experiences with this CD. But something happened that night at Mohegan Sun, I had experienced a revolution within my world of heavy metal. \n\n“......well I’m not afraid, I’m not alone......”\n\nEverything that night, from Iommi’s relentless riffing and mind blowing soloing, to the heavy thudding of Butler on the bass was something that I have never experienced before in a concert environment. It was a new era of excitement within my understanding of heavy metal and anytime that I wish to have that night back, to go back to those few hours of heavy metal bliss, I simply pop this CD in and turn it up all the way. This CD manages to capture everything that I had experienced first hand that night. It never ceases to amuse me, these are all legendary, classic, and mammoth sized songs which all deliver endless hours of entertainment. Now hopefully you are truer to the faith than I and have a better understanding of Black Sabbath and you have heard all of these songs before so that I don’t need to go into detail about the songs. But in a live setting these songs fulfill more than ever imaginable and capture your mind and soul and refuse to let go until the album is finished. And that is quite a feat for something that almost hits the two hour mark. Every time I throw this in I get flash backs to the show, the brilliance of it all. Dio, whom to people outside of metal would consider “too old” or “too weak” to perform live. Bullshit! Dio was, is, and forever will be an amazing vocalist. He still has all the energy, the passion, and the lust for huge riffs in every song. Speaking of huge riffs, everyone should know of the main riff in the title track “Heaven and Hell.” Dio entices the crowd into singing along to the riff, something that he also did at our show, something that is surreal to experience live. \n\nThe entire band looks, and more importantly sounds great! After all these years of rocking out these guys still manage to kick ass and they do it with authority! From the show that I have been to and from this CD alone one can easily tell that there is no stopping or even slowing down for these heavy metal veterans. The production here is great as well! You get a real heavy and clean sound from all of the instruments with Dio soaring above all the noise and chaos. Even when most bands lose their bass in the mix, you can clearly hear Butler grooving away. The crowd sounds are also a nice little effect that only trip you more into thinking that you’re there. Now I highly recommend this to any long time fan of Sabbath, or even for someone who has never even listened to metal before. This amazing piece of art is one that will surely convert them into the faith.\n\n“....If you listen to fools...THE MOB RULES!”\n",
        "\nWho knew that after Ronnie left the band both in 1983 and again in 1992, that he would ever want to collaborate with Iommi and Geezer ever again? Or if he would ever want to collaborate with Vinny Appice again, as well? I sure didn't. But I'm glad we did, because this DVD is great!\n\nI am sad that they were unable to squeeze \"Ear in the Wall\" into their live show for inclusion on this DVD, or in some other format (perhaps as menu music, or the music for one of the bonus features). But hey, this differs from the usual Black Sabbath DVD fare, as this actually does have some bonus features. Granted, they're fairly short, but they're very interesting to hear from Iommi's guitar tech and to hear about the origins of the little demon that dominates many shirts and sits on Geezer's bass.\n\nThe setlist was great, and nice and lengthy, nearly two hours long! The majority of the set was stuff from Heaven and Hell (6 out of 8 songs from that album), and then a few from The Mob Rules album, and then 3 off of Dehumanizer. I was sad they didn't include a few classics like \"Turn Up The Night\", \"Time Machine\", \"TV Crimes\" and such, but we still got a great helping of Sabbath that we never thought we would get to see live. And since the Live Evil film reels seem as though they may never see the light of day, we finally have Dio era Sabbath captured on DVD form in an official release!\n\nThe standout tracks here are \"I\", for it is the one song on here that has a riff unlike any other which Iommi lays down (it's almost thrashy), \"Lady Evil\" for it's amazing use of wah-pedal in its solo breaks, \"The Sign of the Southern Cross\" for Iommi managing to turn it into a doomy masterpiece, full of Ronnie's little vocal fills and great vocals, and Geezer's interesting use of a wah-pedal with his bass, and finally \"Lonely Is The Word\" for it's displaying of more of Iommi's ability to solo that we just haven't gotten to see much of in the past decade. And I like his use of a white SG as if this is a new chapter in his legacy.\n\nThe whole band is in great form, and appear to be having a great time. Iommi nails his old solos and somehow manages to never miss a note. Geezer has some really good bass fills. Ronnie sounds really good, though he is finally starting to show his age. His vocal range isn't quite as high as it used to be. But he still sounds great, and he makes it through the whole 2 hours without his voice cracking or giving out at all. And Mr. Dio manages to let out one of the most metal screams (at the start of Mob Rules) this side of Jon Oliva of Savatage.\n\nThere's a few places where the video footage is not quite aligned with what they are playing, such as a notable section in \"I\" when Iommi is playing the middle of the riff and the video shows him slide up to the end of the riff. Just little things like that. The drum solo is a little boring too. Other than that, the crowd does a great sing along with Heaven and Hell, and Iommi does a very nice extended solo both here, and as an intro to Die Young. It's nice to see Iommi let go and just unleash on the guitar, as he's been so reserved and had no place to really shine on the Black Sabbath The Last Supper Reunion DVD. Now he comes out and gets his own spotlight at the start of After All (The Dead), during the middle of Heaven and Hell, and at the start of Die Young. Then there's that crazy rockish riff at the start of Voodoo. Even Geezer gets a section to shine, during both Heaven and Hell and The Sign of the Southern Cross.\n\nIf you are a fan of Dio era Sabbath, then go pick up this DVD. The band still plays together as tight as ever, and you can definitely tell that on this DVD. And the video and audio quality is near perfect.\n"
    ]
}