{
    "Band Information": {
        "Country of origin:": "Switzerland",
        "Location:": "Nürensdorf, Zürich",
        "Status:": "Split-up",
        "Formed in:": "1982",
        "Genre:": "Speed/Thrash/Black Metal",
        "Lyrical themes:": "Death, Satan, Destruction, Armageddon",
        "Last label:": "Noise Records",
        "Years active:": "\n1982 (as Hammerhead),\n1982-1984 ",
        "Number of Reviews": 32
    },
    "Band Reviews": [
        "\nLast year, Darkness Shall Rise re-released the Hellhammer classic onto cassette format so that it isn’t damn near impossible to acquire. Apocalyptic Raids has always been something I was drawn to, and a big part of the first wave of black metal that inevitably pushed me deeper into the genre. Spinning the reissue made me want to gather my thoughts. This specific version tacks on two bonus tracks to the end, giving us a little more to work with, and they definitely fit in pretty well. They’re both fuming bangers, and funny enough, came from an old death metal compilation. I wouldn’t call them that, though.\n\nGranted, that isn’t a difficult thing to do, because I’ve always found this to be a bit scattered. Both of the first two tracks are quick sellers. For how dirty this is, the drumming on “Massacra” has always felt extremely steady with the fills placed wonderfully. If that isn’t enough, the slower riffing contrasts it so wonderfully, and acts as suspense when the speedier picking gets loaded on. It’s like taking the strength on “The Third Of The Storms,” but Tom G. Warrior just capitalizes on it. Composition wise though, “Horus / Aggressor” is probably the most advanced because of its ability to sneak in more melodic riffs, as well as progress more clearly. \n\nPerhaps a hotter take, but I thought the only flaw with Apocalyptic Raids was the execution on “Triumph Of Death.” It’s solely responsible for basically any and all of the disjointedness here. Had it been trimmed down to maybe five minutes, I think the doomier trudge of this would have fared better, but I think it overstays its welcome. Plus, the scattered screams take away from the (once again) impressive percussion. Thankfully, the dirty atmosphere adds loads of charm to make it forgivable, and the general gist of the song is solid.\n\nDespite it being musically scattered and a bit tough to swallow at times, there still isn’t really much out there that sounds like this. Obviously black/thrash has evolved several times over since its release, but the isolation of their sound has always been impressive. Very much an influence on what was to come, which goes without saying. \n\nOriginally written for Metal Inferno\n",
        "\nLet's first put Hellhammer on a timeline perspective. Very few bands were doing such primitive stuff in the early 80s, we had of course Venom, which was an obvious inspiration for this band as well as other acts like Motörhead and Black Sabbath. At this point of time, thrash metal has yet to be considered as a genre and most bands were just starting out, no one really knew what was going on in Switzerland. Tom G Warrior, going on by the pseudonym \"Satanic Slaughter\" at the time, composed some of the most evil and grotesque tracks that we should hear back in 1983. During their first recording session in their homemade bunker with crappy equipment, Helllhammer produced two demo tapes called \"Death Fiend\" and \"Triumph of Death\". To be quite honest, the sound on these demos is not just raw or primitive, it just sounds like shit altogether, except for the good bass. However, it at least gave a good impression of what this band was all about since many songs were re-recorded later on and to our pleasure, with a better overall quality (depending on your standards). One thing for sure, these guys had no clue how influential or cult their records would become up to these days, among other legendary albums of bands like Bathory or Sodom.\n\nThings really started to get interesting when the band released their third and last demo titled \"Satanic Rites\" on the last day of the year 1983. Actually, this marks a noticeable improvement quality-wise if we compare the playing on those demos. Maybe the sound is not as fresh as a full-length album, but it's definitely better and much more enjoyable to listen to. What we have here is a bunch of material that has a lot of variety, even if the overall musical composition is rather simple. \"Satanic Rites\" has a play time of over 46 minutes, which is quite a lot for a demo, and this is basically the essential Hellhammer record, to me at least. Definitely a personal opinion, but the main reason for that is because I always found \"Apocalyptic Raids\" to be more doomy and less raw than this demo. The vocals of Tom G Warrior are my favorite aspect on this record, compared to every other release of Hellhammer, on this one he has a more aggressive tone and sounds less depressive than on the EP. Take for instance the version of \"Triumph of Death\" on this demo in comparison to the one featured on \"Apocalyptic Raids\" and you will easily notice what I mean here. On the other hand though, the bass on this particular demo is near nonexistent, but without much surprise.\n\nThrough the simplicity of the music of Hellhammer, the guitar riffs and tone is what's makes the music so good. The only problem some of you may encounter while listening to this music is its repetitiveness on some tracks. At least, those songs like the classic \"Messiah\" or \"Maniac\" are catchy as hell, the riffs are heavy and since the drums are pretty high in the mix, they bring some more ferocity within the sound. Another interesting song we have here is \"Buried and Forgotten\". Just by giving this number a listen, you can clearly notice that it's in fact an early version of \"Necromantical Screams\" of Celtic Frost. It's not nearly as intense as that latter version, but it has a more violent and primitive feeling than being more atmospheric. While that song and the seven minutes of length \"Satanic Rites\" are more slow to mid paced, the awesome \"Crucifixion\" and aggressive \"Revelations of Doom\" shows the Motörhead influence with a more speed metal approach. In general, I cannot really find any bad songs on this demo, maybe just \"Reaper\" that sounds a bit weaker than let's say, \"Eurynomos\", which is a killer catchy evil song. Just don't expect some cool guitar solos though because you won't be pleased since it barely has a few messy ones that are not even high in the mix.\n\nIf we take a look on the lyrical side of Hellhammer, Tom G Warrior at the time was writting some pretty extreme lyrics, not just about Satan, but violence, death and destruction was a part of that as well. There's not much authenticity to see here though, since most bands were doing more or less the same thing. To sums it up, the first band of Tom G warrior and Martin E. Ain (R.I.P.) was all about being extreme and evil. However, when they moved on with Celtic Frost, the focus on better musical composition brought an even better view of what these guys were capable of. Even if they never were geniuses with their instrument skill-wise, it didn't deny them to come up with one of the most influential extreme metal records. An essential piece of music history that any fans of the genre needs to listen to. Definitely recommended.\n",
        "\nWould Hellhammer be legendary if they hadn't evolved into Celtic Frost? Probably, but much of the \"essential listening\" factor of this EP comes from the band's reputation given the occurrence of CF and how hard to come by the original demo tracks are. So what we have here is the only non-demo release from a band that, while never discovering their signature sound, did a whole lot for the metal community.\n\nHellhammer are odd. Their music is an unproduced nightmare driven by energy alone and defined by frontman Tom G. Warrior's signature vocals and minimalistic guitars. The sound itself is an amalgam of thrash and speed metal with another indefinable element. It was very different to the two other \"black\" metal bands which existed at that time: Mercyful Fate used falsettos and conventional singing; Venom were closer, but still different. Venom's music was more evil, but these guys seemed to be heavier, a total lack of musical skill directing them to just play fast and hard, while Warrior crafted epic songs better realised in Celtic Frost. This selection of tracks here is pure musical annihilation, never matched.\n\nThe three short songs here are great: they leave the band no room to go off on tangents and stick to what they do best, short, powerful, blasting songs. \"Horus/Aggressor\" isn't bad either, but feels a little odd with the somewhat sing-y vocals and of course those terrible bass drums. It's got a great chorus too: simple shouts of \"Aggressor!\". More bands should do that. I'd like to talk about the standout cut though: the opener \"The Third of Storms (Evoked Damnation)\". It typifies the Hellhammer sound with a minimal riff, Warrior's faintly sneery, spitting vocals and of course the band's philosophy: turn everything up to 11 and go for broke. Chaos will ensue as the band burn through everything with their primitive, incendiary style. \"Massacra\" is more of the same, literally, since the riffs are so similar.\n\nThe main issue here takes up a third of the run time: \"Triumph of Death\". It is a piece which suggests it was written by a five year old, with no cohesion or any form of structure. You know how freeform jazz devolves to just mindless, melody-less musical death? Well that happens here. A bunch of nobodies from Switzerland try to create an epic song but it has no progression, no nothing, and just begs to be fucking shot and put out of its misery. Seriously, remove that stain from music.\n\nThe other issue also warrants a paragraph on its own: the production. The production makes it sound like the band members' parts are being suffocated, making it all too dense in a bad way. And the bass drums. OH FUCKING ANTI-CHRIST MOTHERFUCKER WHAT THE FUCK. Those are my comments about the bass drums; I'd rather listen to a drummer playing Lars' St. Anger kit all day over these monstrosities, sounding like the drummer was slapping, I dunno, maybe Vaseline or rubber or something. And bass guitar? Forget it, there's no way on this Earth that you're gonna hear it any time soon. I mean, this production is bad even for the '80s thrash demos of American bands who'd been recorded in their garage by their mum and released that. If this producer was a professional and had a career after this, then I give up all faith in humanity and will devote my time listening solely to Foreigner records.\n\nOther than those bitches, the songs are okay. Definitely worth listening to based on song quality alone, but it all comes down to this: if you want raw emotion and feeling, then this is great. If you want better music, listen to Celtic Frost. Final thoughts: the songs themselves are fantastic, but everything around them is crap. It's not something I'll spin regularly, but it can be fun while it lasts. Listen to it not because of what it is, but what it started, and how different from everything else it is.\n",
        "\nThere's some worthwhile stuff on Apocalyptic Raids. The main problem is that one of this EP’s songs is just one step above unbearable. This wouldn’t be a big issue if not for the fact that said song consists of almost half the release’s running time, forcing itself to take the role of centerpiece on an EP that would have been good in its absence. The other three songs take aspects that most people would see as weaknesses like sloppy playing, sandpaper-rough vocals, a general lack of technical skill, and horrible production values and twist them into something vibrant and powerful. If only that sort of passionate delivery could have been spread across the whole release, then Apocalyptic Raids would not resemble three gems scattered around a large heap of crap.\n\nThose three gems, in case you weren’t paying attention, are the shorter songs and they’re full of exuberant playing and a vicious punk attitude. Actually, if we’re being honest here, they’re only gems in comparison to ‘Triumph of Death’. Essentially, they’re the byproducts of three Swiss guys blowing off steam by taking out their aggression on their instruments. The riffs and structuring are simplistic and the band seeks to play fast rather than well, resulting in some slipshod but energetic execution as they blaze through these tracks. Despite the numerous flaws in the composition and execution, these are fun, cathartic songs with a bouncing energy that makes up for their amateurish nature. And the greasy tone straight from the dingy garage this release was surely recorded in is charming in its own ugly way. This EP is only essential for Celtic Frost completists but for the rest of us, the three shorter songs are well worth the occasional Youtube listen. \n\nNow for the proverbial turd in the punch bowl. 'Triumph of Death' is such a big part of this release and such a weird outlier that it needs its own paragraph. At 9:23, the track is not only far too long but it also sees the band sticking to none of its strengths. Hellhammer was at its best when the songs were fast and aggressive. This song, however, clearly based more on Black Sabbath's example than Venom's, is slow and not very forceful. It's still got the same roughness and simplicity as the other tracks, but neither of those attributes work in the band's favor at this speed. It also starts with a long, aimless section that treats the listener to some truly horrendous yowls from Tom, who at least manages not to sound like a wounded hyena elsewhere on this EP.\n\nNone of these tracks are masterpieces, though three of them do have that refreshingly simple-minded and in-your-face nature that punk and early extreme metal capably deliver most of the time. Even for something in the vein of Venom or early Sodom though, they're just a little too poorly executed and basic as far as songwriting is concerned to stand above most other proto-black metal offerings from this era. Adding to this the fact that half of Apocalyptic Raids is impossible to recommend due to the presence of one gigantic album-ruining song, this EP is sadly robbed of the high quality it could have had.\n",
        "\nIt was 1984, and the metal scene was getting a lot darker and heavier. In continental Europe, it was also getting faster. This album is a perfect example of that sound. It's fast, heavy, dark, and far from mainstreem. Then again...that doesn't mean that it's perfect album. Let me try to explain my feelings on this album. I'll write a paragraph on each band, individually.\n\nHelloween: \nIf you are a fan of this band, this probably isn't what you will expect. This is far from the epic power metal that they're known for. They deliver raw and unpolished speed metal that makes you feel stupid if you're just sitting there, motionless while it's playing. While it's not as dark as some of the other stuff on this album, it definitely aggressive. \n\nKai Hansen delivers aggressive, yet complex (at times) guitar playing, and his vocals wail and scream, but he clearly doesn't have too much skill when it comes to actual singing, but the aggression makes it fun to listen to. His vocals are definitely higher than anyone else's on this split. The drumming is absolutely thunderous. The snare and bass drumming sounds like an earthquake. If you need to blow off some mental steam, I would recommend Helloween's work on this album.\n\nRunning Wild: \nOnce again, if you are a fan of this band, this probably isn't what you will expect. Instead of the \"pirate metal\" that the band plays now, this is dark speed metal. It is definitely a bit less complex, and focuses more on fury than melody. The guitar playing is quite muddy, and I feel like it doesn't really fit the music very well, but it will appeal to some people. The bass reminds me of the sound of a stomach growling, and that gets a bit agitating as well. \n\nThe vocalist snarls into the microphone, and it gets a little whiny at times, but other times, it sounds like pure evil (not that I'm a fan of that). The music combines speed and aggression with evil imagery that is definitely something to listen to when you think that you're too happy. Sometimes the music gets a little boring, but a few little bits here and there are decently fun to listen to. This work by the band is one of the things that inspired Bathory, so I'm sure that black metal fans respect and/or like their work on this album.\n\nDark Avenger: \nThere isn't really too much known about this band, as they disbanded two years after this album came out. This is the least dark and heavy of the work on this album, and it seems like sort of a prototype of power metal (with it's fantasy teams and epic sound). I honestly think that it's really boring. It sounds like Black Sabbath and Rainbow tried to make an album together, and failed at going towards a certain direction with the music. Seriously, the musicianship is absolutely terrible! The bass player can't play for shit, as he keeps using the same notes over and over again, and the notes don't even appeal to the listener.\n\nThe singer sounds like Kermit the Frog got a cold. He tries to be a less atmospheric version of Ozzy Osbourne, but in the end, he sounds like a crappier version of him. The lyrics attempt to be epic, but they are cheesy and nothing else can describe it. Song titles like \"Black Fairies\", and \"Lords Of The Night\" are not going to appeal to people. The drums seem to be the only thing here that can really carry a tune, but there isn't anything special about them, so they don't catch the listener's ear. This is why most people have never heard of this band. Nobody really wanted to give them a good record deal. They suck!\n\nHellhammer: \nOut of all of the work on this album, this is by far the most raw and dirty. The production is poorer here than on the other work on this split, especially with the singer. However, the reverb affect on the vocals do make this atmospheric. The guitars are down-tuned, and they sound sort of like something that belongs in doom metal, or at least to me. \n\nThe drumming is fast and powerful, but a bit sloppy, and I know that this band isn't about musicianship, so I can see why the drummer isn't trying too hard. The singer has a voice that was very guttural for the time, but they sound a little absurd when you listen to them today, because they are vocalists out there now that are a lot more \"evil\"-sounding than the work on this album. The lyrics and imagery focus on satanism and death, plain and simple. It was something that a lot of people frowned upon at the time, but at least it isn't a fail at being dark and evil, like some bands are now. This personally isn't my taste, but if you're an extreme metal fan, you probably already know (and love) this band.\n\n\nOverall, this album is pretty decent. There's some great stuff, boring stuff, and mediocre stuff. The genres include speed metal, thrash metal, proto-black metal, proto-death metal, proto-power metal, and traditional heavy metal. There is a lot of diversity, so I guess that draws more attention. Halloween has the most creative sound here, Hellhammer is the \"mean\" band here. Running Wild is the most generic here, but it could be worse, and Dark Avenger is the boring and cheesy band. Three of these band over time improved a lot after this was released (Hellhammer became Celtic Frost, Halloween became a power metal band, and Running Wild developed a string sound which they now call \"Pirate Metal\") while one did not get anywhere. They are not as good here as they later became, but we all have to start somewhere.\n",
        "\nOriginally purchasing this EP, some 13-14 years ago, I sold it not long after that for reasons I don't even recall. Maybe it was too primitive-ish for me or maybe I just didn't recognize it for what it was. It wasn't until recent years when I purchased the 'Demon Entrails' demo compilation and was reintroduced and ultimately blown away by the barbaric pioneering filth that was Zurich, Switzerland's own, Hellhammer. Naturally, that lead me back to this EP, which I snagged from a friend who was liquidating his collection for a mere $3. Deal.\n\n'Apocalyptic Raids 1990 A.D.' is a re-release of the '84 EP, which also includes two bonus songs from the Noise Records '84 compilation, 'Death Metal,' which incidentally didn't exactly contain bands that we'd associate with the death metal genre nowadays. The cover is also different from the original, here opting for a spidery skull monster that I once had a dream about, but I'll spare you the details and get to the music.\n\n'The Third of the Storms' kicks off the EP, with simplistic drum beats, two or three chord riffage, a catchy solo, non-existent bass guitar and gruff vocals, which was not unheard of at the time, but this primitive approach to writing and production values served as a major catalyst for the brooding black metal genre. 'Massacra' follows, and the music formula remains the same, but that riffage it something truly wicked, whereas, 'Triumph of Death' is more doomy in character, lasts for nearly ten minutes and has these desperate shrill squealing vocals that are simple a must hear. 'Horus/Aggressor' kicks off with a drum intro before going back to the familiar sound of the first two songs, with something of a sense of catchiness behind this one, while 'Revelations of Doom' & 'Messiah' up the ante on the speed a bit, but still hardly different in overall song structure.\n\nListening to this EP again and making the comparisons to the demo compilation I think I understand why I originally sold this EP. To me, despite its historic and influential qualities, the production is not just raw, but honestly flat and somewhat annoying. It seems to completely lack any sort of lively spirit and perhaps that was the point, but those remastered demos are quite the opposite as they explode out of my speakers. As such, I wouldn't mind seeing this EP re-released yet again, naturally remastered and with a fuller sound to it.\n\nOf course, you may be the exact opposite of me and love this material regardless of its production values. Nevertheless, much like Hellhammer's earlier demos, 'Apocalyptic Raids' is largely seen as some of the first real and true black metal out there and although I wouldn't urge you to buy it ASAP, it is at least worth listening too once just so you know where your favorite black metal band got their inspiration from. \n\nOriginally wrote for, Lunar Hypnosis: http://lunarhypnosis.blogspot.com\n",
        "\n(Hellhammer)\n\nDeath Metal pt 1 of 4 (the rating is for the complete compilation)\n\nWith part one of the four-part review of Noise’s seminal Death Metal compilation, we first go with the only band that deserves to be anywhere near this album. In ’83-’84, Hellhammer was death metal. Thirty seven years later it’s considered a prototype of the style, with vocals not quite the terrifying lung destruction that Cryptopsy, Exmortem, and Krabathor deliver, meanwhile the dirty, yet naive riffs aren’t up to death metal’s roaring chaotic snuff. Time changes everything. Yeah well, one thing time isn’t changing is the page in my extensive book saying HH are indeed death metal. As far as vocals go, there wasn’t anything quite like them out there, and singers previously belting out fits of diabolism and sepulchral fury were probably glaring at this guy who called himself Satanic Slaughter, who unbeknownst to them was from a sleepy hamlet in Switzerland of all places. Additionally, a conversation took place sometime late in '83 or earlier that year between Tom and Noise headmaster Karl Walterbach that went something like “Hey Karl, I have an idea for the title for the compilation…”\n\nAt one time, the Freudstein cover art was a real shocker. Today, it doesn’t even cause an eye to bat not because it’s uneventful or goofily rendered, but simply because it’s just so everyday to us now, much like the crumbling border of acceptable language and sex on (American) television. Time’s ‘cutting edge’ slices away layers of what is inadmissible as society ages, and just as this is no longer reveled as ‘true’ death metal by many, the same blade dices the cover’s one-time banished visual. It’s the reason why fans buying it beyond the first pressing (that was recalled) were forced to take the red and black yawn of a cover instead. \n\nAny of the tracks on Apocalyptic Raids save the godless “Triumph of Death” could’ve appeared here and had the same bludgeoning impact as “Revelations of Doom” and “Messiah”; a sparse, but potent non-formula of rudimentary musicianship, diesel powered mobility, inherit drawling of chords, and gravel-gargling vox that rumbles with an authentic, prehistoric prejudice toward anything on the domesticated side of Venom. And on the other side, the barbaric side of Venom? – a void where there is nil except for Hellhammer and Slayer. \n\nSeparating these two tracks is mere locomotion. “Revelations of Doom” is your typical (funny calling it typical now when at the time it was atypical for most unless you had some of their demos) HH track, elemental in its precision and course and differentiated only by a chorus that snakes slightly out of line. “Messiah” pulls the reigns for an even slower effect than that of the ep's “Massacra” and is slightly more varied musically, yet lacks the steadfast drive of “Revelations of Doom”. Maybe not the band’s finest hour, but easily the most baleful of the four. \n\nHellhammer made this almost cluelessly-titled disk more supportable. Funny, the only non-Teutonic band on the compilation would be the most pestilent. \n\n“…no escape, time stands still, feel his deadly breath...”\n_________________________________________________________________________\n\n(Running Wild)\n\nDeath Metal pt. 2 of 4\n\nOf the four bands featured, Running Wild are basically tied with Helloween for significance, though admittedly more people have heard of and are more familiar with the latter for one reason or another. I prefer the former, and since I’m saving the band interpretation for the future review of the debut (because that’s where it really matters), I’ll cut to the chase. \n\nThese two tracks were also featured on one of their ’84 demos, and one of them possesses a tiny component the band’s debut wouldn’t promote: the high note. “Iron Heads” is book-ended by a pair that Rock´n´Rolf Kasparek was probably saving up for around eight years (and by ’84 that would make Rolf, well, not young for the time) and is his only shot at a NWOBHM nuance. Otherwise, his masculine tone is a fair antonym to the soaring-voiced vision of many singers preceding him and is fine for a song that’s as grass roots straightforward as “Iron Heads”. The chorus is the song’s thrown brick as it repetitively breaks through the fairly smooth glass of the main structure. “Bones to Ashes”, except for a few rhythmic surges that only momentarily enliven the project, is even more axiomatic and even-keeled.\n\nAnyone who’s heard Gates to Purgatory will deduce these aren’t the prime rib of the band’s material, nor are they worthy to stand beneath the banner of death metal, but hey. \n\nFun fact #267: Despite the fairly early date of Death Metal, Running Wild’s initial moment on wax is a 1,000 pressed compilation called Debut No. 1 on the lost Raubbau Records, now very rare. Isn’t that special? \n_________________________________________________________________________\n\n(Helloween)\n\nDeath Metal pt. 3 of 4\n\nProbably the most dynamic on this compilation is Helloween even if it does kinda seem (and sound) like they’re looking at each other awkwardly trying to figure out what the other is doing on the first track. About halfway through “Oernst of Life” the gang ratchets the loose bolts with tandem guitar drama unsurprisingly like Maiden and with vocals most matching those Brits thus far (real tough considering the other bands). “Metal Invaders” continues this spiel with a minor speed metal glare that hauls in boatloads of inspiration from other British acts flanking Maiden, known and unknown, headstrong come-sing-along passages aren’t just a domination of the chorus, and by the time the track ends in party mode you know you’ve heard another band still angling for an identity of its own.\n\nSo far the most charismatic and audibly talented carpools with the Band of the Decade, and a crowded vehicle it is, but anyone who developed temporary insanity just for an instant and thought Helloween and its pumpkins…well, you get the picture.\n_________________________________________________________________________\n\n(Dark Avenger)\n\nDeath Metal pt. 4 of 4:\n\nYes, the enigmatic Dark Avenger mysteriously melted into the metal woodwork immediately after recording these two tracks for the sampler like someone who went out for cigarettes and never came back. Yes, the band appears to be yet another random tree branch caught up in the New Wave of Metal flood that’s pushed to the banks of the river to rot, forgotten. Yes, the world isn’t missing anything by yet another German band’s absence. Actually that’s not entirely true.\n\nPlay “Lords of the Night” first. It’s so enslaved by tradition it can be an ‘everyband’ song, a tune that anyone from Saracen to Tysondog to Raven or a clone thereof could’ve portrayed with exact success and merit. From the head-hits-the-pillow galloping rhythm to the strange Ape de Martini/Oz vocals, it’s a pretty promising assumption the world isn’t missing anything if this stays buried. And now that you’ve trudged your way through that opus, backtrack to “Black Fairies”, easily the catchiest track to literally throw a hook into this thing. While not a picture of ornate musicianship or stunning originality, the track is simply infectious with its driving gait, memorable main melody, and a flowing, weirdly epic chorus that’s capped off ideally by a single falsetto note to bring it home. It’s a good, clean song I’m glad was excavated. \n\nOverall, the Death Metal sampler is more than just a legendary compilation and collectors item. It strapped a jet engine onto its featured bands, propelling three of them into long fruitful careers that would help shape the underground while one unfortunately fizzled in a silent death two songs later (ed. a four-song demo from 1985 actually has been unearthed since the time of this writing), but that’s hardly the record’s fault. It also showcased what Noise Records was preparing to offer. \n\nEverything that happens before the exact second you’re living is history, but there are moments and incidents that become historic. This is one of ‘em.\n",
        "\nI was actually planning on reviewing each demo individually, but that serves quite hard. The full thing has been remastered, several tracks have been rerecorded (Triumph of Death (on Satanic Rites) sounds exactly like the Apocalyptic Raids version to me) and the Death Fiend and Triumph of Death demos have the tracks muddled up so it's pretty hard to talk about.\n\nSo I'll just have to talk about this compilation - and it's quality stuff. The earliest works of Hellhammer (pre-Celtic Frost), combining all three demos and remastering somewhat but not in a way that it ruins the original works. There are some cool songs on here that have been forgotten that shouldn't be, like Maniac (there's one awesome guitar part in that track, you'll know the one when you hear it) and then you have classics like Third of the Storms and Triumph of Death. The Satanic Rites demo is much better produced than the others, but they have a really charmingly raw quality, the bass guitar sounding like a chainsaw and Tom G. Warrior sounding like a punk rocker with retardation. Then there are some songs with really random construction like 'Crucifixion' which sounds like something ZBT would hesitate to release. Hard to pick a favourite disc really, the second one has that noisy, punky, garage rehearsal greatness, but the first one has some crazy reverbed vocals which always sound great with no exceptions. \n\nSo there you have it. It has raw metal charm - a mix of punk rock, black metal, death metal, thrash and bits of doom (sounds like crust punk to me) but isn't as jaw-dropping perfect as many make out, they were an ameteur band just having fun and probably didn't expect for these demos to become kvlt collection pieces. It's fun to listen to once in a while.\n",
        "\nWhile far from real death metal, this split does have a small place in history as being the main teaser for the central European heavy metal scene. Running Wild still played raw speed / heavy, Hellhammer were getting it on with their thrash / black style, and Helloween themselves also weren’t entirely power metal at this point. Dark Avenger disbanded sometime after this split, but their contribution hasn’t been forgotten.\n\nRunning Wild\nBoth of Running Wild’s songs have some groovy riffs in the heart of a low-budget dungeon - great way to start off the split and showing the band at a more unprocessed stage than the debut. The uncooked guitar tone plays the early Iron Maiden card by dashing forward regardless of how clean and neat it sounds. The vibe settles with the grumbly bass sticking around despite the charred, demo-like quality and some sloppy playing. “Bone To Ashes” really slays in the rhythm department, thanks in no small part to the consistent drumming and synchronized-headbangable riff.\n\nThe atmosphere alone with these two tracks move away from the satanic themes, instead opting for a zombie-themed after-school extravaganza! Rolf doesn’t show too much range aside from rare Halford-like wails; get used to his deep talking with a hint of whining. It works for the tone at hand, but anywhere else and these vocals would be ganged up on. “Bones To Ashes” does drag on a little longer than necessary – the longest song on the split, in fact, though the solo at the end does make up for that extra minute or so of waiting.\n\nHellhammer\nTom keeps his vocals above the guitars, which mange to run amok with a menacing attitude; a very grimy, hopeless tone without a sight of light. “Messiah” is really impressive in this department – tortured, hapless riffs with Tom letting out some deafening yells and growls in the distance. God damn, thrash like this is unmatched in heaviness – despondent atmosphere with a vociferous bass playing from Martin. You can hardly make out the lines, but the tone is what really makes these tracks the hideous and scariest ones this split has to offer.\n\nDrumming for “Revelation Of Doom” (Gorgoroth, anyone?) is louder than “Messiah,” but all it consists of is steady cymbal bashing. It gets annoying and drowns out the snare hits a little, which are ripe for the production (poor compared to Running Wild’s job). The double bass is horrendous – like stomping your foot on a carpet while sitting down. Considering the options at the time, it’s hard to get worked up over it, especially in view of how these two tracks reek of death, decay, and malevolence.\n\nDark Avenger\nThis band has almost no history – only a couple recognized releases before splitting up shortly after, but their recordings shouldn’t go entirely unnoticed. Between all the bands on here, I’m most surprised by this group. The vocals belong to hard rock, as they’re very “out there” like Glenn Danzig. The music itself crosses between Black Sabbath and Iron Maiden – really addicting stuff with killer riff attacks and a snarling bass. Drums gallop with great use of double bass steps and a “bite-and-hold” snare / cymbal tactic. “Lords Of The Night” show everyone working together to deliver an incredibly ambitious track backed by a solo bridge that kicks this split’s ass.\n\nHellhammer has the atmosphere, Running Wild has the grooves, and Helloween yuck it up with the vocals, but Dark Avenger nails everything down like crazy. I’m not too gung ho about “Black Fairies” as the lyrics are incredibly cheesy (considering how over-the-top the vocals are, too) – these vocals just sound so awkward, but they somehow work regardless of the miscomputation. They aren’t operatic or deep grunts, but nasally talking / yelling with an accent that’s impossible to pinpoint.\n\nHelloween\nHelloween compete primarily against Dark Avenger for the best solo bridge, but it’s a tough call. “Oernst Of Life” is a hectic, cut-throat speed metal track with Kai Hansen wailing in the distance like some tyrant. A creepy track that’s made less creepy by the wave-like riffs crashing against everything that isn’t wet. The drums are insanely heavy for such an early recording – they’re not thumping or up-front, but the cymbal / snare / drum bass hit just packs a punch right to the senses. The recording quality is tighter than Dark Avenger but less clear than Running Wild; the band is the fastest of all four, though. Hansen of all is the highest of all four vocalists featured on the split – nobody on here can top his stratosphere-screams.\n\nThere’s no fluffiness to be found with Helloween, which is just how I like my speed / heavy metal. Between the riffs and the vocals, there’s no room for child’s play around here. Gimmicks are one thing, but the tone is very serious, no matter how high Hansen can go with those vocals – and he’s singing in the distance! Bass is hardly there compared to the other three bands, even though you can just hear it criss-crossing with the riffs. \n\nHellhammer and Helloween both have their sound together moreso than the other two bands in the sense that they’d be continually maturing these two sounds. Hellhammer would of course disband and become Celtic Frost before maturing their sound (and then ditching it for a second) while Helloween honed their speed metal endeavors before digging into power metal. Dark Avenger had something going here but never got out of the cubicle while Running Wild would drastically change their sound from raw heavy metal to epic, regal heavy / power metal that remains a testament to Germans everywhere. From here you can venture off into three of these bands’ careers and find some damn good material. These starter tracks are acceptable, but when these old dogs learn new tricks, they’re usually better.\n",
        "\nHellhammer (and often, Celtic Frost) are a love-them-or-hate-them band. I might not be able to change your mind regarding Hellhammer, but I would love to provoke the thoughts within you, dear reader, into given them a second chance with an open mind. So, with that said, feel free to read my review and possibly gain a new perspective on the original cult band part of the unholy trinity (Venom; Bathory; Hellhammer & Celtic Frost). If you listen with an open mind, you may find what the fanatics have been raving about for years.\n\nHellhammer play one of the first incarnations of blackened death metal with youthful abandon and some inspiration from artistic elements and intellectual research into the occult (the Necronomicon, the Church of Satan’s early writings, H.P. Lovecraft’s seminal works, along with some mythology quite possibly made up on the fly).\n\nMusically, this is raw, primitive and simplistic, sharing as much in common with early Venom and Bathory, as well as the punk scenes “don’t give a fuck” attitude, with their own twist on the proceedings. As mentioned, it’s raw and very primitive: in most bands’ hands, this would be their death knell. However, in Hellhammer’s case, it works beyond belief.\n\nMake no mistake, there is nothing technical here: instead, the youthful abandon more than makes up for their method of blasting everything in their path.\n\nThere are, of course, exceptions which change things up. Not everything is full-throttle (thankfully), slowing down to a crawl on songs like “Buried & Forgotten”, “Reaper”, \n\nThe intro and outro on Disc 1 (the Satanic Rites recordings) add a little bit to the atmosphere, and bookend the first disk quite nicely – giving us an example of the different things that Celtic Frost would later do, albeit in a much more grandiose method.\n\nDisc 2 contains the Death Fiend and the Triumph of Death demos, giving us an earlier look on what the material was like before the Satanic Rites demo. This is actually a bit rawer, with a little less variation, but the variation is there, albeit in lesser and more subtle quantities.\n\nFor example, Crucifixion starts with a keyboard intro not unlike something you’d hear from a Transylvanian organ, which was a nice touch. Blood Insanity and Reaper are mid-paced recording which later Hellhammer and (later) Celtic Frost would put to work in their compositions, which would later be their trademark for years to come (at least, become the Cold Lake debacle).\nA bit of a side note: the track listing states the Crucifixion is the first track: the first track in, instead, Sweet Torent, followed by the rest of the record in its running order from that point on, with Chainsaw being the last track.\n\nIn conclusion, Disc 1 (the Satanic Rites demo) is a lot more varied. While raw, the hints of the future of Celtic Frost are apparent in places. And Disc 2 (Death Fiend & Triumph of Death demos) are even more raw with vulgar production values – don’t let this fool you, though – the songs are still very listenable.\n\nIf you’re into Celtic Frost, the current wave of primitive black metal, or a curious bystander wanting some definition as to where it all started, this is a great album worthy of your attention. And if you’re already a fan of primativr, raw music, this is definitely one recording you don’t want to miss out on.\n\nIn the beginning of death and black metal, there were Venom, Bathory and Hellhammer. And as these recordings were previously available as bootlegs only, now is your chance to hear it proper… just as the band had attended it.\n\nIf you don’t have this recording, and you consider yourself a fan of the Norwegian black metal scene or old school death metal, correct the situation and take a history lesson as to where the roots lie. It’s raw, primitive and has an air of evil woven throughout.\n\nPurchase this if the following applies to you. You won’t be disappointed.\n",
        "\nHonestly, this is the only reissue that some people were waiting to be released during around 25 years that I can think about! There is only 1 band except Iron Maiden that got me actually shocked from the first note I heard, and this is Hellhammer! The moment I heard the utter rawness and the over driven chainsaw-bass in “Death Fiend” demo, I couldn’t believe my ears! Hellhammer were the dirtiest and rawest band of their time in Metal, the forefathers of Black Metal and basically an embodiment of all that can characterize a CULT band! There are many bands that try to sound like Darkthrone by just playing shitty stuff with even more shitty sound, but there aren’t many bands that actually proudly continue what this mighty band did, like the dedicated maniacs “Warhammer” and “Apokalyptic Raids”, which are the most dedicated followers that could ever be! And even they admit that there never was and will never be another band, which is as great as Hellhammer itself!\n\nFinally, 25 years after these demos were released in a small quantity on tapes, Tom G. once “Warrior” Fischer decided to bring this band to the masses and released all of Hellhammer’s 3 demos through a major label like Century Media, which is probably the most useful thing he did since the reissue of their EP “Apocalyptic Raids” on CD back in 1990. If you think that I’m going to review the MUSIC here, you’re oh so wrong! If you’re reading this zine, you have most probably listened to this stuff many times before and you don’t need me to review it. If you’re not familiar with these demos yet – my words will never be able to really explain what these demos are all about, so you need to listen to it yourself, leave me alone and later thank me for introducing this amazing band!\n\nSo what we’ve got here anyway? Don’t ask me about the regular edition of the CD, since I have never actually held one in my hands, hehe! I ordered the 3-LP’s set with the killer “Goat’s Ecstasy” drawing that was made by Fischer back when this band existed and I actually find it as great as the “Sitting Death” drawing that appears on the EP’s cover. It comes in a great gatefold sleeve, featuring a rare photo inside. Every demo appears on a separate record and has its own sleeve, featuring the original demo cover’s design on 1 side and a never published before photo on the send side. These are great thick vinyls by the way and I actually enjoy the sound on them. Leon of Apokalyptic raids told me that the sound sucks in his opinion, but I’ve never heard the original tapes and can’t compare and overall I’m pleased with what I hear in this release. It was told that the original master tapes got digitally remastered for this release, but surprisingly – I can’t say that it actually ruined the sound and the utter rawness is definitely there. There’s also a cool booklet with al the lyrics, some notes and rare photos of the band, and a 2 sided big poster included as well (Fischer’s pic on one side and a drawing of the digibook’s artwork on the 2nd side). \n\nAs for the \"Deluxe\" version - here – the demos are not separated and 1 CD features “Satanic Rites”, while the 2nd features both “Death Fiend” and “Triumph of Death” demos. It features a booklet with the same content as the 3-LP version (but way smaller, hehe!) and a really small (less than A4 size) “poster”, featuring the “Goat’s Ecstasy” artwork. All this is packaged in a kinda DVD-like box. If this is a deluxe version – I really don’t wanna know what the simple version features!\n\nAll in all – it’s crystal clear that the vinyl version is way better, but the main thing is the MUSIC, and even though I f! eel that I simply have no right to review it, It’s really great that t hese demo finally got the professional official they deserved, after getting released on shameful low-quality bootlegs during so many years!\n",
        "\nSo yeah, first Helloween demo/recording/split and they already rock copious amounts of ass. The songs are pretty much along the lines of their debut EP and Walls of Jericho, speed metal with an emphasis on riffs and melodies like a souped-up Judas Fuckin' Priest/Iron Fuckin' Maiden.\n\nThere's only two songs, \"Oernst of Life\" and \"Metal Invaders.\" I have no fucking idea what 'Oernst' is and what kind of fucked-up babelfish could have created such a word, but hey all is forgiven because it is SPEED metal. Yes emphasis on SPEED. It's kinda like \"Starlight\" riff-wise, and the structure's fairly similar...so Uncle Weiki sez \"when a formula works don't change it!\" The harmonized middle-section's very good though nowhere near as colon cleansing as \"Halloween,\" \"Ride the Sky,\" \"The Saints.\" Too bad this has never been re-recorded, I'll never understand why shit like \"Gorgar\" (which Weiki admits is pretty moronic,) got on the album and THIS cut is forgotten.\n\nSong two is \"Metal Invaders\" which will be sped up in Walls of Jericho. This one's not bad I guess, but the general mindset in SPEED metal is...well SPEED so I definitely like the album version much better. Other than speed not much has changed, if you've got Walls of Jericho ('if' is merely hypothetical, everyone has Walls of Jericho...if not I will rape you, your mama, your grandmama, and that boy next door...sideways) there's not really a reason to find this version, and since it's a bonus track on the remaster you'll have it already.\n\nPerformance here is not as tight as their latter efforts. Ingo tries his best to keep the tempo, and most of the time he succeeds. Maggi plays pretty much as expected, his bass is pretty audible too. Weiki and Kai not quite getting their harmony sections down pat and one of 'em plays slightly faster at times. Kai's voice...well since this is per-Land of the Free you all know what he's like. I don't really like him (The Metal Inquisition must be preparing my pyre as I type,) his voice is raspy, and not the good DEASSS METALL raspy either, and his high notes are fairly weak compared to Michi and Andi.\n\nProduction's great for a demo, though the expected muddiness and slight buzz is there.\n\nShould you get it? Well, if only for \"Oernst of Life\" but since the Walls of Jericho remaster has the two tracks you no longer need to sell your firstborn for a copy of the Death Metal vinyl, pick up the Walls of Jericho remaster and you too can listen to a rare piece of Helloween history.\n",
        "\nHellhammer is the band, two of whose members later went on to create Celtic Frost, a band whose influence on the overall extreme metal scene is just as notable and significant as Venom or Slayer. This is their very first demo, the recording with which it all began. But this is not one of those demos where we get just a glimpse of the band’s sound and only get to hear some 3-4 tracks. This is a complete 9 track 30+ minute treat! \n\nThe recording value and production are obviously a little trashy and poor, but it has been used as an advantage and features the band in pure raw aggression; well, somewhat… it gives a punk-ish feel to the whole thing, it’s depends on you whether you consider it good or bad. One thing I can assure you is that the energy is there, but the vocals can hardly be heard and this is an unfortunate flaw with this offering. \n\nHowever, the bass is very much audible. You might actually find it a little high in the mix, but I for one being a person who always wanted the bass as loud as the guitars, am happy. The riffs, as expected, are thrashy and top notch. That’s one department where no excuses work and they clearly don’t need any. Solos are very rare, I know that’s something one doesn’t crib about in this genre, but it had to be mentioned. The drums I have to say are quite amateurish and limited to the bare minimum. If they were a little tighter this demo would have earned at least 10 more points immediately. \n\nTo sum it all up, the guitars and bass are very good but the drums and production (which completely ruins the vocals) are equally bad.\n",
        "\nIf you know anything of Thomas Gabriel Fischer's criticism of Hellhammer, it was the production. I aint gonna argue with him, its pretty bad, however, time could have been worse to Hellhammer, which is due to a combination of many things. Firstly, there is the obvious success of Hellhammer's 'successor band' Celtic Frost; however, there is also the rise of 'bedroom black metal' bands, whose lousy production generally equals out pre-Satanic Rites era Hellhammer. Officially released on CD and LP for the first time, (partly to cease the stream of sub-par bootlegs, and a part symbolic release, ending Thomas Fischer's less than angelic relationship with Hellhammer or something) Triumph of Death, as well as the Death Fiend and Satanic Rites demos, has never been more easy to get. So, should you part with your money to get your hands on something that music journalists have repeatedly criticised and vituperated?\n\n\nI'll start by following the MA golden rule by talking about the music; the thirteen tracks presented on the Triumph of Death demo are basically the musical equivalent of having your brain removed with a large blunt hammer from hell (heh, heh) and vary from the fast and aggressive 'Blood Insanity' (a personal favorite of mine), to the slower, unnervingly creepy 'Reaper', and all are primitive and raw, with about as many solos as St. Anger. An interesting thing to listen out for is Tom G.'s droning guitar sound (if you can hear it over the clanging heavy bass, more on that later), which is basically identical to the one he's been employing with Celtic Frost for over twenty years, Cold Lake not withstanding, as well as the vocals provided by bassist Steve Warrior (no relation to Tom), who can probably lay claim to being one of the first ever black metal vocalists.\n\n\nNow, onto perhaps the thing that Hellhammer were criticised for the most for back in the day, and it is still a slightly colossal problem. The production. Its shit. Now, as a bassist, I'm all for us four-stringers not hiding behind a guitar sound thats drowning us out, but here, its heavier than a solid iron blue whale scrotum and whenever Steve stops playing, its almost a relief to hear him shut up. Bruce Day's drumming here has a slightly fake sound, and at time he sounds like hes attempting a Beach Boys song, but apart from that, the drums are dine. Tom's guitar tone, no matter how much like Celtic Frost it sounds, also sounds like a cheap, fucked up amp that you get in a starting kit thats had a foot through it. Though thats probably what it was anyway. But in the end, how much less mythos would this demo have if had been recorded in an actual studio and not some bunker on the outskirts of Zurich anyway? \n\nYou may recall, at the start of this review, I asked a question to you, the reader, should you part with your money for this poorly produced demo from over a quarter of a century ago? The answer is a resounding 'YES!' Despite shitty production, this is a fantastic demo, with or without the usual Hellhammer mythos. Recommended for anyone with an interest in either black metal, early Celtic Frost, or people with a sexual lust for heavy as lead bass.\n",
        "\nThe word 'Hellhammer' can mean different things to different people. To some, Hellhammer is 'that drummer whose in loads of bands' to others, Hellhammer is an influential Swiss 'thrash' band whose vocalist and bassist went on to form Celtic Frost. \nHellhammer could probably be counted among the ‘first wave of black metal’, along with Bathory and Merciful Fate, but some of this clearly influences doom, (namely the tracks ‘Triumph of Death’ and ‘Buried and Forgotten’. \n\nWhen this Swiss trio formed in 1982, with a strong Venom influence, but didn’t fall into the trap that Slayer did with Show No Mercy (not that it’s a bad album mind you), due to both Tom G. Warrior’s droning guitar sound, unique vocal style and generally appalling sound quality (due to their Death Fiend and Triumph Of Death demos being recorded in an old bunker). With Satanic Rites however, the band actually appeared to have recorded it in an actual studio as well as getting rid of the clanging, heavy bass that haunted the first two demos. This generally makes this demo an easier experience to listen to, though not actually ‘better'. This said, the production is hardly perfect, sometimes with the sound switching from speaker to speaker for no apparent reason\n\nAfter a freaky intro, which is actually just the ending of the song ‘Triumph of Death’ played slowed down, opener ‘Messiah’ is a fast paced, destructive opener, as well as a highlight for the whole demo. The demo continues in this fashion for most of the demo, despite thirteen minutes of doom. Lyrically, Hellhammer stick to Venom-esque moments of Satanism, as well as lyrics the early Slayer, Mayhem et al would be proud to write: \n\n“Satanic rites, satanic rites, \nI love the screams of children \nI love to see ‘em hang \nThey are so little and helpless \nSo I’ll do what I want”\n\n\nHardly easy listening, Satanic Rites will probably not amuse newcomers to metal, and might put off Dimmu and CoF fans. Not that they're necro enough to get it in the first place though. \nAll in all Satanic Rites is a headfucking, dusty blackened masterpiece, which has been made much easier to acquire, now that Tom G. Warrior has made peace with Hellhammer (as he once despised Hellhammer as much as the early 80s metal press did), and released the Satanic Rites, Triumph of Death and Death Fiend demos together.\n",
        "\nFor those of you who are into old school (I mean extreme metal, not porn or hip-hop) and have nothing better to do than reading reviews here on M.A. there is my little contribution to Hellhammer worship. Yes, Hellhammer... the infamous band which came out of nowhere and managed to be heavier than Venom; the band which had been existing barely for two years and which \"will never be reformed\"; the band which introduced a real morbidity into heavy metal and which \"will never be forgotten\". It looks like all has been already said here but I'm deranged enough to think this record deserves one more fucking review.\n\n\"Come on you pretty girl\nI know a silent place... \"\n\nYeah... black leather, spikes, inverted crosses and other rubbish. In 1983, when black metal was considered a bad joke (if it was considered at all), two young metal freaks from the land of Jung's archetypes, Giger's biomechanoids and Meier's extraterrestrials recorded this 46 minutes of socially unacceptable 'music'. The ugly cassette was named Satanic Rites, labelled with (fictional) \"Prowlin' Death Records\" and guess what? It impressed Noise records enough to offer the band a record deal. Soon the new bass player joined and the unholy EP was released. One year on, however, the band was gone. Why? Hellhammer concept was suddenly considered too simple by the 'musicians' who therefore abandoned it as a dead end. They had not a clue that the name of Hellhammer would later gain a cult status in certain circles and the band's approach would inspire many. I hate to say that Tom 'Warrior' Fischer, the main protagonist who by the way pioneered using 'corpsepaint', eventually lost his judgement when trying to succeed with glam rock(!) but that's another story.\nSo much for the background, now let's focus on the music. First of all, we are far beyond the realm of good taste in music here... and we should be proud of it. So expect no complex compositions, no guitar solos (well almost) and of course no clear vocals because 'Warrior' preferred to perform his weird lyrics in an entirely different way! He had really developed himself a nice sense to sound either passionate or arrogant/evil (OK, not as evil as Jeff Becerra of Possessed or Chuck Schuldiner of Death). As regards riffs, tell your brain to use only the right hemisphere 'cause there is no point in trying to analyse what exactly is being played... power-chord here, power-chord there and if you dislike this rawness and minimalism even when it IS effective, you can fuck off... or you'd better satisfy your appetite with Mercyful Fate's Melissa LP from the same year. Agreed, the sound quality of Satanic Rites is poor... or should I say raw? But hey! It's a demo and it IS actually listenable so don't cry to your mama you don't hear the bass or something. She wouldn't care anyway.\nIt consists of twelve tracks: apart from cheap Intro and Outro there are mediocre/uninspired songs (Maniac, Reaper, Crucifixion), the classics which appeared on subsequent releases (Messiah, The Third of the Storms, Triumph of Death, Revelations of Doom) and morbid highlights on this piece of decadent effort (Buried and Forgotten, Eurynomos and Satanic Rites!). All of them all worth listening maybe except of Triumph of Death because the Apocalyptic Raids version is without a doubt better in all aspects (that one has the potential to disgust anyone, anywhere, anytime and for me is the main reason to love the band's rotting legacy). If there was just one song to be pointed out, I would choose the creepy Buried and Forgotten. It's a slower one but rich in moments which are nowhere else to be found... or at least I haven't come across a metal song which would create similar atmosphere. The vocals are simply wonderful. As far as I understand it, the lyrics are about being physically dead yet conscious. YES! Imagine one's soul having departed the body and being capable of only one emotion... FEAR! Fantasy you think? Materialism is a fantasy, you fools!\n\n\"Freezin' breeze, last bell is mute\nAs I run thru night's fog\nMy feet lurch over the grave\nHave 'em buried long ago\nStill awake but without life?\"\n\nNow have I forgotten to mention anything important? No? Then epilogue: Satanic Rites together with Death Fiend/Triumph of Death demos have been recently reissued as Demon Entrails and it shouldn't be a problem to find a copy. So get yourself one and enjoy listening to such a great example of old school black stinking metal with beer, barbiturate or whatever that makes you happy. Absorb it all, celebrate the decline of western civilization, vandalize christian icons/idols in the nearby graveyard or just play it loud enough to annoy your neighbours. I listened to this stuff right before my suicide attempt... if I were successful, you wouldn't read this, heh. No, I'm NOT joking here. Only death is real. And malevolent non-corporeal beings of lower astral await to feed on your fear... be aware of them.\n",
        "\nOnce I read a Fenriz interview about the black metal scene during the early days. He said that most of the metalheads in Norway think that this genre was born there. He said that this was wrong because it’s a genre grown in different bands at the beginning of the 80s in different countries that are not totally Norway or Sweden (except for Bathory and Mayhem, of course). I agree with him. Let’s think about Sodom in the early days (In The Sign Of Evil), the early Sarcofago from Brazil (early Sepultura too), Possessed and these Hellhammer. \n\nWell, they didn’t play like 1996 Marduk because this was an evolution of a genre yet bound to speed and thrash metal in those days. Black metal genre did not come out of the blue, but evolved through great bands. From Venom to Immortal for example. Back in 1983 or 1984 there were few bands playing like this. Quorthon said he was influenced by death/thrash metal but the production and the way of playing contributed in creating a milestone in the new born black metal movement, the great “Bathory” album. \n\nIn these years other creatures started to release demos or EPs, like Sodom and Hellhammer. While Sodom were more punk in the attitude, Tom G. Warrior and Co. started to play an obscure mix of doom/ thrash metal with black influences. The doom/black contaminations can be found in the great “Triumph Of Death” song with lots of black metal screams and down tempo. A manifest for the future generation of black metalheads. \n\nIn “The Third Of The Storms” and the legendary “Massacra” the thrash/punk influence are more present. Raw up tempo with quite repetitive drums work (a characteristic), tuned down guitars and truly doom atmosphere. The technique at the instrument is childish but also this contributes in giving a more primordial touch to the songs. Truly evil.\n\n“Aggressor” begins with a doom drums part, followed by raw double bass and an atmosphere that could fit easily in a graveyard by night. The tempos are never too fast and Tom vocals are something raw but not screamed. Like early Celtic Frost. “Revelation Of Doom” is fast while “Messiah” is mid paced and again really obscure. \n\nAll in all, a must for anyone who wants to know to who black metal nowadays should pay tribute to. But don’t expect blast beats or too screamed vocals. The history is here.\n",
        "\nRazor wire wrapping peels off to reveal an atonal tribute to all things depraved and disgusting. A voice with all the charm of Frank Sinatra's rotted corpse belches death sentences into a subpar microphone, while also testing the gag reflex with vomit-like excursions of the diaphragm. These riffs, or as I refer to them, sequenced patterns of feedback noise, conjure up images of horror and torture in ways only post-pubescent angry Swiss males can muster. The drummer sucks, but this still gets a hundred percent. \"Triumph of Death\" is obviously the standout piece, with aforementioned puking laden with slow keyless doom style riffage, and chugs on forward like a locomotive from hell. \n\n\"Horus-Aggressor\" deserves mention as well, the thundering double bass, trumpeting perhaps the most loosely defined \"guitar riff\" ever created; however, this riff will rip skin from bone. Extremely heavy - just like the rest of the album. Get this or fuck off.\n",
        "\nHellhammer were always a band that appealed to me. I like the idea that a group of bored teens who can barely play their instruments can make an album with the idea of 'being more evil then Venom', and come out with a cult classic. The good thing about this band is that while they are quite bad on their instruments, the songs are actually quite good.\n\nHellhammer play a pretty cool kind of metal. It's almost punky, it's quite sludgey, and there's some big riffs to be found here. The Third of the Storms kicks things off really nicely. It's fast, got a huge punk feel and has some truely awesome riffing. It's incredibly sloppy... It's quite funny to here the whole band slow down for the chorus, so the drummer can keep up with the double kick, but that makes it all the more endearing to the listener.\n\nYeah, this is really good! Massacra keeps up the same feel, and there's some huge riffs here. Twenty years or so later, this is still a real unique band. Maybe it's because I haven't heard any Venom, but this sounds pretty original to me, and with the possible exception of Bathory, I don't know any other bands that sound similar.\n\nWhile the first two songs are indeed entertaining, it's Triumph of Death that's the real out of the box song here. The intro is quite droney and doomy, and while the whole \"Im Dyinggggggg\" vocals from Tom sound kind of weak, it's still a somewhat freaky and evil start to a song. This song is a masterpiece, simply put, and it's a great example of minimalist, repetitive songwriting that just completely owns you. The relentless tempo and the funeral march of the drums combine to create a truly trance inducing experience. It's really quite astonishing when you realise that this song was made back in '84.. Imagine how intense it would've been back then. It's some quite out of time guitars in places, but that makes it all the more awesome.\n\nWe finish with a track that's quite similar to the first two. More punk feel, more big sludgey riffs. Admittedly, the riffs in these songs sound quite similar, particularly the chorus parts, but that's cool. It's still an awesome track that the whole family can enjoy.\n\nThis albums been a real pleasant surprise for me. I was expecting sloppily played proto black/thrash stuff, and that's what I got, but it's so damn good! The riffs are massive, and while the vocals do get a bit annoying, they still own. While I wouldn't say this is essential, I would say that it's terrificly entertaining and that most metalheads will thoroughly enjoy this.\n",
        "\nI'll start by saying that this album is seriously lacking in anything to make it stand out or make me want to listen to it ever again. I didn't even want to listen to it when writing this, but I made myself because I wanted to make sure that it was fresh on my mind so I would know exactly what I was talking about and wouldn't sound as if I was just going on some rant about something that I didn't even give a chance. It starts with \"The Third of the Storms\" and to be completely honest, when I heard this it almost made me laugh out loud. There's something about the riff that's played when the drums kick in that made me think of an opening theme from Looney Tunes or something. It just sounded goofy and I didn't know what to make of it at this point. It sounded like sloppy and painfully generic punk, but played by people who were influenced by Black Sabbath instead of punk. The chorus really gets on my nerves because you can hear the entire band slow down because the drummer couldn't play double-bass fast enough. This immediatly leads me to believe that they were all very unfamiliar with their instruments and that this was just something they shit out and didn't think twice about because they were too busy day dreaming about the big rock stars they were gonna be. The solo in this song is particularly awful and upon reading the lyrics I start to feel angry toward the band as if they had stolen my hard-earned money right from my pocket. Tom was never good at soloing, but this solo doesn't make me want to kill myself the way most of his solos in early CF do. The lyrics get progressively better from track to track, but Tom sounds like he is totally bored and falling asleep. Where's the energy? This is what a punk band would sound like if they had eaten too many muscle relaxers. In a word: boring. \"Massacra\" is a little better than the first track since it's basically the same, but with a better opening and since Tom chose not to solo I can afford to be a little nicer. Not much more to say about that one. Onward to track three... Oh fuck. I don't know where to begin with \"Triumph of Death.\" This is without a doubt, one of the worst songs I have ever heard in my entire life. The opening reminded me of Mercyful Fate's \"On a Night of Full Moon\" but instead it went nowhere and when the vocals came in I actually turned it down because I was afraid that my mom (I bought this when I was about 15) would hear it and that I would be totally embarassed because it's just that bad. In a way I can respect him for what he's attempting and I'm sure this sounded much better live, but this is so bad that I just don't know what anyone has ever seen in this band. When the verse is over and the riff changes the one that comes in is just about as generic as a metal riff can get and it sounds like the guitar is going in and out of time. To tell you the truth much of this song feels like a simple jam session and nothing more. This is one of those things you would play for fun, but you would have the common sense to never let it leave the rehearsal room. Next. The intro to track four, \"Horus\" would have been pretty cool, but the drummer fucked that up by getting out of time just before the guitar came in and when the guitar leaves the double-bass... Fuck. I don't know. This sounds so corny and generic. When the verse comes in I always think of some \"Ace of Spades\" or \"Iron Fist\" era Motorhead filler-grade songs, but a little heavier and a lot worse. On a lighter note, the chorus riff is actually pretty cool and is the one of the only times on the album that I don't feel like pressing the stop button and chucking the CD and my, by now, very numbed mind into a wood chipper.\n\nSince they are on nearly any version of this you will find nowadays I might as well mention the two bonus tracks, especially since when they come in I always feel a wave of relief roll over me for two reasons. They are 10 times better than all the tracks that make up the actual album and I know that the pain will soon be coming to an end... \"Revelations of Doom\" is kind of cool, but it still contains absolutely nothing to make me want to change my mind about these guys. \"Messiah\" is the last track and is the only one I would actually goes so far as to say \"I like.\" I just can't put into words how over-ratted \"Apocalyptic Raids\" seems. It's one of the only things I've ever bought that made me feel 120% disappointed and that my money would have undoubtedly been better spent on a drugged-up hooker with hep, AIDS, herpes the desire to kill me halfway through. Most of these songs make me think of some of Venom's early outtakes such as \"Hounds of Hell\" or \"Snots Shit,\" but not nearly as deep. What does it all boil down to? Basically everything that Hellhammer has achieved with release, Venom did 1000 times better, but at least three years before. I'll give them 40 points for taking the effort to write, record and convince someone to release these god-awful songs, but -30 because it has forever ruined the metal world by making it appear acceptable to release and re-release ignorant music. Hellhammer seem like something that was more about image or finding a party play at so they could get free beer, as opposed to anything resembling substance.\n",
        "\nThis album receives high scores for mainy reasons. The main reason is the recording quality. Yes, it is a demo. The great thing about this recording, although it is very poorly done, is that, in the long run, it helped influence an entire generation of music. When one looks in retrospect at this album from 1983, the reader can see the milestone for what it is. Yes, Venom may well have been the first \"black\" metal band, with Bathory close behind, but that's not really the point being made. This album, seemingly played by amateurs, showed an amazing thing: less can be more. By giving the album a very dark, evil feeling and atmosphere, it didn't matter how well they played, or what chord progressions they used. This album (along with Quorthon) helped pioneer the raw vocals that we all love in black metal.\nOnce again, looking in retrospect, look at al the bands that have used this formula of raw vocals, poor recording, and evil atmosphere. Classic albums have been made with this formula: Mayhem - De Mysteriis Dom Sathanas; Gorgoroth - Pentagram; Dark Funeral - The Secrets of the Black Arts; the list goes on. Any essential old school black metal album follows this formula, a formula that really wasn't broken or expanded on until the symphonic black metal wave hit.\nEvil atmosphere, poor playing, poor sound quality. Usually this would warrant a poor score, but the retrospect and history of metal alone will not allow this album to be taken lightly.\nThis album is recommended to all fans and historians of metal. If you want to see where black metal came from, I recommend this as a start. Highly recommended to all metal fans.\n",
        "\nThis is a very mediocre album in almost all ways of looking at it, and, while it was groundbreaking, I came away from listening to it with absolutely nothing. There is no direct artistic contribution from this band.\n\nThe opening tracks are redundant in the face of music. This is Venom before their time, simply put - historically significant, influential, yet bereft of any direct contribution. \"Triumph of Death\" is a better track than the former two, yet despite its 9:30 length, lacks anything truly new. It's easier to listen to, and almost acquires an epic feel to it, but I keep getting the feeling as though I'm listening to punk regurgitated as \"thrash black metal.\" This track is almost enjoyable as a joke, quite honestly. The hellish screams are a nice touch, I'll admit, but aside from that, this track is weak.\n\n\"Horus/Aggressor\" starts off with a slow riff, fading out and leaving the drums on their lonesome, but picks up upon the arrival of a decent riff (Hey! I like this riff!), then returns to its punk origins. By this time, you have lost all hope of having purchased a good metal album, and can accept this as a good hardcore-ish punk album with harsh vocals. In this context, this song works, but doesn't seem to fit the atmosphere almost established by the track preceeding it. It would appear as though the band simply cannot make up their minds here.\n\n\"Revelations of Doom\" is another sub-3:00 track, focusing on fast riffs, forced vocals with an echoing effect and the basic drumming pattern Darkthrone uses. This is actually a decent track, held by the standards of the other songs preceeding it. Even though this would imply mediocrity, it does not mean that this track is bad. It's fun to listen to on occasion, but I wouldn't make a habit. Still, I had high hopes after this song, not realizing how close I was to the end of the album.\n\nOn with \"Messiah,\" clocking in around the same time as \"Hours/Aggressor.\" It starts off with a cold, chug-a-chug riff. And it goes on as such for a while, then changes to another riff that, while not entirely different from the first, destroys the atmosphere. After this track was over, I sat by my CD player, asking \"Was that it? This received that many good reviews?\"\n\nNow I should have been less foolish than to expect great 80s metal, but Bathory managed to do it during the same year. I acknowledge Hellhammer as part of black metal's foundation, but on their own, they accomplished very little.\n",
        "\n“…when you have been down in your grave…alive…”\n\nHellhammer. The first time I heard the name I just kept saying it aloud to myself. Hellhammer. I kept thinking there has to be some true significance to grasp. Hellhammer. It was a time when a name like this was so primitive, so top-heavy, and so much more menacing sounding than the likes of Raven, Exciter, W.A.S.P., and Running Wild. Hellhammer. Real word or not, I wanted to use this in a sentence in English class so bad. I hadn’t even heard the damn band yet and I was already enamored with them. \n\nI would initially get a dubbed Memorex tape of Apocalyptic Raids from my buddy in school who was feeding me all this stuff. He verified to my relief the band didn’t sound anything like Laaz Rockit or The Rods, and since my Walkman was practically cemented to my body back then, that I’d see for myself soon enough and if anything to be sure to check out “Triumph of Death”. Screw social studies and the Treaty of Ghent, I wanted to hear this friggin’ band. I got about forty seconds of “The Third of the Storms (Evoked Damnation)” in before the teacher got down to his boring business. God, this was like crude oil extracted from Venom’s hide, and the guy’s vocals…Cronos and Tom Araya were as diabolical as they come, but this guy…? It’d be about forty-five minutes before the bell of glory would ring the class’s end. \n\n“…the world will die under the sword of destiny…”\n\nAll nostalgia aside, this four-song graven opus wasn’t inspiring rave reviews among zines. Even the smaller, in-the-underground-know ones were calling it something akin to the steam that rises from manhole covers. Truthfully, anyone with an even half-evolved brainstem can hear that the music is written with zero complications and is frightfully simplistic. I didn’t care. AR was its own little world as far as my concerns went. If you hadn’t already heard Venom or Slayer by day one of the ep’s release, the most gutted and acrid vocals were what you were hearing, and if a fantastic production were a living, breathing entity, it would’ve walked over and said “what the hell do you want me to do with this?”\n\n“The Third of the Storms” is actually the first of the four storms featured here, squealing forth with a primal, deep-toned mid-pace and vox that was as gravelly as they was unintelligible. “Massacra” cracks a whip on the velocity, and the memorable chorus with an open-ended riff is the center point. \n\nTo prepare for “Triumph of Death” back then was impossible. Discordant guitar notes barely even associated with a rhythm cry and moan like some prehistoric mammal caught in a painful trap, then the real inhumanity starts. With a nocturnal rhythm Sabbath would’ve thought was way too mausoleum-like, Satanic Slaughter a.k.a. Tom Warrior, the mammal’s pained father, unleashes bestial cries of defiance toward anything commercial or loving. Finally an actual beat trudges from the forest of screaming doom as the hollering subsides to actual lyrics that could give master linguists fits, and again the trap is reset and sprung. After 9+ minutes the beast gracelessly dies in a whispering mess, a beloved atrocity for the ages. Is it really a mystery as to why some would dislike this track? And to say the concept for the song as well as its performed extremity is merely a daring endeavor is an understatement if one exists. Let’s face it, “Triumph of Death” is the Evel Knievel of extreme songs even today. \n\nThudding in with percussion, “Horus/Aggressor” borrows the quicker rate of “Massacra” and surrounds it with the gait of “Third of the Storms”. The chorus’ catchiness enlivens the tune that ends with the fanfare of a guillotine strike. \n\n\"...the final chapter is yet unwritten...\"\n\nOf course I’d buy the real deal a little later, until then never seeing lovely Sitting Death, the cover painting with the schlong, and always wondering what the hell Tom was grunting about. It's also where I would come eye to eye with the dark, superior glints of Tom’s worded signature, a lyrical rawness that would grow into Stygian prose with Morbid Tales and beyond, and would be the formal catalyst that would urge me to pick up a pencil and do something with it other than throw across the room. \n\nIt’s undeniable that Apocalyptic Raids is all of these: basic, pioneering, primordial, catchy, slovenly, bare, haunting, and as cheerless as a dead puppy, and with three of the four tracks not conveyed with the most captivating of songwriting, I believe the ep’s impact would have been much less conquering if “Triumph of Death” had remained mere demo material. \n\nGiven a chance to bet on it, I would’ve lost if someone told me this band would incorporate orchestral movements, angelic soprano harmonies, and other avant-garde shadings into their songs in a little over a year. Nevertheless, Apocalyptic Raids sits rightfully on a throne of kings. \n\nAs of this writing, the ep is also available on CD with two bonus tracks, “Revelations of Doom” and “Messiah”, both of which can be found on the earlier Death Metal compilation from Noise Records, and even with the pair it still times in under a half hour. The addition of “Crucifixion”, straight from the vaunted Metal Massacre V compilation, would’ve easily found a home, and since we're being charitable, how about some demo crap like, oh I dunno, alert \"Sweet Torment\"? Or \"Reaper\"'s grody thunderplod? \"Eurynomos\" anyone? And how disappointed would grandma be if she couldn't toothlessly croon along to good 'ol \"Bloody Pussies\"? \n\nNow I ask you, between the Treaty of Ghent and Hellhammer, which do you think has enriched my life more? \n\n...only death is real...\n",
        "\nBefore I had even heard Hellhammer, I had heard mixed reviews about them from friends, and musicians and books. Although all the reviews weren’t praising the album, all of them agreed that Hellhammer had a major influence on music. So ,I finally decided I was gonna find out what Hellhammer was about. \n\nFrom the moment I bought this cd, I knew it was gonna be great. On the cover of the album there is this really bombass drawing of a spider like thing with a skull for a face, holding the bones of humans. I get home and put it in my stereo and the first track that comes on is “The third of storms(Evoked Damnation)” this song blew my mind away, the drumming wasn’t the best, but it went perfectly along with the guitars and the vocals. This son is great, although like most of the other songs on this album, it is bass empty, you can barely even hear the bass. \n\nThem comes “Massacra”. The quick “intro” of this song is fuking great, the way it leads right into the thrash. This song is similar to “The third of storms(Evoked Domination)”in some ways, but it definitely is its own song. The chorus is fuking great, “Away is the sun/ Forever is night/ Mankind s’ massacra/ Intelligence is dead” The brief ending was a great way to end this song. \n\nOut of no where, comes the longest most dragged out guitar note I’ve heard in a while, and then a scream from Warrior that sounds as if he is fuking dying. Then in come the drums, and once again, they go perfect with the song. Unlike the other songs,”Triumph Of Death” is probably the only song on this album on which you can hear the bass. After about 3 minutes, the song starts to speed up a little bit, but not too much, but just enough to still have that “doomy” feeling this song is infamous for. With death growls, perfect drums, and great guitar, this song at times reminds me a little of a less distorted version of something off “Under a funeral Moon” \n\nNext is “Horus Aggressor” with a bombass drum intro. It might not be complex or impressive, but it goes perfect with this song. This song is still a little bit slow compared to “The third of storms(Evoked Damnation)” or “Massacra”, but it well placed after “Triumph Of Death” since it still has traces of that “doomy” feeling. Tom’s voice on this is fuking awesome, with his high pitched growls through out the song. \n\n“Revelations Of Doom” picks up the pace right away, being much faster then “Horus Aggressor” and probably has one the better riffs on this album. This song is like the first two songs, but it is still fuking great to listen to. Very fukin easy to hear, and just fuking great. \n\n“Messiah” comes in with a little guitar intro, and then Tom comes in along with the drums with his high pitched growls make it sound all the better. His voice really stands out on this song, like in “Triump Of Death”. The way he screams “MESSIAH!!” and drags it on for a while is impressive (shit, no one I know can do it) and his high pitched growls once again are excellent and cant get tiring. A great fuking way to end this album \n\nAfter hearing this album, I couldn’t put it down for a good couple of weeks. Its got perfect rhythm, this “doomy” feeling, and the fuking genius which is evident in “Triumph Of Death” and, although Tom speaks poorly of it (“We thought Venom was the heaviest band, and we wanted to be heavier. Everybody thought we were a new heavy band, but in reality we were just a miserable photo copy [of Venom]” - Tom G Warrior A.K.A. ‘Satanic Slaughter’) I personally think this album is fuking great and a must have. But, when I recommended it to a friend of mine, he thought the whole album (with the exception of “Triumph Of Death”) was garbage. So it would be best borrow it froma a friend, or download some songs, and if you like what you hear, to go out and buy the album.\n",
        "\nOkay, here goes another try. Hellhammer are one of the few bands who, in actuality, can incorporate an evil sound into their music and not get lame and/or boring. This is like pouring the fuel on the fire, in the sense that Death, Black, and Thrash Metal were all originating around the time of this album. Hellhammer, in turn, took all of these genres and molded them into one dark album called Apocalyptic Raids. Whether a fan of thrash, death, black, or doom metal, this is a must have. Now on to what I was lacking in last time I reviewed, the actual music:\n\nThe Third of The Storm is a doomish thrashing classic, one of the best tracks on the CD, and I'm sure all of you who have heard this album can rightfully agree with me. The sound is so raw, yet it is distinct in every way.\n\nMassacra is, eh, a mediocre track. Not my favorite, but definitely doesn't let up on the thrashing. Overall, this song reminds me more so of Venom than any of the other tracks on the record.\n\nTriumph of Death, yeah, this is the one I went on the rant on before hand. 9 minutes and some odd seconds of pure fucking evil. I won't go back into the rant, because it's unnecessary, but... this is one Hell of a song, and I mean that literally.\n\nHorus/Agressor starts off with a drum intro sounding like a battle march, or something reminiscent of one. The fading guitar does fit quite nicely with the drums. The vocals of this song, at points, remind me of a lot of other old school thrash, but then I think, Hellhammer can't, wasn't, and will not be reproduced.\n\nRevelations of Doom, one of my favorites off the album. Slightly in the same tone of Bathory, except the singing sounds something of a more Death Metal style. Definitely a highlight. 2:51 of pure headbanging madness.\n\nMessiah, the closing track, ends this with a fucking boom. A wincing cry at the beginning, dark tone throughout the whole track (who am I kidding... through the whole album)... anyhow, this track was a nice choice for ending, because it definitely ends it with a thrashing bang.\n",
        "\n\"Apocalyptic Raids\" is a triumph. Influential, violent beyond words and blacker than black this CD defines \"necro\" and \"cult\" in ways that I can barely begin to put to words. Vile...violent...bitterly recorded...what more could a man ask for? Tom G. Warrior was never more aggressive and motivated as he was here. Sure, the production \"bites\" (hey, this is \"necro\" you morons) but the feel is so raw and violent that you can't deny the overall mood and vibe. The playing is competant, and this allows the music to flow with a violence that captured the best parts of what would remain in Celtic Frost, but enhance them with a feeling that was long lost by the time of \"To Mega Therion\". Double-time-doom-black-metal. Nobody did this better than Hellhammer...\n\nThe record explodes forth with the dominating \"The Third of Strms\" and follows with the meaty \"one-two\" punch of Massacra. Both tracks hammer along like hell's jackhammers on the inside of your skull. The moodier \"Triumph of Death\" and the drum-oriented \"Horus/Aggressor\" also work quite well. That's right folks...there is NO filler here! The best song is saved for being the ultra aggressive \"Messiah\". Never before did Tom G. Warrior pound along with such aggressive tones. This sadly, suffers slightly from the performance being a little off...but with songwriting like this who can complain? The riffs have yet to be matched.\n\nHellhammer were a concept too good to last. Thankfully, despite the amount of \"demo material\" that found it's way too the surface, the band managed to quit the scene before they became a joke and plodded on with the ever-decaying Celtic Frost. For all fans of black metal, dark metal or just plain thrashing hell...this one is for you!\n\nBUY OR DIE!!!!\n",
        "\nThis is where most of the extreme metal bands of today got their inspiration from. A simple little demo EP, and who knew it would become one of the most influential metal recordings of all time. Afterall, it was made by a bunch of teenagers with the sole purpose of being more extreme than Venom!\n\nThings get kicked off with a bang with the insanely rough around the edges black/speed metal of \"Third Of The Storms\". The same drum bet the entire time, a simple two or three chord riff, very rough vocals(some of the best ever!). As a matter of fact, the second track, \"Massacra\" is very much in the same formula, except catchier somehow. And that reminds me: since this album is ultra primitive, you'll be able to memorize this entire album in about 2 or 3 listens.\nThe third track, the \"centerpiece\" of sorts, the nine minute-plus,\"The Triumph Of Death\", is much more doom metal in execution, and is able to actually pull off some atmosphere, thanks in part to the screaming, groaning and moaning of Tom G. Warrior. There's actually a pretty cool main riff in here, once the song gets off the ground(the intro is a little overlong, it could use some trimming.).\n\nAnd back to the black/speed! \"Horus/Aggressor',\"Revelations Of Doom\" and \"Messiah\" are very much in the same style of the first 2 songs, yet they still find a way to avoid being monotonous in any way.\n\nWell, there ya have it. One of the greatest EPs of all time , and an album that all death and black metal fans should check out and appreciate, afterall, without this, those genres may never have exsisted, or at least been alot more different than it is now.\n",
        "\nBut here is some of my own anyway... this is just some freaky, freaky shit right here, especially if you consider the fact that this is from 1983!!! Not 1985, 1983... this is probably the stuff that was making Jeff Becerra feel all funny in every part of his body (including his pee pee) when he was first deciding to form Possessed... the stuff that took Venom's first few releases and then added a whole lot of dark, evil, completely nuts ideas to the whole thing. Not even Quorthon was as fucking fucked up as the guys that put this work together.\n\nSo, why is this so essential, you may ask? Because, for all intents and purposes, it is a HELLHAMMER FULL LENGTH ALBUM!!! Yes indeed, kids - because Apocalyptic Raids isn't enough - 2 bonus tracks or otherwise. You want something that adds on to the sick, sick charm of that little EP, takes production values of that album and throws them even further down the shitter, and even manages to predate the official release!\n\nWorship at the altar of Hellhammer... this is insanely great stuff. Most of it is the fast Venom worship we all know and love... stuff like the intro Messiah, the Metal Massacre V track Crucifixion, and others. Stuff that's so insanely, horribly BAD that it is very very good. That buzzsaw guitar tone with the most absurd use of the bend bar (see Buried and Forgotten), Tommy G's deranged vocals, etc. This is just fucking death right here... from EurEEEnymos (Prince of Death) to Reaper, to the long title track that gallops along, spreading good cheer in the name of Satan Claus. Ho ho, you fucking ho.\n\nThen, we have a rendition of Triumph of Death, which, while not nearly as good as the one on Apocalyptic Raids (that one is just magical... there is nothing like it, before or since), is still pretty fucking decent. Compared to the abysmal crawl of that one, this version positively blazes along (it's only seven minutes) but fundamentally all the assorted corpse parts are there.\n\nEven the outro is morbid as fuck - probably the most deathy vocals ever employed in metal up to that point. Sure, the whole thing sounds like a pig fucking a blender, but hey, influence!! Abominatrix mentions the whole thing may have been a pitch-shift trick, but oh well. Can't read too much into these things, unless of course you're practically every DM metal band to come along.\n\nSo, does this thing fucken rock? HELL YEAH. Does it fucken rock as hard as Apocalyptic Raids? Not quite. But where else are you going to get most of these songs? Seriously. Buy or die.\n",
        "\nEnter a professional studio, semi pro recording and a record label and what you get, paradoxically, is an uglier sound. If you're not famillliar with Hellhammer and want to read a more broad analysis, check out my \"Satanic Rites\" review above. I'll dispense with the preliminary essay now and get straight to the point. This is abrasive and harsh stuff....annoying I'm sure to the vast majority of people, and possibly that's not strong enough a word. It is also great in a sense that few other releases are. Four songs in total from the \"Satanic Rites\" demo are here, plus two new ones, \"Massacra\" and \"Horus/agressor\". The recording is a hell of a lot louder now, and grittier..the drums more snappy and the guitar a furious low growl, while the bass frequencies have been jacked up. \n\nThe two new songs, I'm glad to report, show no signs of musical progress either. \"Massacra\" is cloyingly simplistic, it's riffs consisting of two chord combinations that are located literally a half step apart, making the whole thing sound childishly nasty almost..which is part of why it is so great. \"Horus/agressor\" sounds a bit like Motorhead on some seriously bad downers, as it lurches along in an almost catchy manner, with Tom delivering a rather exciteable vocal performance too. The EP concludes with \"messiah\", given a particularly vehement treatment here and sounding truly great.\n\nThe reverb is completely gone on the vocals as well..they're right up front now, devoid of any effects...which makes the rendition of \"Triumph of Death\" to be found here a totally harrowing experience. I remember how revolted I was when I first heard this song several years back, still a neophyte to the harsher and rawer forms of extreme metal. I hated grindcore, and my only real forrays into raw black metal were the first couple of Bathory albums and a rather tentative purchase of Darkthrone's \"A Blaze in the Northern Sky\". Anyway, \"Triumph of death\" sickened me...I wasn't even aware who the band was...I heard it on a local radio show and nobody bothered to announce the song..but I got it on tape, and it was months before I finally learned who the song was by. The vocals were disgusting....absolutely vile shrieks, sobs, wails, moans and puking, gut wrenching cries. Not even Bethlehem's \"Dictius Te Necare\" had prepared me for vocals like this...and the music was so ugly, so trudging, bare and sicly sounding. The whole thing almost made my stomach want to turn over, and of course I kept coming back to that tape, being fascinated by this sort of audial cruelty and wanting to listen to those nine minutes of massochism repeatedly. I guess I have become somewhat more accustomed to harsher forms of extreme metal..but Triumph of Death still affects me. It still brings about such utter feelings of misery and wretchedness, and I think for that reason it is one of the greatest hymns ever conceived. How a trio of otherwise down to earth swiss guys with limited experience in basically everything managed to pull this off I have no idea...but they did, and Tom certainly did something with his voice here that hadn't been done before, at least not in metal...and still hasn't been equalled since to my mind. There are hints at Celtic Frost to be found in this song too, in it's sluggish chugging midsection.\n\nSo there you have it....and again, this is not going to appeal to everyone. Even those who claim to appreciate raw black metal may be hard pressed to really understand this, although they may be quick to sing it's acolaides. The fact is, it is hellhammer's nonsense, the fact that they pulled off music here and on \"Satanic Rites\" that is unconventional in its struggle for tonality, its near failure to make some sort of coherence out of passages that unspoken laws of music state should never have been juxtaposed. To some, this might just sound bland and overly simplistic...but in it's ethos, it is far from both these things, and this is why it won't be abandoned.\n",
        "\nHaving read with considerable interest Thomas Gabriel Fischer's book \"Are You Morbid?\", describing the events surrounding Celtic Frost, its creation, concept, struggles with personal and business difficulties, run-ins with insane females and eventual demise, I wasn't too surprised that Hellhammer was regarded in retrospect by its creator as a symptom of teenage boredom more than anything else, a result of three clueless Swiss guys who knew nothing about their instruments but wanted to play \"more extreme than Venom\". On the surface, this slagging of Hellhammer might leave a bad taste in some peoples mouths. After all, this is the band who countless black metal acts flock to for inspiration, who's formula, as much as Tom might like to see it buried and forgotten (excuse the reference), continues to be called upon to this day. Tom G. himself actually hints at a grudging fondness for the Hellhammer days (or perhaps I am merely imagining this?), for despite his harsh criticisms of the pre-frost era. He doesn't hesitate to point out Celtic Frost's continuing inclusion of \"Messiah\" in later sets, nor does he refrain from describing how the group attempted to rehearse \"third of the storms\" in 1987, and found that they were, for some reason, totally unable to recapture the original feeling of the song, much to their embarrassment. Of course, the latter anecdote is relegated to the Author's Notes section at the very back of the book, but it is there, plainly enough. Sure, the music is almost mindless in a sense...perhaps in Tom Warrior's eyes a mere stepping stone of a dubious nature to what Celtic Frost would become, but there is something about it that remains powerful and will not be forgotten, at least by some. \n\nThe consensus with Hellhammer seems to be that either people love them or laugh at and ridicule them. With that in mind, I'm going to attempt to dissect the music to a certain degree, since I am for some reason interested in the phenomenon of this band. Some might say it's unremarkable, boring even to speculate on such things, let alone listen to the music...but feelings of such extreme reverence and derision must always have a basis, and an understanding of that basis is perhaps integral to truly understanding and enjoying what it is that Hellhammer did, intentionally or not.\n\nAlthough modern bands certainly do harken back to Hellhammer, all but a few, those that seek to directly mimic, such as the very obvious examples of Warhammer and Bloodhammer, have much broader subtexts to draw on and thus don't really sound much like that early swiss band after all. I refer of course to bands like Darkthrone, who ocasionally compose riffs that have the almost nonsensical claustrophobic patterns that Hellhammer seemed to utilise. Darkthrone however have some more developed metal ideas from which to draw their particular elixir of sound, and thus, even when they are paying homage to Hellhammer, such as in the slower moments of \"A blaze in the Northern Sky\" and \"Panzerfaust\", and even on the more recent \"Ravishing Grimness\", there is a certain modern aesthetic that makes the music somewhat more digestable. Hellhammer seemed, if I can hazard to say this, to almost come out of nowhere, which is part of what makes them so great in my view. Sure, Tom Warrior listened to loads of Motorhead and Venom, and other british bands like Angel Witch at the time, and yes, those are probably the bands, if any, people would be quick to slap on Hellhammer as obvious influences. But I submit that they aren't, really. If Hellhammer had been able to play as well as Motorhead or even Venom, they would not be the original phenomenon that they were, because as Tom would have pointed out, they would have tried to sound like them. The fact was though, that Venom looked like virtuosos when compared to Hellhammer, and that is a scary thought for a lot of people. The fact that three years later a band that was more or less the same individuals (two of them, anyway) had reached the point of musical advancement to create an album like \"Into the Pandemonium\" is quite a testament to Tom and Martin's ambitions and insane drive to improve. Even Celtic Frost in 1987 were by no means stellar musicians. But they had a vision, a desire to create something new and unique that had never been done before and would raise so many eyebrows, create such a firestorm in the extreme music community that it would really never be the same again. Hellhammer was perhaps more of a quiet revolution, at least in the figurative sense, but it was an equally important one.\n\nThis is not, of course, the most legitimate Hellhammer release. it is in truth a CD reproduction, a bootleg I really would have to say, of Hellhammer's second (or third?) demo. I believe this is correct, despite information given that indicates that tracks here are from the \"Triumph of Death\" demo or even recorded live. I have heard that demo, and I can say with absolute certainty that nothing on \"Satanic Rites\" is remotely as horribly recorded as was that earliest output of the band, and the sound here is good enough to have been the result of minimal studio work . I believe that \"Satanic Rites\" was the recording that got them a semi-deal with Noise records to record a four song EP. I wanted to give a really comprehensive description of Hellhammer's sound here since it really is the first widely available recording of the band, and since many people probably don't own this and should, since it's just as good as \"Apocalyptic Raids\" in its own right. There are ten songs here, not counting intro and outro, which seem to be parts of other tracks played at reduced speeds...something which the band probably did in order to sound heavier, judging by a comment Warrior makes in his book about playing Venom singles at 33 rpm to increase their brutality (how cool is that?). Anyway, two of the songs from the original \"Apocalyptic Raids\" EP are here, as well as the two tracks featured on the Metal Massacre compilation, the label release debut of Hellhammer. All these are of course earlier versions here; the band does improve on the way these songs sound later, so for the most part these renditions of \"Third of the Storms\", \"Triumph of Death\", \"Messiah' and \"Revelations of Doom\" are only of moderate interest. IN particular, the version of \"Triumph of Death\" seems to be rather lackluster....probably partially do to the completely anguished vocals Tom pulls off on the \"Apocalyptic Raids\" take of this track. The previous incarnation of this song doesn't have nearly the same amount of feeling or passion and tends to drag a little. \n\nIt's really the other six songs that make this recording great. Forgotten jems that could have easily been on \"Apocalyptic Raids\n. but weren't, for the obvious reason that Hellhammer didn't have the funds or contract to record an album anyway. It's not really for us to imagine what these songs might have sounded like on the EP...since they only exist in these versions, it doesn't really matter and we can just enjoy them for what they are. Hellhammer's music struggles with itself, cycling through repetitive, thrown together sounding riffs, the guitar almost desperately sawing back and forth between chords that simply don't sound like they belong together at all. Often it sounds as if Tom isn't sure quite what chord to play at all, and simply ends up thinly strumming half of it, or forcing an anguished bent note out of his instrument. The drums, in the majority of the songs, clip along at a fast pace, but the rest of the band crawls, so that even the most \"rocking\" sounding songs come out doomy and hobbling. The complete absurdity of some of these riffs would make most musically minded people cringe. This is perhaps even more evident on the EP in songs like \"Massacra\", which looks inane on paper and yet manages to sound primal and awesome when played by this particular band. Tom seems to enjoy vocal duties as he always did in the future as well. There's plenty of \"Owww!\", and \"oooh!\", and so on...the difference here is that there is a completely over the top echo on his voice, which gives the music a sort of distantt feel that isn't present on \"AR\". The guitar is much thinner on this particular recording than on the ep, but in a way that makes it clearer..and this is by no means a bad sound...it's just a little lacking in fidelity, and considering the nature of the music, who really cares? There are a couple of glitches that pop up in the sound here and there, which obviously point to the fact that the CD was necessarily mastered from a cassette that is degraded in a couple of places, resulting in the breakup and distortion of sound common in old and often played audio tapes. It's not a chronic problem though, and only surfaces in a couple of tracks, most notably for a second or two in \"Messiah\". \nAs for the songs themselves....the original tracks....\"Buried and Forgotten\" is incredible and definitely the highlight of this recording for me. The song was later stripped of certain elements and given a few others, transforming into Celtic Frost's \"Necromantical Screams\". The Hellhammer song is a lot less precise and tight, obviously. it's very slow, ponderous, full of those torturous bending notes Tom is so fond of, and some *very* menacing riffs. I think the Frost song should have used a few more of the ideas in this original. The vocals sound ghostly and evil as fuck too, and the fast part near the end is totally unexpected and well....odd..you have to hear it for yourself. \"Crucifixion\" is a short rocker and should have been on the EP for sure, and the title track is seven minutes of repetitive Hellhammer \"psudo-thrash\" for want of a better description....almost hypnotic in it's fast tempo but constrained and aching riffs.\t\n\nObviously, I like this a hell of a lot....although after much debate with myself I've realized I do prefer the sound on the EP for being more up front and \"in your face\" as it were..the six exclusive songs here are essential to anyone who knows or wants to know hellhammer. If you are a newcomer to this particular brand of mayhem, do start with the EP, and if you are hungry for more, track down this bootleg and enjoy the further revelations. Of course, not everyone is going to share my enthusiasm for this...and I don't expect too many will be flocking to Hellhammer, since they represented a near antithesis to most peoples ideas of good music..and this applies equally to today's extreme metal public, even those who say they enjoy black metal bands that never hesitate to point out their adoration of Hellhammer.\n",
        "\nYes, it's that revolting. And awesome. \n\nThough one to find too. But I read somewhere that Celtic Frost's Morbid Tales/Emperor's Return (another excellent record on its own) was reissued a while back with the entire 6 tracks of AR 1990 A.D. That could be easier to get, I'm sure.\n\nThe obligatory description: Take equal parts Venom and Motorhead and make more dirty, more unholy and with a vibe as ugly as the smell of a bunch of corpses rotting on the desert on a REALLY sunny day. Add to all of these a guitar tone that would make Master of Reality sound like Def Leppard in comparison, fucking insane vocals and a plodding rhythm section, then the production (or no production at all). You got Apocaliptic Raids.\n\nThe openers \"Third of the Storms\" and \"Massacra\" are speedy and straight bangers and featuring those nice as fuck riffs that take the concept of atonality to the extreme. See also, \"Horus / Aggressor\", for a greater example on this. Tom G. Warrior growls on Celtic Frost's first album sound sane if we compare them with the ones on Apocaliptic Raids. And the guitar tone sounds so torturing, so demonic, and that could be because of the poor equipment and equally incompetent technical skills, but, intentional or not, it gives the record such a strong sense of chaos and annihilation.\n\n\"Triumph of Death\" (more than a song, an exercise on self punishment, because of the vocals, mostly) is such a fucked up work of art it HAS to be heard in order to be comprehended. It rides mostly on slow tempo riffing and even the faster parts sound like something dragging itself as it leaves a trail of blood and guts.\n\nAnd then, the bonus tracks: \"Revelations of Doom\" is another fast number like \"Third of the Storms\", but better. \"Messiah\" rides on this riff that is like a sick version of he opening of \"Symptom of the Universe\", with a tempo that's slower than \"Revelations\", but just as punishing.\n\nIf you ever wondered how the legend of Hellhammer made itself with a couple of demos and these six songs, then by all means you must get this. If you like it raw, vile, dirty, then by all means you must get this. If you can't take the raw, then by all means you must get this, so you see what you're missing.\n",
        "\nGrim, kvlt. Possibly the grimmest and kvltest stuff ever laid onto tape. Oh fuck yes... this is just so completely epic and essential and dark and HEAVY FUCKING METAL and ... imagine Venom, but darker. Possessed, but more primitive. Black Sabbath, but rawer. The basic lineage of what metal is and represents runs solidly through HERE. \n\nFor being a short little EP, this is nothing short of majestic. Something that harkens back to the beginnings of metal itself, and would be echoed in a thousand later attempts, some more successful than others. The Triumph of Death - the title says it all... a celebration of all that is dark and blasphemous and Satan and krieg. GRAAAHH!!!!!! Twisted vocals channel Hell itself - slow doom crunch turns into a midpaced frenzied beating of the senses - riff after solid riff delivers the assault, with the key \"fast\" (I use the term loosely) riff being almost a morbid, necrotic refraction of the classic heavy/power crunch riff. Imagine \"Megalomania\"'s middle section, but played by zombies. Possibly the darkest song ever, with the exception of course of the first: \"Black Sabbath\" itself. \n\nAnd the rest is no slouch either... speed metal The Third of the Storms evokes the first Bathory LP and predicts the second with its Venom stylings, combined with the same darker guitar tone that makes THIS be a cut above the other black/speed offerings of the era. Massacra is similar stuff - fast, brutal, cutting. Horus and Aggressor combine into one song - a final closing in speedish fashion - the two first songs, and the last double-song framing the Triumph, speed metal bookends for a doom classic.\n\nIf you don't like this, you don't like heavy fucking metal. Plain and simple.\n"
    ]
}