{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "N/A",
        "Status:": "Active",
        "Formed in:": "2021",
        "Genre:": "Extreme Progressive Metal/Metalcore",
        "Lyrical themes:": "Japanese legends",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2012-2021 (as Mrityu),\n2021-present ",
        "Number of Reviews": 2
    },
    "Band Reviews": [
        "\nFor those unaware, Ibaraki doesn't only generate from Matt Heafy's love for extreme metal, specifically black metal. As much as black metal is what we are about to hear on Ibaraki, the name and the concept of Rashomon as an album generate from Matt's family background, as he is actually Japanese-American. That being said, Rashomon as a lot more to it than just love for black metal and the collabs with Ihsahn, Nergal, and Gerard Way. This is way more personal. It's a tribute made by Heafy to a culture that is also his own.\n\nI had high expectations for Rashomon - considering everything Matt puts his touch in turns out to be amazing - and it did not disappoint. The only way for you to be disappointed with the album is if you're either too much of an old-school fan of black metal (and you like it all heaviness and no melodies) or if you're a Trivium fan that is not acquainted with the extreme side of the genre, thus being caught by surprise. Luckily I happen to fit myself in both categories so I would hardly be disappointed by this. And once again, I am not.\n\nThe greatest thing about Rashomon is that it is labeled as a black metal album, yet Matt Heafy has managed to go way beyond the spectre of the subgenre. From the waltzing rhythms of \"Hakanaki Hitsuzen\" and \"Kaizoku\" to the oddly danceable section in \"Akumu\", not to forget the ballad-like clean guitar intro of \"Jigoku Dayu\" and the japanese-singing section in \"Susanoo no Mikoto\", Heafy seems to have channeled a combo between an old-school black metal sound, together with his usual layer of Trivium melodies and an Opethesque kind-of approach to craft a unique and profound offering.\n\nIt is hard to find negatives in the album, as there isn't a thing that I would necessarily describe as negative. \"Hakanaki Hitsuzen\" and \"Kaizoku\" caught me by surprise for sure, but they seem to either set the tone for what's to come or make the album come full circle, and that certainly adds consistency. The collaborations are on point, especially the one with Gerard Way on \"Ronin\", which I found to be unexpected yet pleasantly surprising. Ihsahn brought a taste of old-school black metal with his Norwegian-singing section in \"Susanoo no Mikoto\", which I consider to be the most out-of-the-box track of the record, as Matt Heafy japanese-singing part during the song is also an unexpected sweet treat. Nergal singing in his native Polish language is also a rare sight to behold (even though he does it here and there when he's with Behemoth) so it adds a certain charm to \"Akumu\", which already has that oddly danceable section capable of dropping many jaws.\n\nAll in all, Rashomon is more than just an album. Rashomon is a work of love. Love of a man towards his own culture, love for expanding the horizons towards a more extreme landscape and love for calling your friends out, collaborate and have fun while drifting inside what's arguably the most extreme genre of Metal. But most of all, this album is a work of Matt's love for the fans, as it will surely please those Trivium fans who prefer melodies rather than aggressiveness, and the (old-school) Black Metal fans who go the other way around. With all the love Matt put on this record, RASHOMON is well versed to become an album of the year candidate when 2022 rides off into the sunset.\n\nThe Dormant Samurai in Matt Heafy has risen. And it is here to stay.\n",
        "\nThere’s quite a bit of intrigue behind the full-length debut of Ibaraki, the latest project from guitarist/vocalist Matt Heafy. The Trivium bandleader has been vocal about his desire to start a black metal-oriented project for years now and the celebrity endorsements along with the shift toward an aesthetic inspired by Shinto legends make for interesting prospects. Seeing Heafy hit a new creative high with last year’s In the Court of The Dragon also helps raise excitement for how Rashomon will turn out.\n\nThe results ultimately come out more like a blackened prog Trivium than any misguided hopes of second wave emulation, even featuring Heafy’s bandmates on the guest instrumentation. The songs aren’t so cut and dry with screaming verses and bombastic choruses, but the song structures favor a comparable tug o’ war between heaviness and melody with an overall grandiose tone. The guitars are similarly thick, and the drums are technical with plenty of interspersed blasts. The vocals also continue their scream-singing dichotomy though I must admit that this may be Heafy’s most confident clean singing to date.\n\nBut as redundant as that last paragraph makes this album sound, it reveals a more unique hand as it progresses. The symphonic tinges and incorporation of Japanese folk elements throughout make for a distinctly epic vibe and the songwriting dynamics feel less prone to formula, allowing for a more exploratory air to shine. The influence from groups like Enslaved, Opeth, and Ihsahn (who incidentally guests on “Susanoo No Mikoto”) is very apparent.\n\nWith that, the songwriting does well to balance its exotic and accessible elements. With the first couple tracks feeling the most derivative of Heafy’s main band, “Jigoku Dayu” provides the first notable curveball with its transitions channeling classic Opeth and “Komorebi” delivers a similar setup with equally satisfying results. “Ronin” is the album’s centerpiece with an especially climactic set of hooks filled out with an extended folk sequence and shrieks from Gerard Way of all people. As much as the guest vocalists admittedly feel like window dressing to me, it’s awesome to see the fuckin’ My Chemical Romance guy put in the most memorable performance. “Kaizoku” is also a fun closer, winding the album down with a playful jaunt.\n\nMatt Heafy already had a surprisingly strong turnaround with Trivum’s In The Court of the Dragon, but it’s satisfying to see Ibaraki’s debut album play out similarly well. While Rashomon initially seems to go by a similar playbook as his main band, it sets itself apart incredibly well by means of its commitment to Japanese theming and adventurous songwriting. This is the sort of album that I would’ve hated as a teenager on pedigree alone but ultimately admire for its maturity. If you’ve ever wanted an album full of songs like Shogun’s title track, consider checking this out.\n"
    ]
}