{
    "Band Information": {
        "Country of origin:": "Finland",
        "Location:": "Joensuu, Pohjois-Karjala",
        "Status:": "Active",
        "Formed in:": "1997",
        "Genre:": "Melodic Death Metal",
        "Lyrical themes:": "Darkness, Mourning, Loss, Pain, Nature, Mysticism, Individualism",
        "Current label:": "Century Media Records",
        "Years active:": "\n\n1997-present ",
        "Number of Reviews": 75
    },
    "Band Reviews": [
        "\nMelodic death metal has a wide variety of potential expressions in spite of its supposedly rigid parameters, with some of its elder progenitors continuing to explore its more abstract possibilities. In the particular case of the Finnish scene, a trifecta of sorts has held up this more nuanced and largely atmospheric take on things, consisting of Eternal Tears Of Sorrow, Omnium Gatherum and Insomnium. But in contrast to the former two, the Joensuu-based quintet under consideration has taken the least impact-based approach, often blurring the lines between the dense, keyboard-rich niche pioneered by Dark Tranquillity and a folksy, heavily acoustic sense of quasi-balladry that has come to typify their sound in recent years. Over the past few months they have been dripping out a series of individual mini-epic compositions via online streaming sites and the music video format that would seem to be going somewhere, though the resulting musical novella that is Argent Moon turns out to be far more focused upon the going part rather than the somewhere that rests at its end.\n\nConsisting of four songs that function as chapters in a short story, three of them having already been released at varying date throughout 2021, this EP proves to be fairly enigmatic in spite of its relative simplicity. Having retained the services of guitarist and clean singer Jani Liimatainen, formerly of Sonata Arctica, there is a sense of cohesion that has been carried over from the generally dreamy and consonant drive of 2019’s Heart Like A Grave, but it’s a tad more stylized and streamlined. The tension between the chanting quality of Liimatainen’s vocal passages and the heavy, grizzly growl of Niilo Sevanen is a tad more pronounced than what Eternal Tears Of Sorrow was bringing to the table back in the early 2010s, but that’s about the closest analogy as to how these dueling vocal personalities mesh within a musical context. By contrast, the sounds brought forth by the surrounding instrumentation is largely an exercise in sorrowful, almost Gothic-like balladry with some occasional hints of symphonic splendor, but a bit more subdued and reliant upon a droning keyboard backdrop and a fairly minimalist assortment of acoustic guitar lines and biting distorted riffs.\n\nThough each song has a distinct character, they all have a tendency to meld together into a single 23 minute long song divided into parts, not all that dissimilar to what was done on a larger scale with 2016’s Winter’s Gate. The opening lullaby with an occasional jagged edge “The Conjurer” is both the most ambitious and also the slowest and most gradually progressing of the lot, building up from a shimmering mixture of droning acoustic guitars and hazy keyboards to a slightly driving yet still somber stride. “The Reticent” takes on more of an ambient and almost shoegaze-like quality, focusing a bit more on Jani’s ultra smooth croons, but ultimately proves something of a banger once it hits the chorus hook and Niilo’s beastly groan commences. “The Antagonist” leans even further into hook-driven territory, this time featuring a brilliant chorus bit by Jani that could almost pass for a newer offering out of Katatonia. The closer and lone newer entry “The Wanderer” proves to be more of a grower after the mold of the opening song, though a bit looser in feel due to a less conventional beat set put forth by Markus Hirvonen’s kit work.\n\nIt’s generally stipulated that the average Insomnium fan won’t find too many surprises here, particularly those that have followed closely since 2014’s Shadows Of The Dying Sun, but these songs function more as expansions upon an existing formula rather than outright retreads. It works best when approach as a continuous, cohesive whole rather than a series of disparate songs strung together, with each song becoming a more developed and slightly quicker progression upon the last. It’s more focused upon building a dense atmosphere to draw the listener into a daydream than any high-impact or technical showmanship, and apart from a fairly impressive guitar solo slot on “The Conjurer” provided by Liimatainen, shies away from getting flashy. It’s a slight step down from Heart Like A Grave and can almost be treated like a shorter addendum to the same basic sound that dominated said album. It walks a thin line between being meditative and a raging lament, but at the end of it all is a highly infectious set of songs that happen to have a wider than usual dynamic range.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nAlthough Insomnium played some new raw songs in their last live stream, this release was quite a surprise. I am always curious with all of their new releases and was not disappointed with this song, which captured me from the first moment.\n\nMore than any other Melodic Death Metal band, Insomnium knows how to build this sad, cold and desperate atmosphere and it only takes me a few seconds to recognize Insomnium’s unmistakable sound. Same as another of the band’s incredible masterpieces, “Pale Morning Star” also \"The Conjurer\" triggers similar emotions. This special mood gets even stronger if you watch the video, which immerses everything in a dark blue winter atmosphere and culminates in a tragic end. These elements seem to be a trademark of Finnish Metal, but Insomnium brings them to another level.\n\nIn contrast to most of their other songs on their last album (which I rate a good one), ” The Conjurer” caught me with its combination of Finnish melancholy, a remarkable melody that immediately got stuck in my brain, and the powerful sound. It is stunning how Insomnium masters varying their style within a song which is especially striking in “The Conjurer”. The way they shift between classic Melodic Death Metal riffs, slow romantic Rock parts, and barnstorming guitar solos makes even their longest songs diverse and absorbing. For me its pure joy to discover all the subtle details and I find new ones with every replay.\n\nThis melancholic mood arises right from the beginning with slow rhythmic concert guitars, followed by classic metal riffs and Nilu’s whispering growls. The song is growing with Markus Vanhala’s and Jani Limatainen’s sophisticated guitar play. They are perfectly complementing one another in a strong solo with extensive melodic play and beautiful riffs. It’s pure pleasure to listen to these two awesome guitarists, perfectly accompanied by Nilu’s bass play. It commences the last part of the song, when even Markus Hirvonen with his mostly restrained percussion is coming in strong with an impressive power play to make it a worthy but sad finale.\n\nThere are always a lot of emotions in Insomnium songs and if you prefer straightforward Metal, its probably not your cup of tea... but I would be surprised if this one leaves you cold. Insomnium songs tend to take longer than the average and this one also comes with almost 8 minutes. However, there is no single moment too long or boring due to its large variety and depth.\n\nI am curious what’s coming next from these guys, but if their next releases go in the same direction the upcoming album may become their best one since “Shadows of the Dying Sun”.\n",
        "\nIt’s easy to forget that Insomnium have been peddling their craft for over 20 years now, merging the traditional melodic death metal sound of the Gothenburg scene with a sense of sprawling vistas, crashing waves, and soaring birds. Naturally, comparisons to Omnium Gatherum and Noumena from the old guard of Finnish melodeath have been constant, yet Insomnium have steadily broadened their range to adopt a trademark sound of expansive, frost-covered, atmospheric metal that is far more specific than genre labels or mood markers might suggest. Seeing the title Heart Like a Grave adorning the quintet’s eighth album may guide potential listeners to conclude that this is a melancholy affair, yet emotions change extremely quickly throughout songs like ‘Pale Morning Star’, first swelling up with hope, then relaxing into contemplation, and finally roaring with determination in a smooth arc of melodic riffing.\n\nHowever, the notion of riffing works quite differently on an Insomnium album to those of Kalmah or Be’lakor, smoothing down many of the pure rhythm parts with ever-lasting melodies spread thickly by use of shimmering effects. That doesn’t stop moments sounding more like typical hooky death metal, such as the bold introduction of ‘Validation’ or the verses of ‘Mute Is My Sorrow’, though the band is far more likely to pile on layers of guitar and keyboards at any given moment, frequently breaking for cleaner interludes. Compared to the preceding releases, Heart Like a Grave sounds a touch bolder and stronger, a dynamic production and hearty drumming performance from Markus Hirvonen seeing to the physical aspects of the listen. The solos, too, flash and dart with vigour at times, marking a successful induction for new guitarist Jani Liimatainen.\n\nPloughing their own furrow for so long may lead to the question of diminishing returns for Insomnium, though thankfully Heart Like a Grave provides strong songs in isolation and a unified 61 minute experience. The acoustic motif of the title track is particularly memorable and ‘Neverlast’ stands tall as the most succinct realization of the Finns’ aims: fans will be very pleased and Insomnium will doubtless go on like this for years to come, having little to change in a well-established formula.\n\n\nOriginally written for Metalegion #6 - www.metalegion.com\n",
        "\nThere comes a time of bleakness in everyone's life, a time when the world seems like the cruelest and most heart-rending place imaginable. Light hides behind distant mountains and you believe with all your conscience that you'll never see it again. You wretchedly cling to even the smallest hope, desperate to make it last as long as possible and not let it run through your fingers. But inevitably, the final trace of it will soon fall and vanish into the dead soil at your feet, and the miserable search will repeat until you somehow find another speck of luminescence. You'll once again bask in it, treasuring every moment of its warmth, and then it'll be gone. You see visions of a time where you've found happiness but you know deep down that it's nothing but a hopeless fantasy. The reality hits you and you see what you perceive to be the real future, one where years have passed and everything in your life has changed, yet you're still trapped foraging for fleeting hopes.\n \nIt's a punishing, harrowing cycle, one which has been repeated since the dawn of man and one which shall continue until the last human is laid to rest and Earth is left a barren husk. Though they took a different form to each individual, people realised that the sparks were something they all sought, the hunt for them a burden they all shared. The light became known. People learned to love it. And eventually, it was given a name: Solace.\n \nToday I look at the most brilliant light of all, a mote of radiance brought forth by Insomnium, one of Finland's many legendary melodic death metal acts. After two separate forays into the land's most desolate winterscapes in 2002's In the Halls of Awaiting and 2004's Since the Day It All Came Down, the foursome returned, carrying with them their darkest and most brooding yet also most hopeful and reflective release. \n\nThere's a lot of parallels to be drawn between this album and the previous one. In my last Insomnium review I described Since the Day as \"A voyage into a mirthless, callous world, a journey across frozen planes, through gloomy forests and into starless nights with pale moonlight as your only companion.\" Above the Weeping World travels even further into pure misery, confronting extremities of bleakness that even the sophomore album didn't touch on; Since the Day was an album about meandering aimlessly through the night, wondering what went wrong to bring you down this far. Above the Weeping World, in contrast, sees you desperately seek a way out. You set the black earth ablaze in a search for solace, you give everything you have looking for a light, and if you fail to find one... Well, we'll get to that a bit later.\n \nThe curtains fall to reveal a forlorn autumn scene. Through rainfall pattering against dead leaves breaks a piano melody, and with it a gloom that will swathe you for the duration of the album. Enter the guitar. Like despair's cold hand the first riff reaches out, grabs you, and pulls you deeper into the murky darkness than you thought imaginable.\n \nThroughout the release the lead guitars continue to be by far the most memorable element. I believe Above the Weeping World is home to some of the most powerful melodies not only in melodeath but in metal as a whole. There's an interlude after the first chorus in Change of Heart which perfectly reflects everything I've said about the album so far - it starts out with an acoustic/keyboard reprise of the intro to the track before electric guitars kick in, which sound like something you've heard hundreds of times in this genre, but the image it paints is like no other. Despair resonates from every note and takes over every fibre of your being, yet at the same time it's fucking wondrous. Sometimes you have to go through the most harrowing and painful emotions this world has to offer to truly appreciate the beauty it holds, and this section is the single best illustration of that I've ever experienced.\n \nWhile we're on the topic of that interlude, notice its form: A quiet part crescendoing into a powerful, melodic climax. Sections containing this structure are in some way incorporated into every single track from here on, never losing any amount of their emotional weight or power. At the Gates of Sleep, for example, is half the reason for the entire introduction on solace; with reassuring calmness between each verse and beautiful natural imagery abounding, this song offers you a forest in the twilight in which you can rest and temporarily escape your struggles. It's not a happy song - the low riffing and Niilo Sevanen's pained roars make sure of that - but it's an intermission, a short respite from the pure misery imbuing every other track.\n \nAnd that's just what most of Above the Weeping World is - pure misery. Drawn to Black, for instance, contains some of the most gut-wrenching lyrics about breaking up I've ever heard. The protagonist has stopped pining for his love, he's thinks he's over it, then all of a sudden a tiny sight reminds him of her and he's plunging back into darkness. It's almost as if the world's mocking him. In the second half of the song, Insomnium as always use descriptions of nature to convey the emotion, and Sevanen's delivery on it is phenomenal - not only do his growls feel pained and genuine, he sounds like he's on the verge of tears. Last Statement is a similarly dreary track but the theming and execution couldn't be more different; where the vocals on Drawn to Black are meandering and helpless, on Last Statement they feel completely controlled and enunciated. And the very first line tells us why:\n \n\"With these final steps I take back my freedom...\"\n \nIt was inevitable, really. On a disc radiating as much agony and depression as this one, suicide had to come in at some point, and this track is definitely worthy of tackling the subject. A strange peace and acceptance swathes most of the song; the decision to leave the world has been made and now all there is left to do is go through with it. However, this changes with my favourite use of another recurring element within the album. Often, at around the midway point, a song will break free from any kind of structure and completely change in tone. Mortal Share goes from questioning the existence and cruelty of gods to examining the purpose of mankind as a whole, Drawn to Black transitions from bitterness at their past lover to lament over losing them, and here... You guessed it. The break here is the protagonist realising that, even after all the time they've spent talking about how they've made peace with the world, they're scared. They don't want to die without leaving something behind, and in the wake of these emotions we're treated to what I consider the most emotionally profound guitar solo of all time. It's somewhat ambient and staggeringly melodic, giving it an almost transcendental, otherworldly quality; it's the knowledge that you're about to leave this mortal sphere and discover what lies beyond, but Sevanen's screams as he scrambles against it are utterly chilling. \"Don't forget me\" is such a simple phrase. But it's repeated again and again, ground into you, every moment closer to fading away until it's no more than a whisper in the background. And in the next moment, it's gone.\n  \nSo that's the story so far. Six songs of sorrow, one of solace. You've been dragged into misery, you've found a light under starry skies in a thicket of fir-trees, and then it's drained away, taking you even further from the sun. Considering the symphony of suffering that makes up the first eight tracks, it's apparent by this point that Above the Weeping World is going to need something quite special to end it off. Enter Track 9, In the Groves of Death. With a soft acoustic intro leading into combinations of whispers and roars and melodies and riffs, this song epitomises everything Insomnium have tried to do on the album in one final display of raw torment intertwined with hope, solace and beauty. The first half is pretty par for the course as far as the band goes, with a standard verse-chorus-verse-chorus structure differentiating itself through particularly evocative lyrics. However, in the middle, at that breaking point I mentioned previously, In the Groves of Death truly becomes the brilliant album closer that it is. A melancholic quiet section sees the speaker decide that this graveyard, above his buried father, will be his final resting place. It feels utterly final, a reflection on a life now past with no hope of ever returning, but just as it seems to be ending we're dropped straight back into a triumphant guitar melody, leading into three final verses in which a speech from the spirit of the protagonist's father changes his mind and makes him decide to live out the rest of his days after all. I particularly love the parallelism between the first and last verses; notice that the world itself hasn't changed and is still described as \"darkling\" and \"dreary\", but his perspective on it is now different. The album culminates with one last reflective solo that settles into a slow piano melody and, as a beautiful callback to The Gale, fades into rainfall. It's a wonderful bookend to the album, leaving you with the feeling of having come to the end of the longest and most important journey of your life. And you know, the world always seems a little brighter afterwards.\n \nYou may think from this review that you have to be depressed or on the verge of ending it all to enjoy this album, but that couldn't be further from the truth. I fell in love with Above the Weeping World during what I now consider one of the best times of my life. In the highs it was a breathtakingly cathartic outlet like no other, and in the lows it's been the most powerful and radiant solace I could possibly ask for. Insomnium have composed a modern classic, in my opinion the most profoundly emotional album ever released - agonised yet hopeful, despairing yet aflame with splendour, I can safely call Above the Weeping World my favourite album of all time.\n\nOriginally written for The Mighty Decibel: https://www.themightydecibel.com/\n",
        "\nHeart like a Grave a direct sequel to Shadows of the Dying Sun which is all I could ask because Shadows was and still is my favorite Insomnium album. And while this one failed to climb one step above, it got as close as it could. \n\nUnlike many, I didn’t like Winter’s Gate because a) it failed at what it aimed at, I clearly heard seven pieces, not a single song. Yes they shared a melody progression but the structures never really connected b) even if we take it as seven tracks, they are really below Insomnium level, there’s barely anything standing out, yes, they sounded good but Insomnium is not about good c) nothing hit me in the heart up until the very finale, that spoken verse carried by the ultra subtle piano line finally was something d) incredibly poor production, I mean, it really hurts. Insomnium have a longtime habit of having every second album produced like shit. So just in case, be ready for the next one...\n\nSo what exactly is Heart like a Grave? It’s that still present subtle glimmer of light brought by Mr. Vanhala from Omnium Gatherum and I can’t thank him more for it. Ville’s songwriting was stellar but before Markus it was misery nonstop. Not like crushing misery but still a heavy thing. Now there’s this almost untraceable balance of light and dark and somehow even the minor songs still show that glimpse of hope even though you maybe can’t point it out. Not as bright as Shadows which was almost Omnium Gatherum in disguise but you still can tell.\n\nIt’s the most melodic offer Insomnium has created. The amount of leads and solos is over the top, and the presence of Aleksi Munter’s keys is as potent as ever. Some complain about lack of dem riffs and that’s true because, well, the band has three lead guitarists now. Ever since Insomnium created this post-melodeath thing I always wanted them to push it to the limit.\n\nIt’s Jens Bogren. There’s almost no need to say more. Finally you can hear all the melody and arrangement details instead of crying rivers over car stereo production of stellar multilayered music (I’m looking at you One for Sorrow...). He might have overdone it a little because the result is the softest production Insomnium ever had, so rhythm guitars indeed get way too blurred at times. The album is like a plushy cat — big, fluffy and sometimes indistinguishable in his cattish details. Vanhala says Bogren even deleted quite some tracks while mixing trying to give space to things and make everything audible.\n\nIt’s Pale Morning Star. It reduces you to cinders in a stream of incinerating solar flare. Most dramatic, cathartic, intense, melodic and heartwrenching song. It’s like Black Heart Rebellion and Winter’s Gate amended to perfection (just so you know, Black Heart Rebellion was supposed to have an ‘epic ending part’ which was eventually cut by Ville because he thought it already had too much of everything... gosh!!). The song was born out of an acoustic demo Markus had for years (you can hear it as a bonus track) until one day Niilo encouraged him to make a full track out of it.\n\nIt’s Finnish gloom and melancholy. The idea to drown in those came from a bleakest Finnish song vote in Helsingin Sanomat. Tapio Rautavaara’s Peltoniemen Hintriikan surumarssi won it and served inspiration for Bells They Toll on the album. Among other authors the band names are such unlikely familiar to outside-of-Finland-people names as Juha Vainio, Saima Harmaja and Vesa-Matti Loiri. The more metalhead-friendly inspiration source was Sentenced (e.g. Neverlast lyrics were inspired by Nepenthe), even though the band notes the suicidal tendencies in their texts do not exactly correspond to the true Finnish mentality. Long but quite elucidating quote from Vanhala: ‘All this Finnish melancholy... classic Finnish emotions. On Heart like a Grave we dive even further into it. We’ve been inspired by Finnish folklore songs from the past 100 years, which are really gritty. Not even Sentenced can get there. In their songs people kill themselves. In the old songs people do not kill themselves, they just go on and on, and in the end they freeze working in the field. They die because of winter, illness or famine... Suicide and running away as a way out are modern concepts. The good, old, Finnish way is to stay and to suffer. Not to choose the easy exit. So it’s not about heartbreak, but the desolation of life itself’. He describes the mood of the album like this: ‘The mentality of Insomnium is more a rural farmer in a fading countryside, whose wife has gone to a neighbor and his brother has fallen under the thin ice. The time is of course in the middle of dark winter, the firewood has run out, the rotgut kettle has frozen and last summer’s harvest has been depleted. Most importantly, however, this Jorma, Väinö or Topi does not hang himself but gathers his last strength despite his evil fortune and starts digging up that last potato from the frosty field. Then he stumbles, can’t get up anymore and freezes to death’.\n\nThe vivid Finnishness goes not only through the lyrics but through the music as well. Sentenced references are numerous, sometimes approaching direct quotes, and Karelia goes as far as old Amorphis hints. Vesa Ranta as a photographer, director of two music videos and cover art designer is definitely not a random figure here. The ‘real connoisseur’ edition of this album is 2CD vinyl-size artbook with lots of Karelian landscapes of bleak and sullen nature, quite corresponding with the concept. \n\nOf course there are less than ideal things, Mute Is My Sorrow is way simplistic, smells hard rock for obvious reasons, is generally oversugared and tastes like liquorice. And the cat doesn’t approve of liquorice. More practice for Jani next time. Twilight Trails is composed of too many unstitched and quite thorny pieces, on this album it looks like a porcupine. The cat obviously doesn’t approve of porcupines, too. Niilo’s oldschool metaller’s hand is quite audible on it. Karelia is a fine piece per se but it makes the s/t track sound like a false finale which is quite confusing. Still, all of above can’t take away much from the glory of this record.\n\nFinally, this album is a paradox. Ville wrote only one song for it, Valediction. Markus took the duties of the main songwriter and did something like what Andy Gillion did to MPE — wrote almost better Insomnium stuff than Insomnium used to write themselves. All the primary highlights are his creations (Pale Morning Star, Heart like a Grave, Neverlast). How can one capture the vibe so precisely, I do not know. Although something already hit him back in 2011 when he released New World Shadows so there definitely was a background. Apparently this album could have been even better with more Ville’s contribution but that we will never know. \n\nI kinda overstayed my welcome, so bottom line: while not without flaws, if you forget the oversaturation with masterpieces Insomnium habituated us to, you will see this as one of those 101% Finnish albums that hits you right in the feels.\n\n(And don’t forget to pet the cat.)\n",
        "\nYour life is crashing down. Perhaps your significant other just left you, perhaps you lost a loved one, maybe you're blaming yourself for it. Either way, the circumstances of how you got here don't matter. What matters is that your world is a cruel, dark place, never again to be graced by any form of joy or solace. You're being crushed by utter despair and there's no way out.\n\nThat's the emotion Insomnium seek to convey on their sophomore album Since the Day It All Came Down, and they succeed; this is one of the bleakest records I've ever heard, a journey across frozen plains, through gloomy forests and into starless nights with harsh moonlight as your only companion. The human mind is incredibly fragile and with this release the Finns ponder what happens when it's pushed to its very limits by grief and hopelessness. This tone is apparent from the first few ringing piano notes of Nocturne, which foretell of the endless night to come. The melancholic piece builds for a couple of minutes before seamlessly transitioning into The Day It All Came Down, and thus begins a 55-minute, unrelenting barrage of all that is miserable and harrowing. \n\nWhile this record isn't too different from the band's 2002 debut, it does take their sound in a distinctly new direction. The Gothenburg riffing off Halls is still present, but it was here that Insomnium made atmosphere the focal point of the music. The 8-minute epic Disengagement probably showcases this best, with heavy riffs and roaring verses wandering into introspective and expansive acoustics combined with whispered vocals. The band know exactly when to put a quiet section in as well - even the more straightforward, faster \"headbanging\" songs like Bereavement and Closing Words fit a couple in to great effect. \n\nThe final and possibly greatest aspect of the album which needs touching on is the lyrics. Whether they're a form of catharsis or a painful reality to you, they're pure poetry. They transform the frostbitten landscapes evoked by the meandering instruments into mere backdrops for the speaker's dreary misery. Take for example the chorus in Daughter of the Moon:\n\n\"Vanished is the light we had, hidden deep in rimy soil\nBereft of us the one we cherished, lost forever our love\nStill at night I see her figure\nFlickering on moonlit glades\nBut passing is the hope she's giving\nJust the faintest breath of air and she's gone again\"\n\nI consider this some of the most evocative lyricism not only on the album but in metal as a whole. The combination of beautiful natural imagery with the speaker's desperation and depression resonates particularly strongly with me. Being at one with nature in a peaceful forest glade at night is about the most calming thing I can think of; if no solace can be found even in that, then there truly is nothing left for the protagonist. I can only be thankful that as of now I've never had to experience such hopelessness.\n\nIn summary, Since the Day It All Came Down was where Insomnium found their identity and truly became the band they are today. It's a near-perfect voyage into a mirthless, callous world. Atmosphere trickles out of every instrument, forcing you to contemplate the fact that some people's realities are as bleak as the one presented. And perhaps more terrifyingly, that one day that reality might be yours...\n",
        "\nInsomnium's new album is always an event of sorts. Listeners await that the band shows everyone else how death metal infused with the infamous Finnish melancholy is played. Insomnium has been succesful on that front along the years surprisingly well and their discography is extremely high-class. Now the challenge is far more greater than ever before, contenders like Omnium Gatherum and Bloodred Hourglass both have released excellent albums during these last few years. Can Insomnium beat them and take the throne back to it's rightful owner? \n\n\"Heart like a grave\" is a massive wholeness. Ten songs and length is over an hour, seven of the songs scoring over 6 minutes of time, at this point already you can tell that Insomnium is not letting off their listeners easy. The album starts with your typical, around 3minutes long intro, though \"Wail of the North\" is so good as a song, I don't even think about it as just the intro and maybe the band never intended it that way. The first single release, \"Valediction\" was a bit of a letdown at first. The excessive use of clean vocals kinda scared me, but as part of the album, the song has raised it's value through the course of multiple listens. \n\nScoring up to 15minutes of time, our next songs \"Pale morning star\" & \"And bells they toll\" startle the listener gracefully. Long, progressive songs contain tons of information. Even after tens of times listening through them, you still find something new and surprising details. You can't just help but to wonder the bands skill to combine harsh death metal and timeless, memorable melodies. When the whole magnificence is frosted with amazing riffs, solos and peaceful melodies, as a listener you just can't but help enjoy life and great music. \n\nThe best is yet to come, however. \"Mute is my sorrow\" starts the real fireworks of the album, after this the band slams three big songs on the table, which end the album beautifully. \"Twilight Trails\" is probably the best song to bring out the core of the band, and you'll constantly get chills down your spine during these 7minutes of melancholy. And as a cherry on top the song \"Karelia\" finishes up the album.\n\n\"Heart like a grave\" is so massive, that at first it feels overly lenghty and perhaps too big aswell. As you listen to the album over and over again, you'll quickly throw those thoughts of the album being too big to the garbage can. You'll realize that this album right here is best of their career. This album is the cornucopia of melodic death metal and Insomnium's magnum opus. It's truly astonishing how many great melodies, riffs, solos and unforgettable songs can fit on one CD. \n\nI think it's safe to say that Insomnium sits on their throne as proudly as ever after this one. This probably is one of the greatest recordings of melodic death metal.\n",
        "\nUp to this day this is my true perfect Insomnium album. Everything I wished them to do, they did.\n\nMost important here is the mood. Quiet September dusk, wind whispers and rustles the fallen leaves, crisp, refreshing air and soothing light of the setting sun. There's no sorrow, no longing, no sullen thoughts, only the essence of detached contemplation. 'We’re nothing more but the shadows'. This album doesn't impose any heavy feelings on you, it clears your mind instead and allows you go with the flow of reality. There's no other Insomnium album like this and I guess there's no other melodeath album like this.\n\nApart from that novelty, everything we love the band for is here in abundance. There's no end to omnipresent post-rock infused lead guitars, now paired with the amazing solo work by Markus Vanhala, something so amiss for me personally on previous records. The keyboards by Aleksi Munter are as subtle as summer breeze (those outros for Lose To Night, Promethean Song and the s/t track are nothing but ravishing beauty). Production draws a fine line between the heavy and ethereal aspects of the music, closest Insomnium had to ideal.\n\nEvery song is a little masterpiece of its own. (Yes there's that Collapsing Words ‘start as a speed train, end like a walk in the park’ thing again but oh well) While We Sleep and Revelation are the most gentle touches of silk-woven melodies, the latter being the first fine example of Vanhala's OG songwriting-in-disguise. Ephemeral, infectious as it can be for a hit single, cuts like the finest blade with its straightforward piano lines. Lose to Night is one of the most beautiful ballads I know, it draws that feeling... that people come and go and everything has its time and it's end. It starts with a sigh but ends with a discreet, almost invisible smile.\n\nThe River is one of the most unusual Insomnium songs, a splendid blackened/progressive collaboration between Markus and Niilo. And although it's a song about sailing the last sail, it is again by no means sorrowful or desperate, instead it reveals the journey ultimately to be the homecoming.\n\nAnd of course Shadows of the Dying Sun itself. Designed from a single hypnotic riff which Ville was going to elaborate into something more but eventually left as the sole structure. A song about desolation of man in what he thinks to be a vast cold empty space. A song with one of the most beautiful lyrics I've ever read. And then, after all the fatality — against the black sky, we are the glimmers of hope. And it is then you realize, the matter will decay but the spirit always prevails. And this is how the song ends. How the album ends. In triumph and empyreal blaze.\n\nThere's more of it if so you want, a bonus CD with entrancingly melodic Out to the Sea and three dreamy acoustic instrumentals.\n\nThe artwork, like the music, is equally phenomenal, Wille Naukkarinen (courtesy of Ghost Brigade) is the perfect artist to capture the band’s spirit in graphic with his solemn and dreamy imagery. \n\nI've played this album over four hundred times and it hasn't faded a single bit ever since.\n",
        "\nInsomnium – the band that got me hooked on melodic death metal for life. And here we are with their latest album, Heart Like a Grave. And what a gem of an album it is! The sound of the album and the image it depicts through words and melodies are as bleak and dispirited as the taiga forests and fens of their motherland in winter. It takes the cheery and chirpy soul and renders it depressed and forlorn, casting it into the abyss of desolation. \n\nLet’s begin with the title. It is a gist of the whole album: Heart Like a Grave. It is so befitting for such an album that you fully comprehend the gravity of the work at hand, much like a trailer of a movie. It sets the mood and foreshadows the magnitude of despair you are about to encounter. The artwork which also prefigures said permeating despondency, is simple and yet evocative, dark roots surrounding a black hole, an “abyss”, and leading straight to the heart of darkness … of light and of hope. I cannot but regard it also as a crown of thorns, with the band’s name and logo right at the center. Having considered these two non-musical elements, one visual and the other semantic, the band has so subtly managed to have you where they had intended. \n\nThe three-minute-and-five-second album opener (Wail of the North) includes, at first, a piano and strings, then weighty metal kicks in and growling vocals also take over. Despite the length, which is longer than some pop or punk or alternative tracks, this is only the intro and is not actually a full-fledged track on the album. Reading the lyrics, you are left with a sense of awe! I wouldn’t be exaggerating if I said I have seldom, if not never, read or heard such a profoundly impactful depiction of sorrow: “Under these cold northern stars / Songs are filled with sorrow / Brief is the time of summer winds / Moon is sad as the night / Here the callous frost slowly crawls inside the hearts / Here the winter's breeze will break the purest soul / Grown on this rimed soil, we've learnt to rue and yearn / Grown in these bleak woods, we've learnt to forsake our dreams / And again, the mourning unfolds before me / Like an open black grave”.\n\nAs showcased in Wail of the North, this album balances, to an impeccable degree, heartfelt musical delicacies and relentless death metal force. It is filled to the full with instances of juxtaposition of moments of bone-crushing melodeath riffs and sections of acoustic gloomy ambience. Almost all songs keep to this formula and the outcome is stable and firm, somewhat comprehensive, atmosphere all through this work of art. One specific example is And Bells They Toll. While the song is mostly mid-paced (or even in parts slow), and the acoustic guitar sets the somber stage of this track, the guitar solo, accompanied with drums, paces up the track and breaks the state of lethargy in which the listener was put at first, only momentarily and to lead to the acoustic outro which follows. \n\nThis balancing effect is accentuated even more noticeably through the diverse and dynamic vocals provided by Niilo Sevänen (harsh) on the one hand and Ville Friman and Jani Liimatainen (clean) on the other. The chemistry between both clean and harsh elements is so strong and they both are so proficiently interwoven to the fabric of the music that not even for one instant they sound out of place and forced upon the music. Quite contrary, the versatile vocals are the trump card of the band on this album (as it has always been). This synergy is most vivid in Valediction where they each support one another throughout the song and this diversity results in beauty. \n\nBut it is by no means indicative of any shortcoming on the side of the musicians. The sizeable scale of the skill of the band is no less formidable and praiseworthy than the vocals. Insomnium is renowned for their deeply moving melodies and on this album such melodies are abundant. But the one that tops the other ones may be that on Mute Is My Sorrow which renders the listener utterly awestruck and emotionally mystified. It is not only the melody, but also the guitar solos that are noteworthy. Besides what such solos always are, here they are another element to keep the above-mentioned balance by pacing up or down as the music finds fit. They are not at all merely a channel through which the instrumentalist can showcase their ability, but in fact they are a medium of reflecting the dismal nature of the album. The guitar trio of Jani Liimatainen, Markus Vanhala and Ville Friman is a grand effort like of which can seldom be found, at least within the genre. I am not talking about big names; I am concerned more with big works. And here we have top-notch melodic death guitaring, electronic and acoustic, in the flesh. \n\nIn addition to the guitars, Markus Hirvonen’s drum-work is what has driven this album this far. It doesn’t force itself on the musical texture, thus it is delicately present and influential to our comprehension of this album. It is withdrawn whenever necessary, like in many intros or outros, and then added to create the maximal effect. Coupled with drumming is the keyboard (performed by Aleksi Munter, a guest musician), which is quite contributory to the overall soundscape of the album. On some tracks, such as Pale Morning Star, it is more prominent than others and draws the listener to itself a bit more. Then we have the bass (also performed by Niilo Sevänen) which aligns itself with the musical framework of the band and has a few occasions to surface. \n\nBut it wouldn’t be an ultimate album without topping lyricism. As was my expectation, the lyrics found on this album are, in parts, of literary value, like the one previously discussed (Wail of the North) or the lines of Mute Is My Sorrow. It is true that the driving force of all albums is the music, still for an album to be of premium quality (as this one is), words are as important as the notes, meaning as significant as ambience. The whole album revolves around the motifs of loss, pain, grief and desperation. Many of the songs are dark narratives, most probably based on folk tales of the frosty land, each portraying a somber depiction of austere moods and landscapes alike. \n\nAfter a few less magical and therapeutic albums, these Finnish melodeath gods once again prove that they are effortlessly the best in this domain. This album is the ultimate sound and image of a wintry land where a “dying light” meets “the waning years of heartache and regrets” in the “woods of woe”, where “dreams have withered” and “hopes have vanished”. It would be a pity to not listen to this offering all through the winter. This album is absolutely going to be the soundtrack to my upcoming winter days. I am impatiently looking forward to walking on the snow-covered lands, having Heart Like a Grave pounding into my head and pouring into my heart. \n\nHighlights: Mute Is My Sorrow - Valediction - Pale Morning Star – Karelia - The Offering - Heart Like a Grave \n\nRating: \nLyrics: 9.5\nArtwork: 9.0\nMusicianship: 10\nVocals: 10\nOverall: 9.6\n\nOriginally written for NoobHeavy (www.noobheavy.com)\n",
        "\nImagine, if you will, a parallel world of seemingly boundless borders, encased in a state of perpetual winter, differentiated only in the degrees of coldness and the terrestrial contrast that distinguishes forests, mountains and wide-reaching plains. It could perhaps be likened to Lovecraft’s Dream Realm; save that it is not a place of cosmic dread so much as one of existential sorrow and fatalism. Yet, despite its generally negative connotation it is also a place of aesthetic beauty and naturalistic awe, timeless in its constancy like a sea of glass. This world is the one that Finnish melodeath pioneers Insomnium enter whenever they conceive of a new studio creation, and one that they have lately been sharing to some degree, if not rivaling over, with fellow Finns and contemporary melodic death travelers Omnium Gatherum. Though they share many common stylistic traits, the former outfit has enjoyed a longer relationship with this unique state of being both tranquil and raging that they come off more as natural inhabitants of their world, whereas the latter contemplates it more like a master philosopher attempting to translate it to a real world audience, neither one necessarily being better than the other, yet each being sufficiently distinct.\n\nComing off a couple of solid yet somewhat glossier and slightly post-rock leaning offerings in 2014’s Shadows Of A Dying Sun and 2016’s conceptual homage Winter’s Gate, Insomnium has opted for a more conservative yet also more ambitious offering that in Heart Like A Grave turns the clock back closer to their earlier days. Though it wants for nothing in terms of lofty atmospheric elements and serene keyboards to accompany the death metal-infused battery, it comes in a more aggressive and driving form that is more befitting of a band under the more extreme end of the metal spectrum. It maintains that typical balance of darkness and light between ethereal melodic guitar and clean vocal chants, and the thudding heaviness of the riff work and low-groaning death barks that has consistently been their staple, occasionally flirting with the power metal tendencies of the broader Finnish sound of the early 2000s, but comes across as far more nuanced and vivid. To the uninitiated, the parallels between this album and something by Kalmah or Children Of Bodom are obvious, but even more obvious is the greater degree of emphasis on layers of sound over technical impact, though this outfit doesn’t slouch in the musicianship department to any degree.\n\nAs with any surprise, the first ingredient deals in what is expected, and Insomnium’s mode of existential sadness has always carried a storybook character to it even when the album itself isn’t necessarily a conceptual affair. The opening number “Wail Of The North” has all the makings of a serene, atmospheric introductory segue that would fade into an opening thrasher at its onset, yet proves to a complete song unto itself that progresses through several contrasting sections, melodic segments and barked verses. Nevertheless, the real bit of this mighty arctic storm ensues on the next song “Valediction”, which seamlessly shifts between haunting vocal chants, forbidding guttural growls to rival Amon Amarth and a solid signature thrashing riff to bring it all together. Generally speaking, the shorter the song’s duration, the more in line with standard death metal things feel, as moderately pounding affairs like “The Offering” and “Neverlast” veer the closest to a traditional Gothenburg mode after that of At The Gates and Dark Tranquillity. Meanwhile, more elongated epics such as the slow-paced journey into obscurity “Karelia”, quasi-thrasher “Twilight Trails” and especially the towering epic “Pale Morning Star” run the entire gamut of thematic possibilities while still being easy to follow and chock full of memorable melodic hooks.\n\nWhether this constitutes the greatest musical achievement in Insomnium’s more than 20 year career is a matter of debate, but it is definitely a cut above their output since the beginning of the current decade and stands as a fine album to close it out. It is often asserted by would be critics that an album such as this showcases a band further maturing, but this band is a less like a natural being going through a mortal life cycle and more akin to an immortal spirit born into eternal adulthood that chronicles its journeys through infinity, each offering denoting reactions to the differing phenomena amid the endless icy tundra. Similarly, there is a seemingly counterintuitive warmness that occasionally enters this otherwise frosty endeavor, as if this same spirit is capable of building fires at points of rest and expressing the sensation of being refreshed by the heat before setting out unto the next distant horizon. This is the sort of vivid picture that this band has always painted with their albums since In The Halls Of Waiting first made waves back in 2002, and all that has really changed is a more potent studio production to make this band’s hazy instrumentation clearer. For any adventurous listeners out there who like their melodic death metal deep, engaging and highly cathartic, this is an album not to be missed.\n\nOriginally written for The Metal Observer (www.metal-observer.com)\n",
        "\nInsomnium is a band I have fell in love with since earlier this year. I first listened to Insomnium in 2018 and Shadows of the Dying Sun is the album that introduced me to the band. I was intrigued by their melancholic take on the melodic death metal genre. But why does Shadows of the Dying Sun sound so awesome. Simply because the songwriting on it is phenomenal for an album that's now five years old.\n\nA perfect example of the strong songwriting is on Shadows of the Dying Sun's big highlight \"While We Sleep\". The song's large musical atmosphere is breathtaking and gives you a feeling of adventure and motivation. This is also true for the other highlight of Shadows of the Dying Sun, which is the title track. Coupled with the strongest band performance on here, \"Shadows of the Dying Sun\"'s cinematic feel makes it a perfect closing track to the album. Mixing melodeath, gothic doom, heavy psych, spoken word, and progressive metal, it gives \"Shadows of the Dying Sun\" not only an eclectic sound, but also makes it a fantastic song for a workout playlist. Shadows of the Dying Sun is also notable for having a re-recorded version of \"Ephemeral\", which not only kicks ass but reminds me of The Jester Race-era In Flames. However unlike In Flames, Insomnium have maintained consistency throughout their career.\n\nThe musicians on Shadows of the Dying Sun would easily agree with me on that statement. Ville Friman and Niilo Sevänen's vocal tag team has improved compared to One for Sorrow. While Sevänen's harsh vocals have hardly changed, Friman's cleans are more mature as displayed on songs like \"While We Sleep\" and \"The Promethean Song\". Ville Friman and Markus Vanhala's guitar synergy on Shadows of the Dying Sun is a perfect example of why I consider the album to be beautiful. The two guitar players create a dense atmosphere on songs like \"Black Heart Rebellion\" and \"Shadows of the Dying Sun\" that make me desire for more. Each solo is unique and breathtaking and serves a purpose to the album's concept. Niilo Sevänen's bass playing works really well on Shadows of the Dying Sun as his bass is noticeable on heavier songs like \"Collapsing Words\", and besides it's atmosphere, it shows that the album's production is top notch. Markus Hirvonen's drumming on here is mostly in the slow-to-mid tempo. However in songs like \"Revelation\", Hirvonen will also utilize double bass drumming in certain sections of the track giving it a unique sound.\n\nNothing's as unique in melodic death metal as Insomnium. Shadows of the Dying Sun is a brilliantly thought out album and is undeniably one of the best melodeath albums from the 2010s. With it's top notch production, it's a beautiful record that will easily stand the test of time. But then again, this is Insomnium we're talking about. Overall, I'm glad I discovered this band and this album. It's 100% worth the money.\n",
        "\nEphemeral is a jewel of an EP by Insomnium. Despite a length of only 12 minutes, it packs enough emotion in to be well worth listening to. \n\nTo me, the EP is effectively split into two parts. The first is Track 1, which is a differently produced version of the song off Shadows of the Dying Sun. While I don't believe either version is superior, this one fits the atmosphere of the EP well; its muddier production gives it an almost otherworldly feel, which perfectly matches the other \"part\". The second half of this release consists of three instrumental tracks, with \"The Emergence\" representing birth, \"The Swarm\" representing life and \"The Descent\" representing death. Each song plays its part incredibly well, with The Emergence having a wondrous atmosphere supported by violin and piano in addition to the acoustic guitar and soft synths which are present throughout the three instrumental tracks and serve give the listening experience a far more ethereal tone. The rest of the EP develops the ideas found in the second track, with The Swarm adding a developing structure that feels like taking a long journey (Think \"Life\" by Shylmagoghnar but condensed to a three-minute acoustic piece). The Descent is a bittersweet ending which combines the ethereal and wondrous synths with descending chord patterns which give a sense of melancholy and finality.\n\n\"Ethereal\" is really the best way Ephemeral can be described. It is a short, peaceful piece which allows the listener to reflect on life, the journey they have taken and the choices which have led them there. Its length combined with the stark contrast between the first track and the latter three prevent it from reaching a score higher than 80%, but don't let this discourage you - these twelve minutes are still well worth your time.\n",
        "\nInsomnium is a melodic death metal band based out of Joensuu, Finland. Consisting of Nilo Sevanen(Lead Vocals, Bass), Ville Friman(Guitar, Clean Vocals), Markus Vanhal(Guitar), Marcus Hirvonen(Drums). Shadows of the Dying Sun is the sixth studio album by the Finnish melodic melodic death metal band Insomnium. It was released in North America on April 29, 2014 via Century Media Records, And on April 25 in Finland, Germany, Austria, And Switzerland and the rest of Europe, As well as Australia and New Zealand on April 28. It is their first album with new guitarist Markus Vanhala after previous long-time guitarist Ville Vänni departed in 2011. \n\nInsomnium find consistency and it shows, every track from one to fourteen are excellent and exactly what you would expect from a band of this magnitude. Shadows Of The Dying Sun manages to explode right out of the gate with the first track, The Primeval Dark, which turns out to be a fantastic intro into the album as it manages to set the speed, Tone, Style and the overall feel for the entire album. Insomnium have always been a guitar heavy band with unreal solos that really make it impossible to not feel in tune with. As always with Insomnium the vocals are absolutely mesmerizing, the best part of the band in my opinion. Its absolutely absurd how poetic and blissful he can make his screams. The band manages to make you feel relaxed, yet also want to break something and head bang, It's truly a remark feeling. \n\nThis album does contain a few stand out tracks I would like to highlight, so you can check them out first and see if you would like to purchase this album for yourself, Which I'm confident after I explain these tracks you will. I will delve into the intro and closing tracks as that way you will still have to discover the majority of the album for yourself. Starting off with the introduction track, Primeval Dark. This track is possibly one of the greatest introduction tracks in the melodic death metal genre. My reasoning for this is statement is simple, It crushes. Starting off with fast paced melodic riffs as well as rhythmic drumming, It manages to create a truly spectacular sounding track. And to top it all off the vocals are beautiful yet menacing, you will not be disappointed. Last but not least is the title track, Shadows Of The Dying Sun. A song that slowly builds itself up till it explodes in your head forcing you to remember it. A perfect title track, and a perfect track to close an album with. However, the band also manages to deliver a deeper album lyrically. Containing some amazing lines, Such as \"Embodiment of despair that never leaves or severs the ties\" as well as \"Children of infinity, Always gazing to our past, We are dust of the stars\". \n\nFrom start to finish Insomnium manage to blend the ingredients of rhythmic drumming, guttural as well as clean vocals, and both slow and speed oriented guitars, This is one of the top melodic death metal albums of all time, Simply a most own for any metal fan, A beautifully crafted masterpiece.\n",
        "\nInsomnium is a fairly large band from Finland, specialized into what is probably this country's favorite genre, melodic death metal. Their albums have been pretty similar in songwriting style for a pretty long time and they were never one of my favorite bands. Not to say that they were ever a bad band but there are a lot of other things I would've rather given my energy and attention to. However, this last release has really caught my eye. One 40 minute long song telling a story is pretty much the first thing a prog listener wants to hear. You know we're those geeks who listen to huge concept albums with no song lasting under ten minutes that any “regular” metal listener would scream of boredom half way through. So give us long songs and we're hooked! Now Insomnium doesn't really have anything to do with prog but their last release does offer this lengthy aspect of the genre and that I like. Despite what all you others out there might think, being into prog doesn't mean you refuse to listen to anything else. In fact, I'm gonna give a try to pretty much everything that moves before coming to any conclusions. \n\nSo what we have here is a viking story written by Niilo Sevanen himself. I took the time to read the thing and trust me, it's a beauty. And it's musical expression does it justice! In the beginning we find our vikings sailing across the misty sea accompanied by the howl of wind and waves. A mystical keyboard theme starts resonating over nature's sounds growing closer and then the double pedals smash! It sounds glorious! And soon later, one of the most important melodies in the album kicks in. The pounding drums combined with heavy, energetic riffs and always beautiful melodies carry you through this story. And the growls are some of the best out there, powerful, loud, expressive and really deep. \n\nWhen this sound of glory finally rests, a mountain rises out of the fog. Acoustics appear for the first time as a narrative voice describes the unknown land ahead. Part two is a bit more focused on the narrative side. This is where the crew starts scouting the island for anything they might take away with them. Hey what can you expect? They're vikings and they're greedy. What did you imagine they were on a sightseeing cruise? The plot becomes complex, with many details not making much sense and leaving our characters stranded here. We hear Insomnium's melodic side at it's fullest with the melody really fitting for the story, a bit of clean vocals show up and some really well placed leads. One thing I could recommend is that you would read the story before listening to the album. This way the music will seem much more expressive and will make a lot more sense and it will also allow your imagination to go wild and envision many many things! \n\nAnd then you see it: the gate of winter. Part three brings forth the main element of this concept. It all gets more and more mysterious and the melodies do so too. The music keeps a pretty similar style so far but with the lyrics and the story unfolding in your head it really ain't a bugger. And this is also when you start thinking that something dark is about to happen. \n\nIt's time for a change. At this point, a bit over half way through the album you get the feeling that if it keeps this going on the same way it's gonna get really repetitive and boring. It's been good so far but something has to happen. The lyrics all have been increasing anticipation for something and you just want it to happen. The title of part four says it all, “The Gate Opens”. The ongoing mid-tempo song style that kept going on and on for the last two parts, resulting in over 15 minutes of music finally stops and leaves you waiting in silence for a few seconds. A beautiful piano melody slowly grows with some fantasy strings happening nicely and then as they fade away a deep muffled rumble resonates through the low frequencies of your speakers. Suspense... anticipation... a few more seconds... SLAM!!! That's when the best moment hits. It's where the word “epic” becomes appropriate for the album. Winter crawls out from the depths of the mountain, guided by Niilo's deepest and most crushing growls with a set of brutal poetry like no other and a grand, god-like melody singing from the guitars. It feels like it could be accurate for a movie soundtrack in some Hollywood style scene with special effects of apocalyptic proportions, only unlike Hollywood, you're actually buying this one. Part four is amazing and glorious. It's where the wrath of nature is unleashed.\n\nSo what's all that epic snowy, blizzard gonna do with those greedy vikings? Coexist? C'mon you know better than that! It's melodic DEATH metal because there's death involved! Yeah, those dudes are going down. Part six starts with a reprise from the first part only this time it's fading in slowly and sounds really eerie and menacing, and incorporates that “death is coming” mood. Double pedals kick in again. Bass is pounding deep. Guitars are grinding and shouting and an evil choir sample echoes floating over all the madness! Screams are now full of pain, fear and despair and as suddenly as it started, it goes silent again. Acoustic guitars and piano come together to sing their burial and then get lost in the distance. A silent whisper presents the only survivors of this massacre and then the hollow wind remains all you hear.\n\nWinter's Gate is not a story! It's a viking legend. It feels like it could be part of ancient mythology and it's sculpted gloriously in the strongest, toughest and most valuable metal alloy that human kind has ever invented: death metal! And there are a lot of details In the story that I purposely missed. Whether you wanted to listen to the album or not when you started reading this review, your hands are tied now. You need to know what kills those big bearded dudes and you need to know who survives and how. If you don't go check it out in these conditions it means you're stone cold and have no soul. So don't let me down. Prove that you have feelings!!\n",
        "\nWhen it comes to bullshit, big time, major league bullshit, there is no idea more exaggerated than the claim that so many bands play viking metal. Finland is probably the most metal oriented country on the planet and many of the bands from this country have found themselves tagged as viking metal. This is somewhat frustrating in a way that a northern vibe can be felt in the music that the Finns create, but the viking metal tag is only vaguely true in most cases. Melodic death metal is the genre that is most often encountered. Insomnium is one of these bands that have been mislabeled as vikings despite showing only few similarities to viking themes. However, this is not the case anymore, as this monumental last album is a story about vikings. This is where epic melodic death metal and viking metal collide to form one colossal titan of northern brutality. Winter's Gate is an original idea that brings forward the best version of Insomnium's sound alongside a complex intriguing and dynamic story worthy of legend, and for those who love the fins, it will be a truly magnificent experience.\n\nThe overall sound is pretty much the same as it was across the band's history. Insomnium is defined by a powerful and impressive wall of sound with crunchy guitars, bass and grinding harsh vocals, alongside a melodic emotional and nostalgic vibe from lead guitars, acoustic guitars and clean vocals. Their sound is sad and uplifting at the same time and their cover artworks have always expressed their vibe just right. It is the 'looking into the sunset after a long cold journey' sort of vibe and it is bound to attract those who seek epic bands. Rhythm guitars are based on simple chord structures alternating open sections with muted riffs resulting in a very satisfying sound. On top of this you get the weeping lead guitars and the sad acoustics. The drumming is based on double pedals and is also quite simple. Clean vocals are another great addition and I actually wish they used more. Apart of few innovations and progressive stuff, on Winter's Gate, this is the main recipe for the sound, but don't let it put you off too easily. Insomnium has never been the most elaborate band musically, but their honest and emotional performance has kept fans close to them for a considerably long time. Still, their albums, satisfying as they were, have always been a bit lacking in diversity. After 6 releases, you could see some improvement in sound, and a few changes, but they were bound to become stale. And this last album is just what they needed. It steps away from the pattern, not necessarily because of musical innovations, but because of the story behind it. The whole album is just one enormous 40 minute long song split into 6 parts. As a result, the similar vibe of their sound is now perfect for the concept, and more variety would end up hurting the end result. Winter's Gate is the most balanced out version of Insomnium.\n\nHowever, it doesn't stop there. Where this album earns the most points is in the sheer size of it. The raw, absolute power of this frozen monster puts to shame a ridiculous amount of bands that dare tag themselves as 'epic'. Shorter in length but more massive in sound, the wall of guitars, growls, and epic leads is now stronger then ever. It will hit you in the face from the first heavy riff and will keep doing so in different ways, as the stages of the story unfold. The simple idea of writing such a long song meant that they needed to amp up everything that they already had. And they did so in every way. Even the sound mixing and mastering is at a new level. And beneath all this, supporting all that metal, is the amazing keyboard background of Aleksi Munter from 'Swallow the Sun'. The intro for part 4 is just piano and lets him show his worth before evolving into the most crushing roar of a sound that I have ever heard.\n\nNow there is one very important aspect of this album that I have not detailed on. And that is the great viking legend behind it. The story is written by Niilo Sevanen himself and I actually have no clue if it's entirely his work or if it is inspired from Scandinavian mythology. It speaks of a group of vikings that sail to world's end in search of riches, and come across the surprise of their lives. I will not share too much about this as I don't want to give spoilers to anybody. That is because the story isn't just in the lyrics of the album. It's an actual narrative creation, 18 pages long that will surprise you and freeze your core with an unexpected and mystical succession of events. Also the fact that it is written separate from the music means that, the lyrics don't have to be narrative and they just focus on describing moments chronologically, without mentioning characters or too many details. This means that the lyrics can fit the music more comfortably and it doesn't feel like a book on tape, keeping everything structured and on spot. And the music itself seems too tell the story, as the mix of sounds and emotions is very expressive and very suggestive of the events that occur. It almost feels as if the story was written to fit the music and not the other way around. One thing that I really recommend is that you read the story before listening to the album. It will help you understand it better and perceive it in all it's might and frozen glory.\n\nAnd as frozen glory goes, this album will end in the most elegant manner possible, with a clean acoustic guitar, a piano, and a whispered clean voice, that just relaxes you after the storm. The band's name is very suggestive for the ending of this album as it feels like finally resting on a soft comfy bed by the fireplace after facing the brutal forces of winter. After listening to this you will have to relax, clean the sweat of your forehead and have a sigh of relief after the voice of doom has enchanted your auditory organ. I assure you, this is 40 minutes well spent, and you will come back at this record after hearing it the first time. This is what the Fins are about. The delightful specimens from the north could very well be Santa's elves, as this is a great present that they brought to all the good metalheads and metal gals out there. And if we're good enough, they might give us more in the future. But for now, it is time for you to look into this album and spoil yourself with the epic mix of viking metal and melo-death, that builds this amazing combo. By opening the Gates of Winter, Insomnium has proven it's worth as another proud contender from the icy land of dreams and mystery that is Finland.\n\nEnjoy!\n",
        "\nI'm not entirely sure \"interesting\" is the right word but albums like this- well, genres are a funny thing. To say this is melodic death is a rather strange turn of phrase. I remember a friend once suggesting that drone doom was just ambient played with metal instrumentation. This isn't particularly droney, of course, but the same idea kinda applies. Dying Sun kinda sounds like loud post rock- your Caspians (great band name), Rosettas, your We Lost the Sea etc etc- played with metal instrumentation. Something like Revelation, for example- that's straight out of Caspian's Dust and Disquiet.\n\nIt's just the vibe of the thing, which I know is a really lame of describing something. It's the earnest melodicism, those big old suspended chords which are absolutely everywhere, it's the way that there's a big ol' soaring lead line jammed in every possible chance, and the way that, let's be honest here, there's hardly any riffs. Or at least that it's not riff driven music. Which if anything definitely suggests that this isn't melodic death, a genre that for all it's faults is at least based on the riff as the main thing. \n\nThat said, don't think this is a completely negative criticism, as the whole thing is fairly well executed, and I quite get into it despite it not really being something that works for me anymore. God, if it was 10 years ago though... suffice to say from anecdotal experience, most big fans of this kinda stuff are dudes in their early 20s with little chance of getting laid or getting paid. I haven't checked the lyrics but I'm going to take a very safe guess and say that the theme is \"quiet desperation\". But yeah, it has been executed well. Insomnium know how to play their instruments, know their way around a record studio, and know how to pull on the heartstrings. \n\nPersonally, I would've liked a bit of ugliness here and there, or at least a bit of something else once in a while, as 50 odd minutes of heartfelt feelings over some competent but not mind blowing music is a bit much. I'm happy to listen to a friend who's having a tough time talk about his problems, I'm much less inclined to listen to a bunch of dudes from sweden or wherever go on about how life is a one way street, maaan. Look, it's not bad, just not something that I can see myself playing all that often- or ever again, really.\n",
        "\nDo you like Amorphis up until “Elegy”? Swallow the Sun? Pre-“Reroute to Remain” In Flames? Congratulations, now you can minimize your CD collecting costs and focus on just one band instead: the Finnish Insomnium, who manage to sound like all of those bands at the same time. Sadly, which is the only Finnish way, they don’t have the same upside as the three aforementioned bands. Still, if you’re looking for a quick slab of above-average easy-listening melodic and melancholic metal with growls, look no further.\n\nA somber atmosphere and melancholic melodies are the focal points on “Across the Dark”, and that’s what Insomnium do best. Without resorting to clean vocals too often, virtually every second of every song is ultra-melodic due to the fact that at least one guitar is always doing leads (harmonies are found aplenty), while the rhythm guitar is pumping away on power chords. This isn’t bad at all, and I rarely dislike anything I hear, but conformity is a big problem. Everything sounds the same. Insomnium almost never stray away from the regular minor scale (Aeolian for you music theorists), and this creates, of course, a sense of unity between the tracks but it also blends them all together into one big soft mush without edges. Some variation wouldn’t have hurt.\n\nThe growl vocals remind me somewhat of Johan Hegg of Amon Amarth, and the cleans courtesy of guests are OK (e.g. not too whiny.) Nothing special in the instrumental department, good and tight drumming and guitar playing but nothing fancy. Some fast double kicks here and there which are very nice when they kick in (har, har) but those are so common these days they don’t really deserve an extra mention. Vocalist Sevänen also handles the bass and gets a plus for some nice and imaginative four-stringed lines. These come to the forefront mainly in some of the more subdued parts, which have something of a smoky prog rock feel to them, and are probably the bits I enjoy the most on “Across the Dark”.\n\nThe big selling point for this album is the melancholic atmosphere, which is heightened by occasional piano and strings breaks. I have to say I enjoy “ATD” more and more the longer I listen to it, the conformity of the tracks almost reaching a hypnotizing level. So, if you want to shut off your brain to some moody and melodic metal, which you will have no memory whatsoever of afterward, Insomnium could be for you. I’ve heard they’re a good non-description drug to cure…yeah, you know.\n",
        "\nThere are many tests that are levied at an album to determine its merit, but the rules tend to be a bit different when the collection of songs revolved around a singular, conceptual story. In many ways, the standard is a bit simpler as the various chapters in the resulting sonic novel tend to relate to each other in a more direct fashion, especially when the individual songs carry no titles but are simply numbered seconds denoting points of transition within a single song. While Insomnium has always had a consistent sound that lends their albums to being treated as whole experiences to be heard from beginning to end, they haven't really delved into the concept album realm until just recently, not unlike their more popular and less atmospherically bent Swedish rivals Amon Amarth, not to mention that this outfits latest endeavor Winter's Gate also features an original Viking tale.\n\nNaturally Insomnium has opted to take a very different road than that of Amon Amarth's blood-soaked tale of vengeance Jomsviking, one that deals a bit more in nuanced ideas and losing oneself in the atmosphere of the story's setting. In many ways, this album finds itself blurring the lines between what is traditionally seen as melodic death metal with that of the atmospheric side of black metal, particularly the employment of keyboards, acoustic instruments and clean vocals. There is a sort of hazy, impressionistic character to the quiet and serene sounding introductory material that is somewhat reminiscent of the dense, spacey character of projects like Midnight Odyssey and Mare Cognitum, though when the full band kicks into gear the sound leans a bit closer to a mainline Finnish sound after the mold of Omnium Gatherum and Eternal Tears Of Sorrow, with some occasional hints of Viking era Bathory, particularly on \"Part 4\", which is also among the more memorable chapters in this well constructed auditory tale.\n\nIt's a bit curious how this album manages to straddle a number of stylistic fences and comes off as a wholly different direction for this band, yet fundamentally it is still a fitting and logical progression from where they've been up until now. It is a bit more catchy and engaging relative to the last couple albums, and has a certain melodic contour that will probably appeal more directly to fans of mainline melodeath outfits like Amon Amarth and Dark Tranquillity, yet it's also an album that showcases a fair degree of skilled lead guitar work that's maybe a tad more reserved than a typical Kalmah album and also highly atmospheric yet much more concise than Midnight Odyssey's two and a half hour epic opuses. One could almost call this album a stylistic crossroads of sorts, bridging the divide between the early days of Scandinavian-themed metal in the 80s and it's more contemporary incarnations, complete with a vocal scheme that arguably provides the missing link between Quorthon and John Hegg.\n\nThe question becomes, is this album something that will satisfy Insomnium's core audience, since it comes with a fair amount of new tricks added to their proverbial bag. The answer is yes, as the underlying character of this album follows the same sort of nostalgic, sentimental character that has always defined their sound, albeit in a form that is ironically a bit more accessible in spite of its unconventional structure. Metal has always had a storytelling element, and the notion of using the concept album medium as a means of creating a \"book-on-tape\" version of an existing story, penned by a member of the same band, seems a fitting step forward for a grand tradition that continues blessing its audience. Some Vikings make their mark on the battlefield with a bloody axe held high, but others made a far more lasting mark by braving treacherous seas in search of the final frontier.\n",
        "\nEven though they’ve never been as celebrated as “The Gothenburg Three”, Insomnium have always been a trusty band when it comes to melodic death metal. Throughout their career they have been churning out great albums that cover all feelings from solitude to inspiration with stirring intent. Based on a short story written by Niilo Sevänen (vocals, bass) about a group of Vikings who set out on a quest to find a fabled land north-west of Ireland during a harsh winter, “Winter’s Gate” marks the first album where Insomnium tread into native lands of experimentation by creating one epic 40 minute song.\n\nWhen you read a book, there are often certain quotes that stand out from the surrounding text. These affecting quotes are the ones that you relate most to, the ones where you can find a piece of yourself within the words and the ones that are more than fiction; they are part of real life. The translation of this feeling on “Winter’s Gate” is that when you listen to the entirety of it, there are moments amongst the surrounding cold soundscapes that are more than just captivating- they bring a warm sense of completeness to the music and without this soaring moment, that part of the song just wouldn’t feel complete. \n\nSuch instances strike at various intervals. Between some acoustic passages and soothing atmospherics, Markus Vanhala executes an unexpected blizzard of melodies at 07:44. At 12:52 the characters of the story enter uncharted borders as Insomnium feature a tentative, proggy riff which initially serves as a build up to a unsatisfactory climax of slow clanging guitars but then, at 16:48, the real climax hits-albeit briefly but still just as moving. \n\nHowever, due to the continuous flow of the album, these heightening moments become forgetful if they are not repeated- that’s the risk that you take creating an album that comprises of just one song. Much like Swallow The Sun’s “Songs From The North”, the hazard of “Winter’s Gate” is the colossal ambition of it. It has to be listened to in full in order for these moments to fully connect with you- if you simply skipped to the specific ‘bit-that-you-like’ then it comes across as unfulfilling. Furthermore, in contrast to the ambition of producing a (dead on) 40 minute song, the members of Insomnium rarely expand their style. The tone of the album is much like the rest of Insomnium’s albums. Niilo Sevänen’s growls have barely changed but just like the harsh environment that the lyrics depict, Vanhala avoids sounding repetitive or tedious by continuing his swerves from giant tremolo hooks to sombre acoustics. This dynamic approach is a welcome relief due to the run time of this single song as he avoids sounding repetitious or tedious.\n\nOne of the biggest similarities to Insomnium’s past work is that they have not lost the ability to create incredible introductions. The first 6 minutes is nothing but an adrenalized ride that commences the journey while the conclusion of “Winter’s Gate” is just as fulfilling, if not more. Pummelling tremolo riffs and blast beats thunder alongside Sevänen’s icy growls in the final minutes of the song creating an aura of grandeur that Insomnium have not summoned in a very long time. In these final moments, Insomnium show us that they can be the untouchable masters of melodic death metal that they proved to be a decade ago.\n\nOrignially written on http://www.sputnikmusic.com/review/71750/Insomnium-Winters-Gate/\n",
        "\nIt's really very difficult to write about Insomnium without using names like Amorphis, Noumena, and Omnium Gatherum to place their sound in the melodic death metal pantheon. Clearly, blatantly Finnish, these guys could easily be called derivative if it weren't for the fact that those other Finnish melodeath acts all have slightly distinct quirks to their burst-of-light songwriting style, plus the small matter of being the same age as the bulk of Finnish bands, barring Amorphis, who took a different route from the groups in the early 21st century explosion. If you haven't listened to any of those bands, firstly, I suggest you remedy that matter quickly, and secondly, I will attempt to give some idea of how the Finnish deviants differ from Swedish and other European melodeath.\n\nThe big thing about an album like 'Across the Dark' is that it is certainly rich. There is a saturation of sound on every song here that makes it feel as though Insomnium are 12 guys instead of just 4. The scope of the music is always broad, even when we are plundering through fast-paced riffing, such as on 'Against the Stream', since sharp riffs, warmly booming bass, busy melodies like insects, and smooth swathes of keyboard all add layer upon layer to the songs with the drums sometimes struggling to stand out amidst the melodic barrage. The relatively slow internal pulse of the songs also contrasts with a frenetic approach to the lead melodies, which rarely let up and rush and soar across everything like the sudden joy of discovering spring after a long winter. At times, things quieten down to tender acoustic guitars or piano, such as the kick-off of the album on 'Equivalence', dappling the glorious light with a smattering of shade, though a pleasant breeze blows through these moments too, detailing with subtle melodies to keep the mood lively and hopeful.\n\nHowever, if you merely observed the physical qualities of 'Across the Dark', you would be forgiven for thinking that it was a melancholy album, with a cover picture like latter-day Katatonia, lyrics strongly imbued with the romantic sigh of nature, and a combination of elements that - on paper - would put Insomnium somewhere close to Opeth in terms of style and influence. It's true, there are melancholy themes, as evidenced by songtitles like 'Weighed Down with Sorrow' and 'The Harrowing Years', yet the pace is usually too lively and the musical themes too buoyant to allow one to wallow in self-reflection, instead possessing a forward-surging energy that (like Sentenced did on 'Amok' and 'Down') encourages greater strength and effort. Granted, 'Weighed Down with Sorrow' does close proceedings on a more sombre note, but that song doesn't depress either, feeling more like we have reached the end of a great struggle and can finally rest after the effort.\n\nThe epicness of the sound sets this album apart from most of the other Finnish bands, as well as developing an emerging trend from Insomnium's earlier work, so that the previously large sound becomes cinematic and engulfing, forcing weight and size on the listener to the point that I can't help using all these nature metaphors as I try to communicate the feeling of the music. The keyboards play an important part in the epic sound, though they aren't too prominent, usually filling a swelling background atmosphere rather than becoming a musical focus, allowing the genius of the guitar melodies to provide the real centre of the experience. The deep ripping roar of Niilo Sevänen's vocals might seem to be at odds with the melodic music, though when he slows down there is a cavernous quality to the roars that fits the scope, while the clean vocals actually don't have quite the same impact, coming closer to a more generic modern style. This is particularly evident on 'Where the Last Wave Broke', which has a chorus forefronting the cleans and the roars in the background: the cleans are too plaintive and lacking in emotional weight to carry the song as they should, while the roars actually sound more passionate and nuanced, smaller range notwithstanding.\n\nDepending what you prefer in your music, 'Across the Dark' might appeal more or less than Insomnium's previous and subsequent output. Although the focus on riffs and purer melodeath content had waned by this album, the emotional and melodic resonance are several steps up from the debut, creating that fuller sound that is utterly glorious to behold when it returns after a break. There aren't really any weak songs either, everything playing its part and keeping the flow of the album going until the closer winds things down a notch. Perhaps the greatest indication of how 'Across the Dark' should affect you is that - even at only 45 minutes - this feels like an album that expands to a great size and captures the listener for its duration, pulling you away from the real world and into its shifting waters of wonder.\n",
        "\nWhen talking about Insomnium's workmanship, all too sudden comes the judgement that they repeatedly put out the same record. I do not agree with this, not one bit. Of course, Insomnium has a very characteristic and recognizable sound, what is more, they never really changed their chosen genre. They used to play and still play a form of melodic death metal of the Swedish/Goetenburg style. At the same time, their music is not a mere genre exercise - apart from their debut, which still is a great record, but more of a tribute to the genre -, they have something unique to add to the Swedish melo-death base: this uniqueness, I think, is some form of melancholy, sadness and pain, which is not obvious in the classic Swedish melo-death bands. This melancholy and pain shows itself in their lyrics and music as well. Classic melo-death bands tends to be more up-tempo than Insomnium, with lyrics which more resonate aggression than existentialism and darker thoughts. But Insomnium has those contemplative instrumentations and lyrics as well. This approach - in my view - connects them to different works of Opeth, Amorphis, Katatonia, to mention some great ones who came to my mind, when I listened to Insomnium. For me this mixture of two related but different metal genres is quite exciting.\n\nBut let's turn back to the starting point. Are they really put out the same record over and over again? I do not really see how this would be true, because in my view their music developed from record to record, making every record a bit unique and different. All too often reviewers or hardcore fans state that their best is their sophomore (Since the Day...) or third (Above the Weeping World) record, sweeping off this latest record (Shadows of the Dying Sun) as a product of a declining, commercialized and softening Insomnium. I cannot agree less...\n\nFor me, this record simply is their best! I think, in this record, the band managed to harmonize different musical influences perfectly! First of all, the first thing which I recognized that melodic singing in this record extended quite a bit. Some would see this feature as a declension but not me. For me, clean singing adds a different, deeper, melancholoc layer to their music, which enhance their genius. Take for example the clean parts of \"While We Sleep\" or \"Lose the Night\". How would someone manage not to mesmerised by their beauty, deepness and pain? Moving forward, secondly, many others recognized that there are some post-rock influences sneaked into this record here and there. I really, warm-heartedly welcome this influence, which is definitely more characteristic in this record than any other of theirs. Post-rock as a genre is something very interesting, recent phenomena, which became too much of a tiring movement, but who would doubt that band like God is an Astronaut, Explosions in the Sky or If These Trees Could Talk created some hell of a profound and inspiring records. For Insomnium, post-rock influence is very gentle in Shadows of the Dying Sun, but I cannot argue that it is not there. It is really there and makes this record even more brilliant.\n\nI do not wish to comment on the tracks, each by each, because for me the album is a complete whole, where all tracks compose their crucial and distinct part in the whole picture. This is one of those records which maintain a high level of musicianship all the way from the beginning to the end. It is a very fine listening, the record worth every bit of its runtime, never gets tiring, but quite the contrary, it is a scintillating and mesmerizing record. \n\nI decided to write this review in order to make more justice to this perfect record. I cannot even describe how great do I think this record is. I only try to emphasize that in my view this record is their most mature, most progressive and most seasoned record regarding musicianship and approach. With this record they evolved to a state almost unreachable. I hardly think that even they are capable of reaching this standard again... I really hope they will.\n",
        "\nI tried so hard to like this album, but every time I listen to it I just want to stop, turn away, and not have to deal with it any more. Across the Dark was a great introduction to Insomnium, a slow, heavy, and rather simple album that gets the message across quite nicely. But One for Sorrow is a turn for the worse for the band, losing many of the aspects that made their previous release great and not adding anything new to the mix.\n\nThe biggest upset is the flat and dull sound that seems to prevail throughout the majority of the tracks. A lot of them are nothing more than a few uninteresting and incoherent combinations of overly simple chord progressions mashed together with a blast beat. The end result is a very unrefined sound that doesn't offer much in terms of purpose and for the most part has absolutely no flow either. It neither shows anything in terms of musical ability or song writing from the band as there is simply nothing that really drives the music forward.\n\nThe production isn't particularly brilliant either, partly as a result of the poor songwriting. There is little if any bass present in the songs, and as a because of the dominance of the repetitive drum and rhythm guitar lines everything sounds dull and washed out.\n\nIn the order presented the only songs of merit are Inertia and Through the Shadows, the first track being a brilliant opener which transitions seamlessly into the intro of the second, sadly it only serves a prelude to the bland songs that follow it. Hidden among the crap is Decoherence, a jewel of an instrumental that could have slotted so perfectly into a good album but is completely lost and out of place between its fellow songs.\n\nOverall the album still suffers from the weak composition displayed in Across the Dark, and takes a turn for the worse in pretty much all other fronts, being a messy hodgepodge of blast beats and flat sounding guitar lines. It also did away with Sevänen's simple, yet effective bass lines which were one of the strongest elements of the previous release. The result is bland and uninteresting; far from what Finnish melodeath is capable of bringing to the table\n",
        "\nWhile the \"melodic death metal\" (read: in no way, shape or form, connected to actual death metal) Gothenburg sound is something I usually find moderately, superficially fun at best, though there are exceptions; in this case, I'd argue that the album (and band in general, I suppose) departs completely from what I would describe as Gothenburg-like. Insomnium seem to have taken a different path altogether, or at the very least warped and altered that original Gothernburg sound so much that it's become something else entirely. While there are strong early In Flames vibes (really early In Flames, as in Lunar Strain), the more somber atmosphere, power-metal like riffing style, and departure from typical melodeath vocal style sets them far enough apart in my mind to barely associate them with Gothenburg (and thus, \"melodeath\") at all. No, what we have here is, while not nearly so bizarre as to be labeled avant-garde or even really progressive, nonetheless doesn't seem to fit neatly in any existing categories. While a stickler might argue that it falls closer to melodic death metal to anything else, and honestly I might be tempted to agree with that statement, it sounds so far from both Gothenburg and any kind of death metal whatsoever, melodic or otherwise, that I can't really justify doing so. I don't have a problem with it being labeled as such, but what we really have here is some unusual amalgamation that seems to include The Black Halo-era Kamelot (although this does predate that album), Be Gone-era Pharaoh, melancholic doom/gothic metal along the lines of The Sins of Thy Beloved's song \"Lake of Sorrow\" (which I mention here in particular due to its rather nautical atmosphere, though there are other bands in that vein that aren't far departed from the sound), and yes, Lunar Strain-era In Flames, but as I've already said, I think the influences are so varied and incorporated in such in unusual way that no one else, unless they were influenced by Insomnium themselves, is really similar enough to pin them down definitely.\n\nThe vocals are deep growls, along the lines of old school death metal, although that is literally the only element of the album that relates to legitimate death metal in any way. The guitar work is strange but also catchy and fitting for the atmosphere; they use harmonies that typically consist of a sort of tremolo-sounding (forgive me if that's incorrect, I'm not an expert on music theory) riff that's slower than what you usually hear in black metal, alongside simple but evocative leads that sound more powerful than anything else, at times evoking either of the aforementioned Kamelot or Pharaoh more than the other. Of course, as I said, this predates either band playing the style to which this album sounds the most similar, so either they were mirroring a more obscure somber power metal act already playing that style (which is highly possible, though I can't think of any that would fit this description) or the similarity is coincidental. Or, of course, Kamelot and Pharaoh were in fact influenced by Insomnium, but I find that unlikely since both bands seemed to progress naturally towards those distinctive sounds from much more traditional power metal sounds. The slower tremolo/power metal riffing style is what makes me think most of In Flames, though - less aggressive and more somber than In Flames' riffing, but it does also retain the distinctive tendency to frequently switch to acoustic solos, which surely isn't coincidental. However, while with In Flames that style often feels awkward or at most decent, with Insomnium it feels like the perfect progression in a song, and many of such passages are some of my favorite parts of the album.\n\nAs I've been reiterating, the album is somber and melancholic, but I haven't described much of how exactly it is, yet. Niilo Sevanen's low growls have a distinctly sorrowful, grieving tinge to them, enhanced by the reflective, nautical atmosphere which the riffs somehow create. I would have no idea how to make a riff sound nautical, but somehow almost all of them do, the possible exception being the title track, which is more evocative of a forest. Of course, this is clearly intentional, given the album cover and song titles like \"Song of the Storm\" and \"Black Waters.\" The lyrics also add a lot, adding another layer to the elegantly gloomy atmosphere. Usually about nature and/or depression, there are pretty brilliant lines (even more so in the context of the music) such as, from the title track,\n\nDo you walking in mourning, still wear the grief/Raiment of sorrow, remembrance of me\nThrough the years of bleakness, winters of bitter cold/Will you not forget me, forsake my soul\n\nPretty impressive lyrics in any context, especially impressive for what are apparently four native Finnish speakers. I'm not exactly sure who did the bulk of the lyric writing, but considering all the band members seem to be native Finns, this is just damn respectable. In appropriate places, Sevanen also uses very low, almost monotone clean vocals that, along with the acoustic sections (with which they often coincide) provide a very poignant contrast between mind-numbing anger and confusion and the continual return to profound, inexorable despair. Insomnium are a band who clearly understood melancholy, intricate details of songwriting, and how to pioneer styles without sacrificing sonic superiority; while I consider this to be their best album by a significant margin, it certainly does still shine through on later albums, albeit not as strongly. However, if you find Insomnium at all interesting to you, at least give In the Halls of Awaiting a shot before you write them off for any other album.\n",
        "\nInsomnium has never put out a bad record in their career. Maybe the production has been lacking, maybe it didn’t stack up as well as the others… but they were all good in their own right and often made it hard to put them all in order beneath Above The Weeping World, which is still their opus magnum. This record is very easily placed at the bottom of the Insomnium totem pole. It shouldn’t have ever been this easy to go “well, this is definitely their weakest record.” Despite that, it still has some of the strongest songs of their career on it. Maybe it’s because they’re still trying to really get in a groove with their newest member, Markus Vanhala (of Omnium Gatherum fame). He’s replacing founding member Ville Vänni, who left to focus on his far less interesting job of being a surgeon or something. However, because of this change, some parts of this record definitely sound like they could have come straight off of one of Omnium Gatherum’s more recent releases.\n\nThe record starts off like pretty much every Insomnium disc ever since 2004, with an intro track that’s easily skippable, but does add to the mood and build up if you decide to listen to it. The real meat and potatoes comes once The Primeval Dark is done. While We Sleep is one of the best songs this band has ever put to tape. I hate making comparisons to past works in reviews on new material, but the opening of the track throws back to some of the best moments of Above The Weeping World with the strong riffs and melodies and a vicious snarl from Nillo Sevänen. With Ville Friman singing in an appropriately sour tone of voice, we’re treated to a first in the band’s discography. Normally melodic “clean” singing vocals were reserved for emphasis or chorus work in select songs but Shadows of the Dying Sun sees Mr. Friman’s singing talents becoming as central of an element to the music as Sevänen’s growls. The rest of the song picks up tempo with galloping riffs, catchy vocal work by Sevänen and Friman trading off with one another and a bang up job on the drums by Markus Hirvonen. Markus Vanhala wraps it up with a fantastic solo and some noodling that calls images of a really depressed Explosions In The Sky.\n\nHow the hell do you follow a song like that up? You don’t. They blew their load completely on the first real track of the record and nothing else that follows it really dares to stand up to it. That’s my problem with Shadows. On every single record prior to this the songs always fought with one another to be the strongest. Shadows has the rest of the songs not even daring to touch While We Sleep, save Black Heart Rebellion. Which is a song that has another first for Insomnium in blast beat drumming. A quiet intro erupts into frantic drumming and a vicious, tremolo picked riff attack. \"Cold is the night\" Sevänen spits, then leads the band into one of the most aggressive (if not the most aggressive) songs they’ve put their name to. Appropriate, since the lyrics seem to draw from John Milton’s Paradise Lost. A+ job. Go team. Ooo-rah, etc. Then they decide to nearly lose the plot entirely after that. Lose to Night is another experiment for the band, coming off as the closest thing to a power ballad that Insomnium has ever done. Ville Friman utilizes his clean voice here once again, taking lead duties away from Sevänen. It’s not really a bad track per say, but it very much sounds out of place considering it’s sandwiched between the hellishly dark Black Heart Rebellion and the classic Insomnium sounding Collapsing Words. It could have been left off of the record and been a bonus track, or maybe even replaced with the actual bonus track of the record and Shadows would have been much stronger for it. They continue to experiment with overly long songs and use of clean vocals for the rest of the record, Ephemeral being the lone killer track remaining, despite its awful lyrics.\n\nI also really have to give an entire section here to Markus Hirvonen and his drum performance on this album. I don’t know what kind of coffee he switched to, but the man is on absolute fire on Shadows. He almost single handedly saves some of the weaker tracks on this record (The River, in particular). Prior to this, he was always a solid drummer, if just kind of… there. But now, now he’s demanding people to listen.\n\nIt’s a bit of a misstep for them on the second half of the record with a lot of new elements used at varying degrees of success. Insomnium’s missteps make those of other bands look like horrible falls, though. The record has a very unique and cold atmosphere, more winter than the fall their music normally evokes. Perhaps with a little more time given to gel with Mr. Vanhala and hone some of these new elements, they’ll release another stereo killer of a record.\n________\nHighlights include: While We Sleep, Black Heart Rebellion, Collapsing Words, Out to the Sea (bonus track for the digipak edition, very worth tracking down)\n\nInsomnium, Shadows of the Dying Sun: 7/10\n",
        "\nIf there is a singular label that could be attached to Insomnium that would sum up their sonic niche, it would be something along the lines of a gray shadow of nostalgia. They came into prominence a bit later in the Finnish melodic death metal wave, like a lingering patch of foam on the beach after the crashing wave of power metal infused technical crashes that were early Children Of Bodom, Kalmah, and several others (often under different names/monikers at the time). Their sound was originally focused more on a sort of humble, contemplative sense of atmospheric pursuit that carries much of the melodic trappings of the power metal character of late 90s In Flames, but also encompassing a longer, deeper sense of longing with a slight hint of post-rock trimming around the edges. In contrast to many of their fellow Finns with a taste for the duality of harshness and melodic consonance, they have also maintained a very consistent record, of which Shadows Of The Dying Sun is the latest addition.\n\nThe gray, fatalistic character of this album's exterior is a slight change of pace from the wooded landscapes and impressionistic skylines that usually adorn this band's album covers, but it's also as good of an indicator of this album's sense of nature-based surrealism and sorrow. In spite of the modern character of the instruments being employed, which are at times as aggressive and biting in character as some of the more industrial tinged melodeath outfits of late (see the military-like chugging heard on \"The Primeval Dark\" and the triumphant drive of \"Revelation\" once it gets past the serene acoustic intro material and between similar quiet interludes), the ultimate picture that emerges is a pre-industrial one, not all that dissimilar from the mysticism of a number of atmospheric black metal acts, though the production quality here is not nearly as spacey and reverb-heavy. One wouldn't be out of line in dubbing this an atmospheric melodic death album given the scope of the songs and the slow and measured progression of ideas contained within them.\n\nWhile largely a guitar driven album that features a fair amount of flair and intrigue, the songs found on here tend to reflect a focus on songwriting and leaving a lasting impression rather than that of initial impact and overt excitement. Granted, songs such as \"Black Heart Rebellion\" and \"Collapsing Words\" aren't without a fair degree of impact factor, much of this album is relegated to a measured, almost mid-tempo character that emphasizes a dense layering of sound over punchy rhythmic riffs and chugs, complete with frequent employment of clean vocal sections that is somewhat reminiscent of recent Eternal Tears Of Sorrow output (minus the female vocals), particularly on \"While We Sleep\" and \"The Promethean Song\". The principle vocal work out of Niilo Sevänen is still largely based in a deep, guttural bark typical of a strong old school death metal influence, but the overall feel of this album definitely leans towards a cleanness that rests on the lighter end of the melodeath spectrum, largely due to the heavy emphasis on acoustic guitars and the continual presence of atmospheric keyboards.\n\nIt's really tough to find anything really overt to complain about with an album than this. It's lone flaw is that, in contrast to much earlier output and particularly the debut In The Halls Of Waiting, it comes off as just a tad bit too hung up on smoothness and is just a tad bit too polished. Occasional bursts of thrashing or blasting come off as a bit out of place on here as much of the album is guilt off a loose, coasting character that makes the overall picture a bit more ballad-based than otherwise. But between the deep sentimentalism inherent in the songwriting and the strength of the melodic content, this album is definitely a memorable collection that defies the simple boundaries of sufficiency. Taste might leave one wanting something a bit more aggressive along the lines of The Crown or At The Gates, but those that already have a taste for what this band has done since the early 2000s will find the exact same formula, albeit with a slightly sweeter and smoother feel. Think of it as the sorrowful whimper of a dying star when compared to the mystic light of magic hour during dusk or the pale gaze of a late autumn moon.\n",
        "\nMelodic death metal these days is mainly popularized by younger bands that often cross the border between melodic death and metalcore, thus failing to truly understand the beauty-in-aggression that the metal sub genre encompasses. However there is one who always is there to rely on when you’re seeking out a heartening soundtrack to a dismal life. With the harmonies of In Flames, the aggression of At The Gates and the grief-stricken sound of Dark Tranquility, Insomnium were never quite up there with the bands that forged the sub genre. Throughout their impressive 17 year and 6 album career, each record always seemed to play too close to home thus never establishing themselves as much as ‘The Gothenburg Three’. With new album Shadows Of The Dying Sun, It’s time for them to look to new horizons.\n\nOne thing Insomnium can hold their heads up high above any of their masters is their ability to create incredible introductions. The Primeval Dark resonates confidence, quickly building tension before an outbreak of dancing riffs kick off While We Sleep. It instantly touches the heart and holds a firm grasp throughout the mix of docile clean vocals and immaculate growls. The short tranquil interlude takes you through a dreamlike transcendence and a wrenching guitar solo that bring the anthem to a sudden close. \n\nThe mix of subdued vocals and harsh growls is a constant theme within Shadows Of The Dying Sun. Tracks such as the aptly titled Revelation and the slower Loose To Night, that could make the most diehard slayer fan crumble in an emotional wreck, unearth a sense of newfound glory and confidence whilst never forgetting their familiar heartfelt harmonies. Particularly in first single, Ephemeral, this conflict of light and heavy exposes certain depth to Insomnium’s music that seems to add a thought provoking, personal touch to anyone.\n\nInsomnium are best known for their solemn atmosphere, as with most doom and melodic death metal bands, but what makes them unique is their ability to meld together agitating aggression and melodies as sweet as a nut. The confronting Black Heart Rebellion is the thrashiest number on the record that evokes imminent fist pumping yet the soaring chorus and symphonic interludes signify Niilo Sevänen’s lyrics of self belief and purity. A clear standout, The River also is a raucous track. The juxtaposing slow snarl of spoken word and sudden burst of energies set a tumultuous tone. From the pummeling blast beats, shimmering ambiance and a harrowing harmony conclude the level of passion Insomnium can radiate similar to bands such as Katatonia and Swallow The Sun.\n\nShadows Of The Dying Sun ends on the regressive self titled closer that oozes melancholy. The brooding bass intro and reverberating keyboard pass to mesmerizing choruses and dominant riffs behind depressive snarls of worthlessness and uplifting chants of self-significance. Insomnium have created an album that has a sense of pride and completion that is not felt prior to any other album. Out of the shadows, and into the light.\n",
        "\nI’ll start with the obvious here: While We Sleep is amazing. The opening scream, that epic riff, the beautiful clean singing…it’s a work of art. This is melodic death metal at its best. A triumph of the Gothenburg sound, which has become so tired over the years.\n\nUnfortunately, this is where my praise ends. I really wanted to like this album. There is nothing worse to me than hearing an amazing single and then realizing it is the only good track on the album. The rest of these songs are not bad…they just fall somewhere into melodeath limbo. You have the cool palm mutes alternating with high pitched fills. You have the epic drumming. You have the slower parts with pretty acoustic guitars, synthesizers, and clean singing. The production is excellent. But it all falls flat.\n\nWhat is the problem? Two words, Dark Tranquility. Everything on this album, Dark Tranquility has been doing since 1993, and done it better. While We Sleep has the only riffs that struck my ears as original, and even those are very close cousins. Pop in pretty much any Tranquility album, particularly Damage Done, Character, or Fiction. You will see what I mean. After listening to that for over a decade, Insomnium just feels redundant to me.\n\nNow for a newcomer to the scene, this is not a bad introduction. Again, the music and production are done well. It grows a bit cheesier at times than I have tolerance for, but the guitar work is passable and the musicians work well together. There is also a nice cohesiveness of tone and theme across the album. If you like this, I recommend you backtrack to some of the greats such as DT, early In Flames (although Reroute to Remain is probably the closest kin to this), and Soilwork. If you’re willing to go a bit harsher, also check out At the Gates.\n",
        "\nShadows of the Dying Sun is Insomnium’s sixth full length album. When most bands reach their sixth studio album you could imagine by now that they have cleanly crafted their own unique sound. This band, of course, is no exception and is always pushing to improve upon what they have written before. Is this album exactly that, another notch in this bands belt or is this a step backwards.\n\nLyrically this band has always written good lyrics. They are ranging from Nature, Loss, and Depression to even Death’s “flight” across the world. Their lyrical theme, as of late, has become more infused with hope after the release of One for Sorrow [see Through the Shadows] and this album has even more [see Ephemeral]. But more so I have noticed that songs now seem like it has an even mixture of Light/Darkness themes. It is nice to see them try new things and lyrically this band has done an excellent job like always.\n\nRight off the bat, this band has done another excellent Intro (which seems to be a reoccurrence this band loves to do). The Intro does a good job setting the pace of the album. The percussion Markus Hirvonen provides has been vastly improved and I would even say this is his best work yet. Though sadly this band lost a guitar playing but was replaced with Markus Vanhala of Omnium Gatherum. I didn’t think this was a good replacement until I heard the album. Though a complaint I do notice is an increase in guitar solos, which is common in an Omnium Gatherum album but not so much with this band. Some are well placed but still it does throw off the Original Insomnium sound. Lastly, I have noticed more clean vocals than ever before. At first this threw me off but after a couple of play-throughs I believe this is the new direction this band is progressing in. Who knows, maybe even Niilo might even attempt to try clean vocals.\n\nFinally this band has presented the album fairly well, The album cover immediately got my attention and at first glance I guessed this albums theme was the end of the world. It was far off though. My biggest complain of the whole album is that every song is entirely different, some sound like old Insomnium [see Lost to Night], others sound like they are just fillers for the highlights on this album [see Collapsing Words]. \n\n\nOverall I would say this album is a great successor to One for Sorrow. Well written lyrically and Insomnium even pushes the boundaries they had set to attempt a new sound which is an excellent addition to this bands long list of skills. I would recommend this to any Insomnium fan and even fans of the genre Melodic Death Metal.\nSong Highlights: Revelation, Lose To Night, While We Sleep\n",
        "\nInsomnium are riding on a seemingly endless wave of hugely successful albums among the melodic death metal crowd which have all been more-or-less the same for the past 10 years, with this new album being no exception. While more of the same may not be to the liking of some listeners (and I do understand this viewpoint), I for one welcome our melancholic melody-driven overlords. Consistency on this high of a level should be praised. There are too few bands where I can recommend new fans to pick any album they want to start with. This new album, Shadows of the Dying Sun, is yet another excellent starting point for anybody wanting to listen to Insomnium.\n\nIn comparison to previous releases, this one very much feels like an amalgamation of their last two albums and could very easily just be called Across the Dark Part III. However, there are hints in here of ideas which go back even as far as In the Halls of Awaiting. Just a few years ago, One for Sorrow debuted Insomnium to a wider audience with support from Century Media Records. That album, while still very much in the same formula of the band, definitely felt like it was trying to pull in a wider audience. Much of the vitality of the band seemed even out across the record to provide for more easily accessible melodies. The clean vocal sections in particular were more saccharine and produced to a level some may have felt was \"sell-out\" material; almost forced compared to the clean vocals on Across the Dark. Insomnium were trying some new things and testing the waters of their audience to try and push themselves to a different sound. Shadows of the Dying Sun brings those ideas full circle and incorporates them more firmly into the band's established niche. The clean sections and melodic passages of this album feel much more genuine to the past efforts of the band and the production of the album returns to something more like Above the Weeping World and Across the Dark. It's a very subtle difference to be sure, given how much has already been said about the similarity of all their albums to date, but I can definitely hear it. Shadows of the Dying Sun is sending a statement quite unlike One for Sorrow. This album screams, \"we are Insomnium and we aren't changing for anybody but ourselves.\"\n\nFans of Insomnium have yet another perfect album to add to their collections this year. Highly recommended for anybody who enjoys melodic death metal. This could quite easily be the best melodeath release you hear in 2014.\n",
        "\nI've been experiencing an ever-increasing level of Insomnium fatigue for years now, because it seems like they just seem content to keep remaking the same album. Shadows of the Dying Sun is more or less Across the Dark Part III, with a number of melodic analogs of songs they've already written, and thus I found it a little difficult not to compare individual tracks here to my favorites of the past like \"Down With the Sun\". And when that happens, this disc always loses, so you can tell I'm a fraction let down that they seem to have ceased the evolution over their first four outings, hit a stride and then never changed up the pace. Perhaps that's not fair, since the EP previous to this had a real folksy/prog balance, but I was not feeling that one much either.\n\nOn a technical level, Shadows is superb, with some of the richest and cleanest production this niche has ever offered. Melodies/harmonies gleam with an emotional radiance, while layers of subtler rhythm guitars and atmospheric but restrained keyboards create a lush background, almost like clouds constantly bursting, only they're the same recycled tears of heaven alighting upon our shoulders and faces. When the clean guitars in tunes like \"Revelation\" erupt into the heavier parts, you definitely get a whiff of that old In Flames/Dark Tranquillity magic when it was fresh in the 90s, but so many of the melodic progressions in this and other tunes feel almost precisely like particular tunes off the two albums before this one. The heavy vocals continue to channel the resilient, fulfilling growls of Taneli Jarva (Amok-era Sentenced), which is one of the reasons I so enjoyed this band to begin with, since they brought me nostalgia for that under-appreciated work, and there are some cleans in addition; but the distribution of acoustics and melodies seems problematic in its predictability.\n\nI've seen some comments that Insomnium are almost like a 'pop' version of melodic Finnish death, lacking some of the wildness of their peers Children of Bodom, but that tag might have be better applied to Omnium Gatherum, who have a more cubicle sensibility which connects them to the modern world. Come to think of it, there are a lot of -m sounds in these bands' names...mmmmmm, cookies! At any rate, Shadows of the Dying Sun continues this band's solemn commune with the natural world, if it was translated through an impressive studio which flawless 21st century sound. I have no issue with the musicianship or the intentions these guys bring to the table, but as they have already written the same album (in superior quality), I wish they'd throw a few unexpected curve balls into how they compose the guitars. I don't see diehard followers of the group having much of a problem with this, but as One for Sorrow felt like a (very listenable) step down from Across the Dark, this too feels like diminished returns. I feel the same about this as I do when staring at a well cut gemstone...brilliant for a few minutes in how it captures the light this way or that, or summons up a memory of beauty, but ultimately just a superficial stone.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nInsomnium is pretty close to the most overrated band ever. I'm astonished at how high their average scores are at MA, and I know some people who just mercilessly ejaculate over everything they do, and it drives me up the fucking wall. They're melodeath with no riffs and mainly just sad melodies, ooooooh! The vocals are usually pretty great but when it comes to this particular little subniche of melodeath, I prefer the more triumphant side like Amon Amarth.\n\nAnd yet, here I am, adding another high score onto the pile, and that has a lot to do with what makes Insomnium work in the first place, they're a mood music, and there really isn't much better when you're in the right mood. And right now? I'm damn sure in the right fucking mood.\n\nWhat mood is that, you ask, dear reader? Fucking soul crushing depression, that's what. Since the Day It All Came Down is pretty much my soundtrack to wandering aimlessly around the forest for hours at night, silently praying that I step in a bear trap and get eaten by a fox instead of having to return to civilization and daylight again. The title track is the song I hear in my head when I'm standing at the edge of the metaphorical cliff, just basking in the last moments of life before I finally reach the triumph of nothingness. This is a paradoxically energetic take on the concepts of loss and loneliness, and it works in a way I would have never expected it to work. It's just gloomy melodeath with a surprising amount of variety with an abundance of acoustic passages and a very, very heavy focus on melody. This is just an overload of emotion and melancholy, painted over the canvas of generally mid paced melodeath.\n\nThis goes against everything I look for and appreciate in music, really. I like my music to be fun, I like to enjoy fast and energetic stuff, it's why I pimp Slayer and Gamma Ray and Vader and Municipal Waste so much even though they're some of the most popular bands in the genre. Insomnium is about as close as you can get to being completely opposite without turning into doom or sludge or some shit. Most of Since the Day It All Came Down moves along at a very deliberate pace, with special care put into every note and every lyric, and it emphasizes the melancholic mood and atmosphere of the whole thing. Quite a far cry from the rip roaring frenzy I normally prefer to listen to. That's not to say there aren't high tempo moments, most notably the climaxes of the title track and \"Under the Plaintive Sky\", but the majority of the runtime is taken up by midpaced melodies and acoustic passages. And I hate to be an artsy fartsy \"why can't Cannibal Corpse write death metal as beautiful as Opeth?\" tool... but goddammit Insomnium write some fucking gorgeous music. At not one point in the record do I think the melodies fall flat, or that the pacing is off, or that the atmosphere isn't effective, none of that. I'll admit to not being entirely familiar with all of Insomnium's work, but the biggest difference I can notice is that the vocals are slightly better on some later albums (being deeper and more full sounding than here), but otherwise the band clearly had their signature sound pegged down by now. I don't know how you can make music, much less something based in metal, actually sound like the embodiment of despair and loneliness, but they manage to nail it here (yeah yeah I've never listened to Katatonia or My Dying Bride, sue me).\n\nSince the Day It All Came Down is pitch dark, and slathered in moodiness. The bright spots shine in the more overtly gorgeous moments, but for the most part the relatively clear lyrics and strong melodies carry you into a pit and then leave you there to rot. Niilo's vocals are remarkably clear for having such a deep, booming growl, and it helps that the lyrics are surprisingly well written as well, expertly conveying the themes of loss and sorrow to the listener. I do have a problem with the clean vocals that pop up from time to time though, as they pretty heartily fail to be emotional and instead just kind of sound like a deep voiced guy kind of rambling in the background. That aside, the keys and acoustics of the album really probably add the most to the whole package, but the big climaxes that surface in places like \"Song of the Forlorn Son\", \"Closing Words\", \"Under the Plaintive Sky\", and especially the opening title track are the most memorable and powerful moments on the album. Shit, singling out those four songs is a bit of an injustice to the other seven. This is stunningly consistent in its songwriting and its quality. If you like one song, you're probably going to like them all. They're all big, ambitious melodeath songs with no real riffs to speak of, merely focusing on really basic rhythm patterns underneath deep Johan Hegg-esque growls with soaring melodies that manage to be both triumphant, beautiful, and sorrowful at the same time. All this coupled with a perfectly crippling atmosphere makes for an album that, while not perfect, does enough right to make me not really care about the small flaws like the clean vocals/whispers. When I'm not in the mood, I'll never put this on, but when I am, it's the best album ever. The atmosphere is just nearly flawless in its scope and execution.\n\nThat's really what makes this work, the atmsophere, the mood. The feeling of this album is impeccable, and the entire time it's on, I may physically be sitting on my laptop drinking tap water that tastes suspiciously like celery, but in my mind I'm sitting with my feet dangling idly over a cliff, above a beautiful scene, looking back on my life and friends and family and loves with teary eyed reverence. Since the Day It All Came Down transports me to another world, where there is only me and endless wilderness. Nothing else matters, I'm just about to return to the dirt, like we all do someday, and I'm looking back at the beauty of what my life once was, and lamenting the fact that all the beauty is gone from myself. The world is a splendorous place, full of wonder and majesty, and yet in my own mind, it's monochrome and dry. There's nothing left for me but to just ruminate on what I had before I lost it. How I lost it doesn't matter, the point is that it's gone, my world is empty apart from myself, the lush landscape which taunts me with its vibrancy, and the overwhelming weight of sorrow and despair on my shoulders. The soothing sound of the waters in the forest creek and the rustling of the leaves in the wind is what permeates my psyche and reminds me that there is beauty in the world, but it is no longer mine to coexist with. With this final breath, I stand up at the edge of this cliff, close my eyes, and smile as I allow the gentle breeze to give me the subtle motivation to finally succeed at what I'd consistently failed at in life...\n\nI put my best foot forward.\n\n\nOriginally written for Lair of the Bastard\n",
        "\nInsomnium, the Finnish melodic death/ doom metallers have once again did it; after two years since the release of their masterpiece \"Across the Dark\", they have once again proved their immense creativity and, fortunately, their musical maturity; \"One for Sorrow\" should be proclaimed the most sorrowful and crestfallen album in melodic death' s history. Its crushing riffs, incredibly sad (yet intricate) leads and poetical lyrics make it Insomnium's Opus Magna, of course, until the next album, which I am very sure is waited by lots and lots of Insomniacs.\n\n\"One for Sorrow\" is an almost perfect album, from the start to the very end. It is a journey through the band's gloomy Universe, through their labyrinthine ideology on life, death and what is beyond it; for instance, take the song \"Through the Shadows\" (which is definitely one of their best songs they've written); in \"Through the Shadows\" the feeling of sorrow is do damn vivid, that is very likely to make you cry, and this feeling is feeded and kept alive all its almost five minutes, but somehow, they are somehow more optimistic than before; now, suffering is there to prove that there is a light, indeed, at the end of the tunnel. Musically speaking, the song is a masterpiece: heavy rhythm guitar riffs (as it was expected from the animal that is Ville Vänni), which build up very nicely in the chaos of the infernal lead guitar and the thundering wall of drums. I think this song is quite like the epitome of what Insomnium was supposed to sound from the start: gloomy, yet optimistic and rageful.\n\n\"Song of the Blackest Bird\" and its kindred suffering-infested songs \"Regain the Fire\" and \"Lay the Ghost to rest\", are veritable pieces of the doomish influence that slowly takes the role of somewhat like a Father-Figure in the band's songwriting process; Insomnium impressed me through their music, and they impressed me even more through their lyrics: I think that no one will throw rocks and mud at me if I say that there are some Finnish metal bands that have pathetic English lyrics, because it is true, but this is not the case with Insomnium. At least not entirely, because there are a few mistakes in their lyrics too. Insomnium's lyrics are to be appreciated, because they are beautifully written and they sure do make some sense to those who reads them. One great example in this respect are the lyrics of one of my personal favorites of the album, namely \"Song of the Blackest Bird\"; Insomnium are talking about Death's bird, supposedly a raven and the malicious effects of its flight above the world. \n\nOnce again, Niilo Sevanen delivers his gutural growls all over the songs, and he does it very well. There is emphasis on the lyrics that are needed to be emphasized, there is whispering and talking where the lyrics have something more meaningful to express; with other words, his performance is almost pristine. At a moment, I feared that the clean vocals that they started to employ somewhere around \"Across the Dark\" will take over and turn Insomnium to, what I thought back then, basically another shitty melodic death/ doom metal band. For that, I deserve to burn in hell. There are certain passages with clean voice, indeed, on the album, but they fit perfectly the overall mood of the album and are employed precisely when they should; Ville Friman is not just a bestial guitar player, but a very good singer, too. He has quite a range in his voice and it seems that his voice was worked upon especially for and just for Insomnium; his voice is highlighted on songs like \"Through the Shadows\" and \"One for Sorrow\". So far, so good. \n\nInsomnium has proved itself to be one of the greatest Finnish metal bands ever, and \"One for Sorrow\" is definitely, without a doubt a new turn in their style, but hopefully, this turn will turn out to be of good nature. I am not going to say this is a must-have album in your private collection if you are a fan, because I am myself a great Insomnium fan and I do not have it. Romania is a shitty country, son. And expensive. I did not give the maximum mark to this album, because of the simple fact that its quality is, I don't know...somehow, fuzzy; there is a certain buzz on it I can't put my finger on. Now, we have to wait for their next album; hopefully, they will work at it after they finish the tour with Children of Bodom, as special guests. Long life, Insomnium!\n",
        "\nThis album was the hardest Insomnium release to get into. Nothing seemed to click as fast as the last album, and especially not as much as the first three albums. It’s a peculiar release that continues Insomnium’s heavy use of poignant harmonies, enthralling atmosphere, captivating movements, and a melodic death periphery to implement some of the genre’s best work. Thick riffs, sorrowful leads, the pummeling drums, and Sevänen’s low, coherent growls are the core makeup of each song. There isn’t much more to it than that, aside from lots of key support strictly for the tone and an increased use of clean vocals. It’s another Insomnium album, but with less of a lasting impact.\n\nThat guitar tone isn't as vigorous as before. It sounds washed out, like it blends into its own restricted, flat tone. It's heavy, but there's no supreme, fat punch like on the last album or that warm, brutish tone like on Above The Weeping World. Those albums had very whole, firm tones while this one feels pasted to the music. It's probably the hardest pitfall to get passed in order to get into this album, as this drawback brought down a critical component to the band's sound. It just isn't as convincing as it tries to emulate the band's aggressive nature, even though the leads are still as ambitious, harmonious, and fervent. You can hear it in songs like \"Every Hour Wounds\" playing distinct, corpulent riffs, but without any of the bite that made it inclusive and durable. \n\nThe newest twist is Ville Friman handling clean vocals which, despite him being one of my favorite guitarists, aren't the greatest at making an impression. They sound timid compared to the ones on Across The Dark. They're humble, cheerless, and mid-ranged, but they limit the potential for the songs they're on. For instance, the title track is a gloomy song written as a build-up, graced by elegant harmonies, and topped off with a mighty climax. The clean here are pleasing, but they don't have any influential sway - the guitar leads play the same melody as the cleans, so they're the ones entertaining the most.\n\nWhile these do detract from One For Sorrow's replayability, the rest of the album is still Insomnium doing what they know how to do (just at a lesser level). It's got the scope, atmosphere (keys mostly doing the backing), and overall style of the later albums, but with the quality of the debut. Drums are pummeling and encircling, with the bass begrudgingly following under the thinning guitars. Again, the same kind of easy listening melodic death metal, but written and played compellingly. Speaking of which, the biggest ode to the tighter, inspired playing from before is with the bonus track \"Weather The Storm\". The leads on this one are tasteful and the riffs are burlier than most of the album. The one complaint is Mikael Stanne's (muffled) vocal performance is underutilized and sounds too alike to Sevänen's amiable, fluent growling.\n\nInsomnium chose to run through the motions while spicing up their formula a little. It isn't their best output, but even a less than stellar Insomnium album is a great body of work. Overall, One For Sorrow lacks a defining uniqueness and gets hit hard by the stifled guitars, but it's still enjoyable. Expect it to maintain the band's status quo while it may even come out sounding better than that.\n",
        "\nFor some strange reason this album was a grower. From the clean vocals to the common direction of the songs, there wasn’t any immediate click like with the first three albums. Each album up to this point had some quality to it, giving them their own identity and ethos for that particular release. By ethos I mean some influence or quality to the melodic death brand that Insomnium perpetuated, like an emphasis on an expansive, doomy atmosphere alongside poignant harmonies to Opeth-like acoustics and the resulting gloom. These qualities, centrally explored for each album, were key in defining Insomnium’s full-lengths. That isn’t much of the case here, since Insomnium’s sound was so cemented by the successes of the previous albums that they chose to remain largely unchanged. Therefore, Across The Dark is a fantastic continuation of Above The Weeping World with a more upbeat, keen personality.\n\nWhile not as perfect at delivering an impactful, emotional listening experience, Across The Dark’s strengths reflect that of the prior album. There are tons of memorable sections, sorrowful leads, pummeling drumming, and fat bass work to be found. The production is essentially the same as the previous album: crispy, clear, warm, and immersive. That last quality is the key to what uplifted the band from typical melodic death. The feeling of being overwhelmed by Sevänen’s authoritative, comprehensible growling and the Friman / Vänni combination of illustrious guitar work is unmatched. I don’t feel any other melodic death band of this same caliber is able to express the same level of moving leads and equally compatible riffs. \n\nAdded to this winning formula is newly introduced clean singing which was, as previously stated, a grower. The cleans only show up in three songs and are very Amorphis-like in placement and style. I could easily hear Tomi Joutsen from Amorphis performing these lines and fitting in just as fine. The cleans are accented and mid-ranged, but most importantly they work. Sometimes they sound like they’re just there, but there’s neither an overreliance nor a simplification of the band’s formula. The band still chose to keep things heavier vocally and rhythmically. The drumming, while uncompromising, had become more collected in delivering a jaunty performance, and with the album’s positive vibe it works noticeably well.\n\nInsomnium’s continued inspiration created something entertaining, relevant, and animated. The best example here is with the song “Down With The Sun,” and its enthralling lead harmonies, engrossing riffs, uplifting tone, and proficient transitions. It’s a perfect reflection of the album’s complete quality and purpose. Each song is distinguishable, catchy, and reflective of the band’s best traits. While it may shadow Above The Weeping World quite a bit, it’s still unique enough to be its own climactic body of work.\n",
        "\nInsomnium’s debut’s melodic death style is tame and plain, with not so much edge as there is melody and atmosphere. It worked in a fundamental way here, but it turned into melancholic bliss on the subsequent albums. The band’s strengths are in the flow of their music and their ability to incorporate heaviness and melody in a compatible, pleasing way. For this debut, things were a little rough around the edges in more ways than one. This has more to do with the full package than the compositional complaints, although that is also something I feel doesn’t stand up to the more ardent songs the band created later.\n\nFirst and foremost, the production on this album is unfortunately dry. It’s solid in that there’s clarity and proper mixing, but there’s not a lot of crispiness with the guitars and bass, or exuberant atmosphere of the same effect like on later releases. From the rounded drumming to the spitfire solos, everything feels compact and without any expansive scope. Whereas Since The Day It All Came Down was inspired by the doomy, Opeth-like atmosphere to bring out its (romanticized) forlorn character, this debut doesn’t attain anything like that. In The Halls Of Awaiting is simpler in that the songs themselves are the producers of their own ends. For example, a great song like “Medeia,” with its acoustic rhythm support, coarse riffing, and very Gothenburg inspired leads (think The Jester Race-era In Flames and you’re right on the mark) is able to bring forth all the positive qualities of Gothenburg-esque melodic death – antiquated tone, some gloom in the leads, and a dash of classical inspiration – for its own benefit.\n\nOn the other hand, there are other songs that aren’t able to pull this off as well. The magnitude of quality varies, and although a less-than-great Insomnium song is generally better than something their peers could produce of the same status, it doesn’t help the album’s flow. From the hooks to the pretty standard drumming, the band didn’t aim to exceed with their already dramatic writing while considering how that impacted cohesion. Songwriting generally stays the same – some mid-to-fast, aggressive riffing alongside a precisely executed (sometimes twin) harmony and Sevänen‘s sullen whispers or coherent, pugnacious growling – so it comes down to each song’s strength as compositions. Overall, the bar just isn’t as high as the following albums, even with this album’s distinctive, lengthy title track. What are missing across the board are intensity and atmosphere, as well as the gripping nature behind the songs.\n\nI’m not here to discredit this as a bad album, just one whose potential wasn’t fully realized. It set the groundwork for Insomnium’s later albums, which expanded greatly on the band’s core ethos of captivating leads, riffs and melancholic atmosphere. In The Halls Of Awaiting is very simple, but very potent for what it is – Finnish melodic death metal with class and direction.\n",
        "\nAs with their previous works, Insomnium continue to display a consistency here that is all too lacking in many of their contemporaries within the melodic death metal scene. ‘One for Sorrow’ contains nothing that might elevate the band into the more ‘mainstream’ niche of melodeath (if it can be called an elevation); there are no lightning fast guitar solos or gimmicky lyrics here. Instead the band seeks to emphasise upon the emotional nature of their music, the sweeping melodies present here wash upon the listener with the power of roaring waves, transforming now and then into fragile acoustics, creating a feeling of melancholy beauty. \n\nThere is something here for everyone (bar those looking for intoxication by means of technical guitar riffs or solos); the band has managed to intermingle faster riffs with softer clean guitar sections, maintaining smooth transitions between the two, while the melodies sweep through with a cohesiveness that bears testament to the songwriting talent of Insomnium. The drums and the bass remain solid and perform their job well, though it is my belief that the strength of Insomnium lies in their affinity for melody. The wall of sound created by the guitars, as well as the keyboards which provide much of the atmosphere present within the album, provide an interesting listening, as there are many individual elements that can be missed in a first or even second listening. The band employs three forms of vocals: the deep growls that permeate much of the album combine well with the clean vocals that they seem to be using more of nowadays, as well as the use of often whispered spoken words. Though the clean vocals here are nothing special when compared to some metal bands that rely more heavily on them, they meld in well with the music, providing a sense of beauty as well as sadness.\n\nThe song ‘Lay the Ghost to Rest’ contains all of the above elements and as such provides a good introduction to those unfamiliar with the band; the hauntingly beautiful melodies are coupled with delicate clean sections, while the vocals weave in and out, culminating in a clean vocal section reminiscent of one present in Opeth’s ‘Godhead’s Lament’. I was also struck by the uplifting tapped guitar melodies in ‘Through the Shadows’ in combination with its powerful chorus, while the range of tempos showcased in the longer ‘Song of the Blackest Bird’ prove that Insomnium are anything but formulaic. The peaceful Eden that is the instrumental ‘Decoherence’ will provide relief to even the most afflicted insomniac, while the more heavier headbang inducing riffs of ‘Unsung’ will surely render the song a staple of their live performances. The lyrics are in keeping with the band’s consistency, poetic in their melancholy, while remaining firmly outside the realm of exaggerated mournfulness. The sound is enhanced by production worthy of their talent, though I found the vocals were occasionally drowned by the wall of guitars and keyboards.\n\nI was interested to hear the band’s approach to songwriting mentioned in one of their interviews. The process seems to be cyclic: the riffs and melodies are arranged into songs, the mediocre ones removed and the process is repeated until the band is satisfied with the final result. Perhaps this is the secret to their durability; their ability to maintain the standard set right throughout their albums prove that Insomnium are the epitome of consistency. I would however like to see the band expand more upon their music in the future, which I believe they are more than capable of achieving. A fall into stagnancy as a consequence of their own consistency will surely be the result if not.\n",
        "\nFucking Insomnium. . . what's not to say about them? They are one of the best melodic death metal acts to come out of Finland in recent years. They've managed to go beyond the traditional Finnish melodic death metal blueprint laid out by bands like Kalmah or Children of Bodom, and they've done a damn good job of doing it, too. This is their debut album, and it certainly surprised me in many ways when I first heard it. I did not expect the superior songwriting that floors me still to this day nor did I expect it to be as good as it was all around.\n\nThe production is quite inferior to their later albums, but it is still salvageable. The bass and rhythm guitars are both very well present throughout this album and the mixing is just right. The vocals I will get to later, but they're also mixed in perfectly as opposed to their next album in which it's mixed in a bit too damn loud. I forget who exactly the producer was on this album, but if I was to record a melodic death metal album, I'd go to that person.\n\nThe music itself is brilliantly crafted. It is atmospheric while still maintaining the sweeping and prominent melodies of the guitars. I hardly doubt that these guys picked up a Norther or a Kalmah album and said 'These guys really influenced me, maybe I should copy them', no I think that they took up their own banner and made their own music from scratch. There is a tinge of Gothenburg influence, but it isn't as apparent here as it is on One For Sorrow. \n\nThe vocals are truly excellent and they stand out in every way. This guy isn't the greatest vocalist, but he damn sure gets the job done. His voice isn't a guttural, deep Glen Benton bellow nor is it a high pitched Thomas Lindberg wail, it's about in between. He enunciates his words while still retaining brutality as well. His vocal performance here is better than The Day It All Came Down for sure. I don't think that he could replicate his performance here ever again, either.\n\nThe drumming is varied and well-done. It utilizes a very rhythmic style and it is quite unique for sure. I think that the drummer tried to keep it toned down but still make sure that he left a lasting impact, and he most certainly did.\n\nI'd say that this is probably one of Insomnium's best and I'd definitely recommend it to anyone who is interested in melodeath that doesn't stick to the standards.\n",
        "\nSince the release of their first full length album, In the Halls of Awaiting, Insomnium were considered one of the best names in melodic death metal. But since the release of Above The Weeping World, they've pretty much dominated the genre, and for damn good reason. They seem to be one of the few bands who actually focus on the word \"MELODIC\" in the melodic death metal, especially in this album.\n\nTheir riffs in songs like Through the Shadows, Regain the Fire, Unsung and Song of the Blackest Bird are simply exemplary. Their lyrics continue to prove that poetry is not a dead art in the modern world, and their vocal variation delivers their art flawlessly. Each song seems to have it's own element that forbids you from even looking at the \"skip\" button. In under an hour, One for Sorrow tells more tales and is more entertaining than some of the best films released in all of time. \n\n\"Inertia\", in under 4 minutes, achieves something 20 minutes of Opeth's \"Black Rose Immortal\" couldn't; a spiritual journey to Zen and back. Each line in the lyrics feels like the Gods whispering in your ear. The gentle build-up of the song is exactly what one needs to prepare them for the upcoming brilliance of the album. Then, \"Through the Shadows\" and \"Regain the Fire\", both not bothering with a crescendo, getting right to the point, send warm chills all up and down your spine. The chorus in both the songs, a beautiful blend of clean and harsh vocals, with adventurous drumming and guitars in the background. The ending of the songs make you wish it didn't have to end, and then make you smile as you replay the song and the journey begins all over again.\n\nThe instrumental song in the album, \"Decoherence\" is the deep breath you take as you surface from the dive in the crystal crisp waters of true melo-death. A short slow relief to calm you from the overwhelming power of Insomnium, clearing your head, also serving as a gentle reminder of the Angels who'd just held a personal concert in your mind. And then, 3 minutes later, you dive right back into the waters and realise the potential human beings have, if they just submit to using all their efforts, to actually create something that they themselves would also enjoy. \n\nThe last song on the album, \"One for Sorrow\" is their little cherry on top of the cake. The gentle intro, absolutely perfect to set the mood and theme of the song, the lead guitars acting as the musical equivalent of the lyrics, creating the very soul of the song. This song is proof enough that to create a depressing environment, you don't need low pitch acoustic guitars and somebody sitting and singing in a deep voice. \n\nA gentle start to the album, a killer body, and a perfect ending; \"One For Sorrow\" is the blueprint to create a fantastic album that connects with you spiritually and physically. The lyrics, poetic. The music, harmonic. The vocals, angelic. The result of natural talent, something this band seems to have an excess of, and pure effort, something Insomnium are clearly bothered to put in. Simply a wonderful album, recommended for anybody and everybody. This is one album you need to listen to before you die.\n",
        "\nInsomnium could be likened to a Finnish answer to Amon Amarth, minus the Viking trappings and with a more varied approach that incorporates more acoustic and atmospheric elements. The analogy largely plays into their rugged musical consistency, electing to stick to a style more closely aligned with the early purveyors of the Gothenburg scene, while bringing in a slightly helping of Kalmah and Norther trappings on occasion. Their appeal is largely centered around their ability to remain tasteful in their delivery, not dwelling too long on one given element, while also avoiding the pretension that comes into play with bands that are more overtly progressive. This band knows their audience and what they want, and what they want is a consistent blend of sorrow and rage, bottled up into a nice package that is very specific, yet with a good amount of nuance.\n\n“Above The Weeping World” is basically a continuation of their debut album where the tempo was picked up a bit and a slightly more power metal oriented approach was incorporated. It is a highly effective blend as it avoids the coasting repetition common to the more ambient bound approach of some bands, as well as the almost pop-like formulaic approach that is taken by both Amon Amarth and, to a somewhat lesser extent, The Crown. While recurring themes are not outright avoided, this album embodies a sort of ambiguity where a clear moment of cadence or a chorus is not necessarily obvious. It is catchy and quite memorable, but the ebb and flow of melodic ideas are not rigorously conformed to a clear symmetry, though in a broader sense the usage of acoustic sections marks clear points of separation that could be viewed as a cadence of sorts.\n\nUnlike the last album, this one is just a little bit stronger the longer the songs are, as the exploitation of acoustic parts is a bit more refined and beautiful. While keyboard usage has been scaled back a bit here, “At The Gates Of Sleep” and “Last Statement” do an excellent job of compensating with well conceived, folksy sounding acoustic interludes and a wide array of melodic motives in the guitars. Everything just comes off as a bit leaner and meaner, save Niilo’s vocal work which is deeper and husky sounding enough to rival Frank Mullen, but it still fits in with the lighter melodic content quite well. The only real complaint that can be launched against this album is that the shorter songs veer back into In Flames territory (think “Colony”) and have a slightly mechanical feel, but it’s not nearly overt enough to really detract very much from the whole package.\n\nThe expectation game is the only real enemy that Insomnium faces, and barring a complete revamp of their style, the only chance of an eventual let down would be if something goes wrong in the quality department. “Above The Weeping World” has a fairly easy time measuring up to the standards already set by the last two albums, and has done well by not getting too adventurous with the musical plot formula that has served this band well up to this point. This is the sort of melodeath that any fan of semi-extreme metal can appreciate, lacking the excesses of most of the more established brands. The only real criticism that can be launched at these guys is that they aren’t expanding the genre very much, but then again, if everyone was expanding the genre then before long no one would recognize it anymore.\n",
        "\nOpinions tend to vary as to whether Insomnium was truly instituted with their more orthodox Gothenburg tinged debut, or 2 years later when they started to develop into something a bit more unique, though clearly well within the parameters of the established melodeath paradigm. But whether one prefers the scenery to be purely woeful, or an evenly matched hybrid of sorrow and scorn, they are quite apt at delivering the essential goods. They are a major player not so much for breaking into uncharted territory, but rather by refining existing standards to the point that they come off as fresh from the snow covered horizon, not all that different from a fatalistic hermit who ventures out of his mountain abode for a time to tell the rest of the world how miserable they actually are.\n\nFor all the talk that “Since The Day It All Came Down” is some sort of massive departure from their 2002 first offering, it tends to listen likely a somewhat faster and slightly more agitated version of the latter. The same general atmospheric aesthetic of nostalgic acoustic lines and dense synthesizer and piano sounds make their presence know amid a sea of distorted riffs, gradually developing melodic lines and semi-discernible orc barks. In essence, this is something of a halfway point between the moderately fast yet still somehow dragging character of In Flames that characterized “In The Halls Of Awaiting” and the nimbler, power/thrash infused character of a number of Finnish outfits, mostly in the mold of the humble yet epic purveyors otherwise known as Kalmah.\n\nThis slight divergence towards the more indicative character of their homeland results in Insomnium putting forth something that is pretty far from restful in nature, save when the acoustic parts chime in, and they do with slightly less frequency here. The shorter offerings in “The Day It All Came Down”, “Death Walked The Earth” and “Closing Words” have a drive to them that is much closer to a power metal character, and seem to imply a formulaic melodic line that is obscured by Niilo’s raving grunts, all of which remind pretty heavily of the Florida approach to traditional death metal vocals, rather than the sepulchral, blackened character embodied in most Gothenburg or Finnish melodeath outfits. But when the longer efforts come in, namely “Disengagement” and “Daughter Of The Moon”, it gets a bit closer to the slower, “The Jester Race” character of their debut, and that is definitely not a bad thing.\n\nFor the most part, this is the same story as the last one, just with a slightly faster delivery and a few additional tricks. The only area where things fall a tiny bit short is in the production department as the drums are just a tad bit dry sounding. But this is barely noticeable save on those few instances where the arrangement isn’t flooded with either melodic guitar drones or keyboard textures, and does little to detract from the power of the whole. Anyone who likes melodeath in its original, non-metalcore or modern rock infused state should be familiar with this band, and even doubly so if looking for a Gothenburg oriented band that is not quite as overblown as Children Of Bodom has become of late. Not to mention that this is great music to listen to in the late reaches of autumn when all around turns from green to death.\n",
        "\nOne enduring requirement of any melodeath band, regardless of their year of origin, is an ability to turn what is largely a predictable and formulaic style into an interesting group of songs by tinkering with a few specific details. It’s a foregone conclusion that said music must be sorrowful, but whether it be a frostbitten sorrow along the lines of a slightly blackened approach, or just a dark yet unfrozen approach akin to the haunting feel of an autumn evening as the leaves begin to die or the lonely halls of a long abandoned palace. Finland’s own Insomnium tends more towards the latter character, and their sound was generally at its best the closer to its origins one goes, though they’ve been among the more consistent players in this sub-genre.\n\nInsomnium arrived on the scene just a few years too late to provide a time appropriate Finnish answer to the Gothenburg trio that kicked off the well known melodic variant on death metal, but timing isn’t everything. Indeed, had they started at around the same time as many of the 90s bands in this style had, they might well have been possessed to recruit a singer with a higher pitched growl in the mold of Tomas Lindberg and one of the unique aspects of their sound would not have come to be. One of the hallmarks of post 1999 melodeath has been a much deeper, darker, more guttural death bark along the lines of the early American pioneers, and it meshes quite well with a style that is a bit closer harmonically to the power metal genre. Bassist and growler Niilo Sevänen is somewhat reminiscent of David Vincent, with maybe a touch of Corpsegrinder, and comes off as sort of an overgrown orc shouting semi-intelligible ravings at the pitch black of his cavern abode.\n\nApart from a deviation in vocal style, debut album “In The Halls Of Awaiting” is largely an exercise in quality detailing rather than outright innovation. The melodic contour of most of these songs conform to the Iron Maiden-like repetition typical to a 90s In Flames album, and the virtuosic shredding solos typical to Arch Enemy are largely avoided for a more solemn and nostalgic mixture of melodies, as can be particularly heard in the several acoustic breaks of “Shades Of Deep Green”. Similarly, the band is not wholly shy about utilizing keyboard ambiances normally reserved to Children Of Bodom, as heard on the intro of “The Bitter End”, but it is used much more sparingly and always makes way for the layered lead guitar lines that dominate most of the songs.\n\nThe songs tend to be of moderate length, but layered with a fair amount of melodic variations that seem to stretch their length out. The longer songs, by contrast, tend to indulge more in acoustic interlude work, with an eye towards a somber and bleak sound comparable to the fonder memories of a man whose present is built completely out of regret. The epic closer “In The Halls Of Awaiting” provides the most concentrated dose of this sense of eternal longing, reaching out for a reward that will be forever unreachable, and shifts through a series of formulaic chord structures that channel the spirit of early In Flames (specifically “The Jester Race”) but with a stronger studio production and a more introspective approach to lyrical content. This is among the more beautiful and ingeniously crafted epics in the Gothenburg mode, and it’s somehow fitting that a band not from that locale created it.\n\nAs noted before, it’s difficult to go wrong with this band if the mid 90s Gothenburg sound is the desired one. In fact, one could argue that Insomnium is more Gothenburg than most of the bands that hail from there, distilling the most poignant elements of the style and forging something a bit more compelling and also just a tiny bit more accessible. They are a band that hit the ground running with this album, and have had very few slow down points since, none of them of any particular note. They are worthy of all the praise heaped upon them, and like a grand elm tree, are strongest right at their roots and base, ergo their masterwork of a debut.\n",
        "\nInsomnium is pretty much \"the\" melodic death metal band these days, and for good reason. Ever since their 2002 debut, they've been churning out record after record of prime material. For those not in the know (which you should be, because these guys are like one of the most popular melodeath bands now, aren't they?), Insomnium is known for their brand of melancholic, mournful melodic death metal which they've been doing since 2004's Since the Day It All Came Down - their debut, In the Halls of Awaiting, was more in the style of old In Flames + Amorphis than what they're doing now. Something about the way they form their riffs produce a certain sorrowful quality that I've seen labeled as the \"crying guitar\" - and really, it's a fitting label. Few bands really evoke emotion with me the way they intend to, but Insomnium is definitely one of them. Tracks from their prior albums such as \"Weighed Down with Sorrow\" rank as some of the most emotively somber music I've ever heard. This newest album of theirs, One for Sorrow, is effectively the same thing.\n\nWhile these guys really do not have a mediocre record at all, I believe that their 2006 album Above the Weeping World, which happens to be one of my favorite albums from the 2000s, is the epitome of their sound hitherto this point. While all of their albums since Since the Day It All Came Down are really doing the same thing, Above the Weeping World did it the best. The mournful melodies climaxed perfectly in this album and created some of the most fantastic melodeath of the last decade. Since then, their albums have been going in a downward slope, however. Across the Dark was worse than it's predecessor, and so is One for Sorrow worse than its predecessor.\n\nThis is not inherently the problem with this album though. This album offers solid tracks all throughout. From the opening acoustic \"Inertia\" to the heartbreaking finally title track, the album never loses its appeal. There are obvious high points - \"One for Sorrow\" is full of sorrowful melody that makes my heart weep, and \"Lay the Ghost to Rest\" has great progression, beautifully somber riffing, and a bone-chilling climax. Likewise, there are obvious lowpoints - opener \"Inertia\" is a far cry from the memorable beauties that opened their previous three albums (and some of the best introduction songs ever), and \"Regain the Fire\" just sounds to me like what an Insomnium cover band would be doing... You know, the Insomnium sound, but generically. Everything here though is good. I think one big problem that arose here with me though is that while everything is good, it's the same stuff they've been doing for four records now, and of slightly worse quality at that.\n\nBut, again, this is not the problem with the record. The problem with the record is that... it's the same stuff they've been doing for four records now. At what point does their sound become tiring and droll? At what point do they fade into obscurity of the bands that have essentially re-released the same record half a dozen times? Insomnium's sound is fantastic, but it's not changing much between records. They've spiced this album up a bit by including more use of clean vocals, but that created another problem with me: the clean vocals (which do sound quite nice) often times make the songs they appear in sound happy... and that is not an adjective one should want to see describing an Insomnium song. But I digress; despite the clean vocals (which are still used sparingly, by the way), the instruments - which are still top notch - are doing the same thing they've been doing for four albums now. As long as they keep doing their sound well, really, I can't complain. There's going to come a point though where it sounds like they're recycling all of their old material, and I can already hear that just slightly here.\n\nMake no mistakes though - I'm giving this record an 80% justifiably. It's still good, quality music, and when looking back on what was released in 2011, it's definitely an honorable mention. I'm just worried they're going to lose their appeal if they don't mix things up a bit more. Maybe add a bit more of that faster and ultimately less melancholic stuff that showed up in In the Halls of Awaiting.\n",
        "\nInsomnium is one of those bands that has really found their place in the melodic death metal scene. While many artists come across as generic and commercial, these guys have stuck to their guns and maintained a level of consistency that is definitely worth acknowledging. Even though a band can be labeled as melodic death metal, there can be a great deal of variation between one group and the next. Insomnium is one that is often compared to bands like Noumena and Omnium Gatherum. There is a deep feeling of sorrow, sadness and grief in their lyrics and the music helps to bring that emotion to the foreground of every song on the album.\n\nFor those of you who are unfamiliar with their work, “One for Sorrow” marks Insomnium’s fifth release. The fact that they have now signed with Century Media has reflected in the production value of the album. Every instrument is well mastered and nicely polished. There is a large portion of ambient instrumentation mixed into the album is well which adds another layer of atmosphere onto the already deep and meaningful lyrical content.\n\nEverything starts off to a bit of a slow start with the intro “Inertia“, but it eventually fades into something that sounds much more familiar on “Through the Shadows.” At first the clean vocals may seem a bit disjointed from the rest of the music, but as they work their way into more and more of the songs on the album, it feels more and more a part of the overall sound.\n\nAs the album moves forward, a clear progression emerges. The songs blend into one another and it seems almost as if a story is unfolding with each passing second. Tracks like “Song of the Blackest Bird” and “Lay the Ghost to Rest” create that perfect contrast between highs and lows, slow breakdowns and catchy riffs. Clean vocals are peppered through the album and help to add another layer to the listening experience. On songs like “Every Hour Wounds“, this vocal style adds an almost haunting quality to the music.\n\nDespite having a rather slow introduction, everything ends up fitting together nicely. The guitars have that solid contrast between the high picks and the low crunches, the double bass keeps the music progressing and the vocals keep those dark, painful emotions running strong. Instrumentally, there are thrashy parts, doomy parts, ambient breakdowns, and even an instrumental found in “Decoherence” that helps break up the album into easily digestable portions.\n\n“One for Sorrow” does an excellent job of keeping the Insomnium sound alive. The lyrical content is excellent and the overall feel is very much alive. For fans of the band, it may seem like a bit of a deviation from previous albums, but these elements add to the dark atmosphere that the band seems to have perfected in the past. For newcomers to their work or to melodic death metal in general, the album stands strong and shows a solid example of the genre. This is a sound uniquely their own and that quality is something that is becoming more and more difficult to find as the the scene becomes more popular.\n\nOriginally written for Metal Blast Magazine:\nhttp://www.metalblast.net/2011/10/insomnium-one-for-sorrow-810/\n",
        "\nThe Finnish melodic death metal scene just doesn't do very much for me. Whether its Omnium Gatherum, Mors Principium Est and up until this album Insomium. But One For Sorrow is a bit better than the rest, including Omnium Gatherum's album New World Shadows that came out earlier this year.\n\nIf I were to describe Insomnium on One For Sorrow I would say they sound like a slower In Flames (Pre-Clayman) with a focus on doom and gloom type riffs and atmosphere. In fact the guitar harmonies are straight up what you would expect to hear off of Colony or Whoracle. This isn't bad though, it might not be very original but In Flames always were my favorite with how well done the harmonies were. Its easy to see that band was probably the biggest influence on Insomnium, listen through Only One Who Waits.\n\nBut the slower songs rule this album though. Lay the Ghost to Rest (which has great riffs), One For Sorrow, and Inertia all exude the slower more depressing kind of sound that Insomnium are well known for. Not to mention the instrumental Decoherence which is an extension of that sound but even darker and softer.\n\nThe one thing I do enjoy about these bands from Finland though is the vocals. They completely drop the higher pitched growls that the Swedish bands make such heavy use of and go for a lower more obvious death metal tone. There are some clean vocals here but they are used sparingly and done very well. Its not really that the cleans are even that good as far as vocal quality is concerned, but that they are put into parts of songs where they add another dimension to it all.\n\nThe only real complaint I have is the thing that most people seem to enjoy about this band. The whole sad/depressing sound does get a little tiring. The songs are good but that atmosphere isn't as well done as I have heard on other albums, Mirrorworlds by Eucharist being the most obvious example. Though if you enjoy that sound as many people seem to it won't bother you at all like it does me.\n\nOne For Sorrow is a really solid album with great melodies and harmonies. The dark sound is interesting but it kind of became tiring to me. The vocals, both clean and harsh, are really well done and I enjoy hearing the guttural style that Niilo Sevanen uses. This has become probably one of my favorite releases from a Finnish melodeath band.\n\nOriginally reviewed @ http://abaddonsmetalshop.blogspot.com/\n",
        "\nI came into this album being fully prepared to either be blown away (as usual by this band) or very disappointed. Fortunately, Insomnium continue to deliver strongly on this album and add another flight in their staircase toward a high place in the history of Melodic Death Metal.\n\nThe added production value and drive provided by a larger, international record label likely had a lot to do with how ambitious this album sounds when compared to those preceeding it. Insomnium haven't changed their sound very much since Since The Day It All Came Down, sticking to a tried and true formula that has pleased all of their fans. One For Sorrow is their first step in a truely different direction. Some of the speed and technicality of their first album is back here as the band takes more risks with their songwriting. All of these risks pay off and bring the band into a more marketable sound to a wider audience. There are songs for people who like faster, heavier Melodeath, but there are still others which remain slow and full of clean sections to please fans of the softer, more emotional material.\n\nAll of the intruments are heard well in this mix. The drums are finally brought up to a good spot and the guitars are equally prominent. The bass is punchy, but not overly prevalent. Most notably different here are the vocals, which sound even deeper and more brutal than ever before. There are songs again on this album with clean singing sections, like those that appeared on the previous album. These songs again sound just as good as others and don't detract from the overall experience.\n\nOverall, this is another strong outing for the band and one that they (and their longtime fans) should be proud to show to a whole new audience. The band has broadened their songwriting, rather than releasing yet another clone of Since The Day It All Came Down. They have not sacrificed a bit of their uniquely emotional sound, however. If you love this band, then this another must-own album. If you're curious about checking this band out for the first time, then this is a great place to start.\n",
        "\nFinland's melodic death mavens Insomnium are not a band with anything to prove. Three of their four prior albums rank among the best of that particular national niche, and while I found the exception (Above the Weeping World) to be a mild disappointment, it was still decent enough and quite highly praised beyond my personal sphere. With One for Sorrow, the band have continued directly where the 2009 stunner Across the Dark left off, to the extent that the two are virtually indistinguishable outside of minor variations in production, so that's either going to be a positive or negative depending on just how much you enjoyed that. I thought it was certainly a milestone for the Finns, and one of their best outings, but I'm not sure I was in the market for what is more or less a duplicate of that.\n\nOne for Sorrow is true to its namesake, and the band retains its rare ability to wrench about the listeners' emotions through wailing walls of melody. Rather than rely on complexity in their compositions, they instead like to build upon simpler rhythmic motifs by intensifying the drums, slathering in the massive, full-throated growls of Niilo Sevänen, and letting those melodies glide above the interwoven mesh like brave gulls traversing the Arctic Circle, clung to the ailing rays of sun to keep them aloft. Like its predecessors, the album's style is routed pretty heavily in the mid to late 90s evolution of their countrymen Amorphis, so you'll hear some psychedelic and atmospheric keyboards throughout the disc, and a bit of vocal variation where the somewhat weak cleans are layered in with the gutturals.\n\nThe pacing dynamics are not necessarily placed upon an even footing, mind you, and Insomnium are more often heavy than not, but they'll often tone down to some cleaner guitar sequences like the lush instrumental \"Decoherence\" or the opening to \"Unsung\", two of the better songs here. I also really adored the intro piece \"Inertia\" as it slowly gathered force from its atmospheric ringing to Niilo's heart-pouring background growls, but instead of busting out one of the more potent emotional pieces to capitalized on it, I found \"Through the Shadows\" to be one of the least interesting and more predictable tracks. More intense are \"Only One Who Waits\" with the muted melodic tails in its opening thunder, or the moving title track which morphs from steady, percussive clean guitars and drums and layered vocals up to this inescapable, dreamy guitar melody like a beam of light through parted clouds.\n\nUltimately, I did not find the selection of tracks here to be quite so poignant or impacting as \"The Harrowing Years\", \"The Lay of Autumn\" or the epic \"Down with the Sun\" from the prior album, which was very near perfect in summary. Nor does this album teeter upon the balance of power and fragility quite so well as their superb debut In the Halls of Awaiting. The lyrics are fairly average, with a lot of cliched emotional imagery that exactly read like memorable poetry. I'd say that Insomnium have played it pretty safe here, but it's to their credit that One for Sorrow is still well structured and resonant enough to throttle most of the other bands in the sub-genre, and fans enamored of the colossal productions of fellow Finns Amorphis, Kalmah and Noumena will very likely find themselves in a familiar trance.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nInsomnium find the bliss point between ferociousness and melody on every one of their albums. They never go too far from their established sound, yet they always manage to make every album sound different from the last. As of writing this, the band has released five full-lengths, three others of which are shy from being masterpieces for a number of reasons. Above The Weeping World, however, is the defining release in the band’s career. It’s the moment where class, professionalism, a solid production, and the most captivating compositions the band could muster find their way onto one album. The atmosphere on here is untouchable, the leads are impeccable, and there’s hardly any hint of negative feedback I can give. To me, the album’s flawless in its execution of melodic death metal. It’s such an amazing sound that I feel the band will never be able to replicate it.\n\nThe production is booming and expansive, yet not massive like a funeral doom album. The darker tone leads to a deeper atmosphere and vibe, with hints of decay and death fit for any twist on the Scandinavian melodic death / doom style. Insomnium are faster than those bands, with more emphasis on the assaulting riffs and elegant leads creating a tune that has zero melodrama and every bit of class. While no cheesiness, the album does feel larger than itself, as if it were a tragic story, although I don’t really follow it too much since the music is where the worth is held. While other bands were gussying up there music with meek melodies and clean vocals (something Insomnium would try out later) that added nothing, Insomnium kept it strictly woeful by emphasizing that their sound came from the main instruments of metal. Friman and Vänni are two that are unmatched playing harmonic, emotional leads with booming riffs. With them, each song has a dash of sophistication while remaining remarkably recognizable, stimulating, and entertaining. There are the straightforward hits like “Mortal Share” and “The Killjoy” or the longer epics like \"Last Statement\" and “In The Groves Of Death” that retain all of Insomnium’s characteristics and refines them.\n\nSevänen does primarily clear, lower growls that are at their heaviest here. Before, he was getting them down right, but he didn’t have the roar behind them, nor the gloomy atmosphere that they’d bask in. Above The Weeping World finds the perfect combination, thus creating a burlier, beastly growl that’s still within the realm of melodic death. No clean vocals are found whatsoever on this album, at all, yet the whispers that cater to the build-up or acoustic sections remain like before. None of these are out of place, and each song is written perfectly for what they’re trying to convey. Take “Drawn To Black” and its blend of tension, harmonies, blitzkrieg drumming, and powerful bass explosions that lead to a tsunami outro. It’s a song that’s certainly distinguishable from the rest, and it has enough going for it to be the best on the album. Just about all the songs on here have these qualities, and the flow from one to another is never destroyed by a misplaced song. Every song is held to such a high standard, and none of them go on longer than they should.\n\nAbove The Weeping World is a modern classic from start to finish. It never drags, and always displays quality writing in every area on the album. Momentum is never destroyed, and while this is the band’s darkest and heaviest album, there’s still tinges of optimism that’s not burdened by melodrama or overkilled by brutality. It’s as close to perfection as modern melodic death gets, and it’s the tightest the group ever got creatively. The presentation is the best for the best content it could pair up with, and the band held nothing back. Above The Weeping World is a crucial album for melodic death and melodic death / doom lovers that dig well-produced, well-written albums that knows what it wants to accomplish and does its own style better than anyone else can.\n",
        "\nWeather The Storm picks up right where Insomnium left off with their last album, Across The Dark, with some very catchy melodeath hooks and windmill headbanging sections of delight. This will not disappoint fans of the band, whether it be of the new or old material. This is just a great song from the band overall and features some excellent guest work from the legendary Mikael Stanne (Dark Tranquillity). It must have been a dream come true for them to record and perform with Mikael, considering how similar Insomnium sounds to Dark Tranquillity at times. His guest vocals are a perfect fit.\n\nThe \"B-side\" track of the single is an instrumental piece which sounds more like a typical Insomnium interlude dragged out to a full length song. It's mostly slow and atmospheric, but certainly not bad. It's a strange companion to Weather The Storm and that's about all there is to say about it. Just a solid piece of somber musicianship.\n\nIf this single release is any pre-cursor to the next Insomnium album, then I'm sure we're in for yet another classic and must-have album from this band. It's as if they can do no wrong.\n",
        "\nWhen the name INSOMNIUM comes up I’m repeatedly reminded of the opinions of a number of metal folk who hold these guys in the most resolute of esteems, and more often than not it comes back to their damn-near-genius-grade melodic death metal leans with that decidedly Finnish touch. But unfortunately, all that was INSOMNIUM came up short on the attention meter as time progressed, despite their existential consistency. Still, I knew these guys would have any kind of tenacity to survive post-ignoring…however, in my eyes they did their craft well, but not great enough to warrant my cascading to my local music shop like a horny nerd to a cardboard cutout of Catwoman to procure their later works.\n\nNevertheless, I’d been curious to know what could come about as the years piled atop one another, and with this album in hand, that curiosity would hopefully bring about the most fruitful of fruits…\n\nUpon first listen, this listener is able to ascertain a necessary evolution in their approach, although such an evolution is, dare I say, a bit predictable. Moving from a heavy yet melodic sound to a dark, gloomy progressive sound isn’t unheard of (OPETH? KATATONIA? ANATHEMA?), and in the end it’s all in how one utilizes it to beneficent ends. That may seem to be the case with INSOMNIUM, as near as I can tell theirs has always been the darker and more depressive end of things wherein such a progression could only serve for the better. I guess if anything of the like can be said it’s that things are more mature this time around in terms of the songwriting and performance, where the doom and gloom has aged better than one could have originally thought it to. It’s also more thought-provoking and catchy; still holding to their older melodic death roots by way of the harmonic leads, fast and heavy riffs and bitterly acidic growling vocals, the prog ends of things are more showcased by way of the acoustic interludes, synthetics, chord arrangements and generally less-than-deathly atmosphere. The latter helps make this new batch of compositions a tasty and addictive fare that totally envelops the listener, getting rid of that unnecessary reality outside the headphones. Indeed, a dire and desperate musical tapestry is evoked in the name of doing as such, dismal in its own right, which is broken time and again by the rather unbecoming death growls that don’t really seem to fit the scheme of thing as easily as I’m sure the band would’ve hoped at times. For the most part it works, but other times it’s a bit too heavy to take in given the musical direction of things, but this is thankfully undercut by the more befitting clean vocals that sputter about here and there. All this comes together best as showcased by the likes of “Where the Last Wave Broke”, “Against the Stream” and “Into the Woods”, grabbing the attentive ears of both extremist fans and casual listeners alike, demanding your attention. With good cause.\n\nIn the end INSOMNIUM’s latest contains a lot of great ideas in only eight songs, where things go from darkly expressive to intensely suffocating. One could chalk this up to being the sleeper hit of 2010.\n",
        "\nFor any band, whether metal or not, it is difficult to continually put forth albums that are all high quality. Some bands have a strong start, and then fall into mediocrity and, in my eyes, are not able to live up to what they were in their beginning. Some bands have decent albums, but then have that one album which is of exceptional quality. Insomnium is one of those bands that has set the bar high since the beginning of their career and then continues to reach or exceed that bar with each album they put forth. Across the Dark is Insomnium’s fourth full length album and it does not fail to disappoint.\n\nOne thing that has always attracted me to Insomnium’s work is the atmosphere that is contained within their albums. It’s hard to fully describe Insomnium’s atmosphere, at most times, it is sad and depressing. The perfect example of this is the closer to Across the Dark, “Weighed Down With Sorrow”. The beginning of the track begins with close to a minute of slowly played violins. This leads into an absolutely crushing riff, which helps create a feeling of despair. Tied in with the lyrics of the song and their masterful delivery, the song can be quite depressing. Then there are songs like “Down With the Sun”, which produces an atmosphere that puts the listener in a peaceful, dreamlike state. This atmosphere is created during the chorus of the song, where there is a pretty fast riff playing while front man Niilo Sevänen whispers the lyrics in the chorus. He then switches to his harsh growls, repeating what he has whispered. However this time, the riff becomes much more prominent, and there are keyboards in the background.\n\nThe musicianship present on Across the Dark is fantastic. It seems that the members of the band have really learned to compose songs and riffs to help songs become entertaining and help move the song forward. Many riffs on the album are quite catchy and pretty fast. Added to this, they are well played. The beginning of “Against the Stream” and “Into the Woods” displays this quite well. For the more emotional tracks, the music moves at a slower pace, yet the riffs can be quite beautiful. The acoustic sections of the album are very well played, and just like other aspects of the album, they add to the sheer emotion present in the songs. The drums on Across the Dark are good as well. They are not overly complex, but they add to each of the songs. This is great because the drums do not clash with the rest of the instruments and this helps the listener become aware of the song as a whole and not just a specific element of a song such as the vocals or the guitars. As with many melodeath albums, keyboards are present on Across the Dark. In Across the Dark, the keyboards serve the purpose of adding to the atmosphere present in the album. They add emotion, without becoming overbearing to the listener, something that plagues many bands. Another thing that is important to address when talking about Across the Dark, or other Insomnium albums, is that there are some elements of doom throughout the album. These elements are masterfully placed in the album, and they help Insomnium stand out from other melodeath bands.\n\nThe vocals on the album that are done by Niilo are just as good as the musicianship that is present. Niilo’s growls are superb; they can be very forceful at times, helping songs progress. The whispered sections add emotion and atmosphere, and the transition between the whispered vocals and the harsh vocal really adds to the appeal of Across the Dark. This can be heard in the song “Down With the Sun”, which I have already mentioned. The transition between the two types of Niilo’s vocals helps makes “Down With the Sun” one of the strongest songs on the album. They are done expertly throughout the song with flawless transitions.\n\nWhen I heard that Insomnium was coming out with their fourth full length album, I can honestly say I was worried with how it would turn out. This worry I had about Across the Dark stemmed from the fact that the band decided to add clean vocals to this album. The first three albums released by Insomnium had no clean vocals, and I was worried that these vocals would somehow change the structure of Insomnium’s songs or make some other aspect of the band become less important. There are many melodeath bands that have albums where many songs are filled with clean vocals. Though this may not be bad, I wanted Insomnium to stay with the structure they had on their previous albums since they all turned out to be solid albums. Surprisingly enough, I am pleased with how these vocals turned out. The clean vocals are provided by Jules Näveri, from bands such as Profane Omen and Enemy of the Sun. They are well executed and are not actually present on much of the album. When they are present, they help add to the emotion of songs. Also, the clean vocals are sometimes mixed with Niilo’s growls, which can create quite a unique sound.\n\nFrom start to finish, Across the Dark is a superb album that is filled with emotion and atmosphere. It is a worthy addition to Insomnium’s already stellar discography. With each album they release, Insomnium continues to please, and any fan of melodeath should look into buying Across the Dark. In addition, if you are debating whether or not to buy the special addition of Across the Dark, I would suggest that you buy it. It comes with an extra two songs that are superb. The first bonus song is “The New Beginning”, which starts out with rough production, but then breaks into a track with cleaner production that will please any Insomnium fan. The second song is “Into the Evernight”, which was recorded during the band’s second album. Both songs are a nice addition to Across the Dark, and together they add about thirteen minutes of music to Across the Dark. If you decide to forgo the special addition, Across the Dark is still a necessary addition to the collection of any melodeath fan.\n",
        "\nAbove the Weeping World is Insomnium's 3rd album, and while not as strong as their newest album Across the Dark, this record is a strong combination of melodic death metal and soft acoustic interludes, some of which border on ambient. While not my personal favorite of theirs, ATTW is definitely a solid album.\n\nThe melodic death metal of the album hasn't changed a whole lot since the first release by the band, but this isn't a bad thing at all. There's some real killer guitar work here, especially on the first three songs. While there aren't any blazing solos or wild technical riffing going on, there is still genuine emotion in the melodies played here, which is Insomniums greatest strength. As on every other of their albums, sorrow, nostalgia anger and even a few glimmers of happiness can be found here, all of which are conveyed in real meaningful ways and avoid sound cheesy or over the top. The vocals contribute a lot to this, with deep powerful roars and growls that really add a lot of feeling to the music. Another big factor is the brilliant use of acoustic guitars, which more than anything here add feeling to the music. Whether used in intros or interludes, the soft acoustic moments are gentle and quite lovely, never out of place and something I really applaud the band for using so well. The pace is slow-to-mid with occasional fast breaks, however these are few and far between and the majority of the album is content to amble along at a mostly slow speed.\n\nThe lyrics are another strong point; Insomnium write some of my favorite lyrics of any band. Resembling poetry more than most bands lyrics (and in the 3rd song using an actual poem from Francis William Bourdillion) they are dreary and sorrowful, but like the actual music avoid being cheesy, which is something a lot of artists fail to do.\n\nThe highlights of this album for me are the first three songs, the third of which, Drawn to Black, is my favorite off the album and my favorite Insomnium song. The main riff is brilliant, the pace is perfect and the entire song simply works beautifully. There are some slower and duller moments though, particularly towards the end of the album. These are offset by some terrific acoustics though, and don't really take too much away from the album.\n\nOverall, this is a strong effort by a fantastic band. Outstanding use of acoustics combined with mostly engaging melodic death metal make for a good combination, and Insomnium pull it off very well here.\n\nhttp://whitefrozen.blogspot.com/\n",
        "\nMelodeath is full of surprises. The first song I heard from Insomnium was \"Mortal Share\" in a youtube video. It was really good but still, I had a stupid fear that the rest of the album was just generic Melodeath (needless to say this was the first Insomnium album I ever heard) but after hearing \"Above the Weeping World\" and I must say I am quite impressed.\n\nInsomnium manages to capture a lot of the emotions that are lost in many other melodic metal bands in an atmosphere that is dark and melancholic. This is due to the GREAT lead guitar (even though there aren't many solos), the awesome acoustic breakdowns and the above average drumming. But to feel the full effect of the sheer feelings expressed in these songs, its absolutely mandatory to have the lyrics nearby when listening to this album. Sure, the vocals are pretty much nailed in Niilo Sevänen's deep Death Metal growls but, if you don't have the lyrics, its a bit hard to understand what the singer is saying and trust me, you WANT to hear what he's saying because whoever wrote these lyrics is a freakin poet. Whether its love, the human condition, nature and even death, this guy has got some serious writing skills. Despite their heavy Doom Metal influence, the production is quite clean and all the instruments have their shining moments.\n\nThere are some flaws like the acoustic sections that sometimes don't fit into the more aggressive songs and some aggressive moments that don't fit into the more mellow songs but for the most part, everthing is perfect. I highly recommend this album to any Doom or Melodic Death Metal fan and heck any Metal fan looking for original stuff to hear. You wont regret it.\n\nStandouts: \nThe Gale, Mortal Share, Last Statement and In the Groves of Death.\n",
        "\nInsomnium are one of maybe 3 or 4 melodic death metal bands I can listen to without being annoyed after 5 minutes. I've never really thought At the Gates, In Flames or Arch Enemy were that good, to be honest, I've never thought they were anything more than annoying, lame and boring. Irritating high-pitched screeches, lame riffs and just an overall boring feel was something that plagued these bands, but fortunately Insomnium suffers from none of these.\n\nThe previous album, Above the Weeping World, was a good blend of dreary acoustics and good solid melodic death metal; however, the death metal was never more than solid (with one or two exceptions) but I LOVED the acoustic sections. Here, on Across the Dark, its reversed. The acoustics take a back seat to some of the best melodic riffs the band have ever written (and I'd say some of the best in the melo-death scene) and while the acoustic sections aren't bad, they aren't really up to par with ATWW nor are they as numerous or as long lasting. As I said before, the melo-death has really been amped up, with some awesome melodic riffs, leads and melodies, and in some cases, soaring keyboards and clean vocals. Both of those are new ground for the band, and while the vocals aren't exactly awe-inspiring, they fit reasonably well and generally compliment the melody of the song at hand.\n\nThe extreme vocals are even better than they were on previous albums; deep, powerful, angry, desperate, sorrowful and perfectly executed. Insomniums vocals are second to none in the scene and have just such a force and power behind them that puts the shriekers and screamers that inhabit melodic death metal to shame.\n\nGuitars are handled perfectly; melodic and heavy with some terrific leads and riffs. The production lends a good thick sound to both the guitars and drums, which gives it a powerful and hard hitting feel. Drums are well-played; there's not a lot amazing or jaw-dropping technical feats, but they're played with a fantastic tightness and accuracy.\n\nThe lyrics are as well-written as ever, and convey genuine sorrow and emotion without being cliche or cheesy or over the top. I wish they'd delved more into poetry as they did with Drawn To Black from ATTW though; I was slightly disappointed in that. Other than that small gripe though, lyrics are top-notch.\n\nThe overall feeling of this album is sadness, nostalgia and dreariness, but every once in a while a ray of sunlight with creep through, however brief. Moments of brutality are woven together with moments of delicate acoustic guitar and piano that make for a truly enjoyable listen; I highly recommend this album to anyone even remotely into heavy music.\n\nhttp://whitefrozen.blogspot.com/\n",
        "\nAs much as Insomnium's 2002 debut In the Halls of Awaiting blew me away, I never was quite as smitten by either of the followups. This 4th album Across the Dark is the best material I've heard from the band in years, 45 minutes and 8 tracks of highly melodic death metal which follows in all the best tradition of Finn bands like Amorphis, Kalmah, and Noumena (and quite a similarity to the past few Dark Tranquillity albums).\n\nAll of these tracks have hooks, BIG hooks, and it takes very little time for them to ensnare you. \"Equivalence\" provides a gentle and welcoming build-up, first with its acoustics and then the flowing leads. \"Down With the Sun\" is like crawling forth from a cave to suddenly be faced with the song's namesake for the first time in many dark years. The riffing is circular and glorious, each progression of notes painstakingly selected to maximize the song's emotional power. Niilo's vocals are huge growls that work wonders here (reminding me at times of Absence, Elegy, Amok and other great Finnish melodeath records). \"Where the Last Wave Broke\" builds a nice, choppy progressive riff beneath more of the band's killer melodic lines. \"The Harrowing Years\" and \"The Lay of Autumn\" are excellent, slower pieces that roil with power. There are no tracks here that will fail to please you, even after multiple listens.\n\nAcross the Dark sounds stunning, with a dense and heavy mix that does not betray the band's penchant for sad and powerful lead lines. The vocals mix in quite well with the sad patterns of the chords, evoking both mystique and anger. This album is both a crowning moment for Insomnium and a tribute to its forebears. I'd have to say it is on par with their excellent debut, though not a surprise. The album shines from fore to aft, and has rekindled my faith in this band. As far as melodic death in 2009, this is the one to beat.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nWell, this is a logical continuation of my review series where I try to share my love with an excellent melodic death metal albums; part one, and two of the brilliant songwriting series represented Insomnium ‘In the Halls of The Awaiting’, and Gates of Ishtar ‘Dawn of Flames’. Part three is again the Insomnium with their second album, 'Since The Day It All Came Down’ \n\nWow, this is the absolutely fantastic magical music those guys created using the melodic death metal toolbox. If you define a hypothetical melodic death metal toolbox, as a certain melodic foundations characterized by the use of standard ‘hooks’, the young Finnish musicians created an original, and awesome work of art. \n\nThe simple atmospheric instrumental creates images of trees, rivers, and the atmosphere of beauty and a healing power of nature, and then the title track rips you apart with a monstrously heavy wall of sound/ misanthropic melodies, and a brutal vocal delivery. The whole record creates a similar effect with the fantastic compositions, and an absolutely no weak moments. Also, the songwriting seems to be influenced by a certain groups, expecially the early Opeth, the early Gothenburg, and the Amorphis, the songs sound pretty original.\n\nThere are some expecially interesting instrumental pieces: the brutal riffing of the title track, awesome acoustic sections in the ‘Disengagement’ , Opeth like guitar solo in the ‘Bereavement’, headbangable rhythmic patterns in the ‘Daughter of The Moon’ , and so on. But the main beauty of this album is its perfect flow. It is impossible to pick out a favorite song, since they all deserve an A! \n\nAlso, the lyrics are very beautiful. In conclusion this is a pinnacle of an intelligent songwriting put in the metal context, possibly one of those records which would make the godfather of the genre Chuck Schuldiner proud.\n",
        "\nAcross The Dark\" deserves some justice. I've read about the bad use of clean vocals, I've read about how the music is influenced by a thousand other bands, I've read about its technical semplicity... I believe that the problem a lot of people have with this album is how it sounds different from the previous efforts. I mean you can still see the old great Insomnium behind the music but Across The Dark definitely represents a step into a different direction. Insomnium have always been doomy or, at least, some of their old songs were. Now imagine these guys with a foot into the classic melodic death (the one we all know from the previous albums) and the other foot into doom metal. That's the way Insomnium go with this album. I wouldn't even say they are \"influenced\" by doom metal, because this album is a perfect balance of the two genres, a balance you can hardly find elsewhere.\n\nWhat makes Across the Dark a special album are the atmospheres. Every song is a further step in the travel within its world. You can imagine forests, rivers, mountains, autumns, winters, you can imagine whatever you want but if you like the music you'll find yourself totally dragged into the music. That's something really special. It's hard to explain it because it's just a matter of feelings.\n\nGuitars, both electric and acoustic, are the soul of the album: they introduce the atmosphere with some slow, well placed melodies and then make the song fly. There's nothing too technical: the musical sections are quite simple and usually repeat themselves more than once without being tedious. Every single song has an unforgettable melody capable of trasmitting a lot of emotions. The keyboards back the guitars work and have some spots in the album where they become the centre of the music.\n\nIn the comparison with the previous albums, Across the Dark pulls the handbrake. This is something inevitable, the price the album had to pay to sound so intense. The drums are deprived of the common pace: not a single song in the album is \"fast\" or needs it for that matter. The double bass, which used to be great, is very simple here. It may be a shame for someone, since fast double bass is one of the basic elements in a lot of great bands, but this album really don't need it.\n\nProbably, the most controversial element of Across the Dark are the clean vocals. Just to make it clear: I like clean vocals as much as I like growls or screams and I think that every of these styles can fit almost every metal genre without spoiling it. Insomnium decided to introduce clean vocals for the first time and it was unavoidable that someone would have disliked them. If you don't dispute clean vocals just for the sake of it, and if you enjoyed the album \"before\" they kick in on the third song, then I'm pretty sure you'll like them. They're not too high and are not overused (now THAT would have spoiled the music): in my opinion, they balance pretty well the good job Sevänen does behind the mic with his growls. Also, I don't mind for autotune if it doesn't sound ridicolous for being exaggerated.\n\nInsomnium is an incomparable band with its own musical style. You may find some similarities with a few other bands but that's only the result of playing the same genre in the same world area. Honestly, I can count the albums with the intensity of this one on my fingers and, at this time, it's probably one of the best in this way. I liked it as much as I liked the early works, maybe more. What I can say for sure is that it sounds different and it's definitely good for a band to succeed in different paths. Buy this album and enjoy its emotional complexity behind its sober style.\n",
        "\nInsomnium plays a melodic death with tendencies of the Swedish metal (that is production values (slightly), somewhat similar to early In Flames, and a bit Dismember)\n\nThe main quality of the music is its wonderful songwriting. The music is wonderfully and carefully crafted. The melodies are simply brilliant. From melodic death metal perspective this is an important to have interesting melodies. And they are consistent; every song has an interesting hook, acoustic guitars and keyboards to enhance already dense sound. The other instruments are very nicely done too. Vocals are brutal, yet clear, and very emotional. Plus, the lyrics are thoughtful and poetic. Rhythm section tends to be not very complicated but not uninteresting enough. Check out the double base work in the 'Black Waters', or very powerful drumming in the 'Dying Chant'. It seems that songwriting is done by the guitarists, and that helps to understand their songwriting techniques. As far as not being original (oh they copied from In Flames and suchlike), there are some similar work (the cute little guitar lead in ‘Journey Uknown’ sound quite similar to In Flames earlier material) \n\nYet in general, Insomnium are quite original. The combination of heavy production, thick guitar wall of sound, melanholic melodies,interesting changes, plus the atmosphere. The song on which they made a video characterizes their unique approach. And there are no fillers. The last title track is so amazing, such as beautiful song with such an emotional impact (the last 4 minutes of it are orgasmic – million stars out of ten)\n\nLast bits: \n\nI give it 95/100 there are some repetitive moments in few songs, (Journey Uknown lead comes back few times, it is a nice little thing, but gets repeated a bit too much) but it is pretty damn close to perfection. Additional respect for the artist to avoid trends. They have no metalcore influences, and no modern pop sampling and suchlike, which means they are not really commercial project, and writev songs from their hearts, plus it is nice to avoid the fucking trends, and stick to the roots which, from a listener perspective, is very enjoable. On of the amazing original artists in the overcrowded genre.\n",
        "\nGenerally speaking, melodic death metal is a mix of the melodic aspects of death metal, black metal, and power metal and thrashes metal. Generally, doom doesn’t get included into the mix, possibly because it’s not up to pace with the rest of the genres, but if this album is anything to go by, it should be done far, FAR more often! \n\nAbove the Weeping World is not as doomy as say, Swallow the sun, but the tangible influences are quite apparent. They have plenty of ball crushing riffs at not so break neck speed, depressive lyrics and an incredibly melancholic mood. As I mentioned, the guitar work compliments both the general melodic death metal and doom styles. While the riffs aren’t entirely slow, they are mid paced enough to satisfy fans of both sides of the genres spectrum. The lead work on Above the Weeping World is absolutely fantastic, being both technical and emotional to astounding degrees creating a connection with the album to an incredible degree. While the guitar work more or less takes the front seat for ones attention on this album, it leaves for little attention to the drum and bass work. This may also be due to the lack of amazing presence from these aspects as well, the drumming is good but not amazing, and general beats to compliment the riffs, while the bass only adds to the heaviness of the album. The vocals on this album are normal death metal vocals, but there’s something about them that adds to the tortured, melancholic feel of the album. Although they are growls, there is plenty of emotion in them, something rarely done in most death or melo death albums. Finally, instrumentally an aspect of the album that really caught my attention was the piano pieces in the album. Now, it isn’t present on all the songs, but when it is used, it creates an amazingly emotional scape for the music, more so then the guitar work and the vocals do combined. \n\nNow, not only is the atmosphere and mood of the album quite melancholic, but you may be surprised to find that the lyrics are also quite sad and gloomy! This aspect is also one of Insomnium’s strong points, their lyrics. Now, they do borrow lines from poets from time to time, and they do it on the song Drawn to Black, in which they use a bit from “The Night Has a Thousand Eyes\" by English poet Francis William Bourdillon. Other than that, there are great examples of lyricism throughout the album, particularly on In the Groves of Death, The Killjoy and Change of Heart. The structure tends to be around your basic order, but a lot of the songs have an intensely emotional melodic break at some point in the song which makes the album that much stronger.\n\nIn terms of being emotional, this album trumps even some of the most renowned gothic metal bands at their own game, playing melancholic metal that doesn’t sound a kin to whinny, mallcore douchebaggery like Atreyu or Mudvayne. All in all it is personally one of my favourite albums of all time and I’m sure anyone interested in doom, gothic or Melodic death metal would be interested in checking it out.\n",
        "\nThree years after their last effort, Above the Weeping World, Insomnium hit the shelves again with Across the Dark. I must say I approached this album with a lot of scepticism, because I seem to be the only person on the planet who finds ATWW to be a complete borefest, and given the facts that before releasing the CD, the band claimed that they will be 'experimenting' a lot, mainly with clean vocals, and the cover artwork that somehow reminded me of Viva Emptiness a little bit [i]too[/i] much, I feared that this fine band might try to pull a Katatonia on us. The result? Completely different. And thank God for that.\n\nThe Finns didn't pull a Katatonia, but I must say that they did however pull an Agalloch to a certain degree. There are a lot of doom influences present in the music, from a 'wailing', high guitar tone to a general somber atmosphere, and an 'Agallochian' impression of late autumn or early winter in the compositions - the twin guitar harmonies do wonders here, with one mainly using simple, yet very fitting, high and slow scales, and the other one providing background. It is also very commendable that Insomnium manage to achieve such a great atmosphere with barely any use of keyboards (they're employed by the guest-appearing keyboardist of Swallow the Sun, Aleksi Munter) - they're 'there', but you don't really notice them at any time, which I find great, because extensive keyboard wankery is the cancer killing modern metal. Acoustic guitars also make a few appearences, like at the start of Equivalence.\n\nThe pace is mostly kept at slow to medium, with very atmospheric tracks like the opening Equivalence, The Lay Of Autumn or the closing Weighed Down With Sorrow. There are also faster tracks, but don't expect any rockers the size of, for example, Medeia. The fast tracks are mostly Against the Stream and Into the Woods, but they're also the worst tracks on the LP. They barely have any atmosphere, they're pure 'disco' and chock-full of chugging riffs, that probably would be a huge hit in moshpits, but in the end, they're irritating and primitive, although Into the Woods picks up a bit in the middle with a cool melody, yet it doesn't last till the end of the song. Come on guys, you can do better than that!\n\nMoving on to the 'great innovation' on the CD - the clean vocals. They're a tricky matter to say the least, because they would be perfectly fine if they were delivered by someone else. I'm almost 100% positive, that they were aiming for clean vocals similar to that of Vintersorg, and it would be just ideal to hire him to do the guest cleans, or heck, if they didn't want to look outside of Finland, I think even Ville Laihiala from Sentenced would be a better alternative than performing here Jules Näveri from Profane Omen/Enemy of the Sun. Allow me to illustrate my point on the example of the song Where the Last Wave Broke - everything about the clean vocals there is great, except the vocalist. They're well-placed in the chorus, and make an interesting overall mix with them in the foreground, and Sevänen's growls in the background, their melody also is rather good. But unfortunately, Näveri fails to deliver them properly, and they turn out to be cringe-worthy at first listen, but after a few more spins, you start to appreciate their 'essence', yet they are still irritating due to Jules' wailing which sounds, well, faggy. He also appears in The Harrowing Years, where he tries to make 'doomy', 'faux-emotionless' vocals slightly similar to most newer doom bands, and in The Lay of Autumn where he 'just' sings, but in these two songs, there are no outside factors to take his performance up. I wouldn't really want to see the cleans completely removed, because as I said, they show a lot of promise, and their current amount is almost perfect - no more, no less, please - but Great Scot, get another vocalist, alright? \n\nLet's drop the matter of cleans though, and say something about the growls - they got better. Sevänen was already one of my favourite growlers, since his vocals are not only in a low tone, but also comprehensible, and they're regular motherfucking growls, and not some half-assed screams. In Across the Dark, they are deeper and more 'ominous' than in Insomnium's previous releases, and they flow great with the doomy music. \n\nAnd of course, what kind of an Insomnium album would this be without a splendid closer? Even ATWW had 'In The Groves of Death' which was not bad at all. Here it's Weighed Down With Sorrow - it starts with grim, violin-like sounds, and after that hits you in the face with a downright epic riff and melody, only to calm down in the middle to lull you with acoustic guitars and explode again with the full splendor of classic Insomnium sound and end with a 'cliffhanger', where the pace starts slowing down as the finish draws near, and it achieves climax with a single, powerful 'bang!'.\n\nFinal score? 80/100, because it's a really damn solid record, plus, it positively surprised me, since it vastly exceeded my (rather moderate) expectations, but in the end, there are flaws that cannot be ignored, and it's nothing exactly groundbreaking, even though Insomnium themselves are fairly original, and they manage to stand out in the Finnish metal scene that is either full of retarded Children of Bodom clones or bands that forget how to play all their instruments except for the keyboards. Across the Dark may not be exactly another In the Halls of Awaiting, but who gives a fuck anyway, since it's good as it is?\n",
        "\nThis album is a must have for any Insomnium or melodic death metal fan. Insomnium continues to impress and haven't lost anything since their previous albums, which are amazing I might add. There is a noticeable change in how they are writing the music though, for better or for worse, but in my opinion for the better. They have dove a little bit deeper into the atmospheric sound, as well as focusing a bit more on the melancholic, haunting riffs of the guitars. The end result is a, dare I say it, a master-piece of an album.\n\nEquivalence starts out with your classic Insomnium accoustic guitar and as seeming like an intro until Niilo comes in with his growl for about the last 45 seconds of the song. A good opener for the album and sets the mood for the next song.\n\nDown with the Sun is possibly my favorite song off of this album. Everything flows well and the guitars give me the chills every time I listen to it. Definitely a head banging song, although their music video I wasn't very impressed with. \n\nWhere the Last Wave Broke is a little faster but still as dynamic as you would expect any Insomnium song to be, and the first taste of the clean singing that they introduced in this album. The clean vocals compliment the song and Niilo well and I have a feeling that they will continue to use the clean vocals in later albums as well.\n\nThe Harrowing Years is probably my least favorite song off of this album, but it is still a completely decent song, just seems to me to be more of the same, if you listen to this album I think you will understand what I mean. Nothing spectacular on guitar, mildy boring interludes, chorus saves it.\n\nAgainst the Stream is definately one of the best songs on this album. From the intro it gets your attention and the riffs don't get any blander or any more boring from there either. The interlude has some interesting keyboard parts in it, and then back into a riff that just makes you want to cry it's so beautiful. Markus does some excellent drum work on this song.\n\nThe Lay of Autumn is the longest song on the album at just over nine minutes, and it keeps you into it the whole time. The guitars are typical, beautiful, emotional, melancholic... everything you would want an Insomnium riff to be. Again more with the clean singing, which is extremely catchy, along with every part of the song, and it makes you wonder where the nine minutes went.\n\nInto the Woods is an amazing song as well, the riffs and the breaks work perfectly together, and the keyboard adds just the right touch to create an awesome atmosphere.\n\nWeighted Down with Sorrow starts off with almost a minute of instrumental, which just builds up for the rest of the song. The guitars sound just like the title of the song, and it's the last one on the album, which leaves you wanting more.\n\nThe only reason I didn't give this 100 is because it's not perfect, but about as perfect as you can get. This band just gives me the chills, the perfect blend between melancholy and anger, its just beautiful.\n",
        "\nVille Friman\n\nWhat a dark, dreary, droopy, acoustified album. Not only that, but it takes some nods from Opeth (compare “Resonance” to “For Absent Friends” off of Deliverance. While some tracks do carry the brown streak of Opeth, the rest can be hailed as a truly romantic experience. This is in no underhanded praise toward the melodic death metal boy toy Ville Friman. His savageness is a reflection of his pieces. What we have here is an album more akin to the debut, with that passive aggressive sense of gloom. The production is definitely a step up, but the formula remains exactly the same as the first one, as if they rerecorded tracks left out of the debut. One notable difference is the overuse of acoustics. For melodic death metal, yes, it may come off as a bit excessive, but they are used much in the same way as Agalloch attempts them.\n\nSince The Day It All Came Down is a varied album when generally hearing it. We have fast tracks, doomy tracks, melodic tracks, and epic tracks. I’d like to commend the drumming on this one big time, since Markus here is able to create some dearly headbangable patterns and stimulating use of the double bass. I take a sense of warmth and comfort from these majestic compositions. The apocalyptic opener serves well as a sinister inspiration to the following songs, with the title track kicking off in addictive fashion. Dead serious, the album peaked at the title track. It’s grand, extremely melodic, entertaining, and damn well evil enough to make love to. If the climax at 3:15 of the title track doesn’t make you want curb stomp a poseur, then I’ll personally write a “Fuck Me” letter to Insomnium. “Bereavement” follows suit in the same way with a short and sweet keyboard intro before unleashing complete melodic bliss. Vänni and Friman earned my respect from day one – these two make a formidable duo. \n\nEven the slower and more acoustic oriented tracks like “Daughter Of The Moon” and “Under The Plaintive Sky” are very melancholic. They’re so catchy; you can tell they were written for fans of folk and pagan themed metal. The final track, “Song Of The Forlorn Son,” feels like that magical moment you share between your loved one that no one can break – that historical moment that will resonate within you for decades to come. You can’t help but stand in awe at the fact that MEN composed such beauty!\n\nNillo’s vocals are the rough sort of growls, very adaptive towards the production and much more filling than on the debut. He would perfect this on their next album, but his performance here is respectable. The whispers and spoken parts are addicting with the melody, I’d say, though some may disagree. The longest track here, “Disengagement,” is hard to bear, considering it’s very slow and doesn’t make any lasting impact. Again, this would be perfected on their next album and was already pulled off successfully on the debut, so there’s really no excuse how they fucked that up. Lastly, there are solos to be found here, but they don’t steal the show nor add anything too rewarding to the ears. Once more, they would achieve precision with this formula on Above The Weeping World.\n\nNow, Ville Friman. That silky brown hair that waves like forests of Finland, coupled with a hot finger for melody makes for a passionate night. I have yet to see this man fail to deliver a good time. Do yourself a favor – skip the cheap hooker and pay this man to fill you with more love juice by… playing this album… Yeah you sick fuck what did you think I mean?\n",
        "\nI wasn’t sure how to classify this one but I knew there was something different when comparing it to a standard melo-death album. The sound combines melodic death metal with depressing themes. No ‘doom’ sounding music here, but it still manages to convey a similar atmosphere in comparison to what I get from listening to a melodic doom\\death band.\nThe guitars are very melodic, adding more musical beauty to this release. \n\nInsomnium’s guitar melodies are like Dark Tranquillity’s with a more emotional edge. I can’t recall any bass lines that stand out but it’s not something I felt was absent. As said before Above the Weeping World is very melodic and the drums and guitars seem to have separate melodies that combine into one, well formed, passage. Of course the vocals could make or break this, and I feel the vocals are excellent. Sound wise, Niilo Sevänen’s vocals remind me of instances of Johan Hegg from Amon Amarth but with a more ‘Gothenburg-esque’ approach. \n\nInsomnium’s Above the Weeping World delivers great melodic death metal with a melancholic tinge creating a familiar atmosphere that you might get from non-melodic death bands. Even though this is not doom metal, I would still recommend it to anyone into melodic doom like Swallow the Sun, Daylight Dies etc.. I would of course encourage anyone into mid-era In Flames and Dark Tranquility. Awesome album, it proved to me that I could headband and evoke emotions at the same time with ease.\n",
        "\nI believe this is the demo that got Insomnium signed for good. The 19-minute-long demo contains four of the best songs from their first album, \"In the Halls of the Awaiting\". Personally, I think they're the best songs in Insonmium's entire discography, but then again, that's just my opinion.\n\nThe production here is as good as it gets, for a self-release. Even though the sound quality isn't as good as their first studio album, it's still better than most demos/promos out there. The biggest difference between the demo and album versions of the songs is that the production on the demo is a bit louder. \n\nThe riffs are both melodic and heavy, the vocals are death growls combined with a few whispered parts, and the drumming is quite precise. Overall, I can't find a single complaint about either one of those elements.\n\nOn to the songs. \"The Ill Starred Son\" is a great song with a very memorable chorus. It begins with a slow acoustic intro, and continues with a much faster pace. \"Journey Unknown\" contains a catchy solo/riff which appears at the beggining of the song and pops up a few more times. \"Black Waters\" is one of the best melodeath songs I've ever heard,. It has everything : heavy riffs, very melodic death growls and incredible drumming which includes occasional blast beats. And, finally, there's \"The Bitter End\", a fast paced song with a slow atmospheric intro, after which the riffs and growls kick in. This song actually sounds better here than on the first studio album.\n\nAll in all, this demo is flawless. If you're an Insomnium fan, or if you want to know how they started out, it's definitely worth checking out.\n",
        "\nWell, this is a good album. I first heard about this band late last year. Something that suprises me a lot is that the band is quite accessible, just as accessible as Wintersun. Yet this band is relatively unknown, check the amount of reviews. Also, in my opinion this band is much better than Wintersun.\n\nLet's start with the vocals. The guy handling vocals here cannot sing so there are no clean vocals to be found on the album. There some spoken/whispered parts though. Also unlike the usual high-pitched vocals that you have in most melo death bands which are similar to black metal, we have to deep death growl. I personally think this is a good thing. \n\nThe metal on this album is pretty heavy. There also some very soft easy listening parts on this album, for instance the album starts off with a cool accoustic intro with whispered vocals then swings into the heavy part of the album. The riffs are usually pretty technical and enjoyable.\n\nIf you're after solos then you might be a bit dissapointed with the album because there is only 1 solo on the entire album which can be found on the last song. It's unfortunately a little too short, despite this it is still an enjoyable peice of ear candy. \n\nSo there you have it, a short but effective summary of this album. This album has sparked my interest in the band and I am interested to see what their other albums sound like. It is suprising that you have bands which are just as good, if not better than Wintersun around but aren't given the same amount of credit.\n",
        "\nFor many years the Metal genre is looked down by people as noise. Mainstream metal bands only helped them shape that thought, and people were stubborn to surrender to the fact that most of the metal music took a lot of skill to produce. Emotion in metal was a taboo, and was completely turned over by calling the deep raspy vocals “mindlessly shouting”. People couldn’t be more wrong.\n\n\nThe album is a sad and gloomy record. A look at the first track title concludes it. Nocturne is a saddening piano ballad with low melodies slowly progressing into the first metal track: The Day It All Came Down. When the song starts, it’s easy to reckon the overuse of the melody. This is however not a bad thing. Insomnium quite put it out well. They set the melody on the front step, yet they didn’t forget the importance of the rhythmic section. The whole album is packed together with an extremely big load of melodies. They harmonize, put a sad tone down or make a song sound more aggressive. The difference of a lead riff and another lead riff is quite easy to recognize, yet doesn’t completely differ much from it.\n\nThe reason why this band is called “the second Opeth” is because of the extensive use of acoustic parts. Almost every song has 1 or more acoustic parts where the listener can relax from the fury that the band made a minute ago. It’s hard to switch from a heavy part to a relaxing part. Insomnium however perfectly executed in every song. Their songwriting in terms of switching from different riffs is incredible tight. Just like Opeth they tend to forget the standard formula and just write what their heart brings up. Songs like Disengagement reach a fairly long length, while some shorter songs such as Bereavement and the depressive album closer Song of the Forlorn Son have reached climaxes where words are just inconvenient to tell the beauty from it.\n\nOf course, it’s not the Valhalla of music. The approach towards the switching themes between acoustic and distorted remains the same throughout the album. The melodies always take the frontline while the rhythm section tends just to follow the lead guitar. This leads sometimes to some generic chords. The chords however always go nice along with the melodies, making it somewhat less bad. Another negative thing is Nillo’s voice. His growling is fantastic, and his spoken word is decent. His flaw lies in the fact that he barely changes his voice. It’s just like the music every time the same approach. It’s not that band though because as I already mentioned, it’s mostly about the melodies.\n\nAlthough the definition: “The album starts overwhelming, and ends emotional, but lacks in between” is vaguely true, the album deserves no statement like that. No single song is unnecessary or bad and differ enough from the other songs. With only some minor flaws in the two songs Death Walked the Earth and Disengagement, and primary perfection in every song, it’s fair to say we’re talking about a classic album. An unknown classic album it is.\n\nTop 6 songs:\n\n1. Song of the Forlorn Son\n2. Nocturne\n3. The Day It All Came down\n4. Closing Words\n5. Bereavement\n6. Under The Plaintive Sky\n\nSongs I don’t care for\n\nNone. Every song has a different feeling, and every song should be considered as a classic.\n\nThis review was originially written for www.sputnikmusic.com under the name TheHamburgerman\n",
        "\nMelodic death metal is a funny genre these days. For every quality band from any given scene, there are thousands of cookie cutter bands that play the same old riffs over and over again. Since Dark Tranquillity went down a more electronic path, and In Flames have put their early days firmly behind them, the incredibly influential early Gothenburg sound has essentially burned out. Enter Insomnium.\n\nTheir first full length release, ‘In The Halls Of Awaiting’ was released in the same year that In Flames released ‘Reroute To Remain’, the album which essentially ended the Gothenburg scene as it was known. Insomnium are from Finland, but still you can tell that they’re trying to keep that flame alive, and, to a degree, they succeeded. Their aforementioned debut and it's successor ‘Since The Day It All Came Down’ were both very positively received and the band have been hailed as ‘the new In Flames’, among other things. They return now with Above The Weeping World.\n\nAs usual, the album starts quietly, with a 2 minute song in the memory of Ari Friman (presumably related to guitarist Ville Friman), an incredibly well written piece if I do say so myself. It can only get better from here and, trust me when I say this, it does.\n\nWhen you’re in a melodic death metal band, you simply must have good guitarists, as the riffs and leads are what drive the music on. Guitarists Ville Friman and Ville Vänni have certainly impressed me on their past recordings. Some Insomnium tracks simply wouldn’t be Insomnium if it weren’t for them (classics like The Elder and Resonance come to mind), and they don’t disappoint on Above The Weeping World. There’s nothing dramatically different about their approach to leads (though it seems like there’s more overdubbing than before) but there’s so much more professionalism this time around. Every note sounds like it’s meant to be there, even in tracks like ‘Mortal Share’ where the leads can actually be quite fast.\n\nThe riffs never really jump out at you because they’re intended as backgrounds to either the leads or the vocals, but simply listening to their crunching rhythm tone is enough to tell you exactly how important they are to Insomnium’s sound. Despite not being at the forefront of their music, the rhythm parts Friman and Vänni play never fall into the trap where they are glossed over and left simple to spend more time working on the leads. The rhythms are very catchy and quite often make the leads and songs in general that bit more memorable (‘The Killjoy’ is a prime example of this). Acoustic guitars are also used a lot, but not in the way that you see so many bands nowadays do it, where a song will slow down and they’ll just chuck in a nice acoustic interlude, no, Insomnium will put it anywhere and it will always work perfectly. Some of the songs from ‘In The Halls Of Awaiting’ had fantastic acoustic work and I noticed that that element is not as prominent on Above The Weeping World, but they still pull it off fantastically. Listening to the album I never really noticed any ‘solos’ as such (though I suppose the lead guitar in general could add up into one massive solo), but when it’s obvious that you’re meant to be listening to the guitarists, they really step up their game. These two have the potential to surpass even the greatest guitar duos, given time.\n\nI found Markus Hirvonen’s drumming on past albums a little bit flat. Not exactly bad, but it sounded like he could do things so much better. On this new album he’s improved a lot. He has a very nice little trick where he plays something fairly slow for a riff, then when the riff returns in the song he plays something very fast and upbeat, and while it doesn’t sound like anything particularly special, it really works. He knows what he’s doing all around, there’s some great stops, interesting fills and fantastic use of cymbals (see Change Of Heart), as well as some double bass which, while nothing revolutionary, is certainly used only in the appropriate sections. I also like the fact that he has a variety of different styles and beats which really let the rest of the band do what they like without feeling like they really have to make every song massively different (I’m looking at you, Anders Jivarp). I mean, compare the guy that played drums on ‘The Elder’ to the guy who’s now playing ‘Mortal Share’ and there’s a very big improvement. Very good performance.\n\nBassist, vocalist and lyricist Niilo Sevänen has always been consistent. His vocals, while nothing special, suit the sound of Insomnium perfectly. They’re rough sounding but blend in very well with the guitar tones. Unfortunately they’re quite low in the mix, which means that their compatibility with the guitars actually makes it difficult to give a full evaluation of his vocal performance, but they don’t take anything away from the music, so it’s all good there. The bass is meticulously produced, and is clearly audible through the thick guitars and drums, but sometimes I wish it didn’t, because Sevänen very rarely strays from the root notes, but he definitely does a good job in the quiet sections where there’s no real guitar to hide behind (he particularly excels on In The Groves Of Death).\n\nThe lyrics are massively influenced by poets such as Edgar Allen Poe (and the final track is based on a work by Finnish poet Eino Leino), and it shows. They seem to be themed around the symbolism of nature (yes, that old cliché), however the lyrics are written very poetically, and they’re actually very interesting to read (especially when accompanied by the fantastic artwork by Ville Kaisla and Olli-Pekka Saloniemi), even if the literal meanings of the songs aren’t immediately obvious.\n\nOverall this is a brilliant album, incredibly professional. Polished to perfection (aside from the lack of volume in the vocals), written and performed superbly and there’s no major faults at all. The highlight songs are ‘Mortal Share’, ‘Last Statement’, ‘Change Of Heart’ and ‘In The Groves Of Death’ (which is a 10-minute closing epic, much in the vein of In The Halls Of Awaiting’s title track). One can only hope that these guys can keep on improving as they have, and truly become the masters of melodic death metal.\n",
        "\nTo this date, after listening to this album for over 2 months, I am still not sure how to review it. I keep going back and forth on thinking if it is great or if it is a disappointment. I think it is more good than disappointment however, after many, many listens.\n\nThe main gripe I have with the album is that I feel as if a lot of the atmosphere always present in previous albums is now compromised. The sound is still the very thick Insomnium sound we are accustomed to but it feels as if something is missing, making parts of the album sound dry and without substance. The riffs are there, but you can't really feel melody or much emotion. The vocals are harsh, deep, and thick, but it sounds boring combined with the riffs at times. In previous albums, I was always able to feel a lot of anger and sadness in the vocals, but at times in here, I don't. Now when I talk about not much atmosphere being present at times, I am talking about the intro, \"The Gale\", parts of \"The Killjoy\", parts of \"At The Gates of Sleep\". I am not going to add \"Devoid of Caring\" to the list because I don't think it fits into the above category, but I just don't like the song too much. The riffs are melodic, the vocals are rather good, but it just seems too much like a recycled version of something out of \"In the Halls of Awaiting\".\n\nThere are many great moments on this album however, which I feel outweigh the negative parts. \"Mortal Share\" is one of the best songs Insomnium have ever made and I just love the main riff. I never get bored of it. The vocals in this song are amazing as well as you could almost feel the desperation in Niilo's voice. This song is filled with a thick sound as well as a good atmosphere and if the rest of this album was like this song, it would have easily been the best album I've ever listened to.\n\n\"Drawn to Black\" is a rather lengthy song, but I also like the main riff. It isn't too fast, but very melodic, and it seems to build up into a great but sad song. In here, the vocals are more filled with sadness than desperation or anger. The song has a lot of atmosphere and it is definitely a dark song. The chorus is also very good as it is almost a lift from the dark and very low verses.\n\n\"Change of Heart\" starts off with a pleasant acoustic intro and then explodes into a tirade of depression. The main riff in this song is quite melodic and I like it because the vocals seem to go along with the melody of the riff very well. There are also a lot of background synths that provide an extra thick sound and atmosphere.\n\n\"Last Statement\" is another great song. It starts off badly though, with a pretty boring, standard, and non-melodic dark riff. It slowly builds up, but it doesn't get really good until the chorus. I just love how the dark and generic riffs build up and explode into some very melodic riffs with great vocals and some good thick drumming. It is almost as if the boring intro was put in on purpose to provide this effect.\n\n\"In the Groves of Death\" is the longest song on the album and starts off very well with one of the best Insomnium acoustic intros they've done so far. The song slowly builds up with more instruments coming in one by one and the song gets more melodic. It has a lot of acoustic guitar which can be boring sometimes, but not in this song. It is a slower paced and darker sounding song so the acoustic guitar fits in very well.\n\nOverall this is a very good album. I just loved Insomnium's sound a lot in the beginning so I am a bit disappointed with some of the songs on here. But the good thing is that most of the songs still have a nice thick and rich Insomnium sound, and since I keep listening to the album after 2 months, Insomnium must have done something right. I will be very forgiving with the score because despite its faults, I can't bring myself to give this album a low score with some of the great moments that are on here.\n",
        "\nSlowly \"The Gale\" works its way up into a strong and beautiful instrumental beginning this album in a way fit to restore hope a lot of people may be losing in the Melodic Death Metal genre.\n\nThe album quickly moves into a faster tempo with \"Mortal Share.\" They fall into their very familiar 'In Flames worship' style melodically in the beginning of the verse, but the vocals are still strong and reminiscent of Amon Amath.\n\n\"Drawn In Black\" is a very nice mid tempo piece. All the progressions are very smooth and welcomed, rather than trading down into something generic having you wish to rewind and enjoy the former riffs, as all too often happens. This song stays very fresh making it a very enjoyable six-minute song. At times they remind me of Eternal Tears of Sorrow in melody construction, and Dark Tranquility with acoustic and whispered vocal sections, but the strong rhythm guitar and deep vocals keep reminding you you're listening to Insomnium.\n\n\"Change of Heart\" twinkles in acoustically, but unfortunately the rhythm guitar comes in and seems very similar to that found on their first album, then progressing to lead melodies again of that style which reminds us all of the old In Flames albums. The song does improve throughout though, at 2:20 progressing into a very folky but rather subtle lead melody.\n\n\"The Killjoy\" seems to lack the higher melodies found in their other songs, though 4 minutes in it offers one of the best acoustic transitions on the album.\n\n\"Devoid Of Caring\" is another strong song on the album where vocals seem to take a backseat to a great atmosphere focused on a very nice lead guitar, and finishes nicely, making this easily one of their best mid-tempo songs.\n\n\"In The Groves Of Death\" begins very much sounding Gothic Metal but rolls into another nice Melodic Death Metal song laced with a beautiful lead. Personally I enjoy the slower tempo transitions in this song than the rest.\n\nThe crafted way this album kicks off at you'd be forgiven for imagining they were going to take their time bringing in and ending songs but it seems most of the songs on \"Above The Weeping World\" have an abrupt ending. However this is my main issue with the album, hardly the biggest flaw to complain about, but for artists with such progression and atmosphere you'd imagine they would wind down each song quite nicely.\n\nMy pick for best cut on the album is \"Drawn In Black.\" For worst cut, \"Last Statement,\" as it is rather average and seems to be a fairly American style song not really in unity with the rest of the album.\n\nThis album overall really is a bit of everything I love from (the old) In Flames, Dark Tranquillity, Amon Amarth, and Eternal Tears of Sorrow. With this, their Third LP, I have no reservations about putting Insomnium in the ranks of the best Melodic Death Metal bands that have been around. The production is very strong on \"Above The Weeping World\" giving it a great atmosphere superior to their earlier releases. This is a very solid effort showing Insomnium are still improving, defining themselves, and are a group to keep an eye on in the future.\n",
        "\nInsomnium seems to have cleaned up the melodic death metal scene after In Flames puked all over it with their last two albums, but if you are a fan of their older stuff, like me, then Insomnium is the band for you. \n\nThis album starts off with a dark piano peice that slows down at the end and lingers with one note hanging in the air...and then...the guitars erupt at exactly the right moment, almost forcing you to convulse your entire body in headbanging frenzy. After that, it just gets better.\n\nThe riffs in this album are fantastic. They are dark and melodic with acoustic peices and speedy double bass drumming at all the right moments. This album has a lot of somber harmonies that you hear often in bands like Swallow the Sun and Well of Tears. The vocalist also does a great job switching between death metal growls, black metal shreiks, and melodic, almost whispery chants.\n\nAll in all, this is a solid release and hopefully not Insomnium's last. I have heard brutal death metal heads who oppose melodic death tell me that this is actually pretty good. So, if you like older In Flames, Swallow the Sun, or Well of Tears, go out and buy this shit. You will not be sorry.\n",
        "\nI know many more people like the second album more than the first, but with that I have to disagree...\n\nWhen we had In The Halls of Awaiting, we had a lot of energy in the songs, we had good guitar and drumming although the guitar seemed to kind of go over the drums. We also had acoustic pieces which were nice and put in the right places and weren't too long...\n\nNow we have Since The Day It All Came Down, and some basic comments on this album is that it does sound darker however doesn't seem as heavy anymore. There are many acoustic pieces and unfortunately many of them get boring too quickly. They have no real feeling to them and no meaning, they just seem to go on and on and they seem just too simple and unentertaining. \n\nWe still have songs that will make instant classics such as \"The Day It All Came Down\" which is similar to the stuff Insomnium had on In the Halls of Awaiting which was an amazing album. This song is quick and full of energy. There is one short acoustic piece however even that is enjoyable. Another is \"Daughter of the Moon\" which is slower and not as heavy and is darker, with some acoustic pieces, however it is also very enjoyable. \"Bereavement\" is good and fast moving.\n\nUpon mentioning \"Bereavement\" I will discuss keyboards as Insomnium decided to include them in this album and I think this was a very wise decision. We have \"Nocturne\" which is a nice, dark intro for the album and sets the mood, and we also have a brilliant piano intro on \"Bereavement\". This was good and I hope they will still have keyboards in their next album...\n\nHowever I must also come to other songs which aren't highlights on this album. Such songs include an acoustic instrumental, \"Resonance\" which is very slow moving, boring, and just plain worthless. \"Disengagement\" was also a rather boring and slow moving song with too many dull acoustic pieces for its own good. \n\nOverall to sum up the album I think Insomnium have definately changed from their first album, although for me it wasn't the best move possible. They should stop using so many acoustic pieces as some are okay, but there's a point when there just becomes too much and it all becomes repetitive and boring (did I fail to mention that all the acoustic parts sound almost identical?). They need to give the drums more room, as you could barely hear them over the constant guitars, although the guitar playing for the most part is very well done. Nillo Sevanen does a brilliant job with his growling vocals, however his whispers get boring, then again you can't be growling to an acoustic piece...(cough, Opeth, cough). This isn't a bad album and is still very enjoyable, just a step down from their previous work, which I really recommend to basically any fan of metal. Insomnium truly has most of their memories worked out well and many of them become memorable classics.\n",
        "\nInsomnium is one of my favorite bands, and for many reasons. They have a very unique and thick sound despite some saying this album sounds a lot like In Flames, they have melodic yet heavy and very sad but atmospheric music, and they have excellent vocals. This album not only has awesome sounding songs, but the lyrics are very deep, well thought out, and have meaning. They sound very sincere. This is a good album to listen to when you have nothing to do. Just sit down, listen to it, and it will almost make you reflect on your own life. It is that powerful. I can picture myself sitting in the woods in the middle of Finland and just listening to this album. The art in the CD booklet also helps if I am following the lyrics. \n\nI said before that Insomnium has a very thick sound. I don't know how to quite explain it, but it must be something in the production. It almost seems like like all the instruments and vocals blend together very well to create a very powerful sound.The music on this album may not be too complicated most of the time, but I could care less as long as it sounds awesome. The melodies are all different ranging from sad and almost depressing to pretty fast but still sad. The acoustic transitions are also very well done and flow well with the song. I also love the transitions of melody from verses to choruses in some songs, like in \"Medeia\". They can change quite a bit from a slower paced and sad chorus to a wildly catchy fast speed chorus. Gives the album lots of variety, which there definitely is in this album.\n\nThere are no throwout tracks, however there are some highlights. \"Ill Starred Son\" is a more melodic and a fairly fast paced song, but the melodies here are very catchy, the melody isn't really high pitched for the most part, but it is also heavy at the same time and with the deep growling vocals it provides a nice effect. \"Medeia\" is definitely more of a sad song. It is still rather fast paced, but heavy with even harsher growls from Niilo Sevanen than what we usually get, this of course not including the parts where he whispers. There are some acoustic transitions here which feature Niilo whispering and it almost makes you feel the lyrics of the song even more. The acoustic parts on this song however are short lasting and not boring at all. \n\n\"The Elder\" is another great song that is slower paced and features a lot of acoustic breaks. The acoustic melody sounds pretty interesting and gives me an image of a cloudy day in an empty town...very peaceful, that is until the song erupts with heavy guitars and loud growls. Lastly, \"The Bitter End\" is simply awesome. It starts out as almost something you'd expect from Nightwish with a very upbeat almost heavenly-like melody, but then it explodes with a loud and harsh growl from Niilo. The song is fast paced and melodic and I love the lyrics as well. There is one particular verse that is just awesome, not only because of the content of the lyrics, but because of the melody and how powerfully Niilo growls the words.\n\n\"\"Now it's the time of grieving\nReign of sorrow in my heart\nAll i have ever wanted\nIs today forever gone\nBitter is the nightly silence\nBitter till the end of time\nThe sky grown ever darker\nThrough now she'll always be mine \"\n\nThis album is very unique and I would not equate it with In Flames or any other melodic death metal bands at all. This is NOT Gothenburg crap, this is truly melodic death metal that owns. The songs on here are powerful, the production is great, the sound is thick, the vocals are not your typical death metal style, Insomnium is truly in another league with bands like Wintersun when compared to with other melodic death bands such as Dark Tranquility. If you are looking into Insomnium, this is a great album to start with as you will be able to hear Insomnium evolve in future albums.\n",
        "\nInsomnium’s new album “Since the day it all came down” really took me by surprise this year. I had no idea this great band would be releasing another album, and then the next thing I know there promo’s lying on my doorstep. \n2002’s album “In The Halls Of Awaiting”, while a good debut, that I found offered the metal community an interesting take on the over saturated mellodeath scene, didn’t get much airplay time from me. I cant quite put my finger on it, but it seemed to me that the album had to much filler, and lacked the cohesion I crave so dearly in my metal albums. Despite this albums fate I knew, that if Insomnium matured a bit more, they would be a difficult force to reckon with.\nMy presumptions about Insomnium are proven correct with their second album “Since the day it all came down”. Everything on this album is more mature than their predecessor, particularly the general song writing. While “In the halls of the awaiting“, was essentially mellodeath in nature, Since the day it all came down, transcends such a definition. The music on this album while still very melodic, has a very doomy overtone, that shows up not only on the many slow arrangements, but in the general persona of the album. “Since the day it all came down” still has several mid paced mellodeath licks, yet a certain cloud of despair and darkness permeates even these moments. \nInsomnium’s take on mellodeath is very unique and refreshing. While most bands that play mellodeath have a happy upbeat sound, Insomnium sound miserable and unhappy. You can tell the members of Insomnium have suffered quite a great deal because the compositions on here were not written by happy minds. The lyrics as well are quite poetic, and reinforce the dark mindset of this album.\nAnother atypical attribute of Insomnium are there vocals, which are growled not screamed like most bands playing this melodic style of music. I personally think these vocals fit the band really well because they make the music sound even darker and more epic. In addition to being another of the many factors that make Insomnium deviate from the norm.\nFor those looking for a direct musical analogy, the best thing I can offer is to compare there doomy mid paced aura to that of early Amorphis, with the general emptyness and sorrow of a band such as old katatonia, blended with the melodic catchiness of a band like In Flames. Finally take a strong dose of acoustic work via mid era Opeth and you have good idea what your dealing with. \nAll in all since the day it all came down is a damn catchy album that both emotional yet groving at the same time. I highly recommend this band, and “since the day it all came down” is a good place to start out.\n",
        "\nAnyone who is farmiliar with Insomnium is well aware of how much the first album sounded like Jester Race/Whoracle album In Flames. It was pretty good, it wasnt the best thing ever, but it was definately worth listening to on occasion. This time however, Insomnium have taken their own approach to making eerily dark yet very melodic metal. There are a lot more acoustic guitars on this album, and they are done quite well and very tastefully. This may be one of the better releases of this year (not the best though, the new Vintersorg is amazing). In typical fashion of my reviews, here is the play by play:\n\n1) Nocturne - a very dark sounding piano intro, and it really sets the tone for the whole album. The ambiance in the background only adds to how eerie and dark it sounds. One of the better intro songs used on any album, and it's definately not one you're going to want to skip over. 10/10\n\n2) The Day it all Came Down - The title track, and one of the faster more upbeat songs on the album. It is a very nice contrast to the intro which is very slow. Right off the bat you can tell it sounds a lot less like in flames, however conversely a little more like dark tranquillity. There is still a little in flames worship in this song, but it's not nearly as obvious as the previous album. At the 3 minute mark you hear what I was talking about with the acoustic guitars already, although short, it is a great bridge to the rest of the song, however some of the parts seem to be reused one too many times. 8/10\n\n3) Daughter of the Moon - More awesome acoustics start off this song, and once again a similarity can be made to newer dark tranquillity with the way the verse goes. The whispering vocals over the acoustic guitar parts is awesome, as it was on the last album. The drum part at about 2:39 is a nice change of the standard double bass roll 4/4 time with the off time jazzy sounding ride hits. The second part of this song, after the long acoustic interlude is just awesome. 9/10\n\n4) The Moment of Reckoning - I swear to you, the guitar lead they put over the intro riff in this song was stuck in my head for days. The combining of acoustics and electrics for about 2 seconds in the first couple lines is a nice touch. Insert awesome acoustic part, and continue on with the song. There is a nice switching between clean and harsh vocals in this song, so if you enjoy that kind of thing, you're set. Some of the acoustics in this song actually remind me of Opeth quite a bit, which is very sweet indeed. This is my favorite song on the album as well. 10/10\n\n5) Bereavment - Another one of the more upbeat songs on the album. This also has a bit of in flames worship in it, however it is not overdone by anymeans. It is a very catchy song overall, as well as very well structured to prevent it from getting boring especially since the tempo doesn't change that much. These guys definately know what they are doing with their song layouts. There are some string synths in this song towards the latter half of the song, which only add to the song, as opposed to take away which happens sometimes when bands who do not have a keyboardist primarily add synth parts into the song. 9 / 10\n\n6) Under the Plaintive Sky - Here we see another use of combining acoustic and electric guitars simultaneously. Although it is relatively short, this song has a very Ballad-y feel to it, which means it is probably very awesome live. However, despite that, the distorted, acoustic, distorted, acoustic pattern this song follows seems a little overdone at times, not enough to make the song unlistenable though. Once again some synths show up, and are added very well. 8/10\n\n7) Resonance - Starts out with a very Opeth feel to it, kind of remniscent of Benighted, at least in my mind, but it is a very very awesome interlude for the album. Clocking at 2:29, this short interlude is probably one of the best instrumentals in the middle of an album I've ever heard. 10/10\n\n8) Death Walked the Earth - This song starts out upbeat, but slows down by the time the verse kicks in. There is some real nice guitar harmonization in this song, and once again at 1:30 an acoustic part comes in (I told you there were a lot on this album), the lyrics from this part carry over to the following part, only following it instead of spoken they are growled. At 2:50 another acoustic part comes up, once again, i feel it has a very Opeth feel to it, especially the more rock n roll sounding lead they put over it. There are a few riffs in this whole acoustic montage, as well as a pretty good guitar solo, which actually leads up into the lead that goes over the electric part. Overall a very awesome song. 10/10\n\n9) Disengagement - The longest song of the album, clocking at 8:39, and since I happen to be very long winded, I'll try and keep this one short haha. The first minute is all instrumental, which is followed by a verse with a semi harmonized lead on it, which sounds excellent. The drums in this song are particularly powerful, and used to make more mellow sounding parts more intense than they normally would sound. 2:30 brings us more acoustic guitar listening pleasure, with an electric guitar distorted lead over it, which allows a smooth transition to the next part, which shares a very similar lead. This song follows along with the rest of the album, however due to it being longer, there is a lot more that goes on in it. Disengagement is basically a summary of the entire album in an 8:39 long song, and it is my second favorite song on the album. 10/10\n\n10) Closing Words - You would think with a title like closing words, it would be the last song on the album, but it is not, you were decieved! That's fine though because although this song is very good, it would not be good for the final song of an album, it just doesn't have that ending of the album feel to it. There is nothing particularly amazing about this song, but it is still quite good; there just happens to be nothing in particular that just jumps out and grabs you. 7/10\n\n11) Song of the Forlorn Son - Here is the closure to the album that it so rightly diserves. Starts out with some extremely dark sounding synths, which continue on into the song itself. The acoustic guitars in this song are very mellow, and very eerie simultaneously. The basswork has been taken a backseat almost the entire album, but during the acoustic part at around a minute into it, you actually get to hear some very nice bass. This song never does pick up at all tempo wise, but makes up for its slowness in great atmosphere, which keeps it from being boring at all. A great ending for a great album. 9/10\n",
        "\nInsomnium’s In the Halls of Awaiting is a prime example of merely average musicians creating something that’s much more than the sum of its parts.\n\nThe music is nothing special on its own. The lead and rhythm guitars are very solid-sounding with lots of nice dual harmonies. The drumming is nothing to write home about, the fastest song on the album could be described as mid-paced at best. The vocals are a kind of gruff-sounding death growl and are actually understandable most of the time. Overall, the playing is very average.\n\nWhere this album really shines is its atmosphere. All that average musicianship I mentioned is combined with exceptional songwriting skills and beautiful lyrics to create a wonderfully melancholy listening experience. Each song is refreshingly evocative and emotional. For some reason everything clicks perfectly and makes what should to all intents and purposes be a mediocre melo-death album into a near-masterpiece. Wholeheartedly recommended.\n",
        "\nThis has to be one of my favourite albums of all time, it has everything, it has melodic riffs, heavy riffs, riffs made better with keyboards on top, acoustic bits, and the vocals are amazingly powerful, but at the same time can do sombre as well. This album has great lead guitar, and although it only has one real solo, right at the end, it’s an amazing one, and the lead is strong on most the songs. I think to put them down as an In Flames clone would be hugely underrating them, they have a lot of other elements that In Flames don’t have, they have a bit of Emperor and Children of Bodom mixed in as well, they have a much more sombre sound at times, and are a lot heavier at others. They are similar, but not the same!\n\nThey also have a progressive side, the way they constantly change rhyme and riffs, they have a much grander sound then In Flames at times. The vocals are also very different too, a lot more Death metal and deeper. This also comes from the lyrics, which are one of my favourite things about this album, they beautifully written, mostly about lost love, in a sombre, strong and brooding way. In Flames have a very modern sound, a very urban sound, but Insomnium seem to be harking back to the old days somehow, making it sound like their jamming under a star lit sky, but with excellent production. The production couldn’t be better, everything sounds smooth and nothing out of place, and you can hear everything. Brilliant. I also love, probably my favourite off the album, the epic last song, the title track, it reminds more of “With Strength I Burn” by Emperor, its long as has some amazing riffs, and then keyboards come in, and it all just builds up over 10 minutes to this amazing climax, an amazing solo, as I said earlier, the only one on the album!\n\nBut, a few things I would changes, perhaps more solos, but that’s only because I know they can do amazing ones and I'm a solo fan. Also maybe a better intro, I don’t really like the first song, it could have been a lot more dramatic. But this album is just great, if you like the bands I mentioned, Emperor, Children of Bodom, or In Flames, you would probably really like this album. I just can’t wait till their next album and when they come on tour to the UK!\n"
    ]
}