{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Boston, Massachusetts/Los Angeles, California",
        "Status:": "Split-up",
        "Formed in:": "1997",
        "Genre:": "Atmospheric Sludge/Post-Metal",
        "Lyrical themes:": "Loss, Personal struggles, Life, Human nature",
        "Last label:": "Ipecac Recordings",
        "Years active:": "\n1997-2010,\n2018 (as Celestial) ",
        "Number of Reviews": 75
    },
    "Band Reviews": [
        "\nThis was my introduction to Isis- and how bittersweet it was. Little did I know when I bought this album way back in 2009 that this would be their last full length release. I wasn't too familiar with \"post metal\" or \"post rock\" at the time, but whatever these guys had done on this release had transcended genre in my opinion. It had the sludgy-ness of doom metal, the groove of prog rock and the bite of death metal and hardcore all wrapped into a gloomy package. \n\nRegardless of if it's pretentious or not, the lack of lyrics in the booklet was *cool* for the time. I think Isis was doing something that most bands don't even attempt to do these days and that's to create an atmosphere- a vibe for the listener as not only a listening experience but a tangible one too. While there are probably endless debates as to what their best album is - is it Panopticon, is it In Absence Of Truth - *this* is irrefutably their best for numerous reasons. If I had to introduce someone to this band for the first time, this is the album I would give them. They honed in on all the things that made them stand out on their previous releases and just trimmed the fat. It's a tight experience from beginning to end and the songs don't meander as much as they do on earlier releases.\n\nThis is also one of those albums that has to be listened from beginning to end- it's a listening experience and I cannot stress that enough. The production is fantastic - the guitars and bass and gritty and raw, the drums are punchy and the synths compliment the rest of the compositions. The vocals are definitely an acquired taste- the growls are quite raw and the clean vocals are mixed quite far back in the mix which lends to Isis' more experimental nature. \n\nI wish this album had at least *one* more song as it does feel like it ends prematurely, but it's one of the few records that I rarely get bored of.\n",
        "\nIsis' label-backed debut EP Mosquito Control is in retrospect highly reflective of their transitional nature. This is not the sound that we would hear on Panopticon, which says a lot when 3 of that album's 5 performers also made this. It's also an early peak for the band, being a very consistent and complete work for such a young band's debut EP. It's not what the band became famous for innovating or that original but it shows off an outfit that clearly had the talent needed become something even more, something truly special. And that's not to take away from this release; it may not be what put them on the map but it's still a fantastic listen.\n\nMosquito Control is a crop of tracks that are some of the heaviest and most crushing in Isis' entire catalogue, with the band playing a rather mid-tempo sludge metal style with a lot of hardcore worked in there and some shots of doom metal at points. 'Life Under the Swatter' is a noisier, somewhat faster track and very frenetic that has a lot more hardcore influence and is laced with a jittering, busy drum performance and the hisses of the mosquito swarms alluded to in the lyrics, while 'Hive Destruction' sees the band throwing in more groovy, traditional sludge metal riffing while keeping the pace up. Whatever the band go for they have the chops and ideas to pull it off; the guitarwork is consistently busy, interesting and helps drive the song forward with the drums playing a supporting role by matching the complexity, texture and tone of the riffing. The vocal style here is unique to this release in their discography; Aaron Turner's vocals here are a powerful and intense shout/rasp/shriek that matches the searing instrumentation behind them, and they're some of the gnarliest vocals he would ever deliver. \n\nThe band varies up each song nicely, bringing in multiple contrasting sections such as the tense ambient bridge of 'Life Under the Swatter', the groovy doom/sludge breakdown of 'Hive Destruction' or the acoustic intro of 'Poison Eggs', as well as a good number of riffs and changes in tempo. Critically, the band can weave all of these together and progress effortlessly from one part to the next in a controlled fashion, not coming across as incoherent or choppy which would subtract from the crushing, oppressive atmosphere found throughout this release, which is generated through a combination of excellent songwriting and strong execution of the music (especially the riffs.) The production is great too; everything sounds very large, clear, crisp and heavy. The low end of the bass consistently rumbling away in the background gives the music more weight, while the drums pound hard and the guitars have a thick and sludgy tone to match. It's all mixed well too (the guitars are slightly above the drums but below the vocals), helping to bring out the most in the music.\n\nThere's also a good amount of variation across the track list; every song here has an identity of its own with the epic, more melodic opener 'Poison Eggs' setting the stage with its fantastic build-up from its acoustic intro to the meat of the track, where the band cycle through the main riff and slower breakdown sections along with an ambient build-up to a heavy finish. 'Life Under the Swatter' and 'Hive Destruction' are shorter in both size and stature and while they are the lesser songs here, they do still keep the energy up and bring their own aforementioned ideas into the fold. 'Poison Eggs' and its more epic, atmospheric scope is in retrospect a hint towards their future direction but a much larger hint is the closer and my personal favourite track 'Relocation Swarm'. It's an experimental epic that dwarfs even the opener at nearly 12 minutes in length, one that in both structure and feel foreshadows their later post-metal material. The first 4 or so minutes consist of ominous, chugging doom metal verses laden with barely audible sampled narration and brief, sparse vocals from Aaron, before a drop-out section featuring more samples gives rise to another chugging doom riff and agonised shouts from Aaron as the band pile on more and more noise, continuing on for the remainder of the song until the band is consumed entirely by this noise. It's a gargantuan finish to this amazing EP and this song is honestly one of Isis’ very finest; up there with the likes of 'Altered Course' in terms of scope and impact.\n\nMosquito Control is an excellent first volley from an amazing band. They'd make more innovative music down the road but the purity of vision and the near-perfect execution of it on display here is something to behold. Even the lyrics are a cut above most bands, with the band's visions of mosquito swarms alluding to human societies and how they can be controlled and crushed. This EP is not something to be passed up on - it's essential for any fan of Isis to see where they come from artistically and any fan of sludge metal or hardcore.\n",
        "\n(Note: Whilst most versions of this EP feature their 1998 demo as tracks 4-7, these will be considered separately in a review of said release as I feel the two sets of tracks are different enough to warrant their own reviews. Hence this review will only cover the first 3 songs of the 7 track release, or the only 3 songs on the 1999 vinyl release.)\n\nIsis were always a band in transition - if one wasn't aware of the artists at work at all they could be forgiven for thinking Celestial was written by a completely different band to In the Absence of Truth, even though they were written by the same 5 people. In general, their adjacent releases sound noticeably different to one another too, as they would evolve substantially with each release. It's for these reasons that earlier Isis releases would be surprising to many: for one, their earliest work (their demo, EPs and Celestial) sound nothing like what most associate with the band. In addition, the evolution of their sound across this stage of their career was much smaller than say, the leap between Celestial and Oceanic. This brings us to The Red Sea, which exemplifies these traits.\n\nIn general, these are among the heaviest and most extreme songs the band would ever produce. It can be easy to forget that before the post-rock and progressive metal/rock influence crept into their music Isis were making searingly heavy sludge metal. Across this release there are many examples of excellent sludge metal riffing whether they're going for a brutal and chaotic feel that leans towards hardcore, or a tense and droning style that leans towards doom metal. The drums are a similar story - complementing the riffs perfectly no matter what tempo and no matter what atmosphere the band are trying to achieve. The sound of the music is a bottom-heavy and thick one and the instruments sound crisp and loud - the guitar tone is a vast and sludgy mass and the drums crash into the front of the mix, giving the music the sonic clarity and weight it needs. The vocals take something of a back seat in the mix but that doesn't rob them of their presence in the music. Aaron's vocal performance here is a distorted, raspy shriek - none of the shouts, growls or cleans heard on later albums are anywhere to be found. He sounds even more intense than what he was doing on Mosquito Control, and matches the sheer power of the instruments.\n\nEven though this is their shortest ever release - a mere 15 minutes comprised of 3 tracks - there is a surprising level of variety across them. 'Charmicarmicarmicat Shines to Earth' is a noisy intro piece that is reminiscent of 'Emission of the Signal' from Sawblade: it's less than 2 and a half minutes of a very slow and ringing sludge metal riff while Aaron shouts over it in a distorted, booming voice. It's a powerful way to set the stage for what's to come and a very intense track in its own right. 'The Minus Times' begins with a rather fast and frenetic passage before settling into a crushing mid-tempo groove that still brings frequent change-ups in the riffs. It listens like a much better produced and more refined version of a track from their demo, and is the single most brutal thing the band has ever written. By contrast, the title track is an epic that is akin to the more elaborate and atmospheric style witnessed on Celestial. Starting with a slow, droning riff it progresses to more mid-tempo territory over the course of 3 and a half minutes before suddenly giving way to a lone acoustic melody. Samples are slowly faded into the music before the band comes crashing in again, with the guitars playing an electric rendition of the acoustic melody. This continues to the end of the track and makes for an impactful ending to both the track and the EP. This song also marks one of the earliest examples of their music focusing more on atmosphere than outright heaviness, making it a very important track for their musical development.\n\nThe Red Sea is probably the most transitional Isis release despite its brief duration, bringing together a more refined form of the style used on their demo and the style that would set the stage for their later, better known albums. This gives the release a pleasing circularity to it - being a final send-off to that older style while initiating the transition to something new. It may not have the same level of sonic and conceptual unity of other Isis albums but it does contain two of their finest songs and it's a watershed moment in their discography. If these aren't good enough reasons to get this I don't know what is.\n",
        "\nSawblade was always something of an oddity in Isis' discography, which pertains to its nature and purpose. Unlike anything else they've done this was never intended to be a main part of their discography, having been thrown together to be sold during a 1999 tour with Neurosis and Candiria. And when I say 'thrown together', it really has been: there's no cover art at all and it's more a compilation of unreleased tracks they had at the time - two covers from The Red Sea sessions and two demos that were recorded at home. Hence it's a collection of unrelated songs as opposed to a unified piece of work, something else which sets it apart from the rest of their discography.\n\nThe two demos bookend this release, and due to their experimental nature they may put some people off. The opener 'Emission of the Signal' is 5 or so minutes of a singular chugging sludge riff, with higher-end guitar noise coming in later, timed to the riff and contrasting with it, as well as sampled thudding in the background of the track. It's quite good in its own way, being a sort of build up to the meat of the EP, but the problem is it's too long - it could easily have been cut down to 3 and a half minutes and the effect would have been the same. The closing track is 'House of Low Culture', an 11 minute ambient/drone piece. Its first 4 minutes consist solely of rumbling sound effects which then give way to a guitar melody. The guitar work becomes less melodic with time as it shifts to heavier, more droning territory before fading out somewhat and allowing a sparse keyboard line to take over. It's a very good song, remaining interesting throughout and creating a tranquil, reflective atmosphere, however its sparse construction and sluggish progression may make it less immediately accessible to some.\n\nThe other two tracks are covers of absolute classics - Black Sabbath's 'Hand of Doom' and Godflesh's 'Streetcleaner'. Both of these tracks were recorded during The Red Sea sessions and as such they have a polished, crisp and loud sound to them with a very pronounced low end. The drums in particular are quite loud and the guitar tone is immensely distorted, sludgy and massive even by Isis standards. This goes some way to making both of these tracks improvements on the originals, but it complements 'Streetcleaner' much better as the power of this rather claustrophobic, intense production style can be felt more on a pummelling track like that than the comparatively laid back 'Hand of Doom'. This is partially why 'Hand of Doom' is the lesser of the two covers, with the other reason being that they don't do a whole lot with it. Aaron sings in a similar style to Ozzy, and whilst the song is a little slower than before, it's in a similar vein to the original. It's good and all but it's sort of unremarkable, and it can easily be argued that the track loses some of its character by replacing Ozzy's distinctive voice with what amounts to a solid imitation.\n\nOn 'Streetcleaner' however, they very much don't go through the motions: the drums are live as opposed to a drum machine, the guitars don't drone as much, and the production as stated is fuller and louder than before. The 40 second spoken word intro from the original has been cut completely, as has some of the outro. As a result the track, while perhaps less mechanical-sounding than before, is made even heavier and more direct, with the band upping the intensity to levels while still managing to create an equally hellish, if less mechanical atmosphere. The riffing is more brutal and tense than ever and Aaron's coarse, powerful shouts replace Justin's booming, effects-laden reverberating spoken word, adding to the song's newfound heaviness and directness. It's not often that a song becomes a classic for the band covering it, but Isis succeeded in doing so; it's an amazing rendition of an excellent song. While it can be argued that the loss of the drum machine and overall machine-like qualities to the sound makes the song less distinctive, this is undeniably a more remarkable and interesting cover than 'Hand of Doom' as they do something a little different with it.\n\nThis is a good release as you'd expect (though also uneven, as you wouldn't expect), however I would highly recommend you don't buy it, as its limited number of copies makes it a collector's piece with elevated prices. The CD releases start at around $38 and can fetch as much as $320, while the vinyl releases start at about $70 and go up to over $325. To my mind no singular album, no matter how good it may be, is ever worth this much and that's especially true for a half hour, 4 track EP comprised of two covers and two demos. It can't be stressed enough: either buy these tracks on Bandcamp, or if you wish to own them in physical form, the two covers (but not the demos) can be found on Temporal, along with many other rare tracks. These are much more cost-effective ways of obtaining this material, and are very much preferable options to buying the EP on its own.\n",
        "\nI say 'failed' because this album is not a total loss - far from it. It's still good but while the album is on it becomes apparent that everything could have been done a little bit better. It's not as if the band were running out of steam when writing it either, given that the songs are more ambitious than on any of their past efforts, and as is the case with their entire career they aren't repeating themselves. However, the songs simply never come together quite as well as they do on past or future efforts, and while the results yielded from this experiment are interesting and can work they aren't quite up to standard for a band as great as Isis. The band themselves admit this was a disappointment, and in general they had too many ideas and didn't know what to do with them. While I'd agree, those ideas do occasionally dovetail to create something truly wonderful, as Isis' music almost always is.\n\nThis album is an experiment in the sense that the band delve very heavily into the post-rock and progressive rock influences that were creeping into their music with Oceanic and Panopticon, and at the same time a lot of the sludge influence those works carried has been dialled back significantly. As a consequence this is by far the least heavy Isis album - the heavy, sludgy aspects of their sound are spread more thinly and most of the runtime is spent playing delicate clean sections, driven by keyboards and guitar chords. The heavier sections are largely used to release tension and don't make up the main body of a song as they would have done on the preceding two albums. In general the clean sections are much better than the heavier ones, and there are two reasons for this. The first issue is a simple one, and that is that the riffs, when they do come into the music, aren't all that impressive. They tend to be predictable in construction or simply a louder chord repeatedly hit, and because of this the impact these heavy parts have is substantially less than say, the ending of 'In Fiction'.\n\nThe second issue becomes apparent to anyone who's listened to Panopticon, which to my mind is both the greatest example of the band implementing progressive songwriting into their sound and their finest achievement. On that album the quieter parts of the songs, even at their most minimal, never felt overly repetitive. Every minute of that album was spent progressing the music in a flowing and logical fashion by slowly developing just a small handful of musical ideas, and just about every clean section on it was building up to a huge explosion of sludgy, enormous riffs and passionate, intense vocals. On this however most of the clean sections meander too much and don't build up to the heavier parts all that well. The band spends too much time throwing in new ideas and not enough time developing them. It doesn't help that the songs are made up almost entirely of this clean noodling, meaning that the songs themselves tend to meander before suddenly breaking into a heavier section in a somewhat unsatisfying way. This issue is admittedly somewhat mitigated by the fact the quieter parts of the music are actually quite good and make up most of the music, meaning the less than impressive riff-driven parts don't take up too much time.\n\nI feel like the album would have been better had they made a full on progressive/post-rock release and did away with the metal influence entirely, as they would no longer be aiming for contrast in the music and could focus entirely on crafting delicate, atmospheric music using these quieter sections. They achieve this to an extent when the songs aren't heavy, with all of the songs taking on a larger than life, spacey and tranquil feel at one point or another. Another thing to note on the album is expansion of musical technicality: the keys on this simply have more to them than past efforts and are used extensively to great effect. The growls are deep and powerful and give the heavier sections some intensity, while the clean singing is smoother and more emotive, to fit the softer music. The bass is more intricate and plays a greater role in the music than before, ringing away to great effect as in the intro to 'Not in Rivers, But in Drops'. The drumwork, in spite of the overuse of a rolling tribal beat, is more detailed and loose and fits the music perfectly. In general they do succeed in exploring the quieter dimensions of their sound on this album and had the songs been more focused and riffing been better this would truly be on the level of their last two releases. It isn't even like the songs always meander and I'd point to 'Dulcinea' as an example of that. That pummelling build up towards the end, beginning with a rolling tribal drumbeat before the rest of the band follow suit and come crashing in leading up to that huge ending is fantastic. The first section of 'Holy Tears' is an example of the band writing better riffs for the heavy parts of the music, giving these sections more impact than on the rest of the album. Had the album had more moments like this I would not be complaining one bit: when they occasionally get these parts right, they really get it right.\n\nAs I've mentioned, I don't want to give the wrong impression about this album. It is an enjoyable and overall a good work despite its flaws and is an important release for the band. They explore musical territory they had seldom entered in the past and the more delicate, prog rock strains of this album would be successfully combined with the power of their previous works on their excellent swansong Wavering Radiant. That said, those trying to hear what this band is all about should definitely start with Oceanic and Panopticon; while this is an important stepping stone for the band and a good album, it doesn’t represent the band’s music at its finest.\n",
        "\nI often find myself becoming disgruntled with the comparisons between Isis and Neurosis. On the Celestial era, Isis did show a definite Neurosis vibe, but from Oceanic on wards, Isis are more often than not the ones being imitated. Oceanic was a ground breaking record which mixed the aggressive post metal of Neurosis with a stronger post rock vibe, resulting in what is perhaps the first album of its kind, ushering in a new blend of metal, hardcore and post rock.\n\nAt its core, Oceanic is a blend of post hardcore and doom metal with the song structures and atmospheric prowess of post rock. Most of the songs follow the loud-quiet dynamic of post rock and thus it’s structured rather similar to ambient music. Long songs that start off fairly quiet and mellow with more and more elements being added on or taken away. This gives the songs a feeling of evolution, with the band always going through multiple transitions. Oceanic isn't a riff oriented album, with the guitars content to play quiet post rock passages with louder, more bombastic chord progressions. There’s not really any stand out melodies with the music being more rhythmic and progressive in nature. \n\nDespite the relative simplicity of the style it never gets boring. The music truly has an oceanic feel to it, what with the constant shifting of the guitars and the multiple transitions. The production feels very warm and clear, the guitars have a nice crisp and clear tone to them whilst retaining a rather dense wall of sound ala Neurosis. The overall feel of the music is very organic and natural. The transitions between light and dark sections never feel awkward or out of place feeling like a natural progression. Of course, it can be argued that the bands over reliance on the standard tropes of post rock might get a tad predictable but the surging climaxes and the atmospheric quiet sections are interesting and varied enough to ensure the music remains interesting.\n\nVocally, front man Aaron Turner utilizes a harshly yelled bark not dissimilar to Neurosis. They’re never fast or aggressive, perfectly suiting the meandering atmospheric style performed here. The ethereal female vocals on the track Weight work perfectly with the soothing music underneath, she’s got a beautiful voice and it complements the music really well. Lyrically this is a concept album of sorts with a single story being portrayed through each track. The story is quite dark and depressing, dealing with subjects such as incest and drowning. Surprisingly, despite the dark and disturbing content presented by the lyrics, I find the music rather uplifting and soothing. It certainly never becomes depressing or too hard to handle, instead the music is very comfortable and warm. \n\nObviously Oceanic is not an album for everyone, the overuse of the climax and general minimalist and repetitive song structures might begin to wear thin on some listeners out there. After all, this is an album that strives for atmospheric progression above all else. The music on Oceanic is very calm and soothing, and even when it picks up a bit as is the case with the surging climax on The Beginning and the End it’s still remains relatively calm, never outwardly aggressive. I guess some metal listeners out there will be put off by the albums “soft” and calm disposition and its connections to the hardcore and post rock scenes. Really though, Oceanic isn't a typical metal album and would be better suited for those looking for atmospheric and emotional music rather than something you can headbang and rock out to.\n",
        "\nThe atmosphere that this album provides is unique, perfect, and makes us think clearly why ISIS was meant to be. This record is the shift from the chaos provided by the past lp and eps that a band can use this in a passive-aggressive manner. The work done by all the members is great because they invite us into the maze of their minds and transport us to the very first row of a tragedy and make us watch every aspect and analyze profoundly in every chord, every riff, every growl, and every key.\n\nThe album is a spiral, like all the good tragedies, but the beginning is the combination of both (hence the title of the song) moments of light, moments of darkness, and once you go straight forward, every place is a dark, atmospheric place that only our morbid feelings come out just to know what is going to happen.\n\nThe heaviest sound comes every moment of the record, giving more presence once you go to the final track, yet giving the catharsis at the middle of the road. The guys in the band looked for something to be remembered by until the end of time and this second material gives everything that we can image: heaviness, rage, pain, order, progressions that go to the most calm chords to the most furious riffs, slow and quiet moments that in an instant become in the most furious anger, giving a slap to our ears and our feelings in such a manner that make us wanting to repeat over and over again the record.\n\nWe came to the maze and they took us to the tragedy, we actuated as spectators of this and we wanted more, once we got to this place, there is no way back to our old selfs, because we were catched by a different sound, we tasted a different thing, we tasted the sound of all things to come.\n",
        "\nHas it really been two years since Isis called it a day? The mark these L.A. sludge behemoths have left on the extreme music scene is a long and deep one, to the point where phrases like “post metal” and “NeurIsis” are often bandied about in an attempt to categorise the planet shaking atmospheric force that they and fellow riff explorers Neurosis helped to forge. Whilst the loss of Isis has allowed the member’s other projects to flourish (I must admit, I’ve totally lost track of how many Mamiffer releases have been put out in the past two years), there still seems to be a large Isis shaped hole in contemporary metal, with none of the band’s torch bearers quite managing to capture the same intensity that Isis tapped into in their prime. All of which means that to say that ‘Temporal’ (a compilation of rarities, demos, b-sides, and one or two previously unheard tracks) has been highly anticipated is something of an understatement. Whilst these compilations can sometimes be a highly enlightening tour deep into the vaults of a band’s history, all too often they can come across as nothing more than a selection of discarded runts from the cutting room floor, hastily slapped together to squeeze another buck or two out of a band’s mourning fans. Mercifully however, ‘Temporal’ seems to lean more to the former…\n\nDisc one treats us to an assortment of demo recordings spanning the length of time between their swansong, ‘Wavering Radiant’, right back to their masterpiece, ‘Oceanic’. Whilst it’s odd that no material from the ‘Celestial’ era has made the cut (not to mention their highly sought-after 1998 demo), it’s fascinating to hear Isis stripped of their studio sheen, and these lo-fi rehearsal room renditions reveal some hitherto unheard nuances in these songs, allowing us a glimpse into the band’s song writing process. For instance, a work-in-progress version of ‘Threshold Of Transformation’ dispenses with much of the song’s latter half, and the two ‘Oceanic’ classics ‘Carry’ and ‘False Light’ are bereft of the haunting vocals of 27’s Maria Christopher, but still ring through with a profound, and at times vicious intensity. To think that these recordings are over ten years old is somewhat baffling, and acts as a potent reminder of just how rich the band’s back catalogue really is. The 17 minute ‘Grey Divide’ is the only unreleased track on this disc, and whilst it may not strike with the same clarity and force as some of the other songs on offer here, it’s still a great listen. The track has a somewhat loose, practice room jam feel, and the final riff is one of those awesomely time stretching moments of mesmerizing heaviness that this band was so damn good at.\n\nThe second disc is a more eclectic listen, beginning with Isis’ tribute to the Home of Metal (or Birmingham as it’s otherwise known) in the form of covers of Black Sabbath’s ‘Hand of Doom’ and Godflesh’s ‘Streetcleaner’. These tracks were originally only released on the ultra-limited ‘Sawblade’ tour EP (although ‘Streetcleaner’ also turned up on the band’s split 7” with Pig Destroyer), so it’s great to finally see them granted a wider release. Despite Turner’s Ozzy impression initially sounding a little odd, hearing the band chug their way through ‘Hand of Doom’ is a lot of fun, and their rendition of ‘Streetcleaner’ is nothing short of apocalyptic; an absolutely devastating cover that respectfully transforms the song into Isis’ own, it’s worth the asking price alone!\n\nOriginally found on the two singles that followed the ‘In The Absence Of Truth’ albums, the two remixes that follow are a bit of a mixed bag. The Melvins & Lustmord remix of ‘Not In Rivers, But In Drops’ adds several dense layers of murky reverb to the song and clouds it in a thick fog without really offering enough to distinguish it massively from the original; it’s not wholly successful, but is an interesting addition nonetheless. Dark ambient artist Thomas Dimuzio’s take on ‘Holy Tears’ fares better – sure, it may initially sound pretty much like the original with some unnecessarily bombastic flourishes, but Dimuzio comes into his own when stretching out the song’s calmer middle section and reducing the outro to a long, hypnotic drone, revealing hidden textures in the Isis sound in the process. Unfortunately the collection’s title track is a bit of a non-event, a brief ambient interlude that feels like an idea that has yet to be fleshed out, and is over all too soon. A shame, because if this had been allowed more time to breathe it could well have become something truly astonishing, with a similar vibe to much of Turner’s work with House of Low Culture\n\nThe pair of tracks from the split 12” with the Melvins will be more than familiar to most of the band’s fans, but just in case you slept on it the first time around, these two songs are a powerful continuation of the sound they were cultivating with ‘Wavering Radiant’. ‘Way Through Woven Branches’ showcases Turner’s more confident sounding clean vocals, and it’s shifting rhythms and transcendental pulse recall some of Tool’s later work, whilst ‘Pliable Foe’s major key pathos somehow manages to sidestep the schmaltz and weave a fairly captivating atmosphere instead. The acoustic version of ’20 Minutes/40 Years’ is slightly less affecting than one might expect, but is nevertheless a good moment to end on and an engaging footnote in the band’s history.\n\nWhilst the more rabid Isis fans will already be acquainted with much of this material, there’s more than enough quality stuff here to warrant a purchase, especially if you haven’t kept up to date with the band’s EP and split releases over the years. ‘Temporal’ isn’t essential, but is far from just a cash grab; with the exception of the slightly odd choice to have ‘Carry’ lead into ‘False Light’ rather than the other way around, these tracks have been lovingly ordered with a satisfying listening experience in mind, and this is a fantastic posthumous release that’s sure to enrapture fans all over again. If listening to this doesn’t make you want to re-spin your dog eared copies of ‘Oceanic’ and ‘Panopticon’ and then weep at the thought that you may never catch this awesome band live ever again, I don’t know what will.\n\n(Originally written for http://destructive-music.com/)\n",
        "\nOkay, I was wrong. I was terribly wrong. This is not just a passable album. With their penultimate release Isis turned me off initially (in 2006) but I was young and stupid then. In the Absence of Truth is indeed a journey one of its kind, a journey set in a peculiar dream in which one experiences both things already seen but those unknown and singular as well. Landscape is blurry and distorted, seen through hundreds of rainy lenses. And there is bleakness.\n\nEvery album from the band has different sound that suits its concept and highlights its specific mood. In the Absence of Truth is obviously not an exception. As this is their most \"post\" and least \"metal\" record, the sound is more airy and organic than ever before. Its oneiric, gloomy atmosphere is highlighted with organic guitar distortion and naturally sounding drums. Since we're on the subject, the drumming is based mainly on tribal-sounding tom-tom patterns. It may seem a bit repetitive to some, but it suits the mood pretty well.\n\nI took a dislike to this album due to strong Tool influence I immediately spotted in it. I loved Tool at the time and Isis seemed to blatantly imitate them. I was obviously an ignoramus as this is not the whole truth about In the Absence of Truth. While being strongly influenced by Tool's evolutionary approach to composition and unique mood of Lateralus, Isis adds a huge amount of their own style to the music. Sludgy heaviness and genuine depressive mood known from such albums as Panopticon and Oceanic, pervades the record thoroughly. With the opening track the listener's mind is immediately flooded with feelings of anxiety and imminent menace. From now on the music takes him to terrains of sadness and shows him surreal, gloomy visions of life and death. It's an intriguing construct made of sludgy build-ups, atmospheric post-rock passages and emotional post-metal climaxes.\n\nPlenty of post-rock albums oozed through my headphones within the space of the last 3 years and 99% of them bored me half to death. I'm glad I survived long enough to finally appreciate Isis. Although the album is a bit uneven, it has some real post-metal masterpieces on board. And most of all, unlike legions of uninspired post-rock clones, this really is emotional and deep stuff. Let it sink in your mind. It's worth it.\n\nTRACKS BY RATINGS: 10/10[masterpiece!!!]: Not in Rivers, but in Drops; Dulcinea || 9/10[fantastic!]: Holy Tears; 1,000 Shards || 8/10[great]: Wrists of Kings; Garden of Light || 7/10[very good]: Over Root and Thorn || 5/10[not bad]: Firdous E Bareen ||\n\n-- Originally written for Metal Music Archives [www.metalmusicarchives.com] --\n",
        "\nIsis was a high quality band from the beginning. Its surprising to see how well recorded and put together this is, considering it is one of the band's earliest recordings. Mosquito Control is one of the heaviest and most brutal things Isis have ever created. For anyone who only knows their recordings from their sophomore Oceanic and onwards, brutal may seem like a strange thing to say about Isis. That period is where the band's most popular works lie. This EP is a sludgy mindfuck, with brutality and aggression at the forefront, mixing with unique atmospheres. In a saturated metal climate, true menace and intensity is often a rare sight. Many bands can get halfway there or create a convincing enough sound, but it is rare for a band that can truly transport your mind to another world. This is a rare beast; integral in its approach, not being brutal just for the sake of it, but because it is necessary to realize the mood and atmosphere Isis set out to create.\n\nFans only familiar with Isis's later work may be surprised by Aaron Turner's vocal approach. Clean vocals are omitted, and what we have is extremely raw; something that falls in the middle of the typical barked style post-metal vocals and something resembling an aggressive and full black metal rasp. These vocals are truly menacing and are surely not without a vast amount of power. Also powerful, is the production. Full, bass heavy and unrelenting, it is the glue that holds Mosquito Control together. Many of the often repetitive riffs, as well as the fucked up drone that ends the album, would become monotonous and powerless with weak production. The production is unpolished and raw, except in the atmospheric parts. This allows Isis to create a true feel of menace and impending doom. Without the raw and dirty production on the rhythm guitar, the album would be castrated.\n\nAaron Harris's drumming is talented and distinct. The drums are high in the mix, but never overpower the song or distract the listener from what else is going on. Not too technical, his drumming is hard-hitting. It is an unfortunate tendency among metal bands to bury the bass, sometimes to the point where there may as well not be a bass player at all. \"Mosquito Control\" does not fall into this trap. The bass is high in the mix, occasionally becoming an indispensable part of the song.\n\n\"Poison Eggs\" is the stand out track of this release. It starts of with a wonderfully mournful guitar melody and a strange static echo. It builds up from there in typical post-rock fashion. This song, however, is anything but typical. It has a distinctly destructive presence, different from most bands tagged as post-metal. \"Hive Destruction\" is the other song most worth mentioning. It is faded into from the previous song, a technique Isis employs seamlessly. The creepy intro sets the mood for whats to come. This song showcases some diverse riffs. The mandatory sludge riffing is in attendance, but Isis reaches beyond the limitations imposed by (sub)genre. A devastating thrash riff is one of the high points of not only the song, but the entire EP. Throwing a twist at the listener, there is a brief section that includes a bluesy stoner metal riff.\n\nTo get the most out of this release, multiple listens are a necessity. There are subtleties that may not be picked up on that first casual listen. Various intricacies and influences converge to form the full picture. Atmospheric parts are quite plentiful, although they aren't as overtly beautiful and serene as Isis's later works. A noticeable influence of crust and hardcore is apparent throughout the EP; it bleeds energy and life into the soundscape. There is sometimes something going on along with the dirty, severely down tuned riffs. This often is in the form of a dissonant drone. The drone element is at its peak in the outro of the album. In the last part of \"Relocation Swarm\", the track is taken over by a creeping drone, backed by a mammoth riff. The riff eventually fades out and the track becomes a mess of distortion, which seems to symbolize pure destruction and devastation. It also feels relevant to the mosquito theme. It may seem strange to assert that droning can be linked to a theme (one relating to animals, no less), but the droning sometimes seem to vaguely resemble a mosquito's buzzing, but more than that, it just has certain qualities that seem to mesh with the lyrics and symbolism surrounding the album; something that words attempting to describe it can't quite capture - you just have to feel it out by listening to the track.\n\nThe works of Isis are highly based on themes. Oceanic tells a story, although in a vague way that is highly drenched in symbolism. Panopticon is based on the prison structure conceived by English philosopher Jeremy Bentham, and moreover, is a metaphor for the state of modern society. This is something they have been doing even prior to releasing their debut full length. In this release the theme is based around mosquitos, which is apparent in both the lyrics and artwork. The song titles all relate to this theme. The lyrics are intricately written, and although they are relevant to the main theme, it is hard to help but think that all this mosquito talk is meant to be a metaphor for a much broader issue than mosquito control. The lyrics are some of Turner's best, full of metaphors and poetic tendencies:\n\n\"Lies are falling, fall from wings, the walls are\nseething, seething with disease. The drone is\ndeafening from the malcontent swarm, lies from\nwings are falling, blood in rivers runs, lied\nfrom wings fall hive destruction.\"\n\nFrom beginning to end, Isis were a truly original force, forging their own unique sound instead of following blindly. Refusing to stick to the limitations of a preconceived metal sub genre, Isis have been staying true to themselves and doing what they feel like since the beginning. Mosquito Control, one of Isis's earliest works, is a prime example of this. This is brutal without a doubt, but never mindlessly so. There are atmospheric sections weaved into the mix, something that would be greatly expanded on in Isis's subsequent releases. This EP is a monolithic offering, engaging the listener in a truly dark and harrowing journey. Every musician shines, but never attempts to hog the spotlight; this release is a balance, full of intricate details which may at first appear hidden. Any attempts to show off would throw the whole thing off balance and the magic would quickly come crashing down. This is raw and inaccessible, and therefore isn't suitable to the masses or even the majority of metal fans. However, this will truly be spectacular to people who are into this type of thing.\n\nOriginally posted at:\nhttp://ifthisishellthenimlucky.blogspot.ca/\n",
        "\nIt’s not every band that can release more live albums than studio LP’s and still have fans clamoring for more. While Live VI is the third proper live set from post-metal giants Isis (the other three were haphazardly assembled bootlegs), it’s significant for two reasons: it’s the first piece of music from the band since their 2010 dissolution, and it’s the most comprehensive document of their live show yet released. Despite the set being one continuous show, six different albums (including early EP’s Mosquito Control and The Red Sea) are represented here. The resulting sonic palette is accordingly diverse, from the primal raging of Red Sea and Hive Destruction to the brilliantly executed centerpiece trio 'In Fiction', 'Holy Tears', and 'Weight'. The latter even includes singer Maria Christopher, whose reverb-drenched mantras were sorely missed in previous outings.\n\nFor such a disparate collection of songs, the set list flows remarkably well. The band takes the stage as a horror-movie industrial loop fades in, then bursts into the crushing swells of 'Hive Destruction'. Having emphatically broken the ice, Turner and company continue with a fantastic rendition of 'So Did We', which seems to have evolved somewhat over the years. The initial riff, for instance, is slightly more streamlined than the Panopticon version, and drummer Aaron Harris throws in dramatic double-bass fills as the song builds. The clean verse in the middle is an album highlight, with Turner’s echoing cries about resisting the passing of time creating a haunting juxtaposition to the song’s ever-increasing momentum. 'Not In Rivers, But In Drops' enters over rolling tom-toms, forsaking brutality for eloquent layers of counterpoint guitar, enduring several sonic shifts before finally giving way to the incessant, coarse riffs of the misleadingly-named 'Gentle Time'. Each song peaks and troughs, the three guitarists meticulously creating an aural landscape. At times the music seems a medium through which Aaron Turner describes a painstakingly assembled primeval world, raked by powerful storms of distortion strategically parting to reveal fields of luscious melodies. Metaphorical tangents aside, there just seems to be something greater at work behind all this.\n\nThe songs’ full visceral effect is made possible by the excellent sound quality, which here is worlds better than the first four albums of Isis’ live series, and another step up from soundboard recording Live V. Aaron Turner’s vocals, in particular, are clearly heard amidst the thunderous layers of guitar and percussion. As mentioned before, Christopher’s presence further sets the performances of Oceanic cuts 'Carry' and 'Weight' apart from their incomplete versions elsewhere. As with Live V, the pieces run uninterrupted, including sound bites of the crowd between songs. This continuity gives a strong impression of the listener actually being at the show, making it easy to drift away in the music without constant reminders that it’s just a recording. Isis were always first and foremost a live band, and the “transcendent” live experience they aim for is very nearly replicated here. Just close your eyes and let the music take you wherever it may, be it a prehistoric world or the front row at a concert. Or maybe both at the same time.\n\nRecommended:\n\nSo Did We\nIn Fiction\nWeight\n",
        "\n(Originally posted by me to the Metal Music Archives: http://www.metalmusicarchives.com/)\n\nOh the things for a single college boy of 18 years to do while he is on spring break. I decided to take one of these days and hike to the top of a tall, rocky hill that overlooks the entirety of the town of Bedford and more in the valley below and beyond. Moreover, I wanted to use this scenic view as visual inspiration for a written review of Isis' Panopticon. So I packed up my notebook, my iPod, two bottles of water, and a sandwich. An hour later, I was at the designated spot.\n\nI actually acquired a copy of Panopticon during the summer of 2011 at my favorite CD store in Princeton, New Jersey for $9.99 new. I liked its scenic, post rock atmosphere mixed with sludgey yet calm metal riffs. In fact, the albums's art of a scenic, panoramic view of a large landscape is what eventually influenced me to hike up here on this hill, find a comfortable spot amongst these rocks, and write this review.\n\nAnd actually, the view of the town, some highways, partial forests, and open farm fields fits really well for the atmosphere of Panopticon. If I was looking at a 100% natural view like a great, vast forest or something, I'd probably be reviewing something like Blood of the Black Owl or Agalloch instead (hmm...ideas...).\n\nThis album's main advantage when conveying its atmosphere is that it is based on instrumentation. In other words, the lasting effect of the vocals on this album is very weak. They're there, but they only do one or two stanzas per song. The most is probably three in \"Wills Dissolve\" and \"Syndic Calls\". The convenient thing about the vocals though is that while the lyrics aren't easy to pick out and sing along to, they're still capable of at least being hummed along to.\n\nOn the instrumental side, all songs are played at a nice, slow-mid pace and never change tempo in the course of a single song. The riffs are varied, however, and seem to build up an atmosphere in each songs before reaching a climax in its final minutes. Guitar tone switched comfortably back and forth in each song from calm sounding post rock guitar and sludge metal riffs. Also adding to the atmosphere is a well utilized keyboard and decently audible bass. All this coagulates into the atmosphere of the album and, by extension, the panoramic view on the album art and of my own view of Bedford.\n\nAny album that inspires me to hike through the woods and up a steep, rocky hill to write a review utilizing the view I get from the top definitely is worthy of my praise. Panopticon is definitely one of the best atmospheric sludge metal albums out there, and an obvious necessity for fans of the genre. And I'm definitely glad I got this little adventure early in this week, because it's raining later; and when it's not raining, I'm going to be working.\n",
        "\nI remember the day I heard Isis broke up. A fairly overcast day by all accounts, and I was left hating myself for never getting tickets to the last show the post-metal giants would ever play in Vancouver. One of the sadder music moments in 2010 to be sure, but they can't be said to have left the scene without one last great album. While not my favourite of the works Aaron Turner and company have crafted over the course of their career together, 'Wavering Radiant' concludes the Isis saga with a dark and brooding piece of metal no less worthy a contribution to their catalogue than any other.\n\nMusical comparisons to the band Tool are certainly no stretch of the imagination; it feels as if through their contact, Isis has assimilated part of that band's bass-heavy sound and rhythmic builds into their own formula. While I might not like Tool, these new elements do add a dark feeling to the music that really works. The tracks here are generally drawn out with sludgy riffs, psychedelic ambiance and Turner's distinctive baritone. The music is well- played, but moreso in the great choice of timbres as opposed to any flamboyant technical playing, of which there is none here. Instead, Isis opts for an ironically mellow approach to their metal; while there may be growls and heavy riffs here, the sound never feels out of control. This high sense of calibration and intention throughout the songwriting makes the heavier moments feel a bit boring. Isis' strength here however lies in the more atmospheric segments of the music, which are done absolutely masterfully here.\n\nThe lighter, more post-rock oriented moments of 'Wavering Radiant' turn out incredibly; mixed generously with psychedelic effects and experimentation with noise effects. On top of this, Aaron Turner's clean vocals work perfectly for this style of music, equally as brooding and as downtuned as the guitars themselves. The sludgier sections of the album are a bit more hit-or-miss, especially towards the second half of the record. While the first three tracks of A-class material, the interlude title track onwards can be a bit more of a bumpy ride, resulting in a closing track ('Threshold of Transformation') that feels like it simply peters out, rather than delivering a real climax to the music.\n\nA great album overall, although it does feel as if Isis has left us with a would-be masterpiece; one that could have easily become a classic with a few improvements and extra considerations put into the sound.\n\nRest in peace, Isis.\n",
        "\nIs 'sleepy' a valid thing for a piece of art to make you feel? Look, I understand that Isis' goal is not to be the heaviest band in the world. I have perspective; I know I'm not listening to Devourment. But it's beside the point; I don't think any matter of style really justifies how oppressively still this music is. I'm at a loss as to what actually happens in this music (which to me seems to be incredibly simple despite what others say); it seems to just wander a huge amount without ever arriving at a destination.\n\nThis is ostensibly metal but it just feels like post-rock to me, which is sort of curious since 'Panopticon', the following album, was supposed to be one of the instrumental releases in establishing the post-metal style. But shit, calling this metal would be tricky for me; Isis doesn't really have any riffs, drive, aggression, or heaviness. They're loud, occasionally; boy do they love to be loud. It seems that literally every big, climactic moment on this album is caused by volume increases, and Isis mercilessly beats the crescendo trope of post-rock to death song after song. It's as though they have no idea of how else to create excitement for the listener except through slow, gradual buildups of volume. Visionary artists my ass.\n\nPost-rock is constructed sort of like ambient music: small, simple elements are slowly piled on top of each other and selectively subtracted to creating a shifting wall of sound that changes in nearly imperceptible ways. A lot of ambient music is made with electronics, which naturally creates something that's less varied note-to-note than physical instruments; it's cool, I get how it is. Isis, however, has no such excuse. On 'Oceanic', they have the bad tendency to repeat themselves verbatim for long stretches of time, with simple, five note guitar lines (can't really call them riffs) looping seemingly endlessly and not driving the songs anywhere. Most of the variation seems to come from the drums, since Aaron Harris apparently has a fetish for randomly placing bass drum notes from measure to measure. Apart from that, nothing really happens; it's just a collection of meandering, mostly clean guitar lines that rarely add up to anything in the end.\n\nThe problem with 'Oceanic' is the one-dimensionality of its songwriting. Do you not anticipate that Isis is going to go for a crescendo as a climax rather than trying a different construction? Really now, don't you? Considering the vast similarity between tracks on this album, this is an inexcusable fault for the record. Do you have any idea how tiring it gets listening to Isis churn through low-volume chug riffs, clean guitar noodling, and the occasional brash crescendo over the course of a fucking hour with basically no variation demonstrated? I really don't understand how this can be revered as a complex, fascinating release when nearly every turn the songs take can be anticipated from miles away. Well, the answer is obvious: metalheads don't listen to post-rock, so when confronted with the conventions of a genre they've never heard before, they immediately spring to 'genius' as the explanation.\n\nOddly enough, I really enjoy 'Panopticon'- in fact, it's the only Isis album I really like. It's really the perfect balance of the band's aimless noodling and a more focused sense of songwriting. 'Oceanic', on the other hand, just staggers around in the former without ever evidencing a greater goal for their songs. Frankly the post-metal genre has become to oversaturated over the past few years that you could probably walk into an FYE and trip over twenty better albums than this one. And if you don't like it, start off quiet on your crash cymbal and then hit it harder.\n",
        "\nEven though it’s been six months (at the time of writing of this) since Isis ending their career I still feel pangs of loss every time I listen to one of their classic records. Their death was certainly premature in my eyes. The post metal movement has become so bland and predictable in the last few years and it needs every interesting band it can get. Of the post metal “big four” (Neurosis, Isis, Cult of Luna, and Pelican if you’re wondering) Isis were the ones always pushing their sound, and subsequently the sound of their clones, into new and uncharted territory. I suppose there’s something to be said for quitting while you’re ahead of the rest of the world, but it still bums me out.\n\nThis split EP with weirdo legends, The Melvins, serves as closing chapter in the Isis story. The two songs from the Isis side of the split are both outtakes from 2009’s “Wavering Radiant” and capture a similar mood to the music of that record. Like the songs on “Wavering Radiant” the two songs here are far more elaborate and prog influenced than the music that made Isis famous. There are tons of sections to these songs, and within those sections each instrument plays around each other rather than locking into a single groove. The main difference is that these songs are even less “metal” and abrasive than the ones that made it onto the full length. Both songs predominantly feature clean vocals for over half of their runtimes, only bringing the harsh vocals and low register riffs in for the codas. This heavy emphasis on the vocals is sure to be a shock for most Isis fans, but not to worry, these tunes still feature plenty of Isis trademarks such as rolling tom beats, squealing reverb heavy leads, counterpoint between the keys and guitars and gradual build. While these songs don’t explode the way a song like ‘Threshold of Transformation” does (although “The Pliable Foe” gets real close near the end) they should give fans of the modern Isis sound a sense of closure.\n\nThe Melvin’s side of the split is made up of two alternate versions of songs from their most recent album. I haven’t heard the originals so I can’t comment on how they compare, but overall these tracks don’t do much for me. “Pig House” is a lurching percussion heavy rocker, typical of the modern Melvin’s sound. Rhythmically the song is interesting and takes a fair amount of unexpected twists, but there is absolutely nothing memorable happening in the riffs or the vocal melodies. The riffs are quirky but don’t stray far away from hard rock conventions to be attention grabbing, and the guitar tone isn’t anywhere near as thick as it should be. “I’ll Finish You Off” is even goofier sounding. The vocals are sung in a childish falsetto and the song is so directionless that it appears to move backwards rather than forwards. Part of me suspects that this is yet another practical joke played by The Melvins on their fan base. Or maybe I just prefer it when they go for the drone rather than the good times.\n\nThis is a pretty strange pairing of bands. One super artsy young band struck down in their prime, and an older group of goofballs screwing around. As an Isis fan first, I would still recommend this split, even if the appeal of the other half is lost on me.\n",
        "\nAs suggested by the tracklist, this is pretty much a fans only sort of release, but (...as suggested by the tracklist) this is essential for those who like a bit of Isis. Ever since ITAOT came out, these guys have had a, uh, \"proud\" tradition of almost completely ignoring their vastly superior back catalog in favour of their newer, floater, far worse stuff (in a live context), so any chance to hear songs like Hym and False Light in a live context should be appreciated. It wouldn't surprise me if the last time most of these songs were played were at this gig.. and what a real shame that is. Any chance of doing this with Celestial sometimes?\n\nSo yeah, what we have is Isis playing one of their best albums (always been more partial to Panopticon, myself) pretty competently, with a rather good mix- although when I heard it was Broadrick mixing, I was sort of expecting something amazing. Oh well. If you're a big fan, do the math; this is well worth tracking down. I must concede that I originally downloaded it but will be hitting the ebay soon in the hope of getting it relatively cheap.\n\nIt's Oceanic, so of course, the songs on offer are stunning. Back in '02 or so when this came out post-metal (hate that term, but it seems to have become the accepted one these days..) was about to hit it's peak; this, Panopticon, the few CoL albums around this time, Neurosis getting in on the game, man, it all sounded so new, so fresh, so epic. Oceanic to this day is still an utter triumph; a brilliant and very successful mixture of post-rock structure, fragile Mogwai meanderings, stoner doom-ish riffing, and an intoxicating and very immersive atmosphere. It's a very pleasurable listen without ever being too melodic and Agalloch-ish, the songwriting is near flawless, so on and so forth. It's no surprise that in four or so years this genre would pretty much be declining; there was nowhere else to go, no other way to improve.\n\nThe band throw themselves into the many monolithic tunes with a lot of enthusiasm, the production's real dense and bassy, in general this is just a great release and easily the best live release thus far. My usual favourites like False Light and Hym (definitely the best Isis song) aside, I was really surprised as to just how damn good The Other was, and the slightly re-arranged version of Maritime (we love e-bows!!!) also really succeeds. I'd love to hear something like this done in respect to the other two early full length- or for that matter for Isis to get some sense and return to this older, heavier, far better sound on their final EP.\n",
        "\nOne of the more popular acts to originate in my neck of the woods, I've always had kind of mixed feelings on Isis. I thought their early material was plodding, boring, and extremely overrated metalcore. But I have enjoyed some of their later releases, their shift into a more experimental direction of post-rock and drone has opened up so many elements in their sound.\n\nThis new EP is a good example of the latter, and I'm happy to say I really enjoyed the title track. It's hooky, it flows so well together, from its dreamy opening to its rock out riffs and even the desolate growling which pops into the middle. There's also a live version of the track, which sounds okay but you'll be too engaged in the studio track to care. The other track here is a Thomas Dimuzio remix of \"Holy Tears\", and it too is a delight.\n\nIf you love Isis, you're in for a treat here. Both of the studio tracks are well worth hunting down and you'll listen to them repeatedly. Being not the biggest fan in the world, I still really enjoyed this. You also have to love that cover art, one of the most striking cover images I've seen in some time.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThree years since 2006’s critically acclaimed “In The Absence of Truth” Isis have returned with their fifth studio album entitled ‘Wavering Radiant”. From the onset they don’t waste much time either as the opening track “Hall of the Dead” kicks off after a few seconds of silence with pummeling, chug laded riffs accompanied by contrasting, uplifting keyboards that give you an immediate sense of wonder of what is to come. As always on Isis albums the production is flawless with none of the instruments being overbearing while at the same time creating an atmosphere that one would expect to hear in a live setting. The opening track continues to build and progress with the initial harsh growls of Aaron Turner that manage to transition to an ambient section quite nicely. The ambience then builds towards an ending that reaches bombastic proportions thanks to the subtle use of keyboards and Aaron's incredibly good clean vocals that bring the song to a rejuvenating ending that sets the pace for what is to come. \n\nIt is from this point on that not only does the album not falter but grows and becomes stronger with seemingly each and every track. The development in Isis’ evolution continues here as well as they have slowly been incorporating more post-rock elements on previous releases and Wavering Radiant is no different as the influence becomes greater than ever and I for one, being a fan of post-rock feel that this only makes sense as the band moves further in developing their staple sound that has taken the metal world by storm and has resulted in a plethora of bands that have followed in their wake. The second track, “Ghost Key” is among one of the best songs they have ever done as it is both incredibly crushing at times and yet totally bottomless, even ethereal at others in its contrasting styles. The album continues in similar fashion on “Hand of the Host” and “Stone to Wake a Serpent”, keeping the listener guessing and wondering what is next on the horizon, never once sounding stale or unsure of where it’s headed.\n\nTo be frank, Wavering Radiant is a puzzle where all the pieces fit perfectly and expresses a wide range of emotions as it rears its ugly head with crushing blows only to displace the vengeful rage with key transitions that also display the beauty, sadness, and hope Isis also wish to express as well. Each instrument is played in perfect coherence with front man Aaron Turner leading the way in what has to be his best vocal performance yet in his already acclaimed career. However, I don't want to down play the absolutely perfect way in which the synthesizer in particular is used in this album. Never once is it over powering as it manages to always create a necessary, subtle base of the atmosphere Isis is attempting to create but when It does come to the forefront on this album, it elevates the songs to whole other level.\n\nI mentioned earlier the continued post-rock influence in Isis’ sound and there is no better example for it than on the track “20 Minutes/40 Years”. This track reeks of patented Explosions In The Sky worship in its use of light ambience and subsequent building of the drums in relation with noted EITS guitar melody that transforms the song into one of the finer, more beautiful sounding moments in Isis’ storied career. It is at the closing of this song that you reach the albums conclusion “Threshold of Transformation” and simply put, this song is a monster. It is the perfect closer to an already grandiose effort and highlights all of the elements on this album that I’ve referenced that make it so very good. Some of the rhythms and transitions are down right bone chilling at times through the first half of the song only to be completely offset by more post rock influenced ambience and soundscapes that culminate with the greatest, most heart felt atmosphere in the closing minutes this band has ever conceived. \n\nAs hard as I try, words can’t really describe the feelings that are stirred up inside me every time I listen. The title of the song is more than fitting as I feel that the prior album was the threshold of their own transformation in that while being a solid album with a few stand out tracks, something was missing, it felt incomplete, unfinished. However, with Wavering Radiant, the transformation is complete and the end result is the best blend of metal, ‘core’, and post-rock I have come across. This album is constantly expanding and contracting, walking a fine line between genres this album breathes, it moves and most of all it creates. Isis remains the masters of their craft and in doing so with this latest offering, have produced in my eyes their undisputed masterpiece. A must buy for Isis fans and fans alike of this growing infusion of post-rock in the world of metal. \n\nStand out tracks; Ghost Key, Threshold of Transformation\n",
        "\nAfter a few years of hearing everybody and their mothers loving this band I finally decided to buy an Isis album. I’m still new to Isis so I can’t really compare their previous works to this album but this is a review of the Wavering Radiant not their discography. \n\nClocking in at nearly 55 minutes the listener is submerged into atmospheric post-rock/metal, with hints of hardcore. I’m not a fan of hardcore but Isis doesn’t use that pseudo tough guy attitude that bands such as Hatebreed use. My problem with the vocals is that they seem to be buried in the mix. The heavier sections on the album don’t have that aggression I was expecting. On a side note, some of the growls remind me of newer Dismember….to all those Dismember fans out there. Clean vocals remind me of new era Enslaved. Again, there is nothing wrong with the delivery but it feels like it’s buried in the mix.\n\nThe music itself is excellent. Isis has a lot of post-rock influences mixed up with heavy metal riffing. I found this to be refreshing as compared to most post-rock bands which tend to sound the same. Isis on the other hand weaves in and out of post-rock and metal for a more diverse listen.\n\nThere are no real highlights on the album, which I prefer. I love albums that demand you to listen from beginning to end. Although I would say 20 minutes/40 years & Hand of the Host do get more spins. Plus the last half of Threshold of Transformation is a very well though out ending to the album.\n\nAll together, minus the vocals buried in the mix, Wavering Radiant is actually worth the $14 dollars I spent on it. From my experience so far, Isis seems like a band you need to give your full attention to. Wavering Radiant has finally caught my interest in this band, so recommended for new fans.\n",
        "\nI wouldn't exactly call this a return to form, but damn it's a lot better then ITAOT, and certainly Isis now have a rhythm section that's one of the best in town. Wavering Radiant isn't as good as Panopticon or Oceanic (when are these dudes going to learn that everyone will be much happier when they stop worshipping Tool and return to the riffs) but it is good, which is far more then you can say about their previous release.\n\nThis album's a pretty strange one, and were it not for that distinctive bass tone and Turner's vocals you could almost think this was a different band. Songs are way more convoluted and take a heap of twists and turns, Harris is suddenly tech-ing his drumming up, and Isis have discovered layering. Not to say that this was ever a band with minimalist pretensions or anything, but now every bit is just stuffed with different guitar layers, bass(es?) doing more guitar-esque layers, e-bows, synths, vocals, everyone getting in one some big gay layer-orgy action. I wouldn't call it chaotic or anything but everything's a lot more over the place, certainly this is the least accessible and predictable Isis album yet.\n\nThe songs themselves don't always benefit from this new found compositional complexity, though. Similar problems were had on ITAOT; good ideas getting pushed aside for the sake of what? Progression? I'm not entirely sure, but certainly many of the best Isis songs have relied quite happily on the repetition and building of two or three sections; so it's strange why they change parts over and over again.. Good examples would be \"Ghost Key\", where a brilliant opening few minutes is destroyed with perhaps a bit too much enthusiasm, and \"Hand of the Host\", where everything reaches an absurd sort of self parody; 11 minutes of no real structure or purpose. What's the point? What are they trying to achieve? Isis are a band best at doing the epic five minute build, and when they keep changing every minute or two you can't but help but feel that they're shooting themselves in the foot.\n\nCertainly Isis aren't as reliable as they used to be; there's still some very good songs here, though. \"20 Minutes/40 Years\" is classic Isis; a solid first section with some earth shattering bass, then more bassy brilliance through a floaty, blissed out mid section before a really triumphant ending riff comes. One that's up there with \"Hym\" and \"So Did We\" as Isis at their best. \"Threshold of Transformation\" seems a bit iffy at first but quickly becomes awesome and stays that way; again, following that classic Isis formula of keeping it simple, drawn out and completely epic, with some twisting, math-y riffs thrown in for good measure. Indeed, most of the songs are rather good, just be prepared to listen to them thirty times before you get the structure.\n\nIt's worth commenting on the instrumental efforts, too. In this sense the album is less then the sum of it's parts; the rhythm section is fantastic, Turner's singing is becoming pretty good, the guitars are wailing and going nuts, yet compared to the sparse simplicity of Panopticon, well, it fails rather miserably. The rhythm section is [i]amazing[/i], though. The snare 'n' hi hat drum machine from Panopticon is gone, to be replaced by three octopi. Harris does keep a tight beat here and there but seems to be happy playing various mathy things that surely can't be that easy; his work in \"Ghost Key\" is terrific in all of it's tom-ness, whereas \"Stone to Wake a Serpent\" has some really catchy lines. Mr.Bassist Man meanwhile seems to go from strength to strength; killer bass lines throughout, excellent use of effects... Jeff Caxide is definitely one of the most underrated bassists in the world right now.\n\nSo it's a good album; there's some really great moments, these guys have got way better as musicians (there's even a few odd time riffs here and there), and it's all a pretty ambitious effort. It just seems that Isis have struggled to give their songs the same catharsis that was present on earlier albums, though. Very rarely do the songs feel like they end when they should, and while you'll eventually get some satisfaction from the crescendos and climax only \"20 Minutes/40 Years\" offers the same sort of classic wall of sound orgasm that \"Carry\" and \"From Sinking\" offered. It's good and certainly an improvement, so here's hoping Isis manage to step up again on their next album.\n",
        "\nWow. Isis still has it. It never ceases to amaze me how Isis can find way to compact a lifetime of emotion and passion into seven tracks. It is absolutely mind-blowing. The one thing I noticed with Isis's last album, \"In The Absence of Truth\" was that the songs didn't seem to take off nearly as much as they did in \"Panopticon\" and \"Oceanic.\" It seemed the like the build ups on the album only led to a somewhat disappointing end of the track. That problem was evidently fixed though. There is so much more heavy riffage and atmospheric sections that mend well together on \"Wavering Radiant,\" then there was on \"In The Absence of Truth.\" \n\nAaron Turner's vocals sound crisp as fuck, yet at the same time, mellow and pristine when he is actually singing. His tones work well with the guitars and bass throughout all of the tracks, which at times gives the song a heavier feel, and at others, gives it a more mellow and atmospheric touch. Either way, the vocals are stellar and as good as ever on this album.\n\nThe guitar tone/riffs/technique were top notch on the album as well. The band continued to incorporate new and heavier riffs while still gaining more of the atmospheric elements as well. This holds specifically true on the track \"Stone To Wake A Serpent.\" It is by far one of the heavier and atmospheric tracks on the album. So, you really get the best of both worlds with it.\n\nThe bass was tuned down very low, and has a nice crunch to it. It is audible amongst the heavier riffs as well, which was a surprise, and goes as a compliment to the production of this album, which is actually great. The bass lines plod along as always, but live to keep a good pace for the song. I can't complain at all.\n\nThe drums, as expected, kick ass as well on this album. They keep the beat, but at the same time, are original. I caught myself numerous occasions on my third and fourth time through this album, trying to drown out the guitar, bass and vocals so I could hear the drum beats. They are interesting and fresh. They compliment the album as a whole a lot.\n\nOverall, this album is worth more than it is being priced as anywhere. I highly advise Isis fans to check it out, and this is also a good gateway album to get people started on Isis. And, even though I used \"In The Absence of Truth\" a lot as a comparison, yes, this is a better album, but \"In The Absence of Truth\" is still a good album. Stop reading! Go buy this!\n",
        "\nI have been following Isis for quite some time now, and I would like to say right off the bat that they are one of my favorite bands. They are surely one of the most unique and intriguing metal acts around, and never have I come across a band with such dynamic and textural mastery. For those familiar with the group, their evolution from angst-filled hardcore brutality on \"Mosquito Control\" to their matured and layered / atmospheric sound on \"In The Absence of Truth\" is apparent, and most fans were extremely anxious and eager to see where 2009’s \"Wavering Radiant\" was headed. Frontman Aaron Turner and the rest of Isis collectively have the mentality of never wanting to repeat what was done before, and they feel it is important to keep evolving and exploring new musical ventures - so the nature of \"Wavering Radiant\" remained a mystery. For the past couple months, infrequent and ambiguous advertising and silent promotional videos were posted on their website and myspace page, which for any fan surely built up immense expectations, to which I was almost sure wouldn't be met. I am happy to say folks that my expectations were completely met, if not surpassed. \n\nAs for the actual music, Isis proudly delivers some of the most enormous and heart-wrenching compositions to date. They have returned to form somewhat, abandoning the predominantly ambient feel to \"In The Absence of Truth\" and including the heavy and immense sound that was heard on \"Panopticon\". However, there is actually a balance to be heard on \"Wavering Radiant\", which is the fusion of both thick atmosphere and straight up post-metal. The familiar cascading clean guitars are present throughout the cd (most notably on 'Ghost Key'), as well as the powerful and heavy guitar tone heard from as far back as their 2002 release “Oceanic”. The guitar parts are written to be less parallel and uniform as in the past, with each left and right pannings to be well thought out and complementary to each other. Caxide lays down perhaps the best bass lines out of any Isis album (which is hard to fathom), filling in the underbelly of Isis' signature high-shelf tones. As for the drums, they are mixed incredibly well and the drumkit production that Sound City studios has been able to get sounds perfect. Aaron Harris also uses 2 different snare drums for the first and second halves of the album, to which the difference in tone isn’t too noticeable but each respective snare fits phenomenally with the music regardless. Harris also shows his creativity with excellent use of the toms (and rest of the drum kit for that matter), fitting drum beats and a variety of tasteful hi-hat patterns. A final aspect of the musicianship on “Wavering Radiant” is the vocals. Aaron Turner’s clean vocals are better than ever, sounding crisper and fuller in the mix and still incredibly smooth and relaxing. His harsh vocals are still as passionate and emotional as before with no significant change, and there is again a perfect balance between harsh / clean vocals throughout the cd.\n\nIn the end though, no review can properly do “Wavering Radiant” justice. Words get in the way of describing the true nature of this cd. The album flows like a great novel, where each track sounds like a natural progression from the one that preceded it. This album is as equally haunting as it is a breath of fresh air. The atmosphere and compositional power is so immense, and to fully get the experience of the cd you simply have to listen to it and immerse yourself in the music. It truly opens up new channels in your brain that you might have thought never existed, and you can really feel the soul of this album surge through you. Isis as a band believe that “Wavering Radiant” is their best record they have ever created up to this point, and I feel it is very plausible that we the fans will find truth in that bold statement.\n",
        "\nProgression doesn’t have to be extravagant, oh no. Isis have progressed over the years, whilst maintaining the consistency that has seen them rise to prominence. Its difficult to believe that this is Isis’ fifth full-length and that they’ve been around for longer than a decade because they still play with the same enthusiasm that took their sound to new heights back in the early days, at the turn of the century. Alongside the consistency, Isis have always managed to maintain there delightful sludge roots and hardcore background, shown most fittingly in the . Though the sound has evolved along the same lines as many other bands - towards sounding like Neurosis - Isis have managed to do what countless other bands have failed disastrously at - keeping their identity intact whilst still being able to induce similar feelings that bands like Neurosis have classically provided for many years now. Aside from the obvious influence, I cannot help but relate some of the material back to bands like Tool, who’re subjected to a lot of criticism from die-hard metal fans though, of course, there is a section that is in love with them. \n\nIsis, like Tool, construct unfamiliar and almost tribal sounding songs (which comes across in the subtleties of the record, not the most impacting elements) that disparage the normality of the scene, whilst welcoming experimentation with a passionate embrace. Although Tool have received a lot of criticism from sections of the metal public for being overly pretentious and downright dull, Isis have never adhered to these criticisms. From the early days of ‘Celestial’, Isis have always made it publicly known who their influences are, but they have also managed to set aside those issues and concentrate fully on developing their own sound, which has grown stronger and stronger as they’ve progressed through the records. In fact, ‘In the Absence of Truth’ was my definitive favourite after its release and up until now because, and this may be bold considering their illustrious history, ‘Wavering Radiant’ has surpassed all previous efforts in its successful bid to steal the crown of glory away from the hands of iconic records like the mammoth ‘Oceanic’, with its deeply affecting aquatic appearance, using a style of production that was as deep as the ocean and an approach on vocals that was as vicious as some of the life that lives within the mysterious depths of the dangerous sea. \n\nThe fascination behind bands like Isis is never likely to die down and for me, long may it continue. ‘Wavering Radiant’ is a fine example of what goes in to making a fine sludge record, one that can maintain its roots, but also allow more adventurous elements prosper; such as the supposed post-rock influences (something that many bands seem to be taking on these days). Although many people do argue that Isis have adopted new themes into their existing sound, the band haven’t altered too much since ‘Panopticon’, which is the headquarters for the movement towards a new style. Elements of ‘Celestial’ and ‘Oceanic’, like the exaggerated production that had a tendency to apply metaphorical hyperbolic themes to the songs and vocals, which surreal in approach since they obviously contain a lot of Turner’s accent - this small, but often noticeable difference between Isis and any other sludge band is important, no matter how small the details are because it provides us listeners with something fresh, with new appeal. \n\nTurner’s performance has always been the most recognisable and instantly appraisable aspect of the Isis sound. He is a constant source of enjoyment for the listener, who likes to indulge in listening to his passionate vocals that can come across as typical of the hard-faced genre that is sludge, but have enough character and evident pride to be taken lightly. A lot of the time, sludge is made or broken on the basis of the vocals. They need to be strong, but not overpowering. Often is the case that the vocals can harm the instrumentation, typically the bass and other subtle elements, but Turner doesn’t allow this to happen due to his experience within the field. Isis are too wise for errors that existed on records like ‘Celestial’ to still pose a problem for the audience nowadays. The modern day Isis is almost without fault, something which cannot be said of bands within the same musical bracket. In accordance with previous records like ‘Panopticon’ and ‘In The Absence of Truth’, Isis have resulted to notable walkways in order to direct their music down the right paths of life. \n\nFor example, the inclusion of clean vocals. This area of the construction is my personal favourite. Turner’s voice isn’t the most astounding, he doesn’t like to showboat like the vocalists of genres like power or progression metal - he just does his job accordingly and most importantly, fittingly to the sound of Isis. Songs like ‘Stone To Wake A Serpent’ ambitiously show the intent of Turner on his seductive clean vocals. They’re here to enhance the slower paced sections, mesmerise and taunt the audience as they toy with your emotions like a twisting and turning novel. His prominent harsh screams, which we all know by now since they’ve been a factor of Isis’ material since day one, are once again performed alongside the harsher sections of instrumentation. When the percussion begins to deliver beats that sound as if they’re building towards an unstoppable crescendo that is about to run you down like a hit-and-run driver behind a huge truck, and the distortion of the spellbinding guitars sets into its stride, magically possessing your essence and controlling the emotions it feels, you know you’re most likely going to see a typical Isis passage of play that incorporates harsh vocals. \n\nWhen the murky soundscapes and instrumentation slow down to that familiar aquatic formation, the emotive and harmonious clean vocals kick in and then you’re truly lost to the hypnotising ways of the Isis hybrid. The best representatives of Isis’ sound are ‘Ghost Key’ and ‘Stone To Wake A Serpent’, which both typically deliver the powerful performance we’ve come to expect from this ambiguous American act. The way in which Isis approach song structures can be seen more visibly here and its evident that there are two prominent methods of release. First, the slower construction that sees bass apply a more methodical sense of joy and the spiralling undertow of the guitars is really where that post-rock feel can be found. The spiralling effect gives the audience a chance to relive the days when Isis supplied a totally aquatic feel on ‘Oceanic’, which was aptly named. The variation in instrumentation is important, too. It reminds the listener that, although Isis have sounded fairly similar for a few years now, that they still have enough gas left in the tank to successfully pull off the same sound they themselves derived back on the enthralling ‘Panopticon’. The best yet.\n",
        "\nSince ITAOT, Isis has switched genres. They threw the ambient out the window and have become a more of post-rock band. The window, however, was closed so the ambient stayed in but tucked away in a corner, for you see the epicness of the earlier Isis albums is still there, just not as much.\n\nWhat made Panpticon-era Isis so great and set apart from other bands was the way they managed to make and 4-minute acoustic intro never get old and also how they weaved everything together, they were able to match the acoustic and ambient parts with the heavy and chuggah-chuggah-chuggah parts perfectly. Aside from not doing that so well anymore they seem to be adding more and more of the chuggah-chuggah-chuggah and losing in the epicness department thus making Isis a more straightforward band, while their earlier stuff sounded like an audible painting. Isis's new carreer step makes me think that they are taking the Dream Theater path in their new carreer, as in the quality is still there but the creativity is fading.\n\nDon't get me wrong though they still have it all, they have become more accessible no doubt about that but they managed to do it without dumbing down their music, for example, \"Hand Of The Host\" is a great and epic 10-minute colossus but on the other hand \"Stone To Wake A Serpent\" was very inferior and it felt too violent. Yes I just said a metal song was too violent and I say it because I thought it was a song that had great potential that was thrown out the window because it just seems rushed. Part of Isis's atmosphere was holding a simple riff for long and start to slowly work up a bridge until the next part of the track. Here, however, they make their transitions very abruptly and makes the song lose it's atmosphere.\n\nFirst off we have \"Hall Of The Dead\", the riffs and the riff/vocal combination immediately reminded me of Opeth. It had that heavy attitude and atmosphere to it. This song really brings the atmosphere of this album to a dark kickoff. And Aaron Turner still delivers great and passionate vocal work. The riff work in this album is great as always and they still manage to not recycle any riffs, although they lack somewhat of substance and feeling to them. The drums, however, are still perfectly in tune with the rest of the instruments and they are one of the major selling points of this album.\n\nThe atmosphere is probably the part of \"Wavering Radiant\" that disappointed me the most. It's technically great but is artistically lacking. I didn't find the atmosphere here very involving and they felt like they put more attention in making elaborate riffs rather than making them seem massive and imposing. That is also due to the production though, in Isis's earlier albums the vocals were more off put and that did great things for them, this new, more fronted, style of vocals just isn't working as well for them.\n\nFinally the final track, \"Threshold Of Transformation\", is, without a doubt, my favorite track in all this album, it's absolutely mind-blowing and definitely had that early Isis sound. Now imagine if the entire album was made of songs like this, THAT was what Panopticon-era Isis was like.\n",
        "\nThis Isis style is almost entirely removed from the modern day band. The additional notes even claim the same; “In their early days, Isis were a sludge/post-hardcore band. They later moved on to a more-Neurosis influenced sound and most recently, post rock.” Whilst the band has moved on to new pastures, the old stomping ground has still got a lot to offer any newcomer, or existing fan of the band. 2000 was an important year. The millennium bug was meant to strike to devastating affect, but didn’t. The world was caught in hysteria over the dawning of a new millennium, but was quickly washed down on New Years Eve by several inebriating spirits and finally, Isis appeared on the sludge scene with their debut ‘Celestial’, ready and waiting to dominate a genre that was only beginning to establish its feet within the metal genre, as a whole, despite being formed many years previous. On first listen, ‘Celestial’ is difficult to digest. The production was the first thing I noticed and I wasn’t too keen on it to begin with. As time has gone by, the production has actually become imperative to the overall sound. I’ve relinquished my short standing morals on production and learned to appreciate its unique input.\n\nIf you’re entering into this record expecting something similar to the modern day era of the band, you’ll probably be disappointed because it does contain a different sound which contrasts drastically to the works of ‘Panopticon’ and ‘In The Absence Of Truth’. If you’re looking for comparisons, I suppose ‘Oceanic’ would factor into the equation. This record and ‘Oceanic’ weren’t released too far apart, so its expected that the band would maintain some of the same traits that saw them through the first hurdle of their career. However, there are noticeable differences between the two, such as; the differences in metaphorical exploration, a very important aspect of the experience in listening to Isis. Like Caspian, I initially didn’t enjoy this record. Its edge and unfathomable production were curious, if any. Though the record intrigued me, it didn’t spark a great deal of energy in me. However, after several years and repeated listens, there is an underlying energetic feel to the Isis style that makes me a believer. Oh, Lord! I am a believer!\n\nWhilst ‘Oceanic’ delves deep into aquatic themes, focusing mainly on atmosphere generated by the production, drowning us with heaps of layered distortion and determined vocals that act like huge waves upon waves of forceful ocean water, dragging us deep beneath the mire, ‘Celestial’ takes us on an astral plain, flying towards the previously unreachable skies and beyond that, to the opening gates of heaven which are welcoming us with out stretched arms and a guitar in one hand, a pick in the other. The description of the modern day Isis needs to be neglected at this early stage. The so-called post rock influences don’t exist at this stage. Instead, to fill the void that one might thinks exists (but actually doesn’t), soundscapes of Biblical proportions are sublimely spliced throughout the record giving an other worldly feel to the textures of the diverse soundscapes which drift in and out of consciousness, allowing us to see beyond what is actually on the record and connect with our spiritual personalities that exists beneath the surface of our weary souls. By that, I mean that Isis have created a record that is visionary in two different senses of the word. \n\nFirst, ‘Celestial’, which is defined as “pertaining to the spiritual, or invisible heaven” is metaphorically created in order to give the listener an almost religious experience. Taking us away from the daily grind of life and placing us in a spiritual vacuum, swirling us around the painful expressionist soundscapes that pummel us continually in the face with hardened and heavy guitars and maximised distortion. The major downside for me was always the amount of ‘filler tracks’, or pointless instrumental, or programmed pieces that ‘Celestial’ has. They don’t seem to serve a distinctive purpose. When I look at the record from the outside, I see a collaboration of ground breaking songs, mixed in with troublesome fillers. If this were the playgrounds, and the lengthier songs were the wimp, the fillers would be the almost overpowering bully. I just wish someone, anyone, would come along and exclude them altogether. Be done with it and take them away from my life. They damage my opinion, they damage my motivation. On the surface of things, Isis have the attributes to make them sound like a typical sludge act. However, there are certain things which all sludge bands do, that Isis simply do better. \n\nA) Generating a passable atmosphere - Take songs like ‘Collapse And Crush’ for example. Its metaphorical and metaphysical nature is to collapse upon the listener with consumptive guitars, destructive distortion and crush the listener with idealist vocals. Aaron Turner’s performance is pivotal to the atmosphere that Isis create. Though sludge based vocals aren’t typically the best thing known to man, as long as you have a vocalist who has the ability to produce an emotive display through his voice, in a sparse way, and as long as it doesn’t become overbearing and reflect negatively against the instrumentation, then it works well. Turner’s abilities on the microphone have increased tenfold since this record, but they’re still pressing, constructive and harshly melodic in a surreal fashion. His performance, vocally, is consistent and warrants credit since, unlike many sludge vocalists, he doesn’t detach himself from the atmosphere of the music. He enhances it with his almighty vocals that depict anger, loathing and loss. The emotive nature of Isis was always bound to be apparent in their music given the lyrical themes, but the instrumentation does an apt job, no wait, a brilliant job at fusing the two together. Vocals and instruments work like cogs in an intricate machine, turning simultaneously and making impressionable strides towards a perfect sound. Even the bass is largely audible, which was pleasing. The double bass doesn’t hamper it, nor do the vocals when they’re present.\n\nB) Creativity, desire and dynamism - All three are keywords when it comes to any form of music and the majority of fans. In order to surpass your peers, you must be creative, desireable in the eyes of the public and dynamic. Of course, there are a few genres that decline this idea (DSBM and funeral doom, to name but a few), but slowly and ultimately surely, ‘cloning’ will be phased out by the better bands. Since Isis’ arrival, many bands have attempted to re-create their style but only once have I really come across a band who managed to learn from the Isis style, and improve upon it in their own unique way, and that band was Bossk, who have unfortunately split-up. I suppose, though I hate to admit it, the creativity of this record lies in the contrast of song - filler - song format. Though it isn’t necessarily ground breaking, its different and against the normality. The desires within the fan, of which I consider myself one of, comes in the form of simply wanting more. The irresistibly intoxicating feel of those heavy riffs, intricately mixed with the resonating bass that lies hidden beneath the clouds of the hazy production, reminds me of the smell of freshly cut grass. Its appealing and although you do forget what it smelt like at the time, you remember how it made you feel. ‘Celestial’ is oddly euphoric and occasionally feels like its bringing me to the brink of death and back, especially in songs like ‘Gentle Time’, which is anything but gentle. Together, creativity and consuming desire makes Isis dynamic. Highlights; ‘Glisten’, ‘Swarm Reigns (Down)’, and ‘Collapse And Crush’.\n",
        "\nI had high hopes that this record would end up being my favorite Isis album, especially considering the band's stellar progression, but alas, I ended up disappointed. I wasn't expecting Panopticon II or Oceanic redux, all I was really expecting was an awesome piece of music, which this, really, is not, especially by Isis standards. After all, I pretty much love everything they’ve ever done, including the early EP’s, which I think are fabulous. In fact I really wish they would’ve done more in the style of their first two EP’s, though I certainly don’t expect them to and never judge new material on that basis. I like their newer style (except this record) just as much anyway. I’ve simply always felt they never fully explored their earlier tendencies. Anyway…\n\nWhen listening to this, it just seems mediocre. Nearly every single song has parts I don't like (the only exception being Dulcinea—which also has a nice Tool ripoff. Something like that doesn’t normally bother me, unless it’s absurdly blatant, but with this bad of an overall album, it just piles on the downsides.). This is somewhat strange as I don't think there is a part I hate on Panopticon--maybe one I mildly dislike. For example, the song Firdous E Bareen is awesomely annoying, and at more than seven minutes it is not a brief interlude. I’m not generally a fan of instrumental music, but a few on an album with vocals are certainly fine. This one, however, the percussion bits fading in and out just drive me up a wall. Not to mention as far as instrumentals go, it’s pretty boring. Garden of Light, the closer, has an amazingly anti-climactic ending, Not in Rivers But in Drops starts off as if it’ll be the best track, but it just kind of fizzles out in the end. And on and on. The best song is probably Holy Tears, but that song really needed a rawer production job to be classed as a great song.\n\nThe vocals don't seem to fit quite as well either. Its not that I don't like his clean/harsh vocals, its just that on this album they don't seem to fit with the music the way they did in the past, like another instrument. But I think the biggest thing about this record is that a lot (most, in fact) of the heavy riffs are simply not very good. For starters, they are barely what you might call “heavy” riffs, and the intensity is not simply lacking, it just doesn’t exist. (Turner even said recently, talking about the new album (2009), that he felt they had lost their energy recently, that some of their recordings were too clean. I can only hope this is what he was referring to.) The heavy parts are, simply put, bad.\n\nThere are some really great parts, no really great songs. Everything seems almost average. I think the biggest thing that dooms this album is the non-heavy parts, the post-rock sections if you will. On Panopticon, those parts were always massive in intensity. On this album, they just seem to wallow, not really doing anything, not really interesting to listen to. Some parts are just boring and/or poorly written. I’m not sure how this happened, as on previous records the non-heavy parts are absolutely fantastic and really make the records great.\n\nAs a side note, I actually think I like the Melvins/Lustmord remix of Rivers/Drops better than most of the songs on this album as it seems to have a somewhat rawer feel, or at least more of an edge to it.\n\nFrankly, if this were not Isis I don’t think I’d even be rating it this high.\n",
        "\nI gave this EP a 90, not because I'm a nice guy, but because I believe it truly is a greatly done EP, and like I said it's a good eye-opener for these guys. In other words, it gets you hooked into their stuff. The dynamics of the thing as a whole were very nicely chosen, and have all the right volumes in the right places. It has just what I want for a musical talent. The weird atmospheric gateways into another world and heavy harsh vocals really juxtapose against each other quite nicely, I have to say. \n\nThis is the first full release (if you could call it that) I’ve listened to by this band, however I have heard the original recording for \"Holy Tears\". The remix really turned me onto the band. The song has some good soundscapes and goes into little forsaken doorways that are quite interesting. The guitar playing is quite phenomenal, and really made me think long and hard about what I was listening to. As said before, the harsh vocals in the slightly less heavy part of this song really make an accent on just how talented this band truly is. The bass playing is that of any band of this kind, just as complicated as the guitar playing can get. The clean vocals for every song can get whiney if the settings on your EQ are off, but they fit quite nicely when they need to. The harsh vocals on this \"Holy Tears [Remix]\" also fit nicely, for they are used when they're needed, and not just used for some shitty effect to make the vocalist sound like he can do something when he can't. \n\nIn all I would recommend this to anyone who has heard of this band, but hasn’t heard anything by them. I know I’d love to hear more of this band in the near future, for this is a good release. Definitely deserving of the epic 90% that I happily gave it.\n",
        "\nRivers/Drops is a song that with the right editing would've made a real good single; the intro is a massive bass led tribal thing and there's some catchy Tool-ish moments throughout the whole thing. Unfortunately, the full length version is incredibly unexciting, not delivering on otherwise excellent builds, farting around for a while in the middle with pointless riffs before the climax (and a rather unsatisfying one it is) comes along and sprays some slimy turds around the place. It's a real shame that no sort of editing has been done here; the song could've went places.\n\nWhereas the last Isis EP/single was a complete waste of time and money this one's a fair bit better, purely because the remix is a hell of a lot better then the one on the Holy Tears EP. This one (which is of Holy Tears) is a real good one; song starts pretty typically before this Thomas DiMuzio fellow decides to add a big ethereal drone section to the middle part. It's pretty cool, and the other treatments that he throws in around the place- plenty of very subtle heavenly synths around the place, and an extended build up before giving us some more beautiful drones. It's a great piece of work, a really good remix that lifts this from \"completely fuckin' useless cash grab\" to \"EP that might be worth getting if you're a fan\".\n\nWell, that's it! The Rivers/Drops song could have well benefited from some editing, but sadly it's not to be. The intro is epic though; doubtless Neurosis are a bit worried about that. It's a powerful one, just not built on by the rest of the song. The live version's pretty cool, too, albeit exactly the same as the album version but a bit more dynamic and with an ambient intro tacked on. Worth getting if you're a big Isis fan, I guess; certainly far better value then the \"Holy Tears\" EP.\n",
        "\nAnd I got this relatively cheap, too! I'm pretty happy with it really; seeing as this is easily the best remixes Vol. Sure, DJ Speedranch's contribution isn't terribly amazing but you have Hecker's excellent Carry remix and that absolute beast by Broadrick; two of the best Isis songs in general, really.\n\nHecker gets Carry and turns it into one of his songs. It's all very processed, noisy and glitchy, but also rather beautiful, damaged guitar tones soaring all over the places before falling back into the mire of distortion and clipping. This guy has always surprised me with just how organic he sounds, even though it's anything but. A typically quality bit of ambient from Hecker; I think he's the best in the genre right now.\n\nI guess it's not really Speedranch's fault that he's sandwiched between two of the best dudes in the business, but man does his remix come off as shoddy compared to the other two on here. He noises it up, I assume he throws in some JT here and there (thus the title). A lot more is taken away form the original track (Carry) then is added, that's for sure.\n\nEnter: broadrick. Already established as one of the best in the remixing business- being the go-to man for the metal world for much of the 90's and killing it with a previous Isis remix. He picked the best song on Oceanic and while he didn't make it better he did make it into a completely new song which is of a very high quality. I often use the term \"soaring\" but honestly that's the only way to describe the vocals in this; massive echo, delay, 10 tracks going on all at once, doing these full throated vocal drones over some massive industrial pummel. Things take a more pleasant ambient meander later on but it's not all that anticlimatic or anything; by then you're already riffed out by the huge intro and main part. Fantastic.\n\nOverall, if you're in that no mans lands between \"obsessive collector\" and \"big fan\" then this is probably the remixes LP that's worth tracking down. Hecker and Broadrick; honestly, how could this not fail? More casual fans should seek the double CD instead, though.\n",
        "\nIsisâ€™s live series are an ultimate example of massive Ebay overkill; stuff thatâ€™s cool but not really worth having, and itâ€™s really, really expensive. Seeing as itâ€™s still easy enough to get the latter two ones in the live series they arenâ€™t so bad (and the second one gets by because of the sweet recording quality), but this is really freakinâ€™ expensive nowadays and itâ€™s definitely not worth the price tag.\n\nThe songs are cool, but the recordingâ€™s not that great and youâ€™ve heard them all a lot better on the album. Setlist is (very) short but decent, I guess; even if itâ€™s a poorly recorded live version itâ€™s always worthwhile to have another version of Hymn. Unfortunately thereâ€™s only 3 other songs, and theyâ€™re all from Oceanic- Carry, Weight (which is boring as hell live) and The Beginning and The End. Yeah, thereâ€™s not a lot of point in owning this.\n\nThe performance seems to be enthusiastic and tight, and all the best parts- the huge, soaring riffs of Hymn, the long jamming sections of Weight- are all intact. Itâ€™s Isis doing their thing at nearly the peak of their powers, delivering tight and massive slow motion riffs, building tension and releasing it in fireworks of exploding amps. It would be glorious (with the exception of Weight), if the recording was of a good quality. Clipping, cluttered, uneven and all-round poor mixing; who the hell thought it was a good idea to turn the vocals up that high? The poor production saps the heaviness and the life out of these songs.\n\nAnd then thereâ€™s the point that you just simply donâ€™t need this album. Sure the songs are good but far better versions are available at a much cheaper price; and the fact that 3 out of the 4 songs are available in other live albums (bit of a ripoff really; Carry, Beginning and Weight appear twice each in the other live albums) makes this thing even more redundant. It does have Hymn live - why this isnâ€™t a live staple for Isis is completely dumbfounding - so if youâ€™re as big a fan of that song as I am then maybe itâ€™s justifiable. But unless if youâ€™re an insufferable fanboy this isnâ€™t worth it. Time to sell my copy for an extortionate sum on ebay, methinks.\n",
        "\nIsis's live albums have always been good to me, but as I've grown out of my fanboy phase I'm certainly less enamoured by them. Sure they have some really, really sweet tunes, but they're just redundant, really; there's no rare tracks or crazy versions of songs, just songs off the full lengths given much rawer production and released in such limited qualities that the only way to get them is to be super keen and get one the day it's released or hope ebay gives you some love. If you're going to rape my account balance then at least give me some stuff off The Red Sea EP or a rare cover or two!\n\nThis one is pretty good value, probably the best one out of the live series. The recording is of a high quality, there's a bunch of stuff off Celestial (though following the typical Isis have crap taste in set lists rule, theres Glisten yet no Swarm (Reigns Down) or Collapse and Crush) and theres an extended version of Celestials title track, which is ridiculously good and not really available anywhere else.\n\nIsis are a lot better at delivering the heaviness then the post-rock in a live context, so its good to see that this set is more riff heavy then the usual set. From Sinkings a terrific opener, big sludgy riffs and an inspired build before a massive climax takes us all to distorted guitar heaven, and while Glisten is probably the worst song on Celestial it's still a heavy beast of a tune, sometimes I wish Isis would go back to their more primitive songs like that one instead of overdosing on the clean noodles. Unfortunately Isis can't resist their post-rock fetish and give us a bit too much on this album; Carry, Weight and Beginning and End are pretty unnecessary seeing as a) they were on the live album before this one and b) they just really aren't terribly interesting live.\n\nThe feelings of irritation at being denied songs that are unique to this record and aren't full of awesome walls of guitar is set aside fairly soon, though. The extended version of Celestial is an absolute beauty. There's the caveman like one note intro and otherwise huge sludge pummel of the original track before the Harris brings his toms out and Isis segue into an excellent, samples-and-ebow accented 'Signals fill the Void' (i.e Broadrick's excellent remix of the original). It's fantastic really; a pretty beautiful ambient drift that many a band would be proud to have; waves of ebow floating over a delay soaked backdrop of chiming guitars.\n\nHowever, if you've been similarly disappointed by the live attempts of other long, mellow Isis songs, you'll find half the songs here to be fairly dull, so it's probably not worth your while. I guess like most live albums I'll say that this one is for the more dedicated fans; it's not bad but hardly the greatest thing ever.\n",
        "\nI originally loved Isis's newest album but since then my opinion's dulled a bit. What was once an excellent band with the perfect mix of Neurosis and Mogwai worship went a bit too far on the Mogwai side, and released a competent if unremarkable post-rock album with some great songs but also a few fairly forgettable ones, songs that cried out for the soaring, crushing Isis crescendos of old but instead farted around with clean noodling and laughable attempts at heaviness.\n\nHoly Tears is a pretty good example of the bad things of ITAOT. A solid intro with a surprising, gothic feel (reckon it's the organ sounds) gives way to a quality, super layered clean guitar build which is all let down by the ending riffs. It's a true shame as the song had the potential to be a truly massive one; as it stands I guess we'll just listen to a few pointless riffs and then see Isis reprise the intro but with shouted vocals. Yawn!\n\nI'd also like to defecate on the fairly terrible Melvins remix of 'Not in Rivers but in Drops' (another song with similar excellent intro/lame ending troubles). It's pointless in the extreme and incredibly annoying; basically getting the final product and making it a good deal less cohesive and good. The epic tribal bass led intro is still mostly intact, it's mostly the Tool-like 'heavy' sections which are screwed around with. Honestly there's not a great deal to say about this song; it changes the structure around to no real end, there's a few EQ filters thrown around here and there. It sounds less like a remix and more like a recording student stuffing around on pro tools.\n\nLike the rest of the single the live song's fairly pointless. A decent enough ambient intro; then Holy Tears again! It's basically exactly like the album version but with worse production. Overall this single's fairly redundant and no one really needs it.\n",
        "\nFor a musiclover it is pretty hard to name all-time-favourites, but if I had to, ISIS's third studio album \"Panopticon\" would definately be among my top five. When I saw this incredible band live in 2004 just after the release of \"Panopticon\", I had already been a fan of their previous efforts for quite some time, but hearing these tracks live for the first time was a crucial experience for me. Those who have had the chance already to see ISIS live will surely agree that there is a special, strong atmosphere, when this band hits the stage. \n\nFor those who are not familar with their music, ISIS started out in 1997 as a Sludge-/Hardcore-Band with a rather noisy approach. Later on they evolved towards a more experimental, post-rock-sound influenced by bands like NEUROSIS or GODSPEED YOU ! BLACK EMPEROR. While their first two albums \"Celestial\" and \"Oceanic\" were already outstandingly great albums, it was \"Panopticon\" in my humble oppinion, which took this developement-process to its conclusion. Without lacking the heaviness of former works (as I sadly have to say about their lates output \"In the Absence of Truth\") they succeed in implanting more and more post-rock-influenced clean-guitar-parts and clear sung vocals to their monolithic sludge-riffing and hardcore-screams. In addition to the virtuose guitar-,bass- and drum-work ISIS would top this record off with electronic ambient parts, most prominent in the fourth song \"Wills Dissolve\". The outcome of this cocktail is an hour of epic and monumental, modern heavy music.I think it is the duality and the contrast between the atmospheric, soothing parts and the utter heaviness, which let both elements affect the listener in this intensity. \n\nWhile the predecessor \"Oceanic\" was centered around the concept (who would have ever imagined?) of the ocean and the feeling and emotions of a suicider drowning himself it it, \"Panopticon\" is based on the idea of a circular prison developed by the British philosopher Jeremy Bentham, in which the inspector could see all prisoner at all time without being seen himself. This concept was later taken on and developed by Michel Focault in his book \"Discipline & Punish - The Birth of the Prison\". Both are quoted in the booklet along with the social and political critic and writer Howard Rheingold and the award-winning futurist Alex Steffen. It is not hard to understand that the main topic here deals with the danger and fear of a surveillance state based on new technologies in our nowadays and future society. While this theme might be rather pressing and political Isis succed in staying with a rather philosophical instead of agitative approach. \n\nIt is hard to name outstanding tracks because all songs are somewhat remarkable and still the whole album works perfectly as an entity. But it is to be mentioned that Justin Chancellor of Tool (for which ISIS played the support slot on their \"10.000 Days\"-tour in 2006) is featured as guest on the bass guitar in the instrumental track \"Altered Course\". Points of criticism? There are hardly any I could come up with. Maybe it will take some time for some to get into this album because of the complexity of the material, but that's not really to be seen negative. The bottom line is that I can do nothing but recommend \"Panopticon\" to any fan of heavy, atmospheric music, it's that simple!\n",
        "\nWhen the viability of any band’s songwriting is in question, the best place to look for any hope of future potential is how they reinterpret songs written by the forefathers of their genre. In the case of Isis, there hasn’t been much doubt in their ability to put out Atmospheric/Progressive sludge that is a cut above the rest. Pig Destroyer, on the other hand, has trouble maintaining the admiration of anyone who is either above the age of 14 or is not an emocore fanboy music journalist (apparently there are a ton of these on the internet as all I saw for them was rave reviews). \n\nThe better half of this album is obviously found on Isis’s side of the court. Not only do they succeed in beautifully adapting this, at the time, avant-garde industrial metal classic to their atmospheric brand of slow, muddy metal; but also succeed in marrying that ridiculously obnoxious snare drum sound Soundgarden is known for to the rest of the mix without burying the entire song underneath it. The contrast between the high and low end guitar sounds is surreal, to speak nothing for the differentiation between the drum and bass timbre, but all of it balances out like Yin and Yang, resulting in an atmosphere reminiscent of a bulldozer unearthing mud in the middle of the wetlands, which is a complement unless you’re an environmentalist (come up with your own analogy about mud and metal then).\n\nPig Destoyer’s side of the split is a little less endearing, but miles ahead of what they’d done up to this point in their career. For the most part, they demonstrate an ability to successfully play all of the riffs, basslines and drumbeats required of them, but not really much more. They essentially go through the motions and don’t really do much other than butcher the production, especially in the case of “Exhume to Consume”, which at times sounds like it was recorded in the basement of a professional panhandler. We get a few extra clicks on the metronome, a few crazy blast beats, but the ultimate truth is that Pig Destroyer is dependent on a good song already being written for them in order to sound even remotely good, let alone successfully pay homage to a well respected goregrind/death metal outfit like Carcass.\n\nIf this split were judged only by the Isis half, this would be an excellent single, but seeing as Pig Destroyer will likely have accomplished little more than getting a few snickers out of old school grindcore/goregrind fans with this half-assed handful of remade classics, I can’t give this a glowing recommendation. There is probably a good reason why no Isis fans have bothered with reviewing this split album, and it has zero to do with the performance of their favorite band on here.\n",
        "\nIsis at their finest right here. Wonderfully orchestrated and composed, it seems to me to be organized into movements: tracks 1-3 are Act 1 that ends in one of the most epic riffs I've ever heard at the end of Dulcinea... its got almost a surfer vibe to it. Then we have a transition with Over Root and Thorn, which are less songs and more a collection of cohesive sounds. The next three seem to fit in as Act 2: 1000 Shards floating in and out of consciousness with its distant melodies while All Out of Time, All Out of Space continues the distance as whispered voices, guitar feedback, and what seems to be the far off cries of seagulls float through the void, phasing in at the last moment to give way to the album's single Holy Tears, a much more conventional piece of music. It begins almost tediously with the slow chugging (\"Alwaaaaays reaching fooooorwaaard\"), however the song molds into a quiet high-end jam with fragmented stressed vocal melody, easily culminating into a transcendent conclusion that allows the tedium at the beginning hold its place. Again, a transition occurs with Firdous E Bareen, a tropical exploration jam that turns from electronic composition to more riff-based material, leading us into Act 3, the 9:17 Garden of Light, which is a journey in and of itself, beginning with a lighter mood in contrast to the dark brooding often found in Isis's music and coming to a crushing culmination midway into the track, then ending in an Explosions in the Sky/ Red Sparrowes-esq eclectic, nostalgia-ridden jam that seems to float on indefinably.\n\nThis album is for the experience. It's built for meditation and full-length listening and it's a beautiful piece of work, or art. This is by far one of my most valued albums.\n",
        "\nThere are probably few records about that are as conceptually sophisticated, thought-provoking and relevant in this age of wall-to-wall CCTV camers, politicians banging the drum for national ID cards and excessive airport security (which in the case of one unfortunate New York City woman in Arizona not so long ago in 2007 proved fatal) yet still musically tough and disciplined and in sound heavy, as Isis's \"Panopticon\". First thing you notice about this album is the design of the CD sleeve insert which ingeniously incorporates two spy cam photographs of a city taken from a plane or a helicopter flying overhead, plus quotations by famous philosophers Jeremy Bentham and Michel Foucault among others on the concept of a circular prison.\n\nFor those who aren't philosophically inclined but want a quick intro as to why these worthies are quoted, Bentham was an English philosopher who was in favour of law reform and who criticised social institutions and practices including forms of punishment popular in his time (the early 1800's) yet paradoxically designed prisons and proposed the idea of the panopticon, the circular prison where prisoners are made to watch, guard and even punish one another. Michel Foucault was a 20th centuryFrench philosopher who investigated the idea of what it means to be an individual and argued that the concept of \"self\" or individuality depends a great deal on systems of power and technology that ultimately imprison us, hence his interest in the idea of the circular prison where we are persuaded by advertising and politicians that we are free individuals but at the same time have (maybe even need) a Big Brother or Nanny state watching over us and encouraging us to spy and snitch on one another.\n\nNow for the actual album: \"Panopticon\" is a very grand, mostly instrumental panorama of often atmospheric post-hardcore metal with well-structured highs and lows in the music. Initially I thought the tracks were not all that distinctive in themselves and they do tend to blend or overlap quite a bit so it's possible to listen to the whole album as one long track which probably fits in well with the album's theme; repeated listenings though do reveal some differences among the long tracks so this is a record that needs and rewards repeated hearings. In looking for \"individual\" tracks, I may of course be presuming that having \"individual\" tracks is a good thing but on an album like this that quotes Foucault, maybe I had better refrain from that approach. The music starts off as hard-hitting and technically precise hardcore-influenced metal with clear-ish vocals but over the course of the album the music seems to get more trancey, the singing becomes more distant and inhuman and atmospheric effects work their way into the guitar riffs. Songs may cascade from bursts of fuzzed guitar to quiet contemplative passages of crystal-clear pure guitar tones which in turn are swept away by tidal waves of more heavy guitar abetted by FX pedals. Moments of near-acoustic suspense, fear and paranoia build up into circular-tower mountains of riffing and gurgly singing on tracks like \"Backlit\" and \"In Fiction\": these are controlled to give just enough of an impression of uncertainty, foreboding and oppressive police state presence. Any more and Isis would certainly risk going over into melodrama and pretentiousness.\n\nThe production is right for this recording, it's clear and technically top-notch, allowing the band to hunker down in intimate near-acoustic corners with pure, almost ringing guitar tones, and then to suddenly expand, Big Bang-style, inot vast reaches of the sonic universe with tsunami wave after crashing tsunami wave of snarling, spiralling guitars, deep bass and insistent thudding drums. This epic approach reinforces the all-embracing oppression and paranoia: the circular prison reaches to and embraces all reality, and is vast and never-ending, yet it takes note of every small thing you do and think. Sounds very much like how some children learn about the Christian God - but no, we won't go into that territory at this point!\n\nProbably the pivotal track is the all-instrumental \"Altered Course\" which has some brightly sparkling melodic tremolo guitar and seems to be more hopeful and positive than the rest of the album. This is also the most ambient-oriented track and presents Isis at their most epic atmospheric post-hardcore Godspeed You Black Emperor likeness: the brooding suspenseful parts are at their most mysterious, most brimming with hope for escape or freedome; the music sounds multi-dimensional with atmospheric effects; and unexpectedly the track drifts off into a dreamy space-ambient stratosphere.\n\nWith an album like this, there's no happy ending but the journey is more important than whether we make it out of our prisons (physical, mental, emotional, whatever) or not. We travel to the highest and farthest reaches of the Panopticon and descend into its innermost niches and abysses and discover this prison may be more complex and far-reaching than maybe even Isis and the gentlemen they quote on the CD inner sleeve can ever have imagined.\n",
        "\nHaving seen Isis earlier this year, I can attest that while they're a very good live band, it doesn't seem to be their natural setting. Their long and slowly developing songs just aren't really all that appropriate in the context of a rock gig. Do you bang your head? Well, maybe.. But most of it's not fast enough for good headbanging. Do you Mosh? No. Instead, you stand their kind of awkwardly.\n\nHowever, while Isis doesn't translate perfectly live, somehow live Isis works quite well on DVD. This is a fairly enjoyable collection of a surprisingly varied amount of songs that's ultimately put together quite well.\n\nThe amount of older tunes in here is a good thing indeed. There's the prog-godflesh of Celestial, the sludge of Gentle Time and Swarm Reigns Down. Perhaps it's just me but I definitely found the massive, crushing grooves of these songs to be the most enjoyable- there's no subtleties lost in these songs, mainly because there were none to being with. Basically, it's the more straight forward songs that work the best. The two different versions of Grinning Mouths are both quite crushing, and Altered Course is particularly gorgeous, quite true to the original song, although the noise jam in the middle of it is a bit unneccessary.\n\nUnfortunately, some of the more layered songs do lose a bit in the live setting. Wills Dissolve and In Fiction both test the patience in album format, and they definitely test the patience here. Would I say they are boring? I guess so- Isis's more post-rock stuff doesn't work too well live, and these are very post-rocky.. Likewise, So Did We is somewhat disappointing- the crushing ending is a bit of a let down, with Meyer's solo at the end of the song not that great. \n\nStill, this is a good DVD. The quality varies a fair bit- most of the Celestial tunes are done by a single camera- but the audio is pretty high quality. The final complete set in Sydney is of a really nice quality, though. The syncing is just a little bit out, but it's only really noticeable when you see the drums. The audio is really high quality and everything's done very professionally. I wasn't quite sure what to expect when this DVD came out- would it all be one camera shots from the back of the stage, would the audio be constantly distorting etc.. But luckily everything's been recorded and mixed together quite well. There's a few little extras like the In Fiction video and a few photos of places Isis have been, and they're kind of nice, although you probably won't give them a second glance.\n\nBasically, this is a pretty good DVD, good to watch, good to throw on as background noise. The subtle melodies buried within Isis's music aren't really visible live, unfortunately, and there's no False Light (and not enough of Oceanic in general) on display- but there is a DVD of Isis playing an Oceanic only set coming out soon, so that doesn't matter all that much. In the end, this is a good DVD, fans will love this, newbs to Isis should check out Panopticon or Oceanic first.\n",
        "\nWith Oceanic ISIS single handedly created the worlds first ever post-metal album. The obvious move would be to progress on the previous album, and create an album with a fresh sound, that still related to the previous album. This inevitably gave way to \"Panopticon.\"\n\nPanopticon follows the precedent set by Oceanic, as far as tempo goes. While sometimes the songs may feel faster, they generally run at the same, slower tempo. Again, the songs tend to be around the 8 minute mark. What makes Panopticon so different, is some songs tend to progress at a faster rate. Now this doesn't mean that they are part of that instant gratification, where the whole song is a climax, instead the songs are carefully crafted to feel as though they are always moving forward (with the exception of \"In Fiction,\" which is one of my favorites anyways). One element that seems to be missing from Oceanic is that the album does not progress song to song. Instead each song is its own seperate element (though they are linked through ambience). With that said, \"Grinning Mouths\" is a grand finale to the album (it is one exception, it sums up the whole album in one magnificent song). \n\nOnce again, the recording quality is great. The guitars are crunchy when they need to be, but the clean guitars are still bright when they come in. The tone seems to be a bit less sludgy than Oceanic, but is still a but sludier than you would expect from most other bands. The drums are still organic. It sounds highly unlikely that any loops are used, as each drum pattern has that one thing added with each bar that passes. \n\nWhile the mixing in Oceanic was fantastic, the mixing of Panopticon is even better. Somehow they found the perfect balance between ambience and instruments. Each instrument has its own part, and it shows through the mixing. This time around the bass is noticable from the rest of the instruments. Instead of mixing everything to the lower register, each part seems to have a different register, allowing for a better listening experience. Dynamics are a large part of this album. There are loud climaxes and quiet builds, and each is mixed accordingly. All in all, another fantastic job of mixing the album. \n\nPanopticon has a different feel than \"Oceanic.\" I found instead of having a dark album that gave a few happy parts to create intense emotion, Panopticon seems to have a neutral, almost spacey feel, but there are still some parts that create a happy, intense emotion. It seems in Panopticon that the mood is extremely influenced by the ambience that is always present in each track. This ambience is extremely apparent in tracks such as \"Wills Dissolve\" or \"Syndic Calls\" where the intro is largely ambience. This creates a full listening experience, that I have not found in any album as of yet. \n\nOne huge improvement over \"Oceanic\" (in my oppinion anyways) is the introduction of clean vocals from Aaron Turner. His clean vocals, as seen in \"Backlit\" can be soothing, just as they can be inticing (during \"In Fiction\" for example). Aaron Turner still makes use of his growl to increase \"excitement\" (if it can be called that, maybe rising action or climax fits better...) during the track. \n\nLyrically this album revolves around the idea of the Panopticon, a prison where each inhabitant could be watched by a single person (but does not know if he/she is being watched). This creates an almost omniscient feeling with the album. The lyrics are, once again rather scarce compared to the song length. They tend to be almost ambiguous, which ultimately lets the audience take from the album what they wish. \n\nOne thing to note about this album is the beauty of the rising action. Each song has its own build, and ends in its own fantastic climax. Though it is extremely hard to explain how this adds to the overall feel, it is important to note that ISIS redifined the idea of the climax. Each song has a different, but completely distinguishable climax. The feeling of these climaxes is absolutely magnificent, and can only be fully understood by hearing a song off the album (I can't post any music here due to copyright laws, but look on some websites like www.last.fm or www.pandora.com to get some songs). The feel of the album gives \"celestial\" a whole new meaning. \n\nUltimately this is a great album for anyone that loves post-rock. Where as \"Oceanic\" tended to be largely a sludge-metal kind of post-metal, this album leans much more towards post-rock than it does post-metal. The highlights are definately the subtle additions to some of the guitar tracks. The grand finale of \"Grinning Mouths\" is one of the best ISIS songs to date (in my oppinion anyways). With that said, those who absolutely hate any kind of growling will find some of this album repulsive as there are a few parts where he still has his extremely aggressive vocals. \n\nThis review was originally wrote for my review blog http://the-post-rock-review.blogspot.com.\n",
        "\nThough ISIS is generally described as post-metal, I feel that it was necessary to include them in this blog, as they are the pioneers of Post-Metal. \n\nOceanic is ISIS' first true post-metal album. While the first ISIS albums tended to borrow quite a bit from the old Neurosis sound, this album tends to break away from the traditional ISIS sound, and tends to lean towards long, emotional songs. \n\nWhen ISIS made this album and broke away from their traditional sound, they seemed to keep the slower tempo that they found to be successful. The song length tends to be around 8 minutes (give or take) and each song is characteristically different. Though the tempo tends to be slower than the average post-rock album, the songs still have forward motion, there are very few instances (I would be hard pressed to find any) where the songs feel like they are just trying to be longer. \n\nAs far as recording quality goes, this album is fantastic. The clean guitars sound realistic, and the distortion is deep and crunchy. The guitar tone tends to be much sludgier than most other post-metal. The drums are all full sounding, with complete dynamics. I could not find any places where the album felt like it had been \"patched together.\" Each instrument, including the vocals feels completely organic. \n\nTh mixing is absolutely fabulous. Each instrument weaves in and out (as the album title suggests, each instrument adds together to create a full sound, that moves just like the waves of the ocean) when it should. The vocals are not pumped up like most modern albums (which may take a while to get used to). Instead they tend to blend with the rest of the instruments. My one complaint is that the low frequencies tend to get \"mushed\" together at points, and sometimes the bass is not distinguishable from the rest of the mix. \n\nThe general feeling of the album is very dark. There are points where the minor chords could very well cause temporary depression, but with that said, this sets up the audience for the rest of the album. The few major, or happy parts throughout the songs become so much greater, due to the strength of the minor parts. The whole album uses ambience to progress the album like one long song. Each song builds on the previous song, until we reach the finale, which, just as ISIS has always done, sums up the whole album, while still leaving a pleasant taste in the audiences mouth. \n\nVocally Aaron Turner relies heavily on growling vocals. These growls are not processed as you would find in many death metal bands (such as Bloodbath or Hypocrisy). Instead his growls have an organic, raw feeling. They tend to be lower in the mix, which takes some getting used to, but it just makes sense in the full idea of the album. \n\nFinally, the lyrics follow a concept, unlike any seen before. Instead of making a specific story out of the concept (though there is a story to it), the album relies on a theme. In Oceanic the theme is mixed between the female theme, as well as the water theme (as introduced in earlier material such as Red Sea, and Celestial). The story is not complete and coherent as certain aspects of the story take place before or after the album (what should arguably be the climax in the story, \"From Sinking\" is the second last song, followed by the musical climax \"Hym.\").\n\nThe biggest highlights of the album would have to be the emotion that is put into it. From taking the audience from a depressing sound to a completely joyful sound the band allows itself staying power in many aspects. Each song builds on the other, and the finale is fantastic. The inclusion of a female vocalist on a few of the tracks (especially \"Weight\") was a great inclusion that added to the overall theme. This album just grows on me each time I listen to it. On the downside I found the vocals to be a bit too harsh at points, keeping the audience from fully understanding the lyrics. \n\nIf you can stand growling vocals, and love the characteristic builds of post-rock, this album is definately for you. \n\nI orginially wrote this review for my blog http://the-post-rock-review.blogspot.com.\n",
        "\nSince 2004's 'Panopticon' (and more recently their stadium supporting tour with Tool), Isis have been getting some substantial attention, and drawing more and more fans of different genres into metal of the more droning sort. They've been the band to bring their style (started by Neurosis, among others) to light in the rock community. With friends Pelican and other bands, the genre is getting stronger and more popular as time goes on, however Isis have been the most famous exporter of the music for quite a while now.\n\nIsis' sound has evolved over the years, as they have gradually progressed from crushing droning doom metal to ambient soundscaping which now sounds more like Explosions In The Sky than Godflesh. 'In The Absence Of Truth' is by far their softest album to date. If you're a big fan of Celestial's colossal attack, expect a big surprise (though the stylistic change was made on 'Oceanic', long before this album), but not a disappointment.\n\nThe songs are incredibly well put together. The structures do not follow any one formula, but have build-ups, guitar driven mellow sections and ambient interludes which all remain for the perfect amount of time, change when they should and the instruments all lock together tightly. The post-rock influence is more evident than ever before on 'In The Absence Of Truth', as the guitar work has gotten more intricate and less droning. The basslines have loosened up from the guitars which gives the guitars freedom to work their melodic capacity while the bass has room to breathe and has more of an opportunity to hold a groove (this particularly impresses me on 'Holy Tears'). The electronics add another layer to their instrumental mood, the atmosphere that they give off often helps the sound retain its themes before it progresses to another section where the song reaches its climax and finally comes full circle. The drums vary from simple tom backing to half-time battery with touches that really make Aaron Harris an irreplaceable member of Isis (note that he is also the only member that is involved in no other projects). He's very creative but sometimes his drums follow the guitar rhythms too closely (the 'Dulcinea' intro could have been done better) which can sometimes ever so slightly diminish the validity of his rather unique approach to drumming.\n\nThe average song length on the album is 7 minutes (the shortest 'proper song' being 6 minutes, longest being 9) but, unlike their early hardcore-influenced work, and to a certain extent, their previous releases in this style ('Oceanic' and 'Panopticon') Isis really make every moment count. Their tone is perfect in every department and every song has a unique feel while still retaining the overall theme of the album.\n\nOne thing which really helps keep these songs afloat (if you will) is the vocals, because they are not frequently used. The second longest song on the album is instrumental, and the song where vocals are most used (opener 'Wrists Of Kings') only uses 65 words. Aaron Turner's clean voice brings individuality to each section even when the rest of the band's parts have only changed slightly. His aggressive grunts are even gloomier than on Celestial, and are used only when an extreme sense of scale and melancholy is needed, which works very well. The only problem that I have with the vocals (or indeed, any of the individual instruments) is the vocal's production. The voice always sounds muffled, and while this is good because it doesn't shift the attention entirely to what Turner is saying, it does get irritating when they cover it with effects. The shouts are very low in the mix and take away a lot of the power from the heavy sections. This has been a consistent problem with Isis (for me, anyway) and I'm disappointed that it hasn't been fixed yet. The performance of the vocals however is Turner's best yet.\n\nThe lack of definition in the vocal production can be explained by the lyrics, and perhaps how they are meant to truly blend in with the 'musical themes' of the music playing behind it, rather than someone singing a song with a band playing any old tune behind them. The lyrics are, in a word, mind-blowing. Cryptic and mysterious, the lyrics could honestly be about anything, but there are multiple references to past works, philosophy and characters which, rather than telling a story (which is the convention for albums which involve characters) portray a theme. I can't say I fully understand the lyrics or what they represent but there are definite repetitions of language which represents authority, searching, spirituality and a certain female character, who I think may be symbolic rather than physical. Certainly Aaron Turner writes amazing lyrics that provoke thought, particularly when listening to his music.\n\n'In The Absence Of Truth' is Isis' most professional album to date, the structure and songwriting is near flawless and the letdowns are very minor. It's got more verve than previous releases and it's far more consistent. However, 'Panopticon' in particular has more moments which really drop your jaw, despite that album having more pitfalls. Overall I really cannot decide whether Isis have continued their habit of improving with every album but this is certainly an incredible album and certainly one of my favourites of 2006.\n\nOriginally written for www.heavymetalsociety.org\n",
        "\nAtmospheric sludge kings Isis burst forth in utter confidence in this album, pulling no punches to deliver a beautiful and haunting piece of metal art. \nNot for lovers of the conventional, I will warn you, nor for those with small attention spans. This album demands a lot of attention if you truly want to appreciate it and pick up on the subtle things. Although not totally void of vocals the album tends to be mainly instrumental. \nIt is something different. Brutally heavy and adversely soft at times, you’re in for a journey.\n\n\nTrack 1, So Did We, wastes no time in beginning its onslaught on your ears, straight away all instruments charging a deep rhythm. Following is a quieter segue which seems to build up for an eternity, a pleasant eternity, with guitars playing over each other melodies and eventually into a swapping rhythm. \nChillingly cold, yet welcoming guitars slice in and the vocals layer over the top and still the build up is developing. It seems the song is a beautiful ever-changing build up, the harsh parts just as spine-chilling as the echoed, soft, spacious interludes.\nThe reverb is perfect on this track adding an almost atmospheric quality and it’s not at all cheesy.\nThe build-up at a climax and then the track ends and you can’t wait to hear the next.\n\n\nBacklit welcomes you in, takes your coat and says ‘Take a seat’ as it’s soft, warm intro takes it’s course, again a build-up, this time with more prominent bass.\nIn no time you’re struck with a heavier passage, not at all unwelcome, covered in the unique vocals of Mr. Turner.\nAnd old radio sound in reverb smothers one of the guitars, softening its blow only to be the calm before the storm where Aaron’s vocals really kick in, blistering and raw, yet so beautiful. \nThis tracks chorus is layered with cymbals, the whole track littered with a high-pitched snare with just the right amount of production.\nA beautiful build-up, with nuances of melody seems the highlight of this track underlaid with impressive drumming and again prominent bass lines and peaking with vocals.\n\n\nIn Fiction has the softest intro yet, layered in reverb and subtleties, lasting an age, but not disinteresting. The vocals, now grunty, layer of the soft passage, which to no surprise doesn’t stay soft for long.\nIt branches out into a beautiful 1,2,3 - 1,2,3 - 1,2,3 - 1,2,3,4,4,4,4 loud, prominent, even bright kind of pattern to which you’ll have to listen to for yourself to know what I mean.\nThis track is not without a beautifully, nuance-ridden, deep, rhythmic flair peaking and eventually ending the epic song.\n\n\nThe almost minimalist first impression I got from the next track dissolved (pun intended? Maybe) when its progressivness took over, transforming the riffs. \nIt revisits creepy, clean melodies definitely adding atmosphere and feeling. \nThat feeling is brought out even more so when this tracks build-up ensures a heavy overlay, mimicking the melody aforementioned. \nThe vocals on this track seem almost ritualistic but fit into the mix well.\n\n\nThe other tracks on the album are as you’d expect, similar but bringing something new to the table each time.\n\n\nThis album seems more creative, melodic and not as harsh as their previous albums. In my opinion they have progressively gotten softer (though no less passionate) with each album, with this album sitting about the middle of the spectrum, so it can really be appreciated by fans of the old OR new Isis. \n\n\nThis is a great album and if you like Isis there’s no doubt you’ll like this album, even if it’s only a select few tracks or moments that take your fancy.\n",
        "\nMixing a unique blend between post rock and proggy sludge metal (if you want to get technical), Isis manages to produce a synergistic blend between the two genres. Fans of either music scene will share some common ground with this influental act along with the likes of Pelican, Red Sparowes and most notably later Neurosis. Enough ass-kissing and going off on tangents though. \n\nThe more I listen to this album, the more it grows on me and every time I find a new layer or discover a new part I hadn't noticed before. The harmonious blend between the guitarwork and the just-above-background-noise-level basswork that's coupled with the vocalist and his female counter-part on \"Weight\" are all neatly accented by the techy, mid-paced drumming skills. This along with the seemless flow and salty-sweet mixture between the ambient, almost trance like instrumental parts and the crushing sludge metal breakdowns produce a concotion you're sure to get drunk off of. This is all outlined with the progressive nature of each song.\n\nThe most interesting aspect is the fact that no one instrument overpowers another. The guys at Isis managed to produce a clean, almost borderline hard-rock style of sound where everybody gets an equal say. That's bound to make a field day any bassists looking to get some ear training.\n\nThe one complaint that I (at one point) had is the lengthy, interlude-ish center in the album only broken after about fifteen minutes of post-rock style music that they manage to show off by an epic crescendo. Now after a few listens I grew to love this like any mother would love her deformed child, but a warning goes out to all the \"tr00 metal\" heads out there: Skip tracks 5-7 if you're not looking for that kind of music...As for the other side of the fence, these parts are just what you're looking for on.\n\nIn general, that's what this album is all about. It's mellowed out metal for the stoners and prog-heads out there. An almost 50/50 brew of the two strands of music...Give it a few rips with an open mind and you're bound to be banging your head with your circle of friends in hazy rooms for days to come.\n",
        "\nIf you ask me, Oceanic was far too good to be messed with. This 2-Disc set is a compilation of the four EPs containing remixes of Isis songs from Oceanic. It’s an all star cast of brilliant artists, including Mike Patton, Tim Hecker, and JK Broadrick, yet hardly any of them give the songs fair justice. Die hard fans of Isis will either love this or hate this, mainly because it tilts entirely on the band’s ambient, atmospheric side, and that’s it. Every song is a drug out, twisted, and redundant mass of beautiful soundscapes and electronic ambiance that will leave you saying “Okay, okay, it’s good, now what?”\n\nDon’t get me wrong, I love ambient and atmospheric music, but this is Isis music that is not Isis! Where is the amazingly heavy, sludgy guitars? (hardly anywhere on this release). When is the part where the music bursts into an amazing sweeping melody hidden n a wall of dense atmospheric sound? (never). Where is that Isis magic? (gone). Basically saying, this is a compilation of cover songs with the band members playing their parts Long with the other artists.\n\nThe best tracks to hear to get an idea of this double disc’s sound are False Light (remix by Ayal Noar of 27), Maritime (remix by Mike Patton), and Like I Will Love Her Forever? (Fuckin Die!!!) (\"Carry\" remix by DJ Speedranch featuring Guilty Connector).\n\nIf you are looking for something outrageously different and unique, this is a perfect CD set to pick up, but if you’re looking for another good Isis record to add to your collection, be best you pass, since their is hardly any trace of the band’s real talent and skill in this release.\n",
        "\nIsis is a pretty well-known band for what they are. Typically sludgy riffs, and usually an even pace to the music. But in later years they have been slowly making a transition. I think it's safe to say that the transition has come full circle with In The Absence Of Truth.\n\nThis cd is closer to post-rock than it is their original sludge. As such, it's really hard to compare this to most of their other work. But the album in itself is amazing in all ways, so there is really no need to. The drum work is extremely polyrhythmic and quite soothing at times. The vocals are very sparse, mixing harsh vocals with normal melodic-type singing. The guitar and bass still retain somewhat the tone of sludge metal, which is a big plus for me personally, and I'm sure for some others.\n\nIt's also one of those cd's that you really should listen to start to finish. It's not that the songs themselves aren't good to listen to individually. But the album is a piece of art in a sense. You don't simply look at one corner of a painting, although that corner may still be beautiful.\n\nAll in all, a very solid release from Isis. Whether or not it is their best, I can't say. But either way, it's saying a lot about this cd.\n",
        "\nSo, Panopticon arrives in the mail along with around twenty other albums that were purchased around various recommendations that were made in passing by a few fellow forum-goers. Never having heard the band before and not having much of an idea what to expect, I rip away the plastic wrap, pop the disc into my DVD drive, rip it, and get to listening.\n\nFor the next hour, I would be subject to the aural equivalent of a majestic ocean body slowly swallowing the very foundations of the Earth, leaving in its wake a vast landscape of weeping sorrow and glimmering hope. That magnificent and devastating ocean has a name - and that name is Isis.\n\nNow, I don't have much of a clue as to where to go with this thing. Isis is not a hard band to describe, but it is very difficult to truly capture the essence of the sounds that extend from their instruments. Their music is a mostly instrumental, atmospheric, shifting beast that at times seems to extend out from your speakers and develop a sense of physical mass. This is heavy music... not the kind of heavy that slams you against the wall and leaves you with a splintered skull, but the kind of heavy that embraces and envelops you, weighs down on your very senses, and forcefully sweeps you away into the dark unknown. There are no double-bass runs, there are no blast beats, there are no solos, there are no \"riffs\"; there are only dense soundscapes littered with kinetic walls of aural energy, ambient stretches of space, and gently ringing guitars that embody the calm before the storm and make you welcome the inevitable devastation that is surely forthcoming.\n\nThe perfect display of all these things is in the opening track, \"So Did We\". The song comes in with a slow, simple drum pattern and reasonably heavy guitars that are soon joined by Aaron Turner's distant, hardcore-ish yells. Turner is surprisingly unobtrusive, so people who have an aversion to this kind of vocal style shouldn't have much to fear. Regardless, this only goes on for around thirty seconds before the vocals cut out, the distortion disappears, and twin guitars come in with interweaving melodies that continue onwards, shifting, morphing, and changing until a bit past the two minute mark, where the music lapses back to a sound similar to the introductory passage. At three minutes, one guitar takes on a sort of sludgy droning, while the other rings clearly in the forefront, creating an eerie and moving aural scene. Soon, the droning transforms into a wash of noisy guitar atmospherics that blend smoothly into the background, while the tranquil reverberations retain their prominence in the foreground. At just under four minutes, the background guitar suddenly comes to the front and quickly diminishes into a short stretch of feedback, before fading out and being replaced once again by clean twin guitar tapestries that weave in and out of each other to create a melancholy, sorrow-filled stretch of airy music that evolves and builds on itself until just past the six minute mark. At this point, everything hits a climax and explodes into a wall of sound so enormous that it escapes from your headphones, clings to your walls, and begins to slowly close in on you from the outside, the weeping guitars and powerful cymbal washes enveloping you so wholly that you cannot help but to let go and lose yourself in the vastness of it all. It's utterly massive, soul crushing music. I cannot express enough the kind of impact the last few minutes of this song has on me. It's unreal. Indescribable. If you only hear one Isis song in your life, hear this one.\n\n...and that, to one degree or another, is the sound of Isis. Unfortunately, this is the absolute high point of the album... and it's a shame that the band hits their peak so early. However, don't take that the wrong way. The rest of the album maintains a consistent and dynamic flow of quality, it just never really surpasses the celestial beauty and power of \"So Did We\" (save for possibly \"In Fiction\", which is also absolutely tremendous).\n\nThe instrumentation across Panopticon is very minimalistic. There is no doubt in my mind that the guys in Isis can play should the need arise, but all the sounds on this album lend to the creation of mood and atmosphere, to the creation of the overbearing leviathan that forebodes the devastation and reconstruction of our modern musical landscape. It's so refreshing in today's mess of musical superficiality to see a bunch of young guys get up on a stage and channel this kind of artistic energy amongst themselves. I applaud them for that.\n\nEssential recording. Absolutely essential.\n",
        "\nThe band that changed my life, musically at least, is the German outfit Can. Eight bars into my first listen in 1973 and I knew nothing would be quite the same again.\n\nCan deconstructed rock, making remarkably unconventional rock music with conventional rock musical instruments. They focused on rhythm and texture rather than the usual “bourgeois” song structures. Their music, blessed with a life-giving rhythmic pulse courtesy of drummer Jaki Liebezeit, sounds fresh and inspiring to this day.\n\nLikewise, Isis eschews the usual and predictable in favour of stretched-out musical land- and seascapes. By turns aggressive and contemplative, Isis’ music, like Can’s, really takes you somewhere. It is metal of a unique cast.\n\nI approached this DVD with some trepidation. Listening to Isis is a hermetic pleasure. Alone, in front of the speakers or with the cans on, I go to a special place when listening to Isis. I wasn’t sure that the music would have the same impact, complicated and possibly diluted by onstage images projected onto the small screen.\n\nFortunately the footage, like the band’s modest demeanor, is restrained and un-trendy. No fast zooms or staccato, rhythm-synched edits. Well recorded, there is a satisfying bootleg vibe to the vision. The music comes first. The band’s minimalist approach to lighting, staging and performance all go to support and not distract from the music.\n\nA real highlight is the full set from the Annandale Hotel in Sydney. A recent show, you get to hear the band at its mellifluous best. There’s the grindcore edge, the hoarse growling but also the longer atmospheric passages with clean vocals.\n\nIn a sense, the DVD makes a great “best of” compilation. You can put it on and leave the room, letting the music waft around the house. The vision is less important, again, than the music, although it must be said that the special features are worth a look, especially the album of tour and recording photos. A band with a sense of humour, Isis.\n\nEnjoy also the liner notes. Not a hint of rock star ego or metal mouthing. Like the music – intelligent, thoughtful and always interesting.\n",
        "\nBefore their highly-acclaimed release “Panopticon” in 2004, everyone thought that Isis was just an Egyptian goddess and nothing more. Ever since “Panopticon,” Isis has been compared to the genre of post-rock, which leans away from the traditional elements of choruses, verses, repetitive vocals, or fast/repetitive riffs. With the release of “In the Absence of Truth,” Isis has justly earned the comparison as ‘the Sigur Rós of metal’.\n\n\nIsis has strayed further from their metal roots than ever, finally crossing the boundary into post-rock. Clean vocals are more prevalent and higher in the mix than any of Isis’ other albums, but work extremely well with Isis’ developed sound. The guitars on this album are also very different, with the heavy parts on the album not having as much distortion and the clean parts having a faster pace. Drum work on the album has also changed, featuring more of a tribal style of beat somewhat like Tool.\n\n\nMost of the songs start off at a moderate pace, with only a few instruments playing, a great way to set the mood of the track. Before you know it, Aaron Turner’s soothing vocals come in for a couple verses. His lyrics are then following by an extended instrumental, with more instruments coming in, tempo gradually speeding up, and a gradual crescendo. Almost suddenly, the calm intro has transformed into a massive epic, offering a full sound and emotionally-charged riffs. Songs like “Dulcinea” and “Wrists of Kings” exemplify this formula perfectly.\n\n\nUnlike other so-called ‘progressive metal’ bands such as Dream Theater, where album after album sounds the same (thus not progressive), Isis has gone to the edge of metal, and perhaps have even jumped off. If you are looking for music to mindlessly head bang to, don’t bother with “In the Absence of Truth”. However, if you are someone who prefers to listen to albums all the way through and enjoy epic compositions, then by all means pick this up. Isis has produced an intellectual musical experience, highly recommended for fans of Sigur Rós, Tool, and Godspeed You! Black Emperor.\n\nOriginally written for Texas A&M's student newspaper, The Battalion\n",
        "\n“Sludge metal is a form of heavy metal music that fuses doom metal and hardcore punk. Sludge metal is typically aggressive and abrasive; often featuring shouted vocals, heavily distorted instruments and sharply contrasting tempos.” The key words in that sentence being “heavy”, “aggressive” and “abrasive”. Isis’ second full-length, ‘Oceanic’ is the epitome of sludge, according to that genre definition. However much that may be the case, I still find it difficult to fully appreciate the harsh vocals that Aaron Turner implements on this record. Why? Well, as a long time fan of Isis, I have the ability to be able to use hindsight which, as we all know, is a fantastic gift to have. His clean vocals, which only truly begin to show themselves on ‘Panopticon’ are what gives Isis the edge over a billion over sludge bands that are characterised by harsh vocals, which often become annoying and take away from the underlying sublimity that rears its head in the form of an aquatic-like bass sound and stunning soundscapes, perfected through cleaner instrumentation, as opposed to the harsh distortion that sludge usually brings to the foreground of its display. Early Isis material and the word ‘heavy’ go hand in hand, therefore the definition is certainly apt in this respect. ‘Oceanic’ clearly displays those aggressive tendencies, typically forced onto the audience in the form of heavy guitar effects and Turner’s shouted vocals, as well as the ability to turn a harsh moment into one of withering beauty. The bass, in particular, is special. The performance on bass is one that needs to be highlighted time and again because of its leadership, dragging a weary Isis into battle and its ability to sustain the underlying growth of beauty despite the heavier and harsher instruments (as well as vocals). The control and sophistication of ‘Oceanic’ was never really a factor on the previous effort. This is by far more mature and constructed in a way that makes it more effective as a listen and as a machine, which all brilliant sludge bands should be treated as. \n\nThe cogs of this wheel turn over and over again, with repetition comes a almost faultless sound. The intimidating production does wonders for the instrumentation on ‘Oceanic’, which has a wonderfully apt title. The under water feel to the music makes me feel as those the guitars are waves, pulling me further and further into the whirlpool of Isis, the underlying beauty and spectacular soundscapes. Much like a doom metal band would do, Isis keep the surface rigid and touch, hardened for those fans who appreciate the harshness of sludge, its thick and abrasive sound. Also like doom, the inner workings of the music are sharpened by a stunning beauty. The bass and elements of the percussion are well suited to drawing in a listener with a mesmerising, even hypnotic repetition that ceases before boredom can strike. The guitars build slowly, tugging away at the heart strings with melody and mellifluous chords before they take on their crunchy façade. The musicianship must be praised. We’re dealing with quality of the highest order. Intertwining performances that play out like a movie such as Crash. Many different characters and characteristics from all walks of life, slowly, but ultimately being brought together in a crushing tale of epic proportions that begins all elements of greatness together into one spectacular defining sound. The production is an oddity. There are occasions when sludge metal truly lives up to its name, creating a thick layer of sludge over the instrumentation, protecting it from outside influences and allowing it to work effectively within its realms of chaos and divinity. Despite this, there is a crisp quality to the production. It doesn’t hinder progress, not even at its thickest. Clichés like ‘wall of noise’ were created for things like this. Improved song writing and the ability to be able to craft the soundscapes into many different shapes and sizes is almost unparalleled. Often breath taking, soul destroying and euphoric all in one go, ‘Oceanic’ feels like you’re on a deep sea dive, discovering new and unfounded elements of the sea that man has not laid eyes on before. This is a classic and always will be. Highlights include; False Light, Carry and Hym.\n",
        "\nIsis are a band who require no introduction. Since the iconic ‘Oceanic’ was released in 2002, Isis have developed a sound that is growing more mature by the record. Their sound is renowned for reinventing itself as they progress through the stages of maturity. With ‘Celestial’, Isis were a raw band with a sound any typical angst ridden teenager would have been proud of, but since then, the band have progressively … Progressed! ‘Oceanic’ took what the poor ‘Celestial’ had failed to convey and told it in a way that could be understood by the adoring audience. I’ve always considering the debut to be lesser in almost every aspect to what followed from Isis, but it still serves a purpose in terms of identifying with the listener and giving them a valid history lesson in the shape of how Isis were moulded. The sound that ‘Panopticon’ displays wasn’t always on show, in fact, this record offers a complete re-working of what Isis were even offering on the brilliantly atmospheric ‘Oceanic’, which is often given a ‘classic’ status by fans of the band and the genre in which Isis command. \n\nSome say atmospheric sludge, which is what this is, was partially founded by Isis, if not heavily influenced by and records like ‘Oceanic’ display aptly why that is. Alongside Isis, the pioneers were Neurosis, whom Isis have began to resemble as the years have gone by. To adhere to the numerous do’s and don’ts of this genre of metal, every band must listen and take in carefully the progression of bands like Isis, as well as the aforementioned Neurosis. The sounds of these two bands, in particular, has become iconic and resonates within all fans. The true beauty of Isis’ progression as a band is the simple fact that, despite changing the layout of the songs and how the soundscapes are pieced together, the atmosphere remains. Isis are a band who are forever going through transitional stages, as previously mentioned. This record represents the third stage of their development, which is still continuing to this day. \n\nThey've evolved in every way possible since the early days of ‘Mosquito Control’ and ‘The Red Sea‘, even from their debut album ‘Celestial’ back in the year 2000. For me, the major differences come in terms of musical progression (which sees bass factor in its sound more and more) and the production of Isis' music. In the days of ‘Celestial’ Isis' production was hazy and worthy of their reputation as a sludge metal band, but with ‘The Absence Of Truth’ Isis have developed a far cleaner sound in which every instrument is easily distinguishable and the vocals can actually be made out, even when Turner displays his usual chaotic screams. As I’ve stated with many sludge bands before in the past, although the instrumentation might be superior and sublime, the make-or-break factor of every sludge band is in the vocals. \n\nThankfully, Isis have a talented vocalist on hand to save them their blushes. Differences between this and previous outings can be heard from afar. Its not difficult to establish what has and what hasn’t changed about the musical projection. Isis have implemented more clean vocals - which is a major positive if you ask me. These vocals are more emotive than the screams, which offer only one set of emotional values. The screams, although well portrayed, are restricted by their one-dimensional sound. Whereas the clean vocals smell as sweet as roses, lifting a scent of melancholy over the anger and anguish that the screams provide. This contrast in vocals sounds is appreciated by people like me. I like the fact that Isis aren’t scared to experiment with different vocals and in doing so, they’ve gained more of my respect. \n\nLong gone are the days where Aaron Turner screams his way through song after song, but now there is a bit more variation in vocals which we started to see on ‘Panopticon‘. Seemingly Isis have resorted to a more repetitive tribal feel, which can be felt more so in the percussion than any other aspect. Something like that of Tool on the infamous ‘Lateralus’ (my favourite Tool album, actually). Its a welcomed addition personally. The texture of the music is also something that has been vastly improved upon. The layered structures are more recognisable with the cleaner production, giving the bass breathing space. The bass, like the percussion, reminds me of Tool in many ways. \n\nThe way in which it contains the sadder passages of Isis’ music like a weeping willow hanging its protective branches over the unprotected elements below its motherly appearance. Isis spin out some very beautiful melodies and harmonious vocals along the way, which enrich the atmospheric qualities that lie deep within and on the surface. Comparisons are likely to be made between Isis and a number of bands including, Tool, Pelican and Jesu. But Isis are in a league of their own. This album is simply stunning, it contains everything you'd want and everything that makes music great. Incredible melodies, fantastic structures and a bit of variation from the normality of the restrictive genre. Highlights include; Wrists of Kings, Not In Rivers, But In Drops and Garden of Light.\n",
        "\nIsis have a habit of making you look for a lot of their releases.. All the live series are out of print (I think, anyway), all the Oceanic Remix LPs are hard to find, but the hardest one to find (at least as far as I can tell,) is this one. This one is rarely on Ebay and when it is, it commands fairly high prices. To most people, I would just recommend you download it like I did, as a quick look round the net will find it for you. I just don't think it's really worth the pain of actually getting it, because only half of the album is really worth listening.\n\nThe first track and the last track both aren't all that good. Emission of the Signal would make a decent interlude, if it was shorter.. It's just the repetition of one riff, with a short break in the middle. It would be cool if it was shortened to one minute, treated with tonnes of effects and put in the middle of Celestial.. But instead, it's 5 minute long, and the first track of an EP. EP's should not have interludes. House of Low Culture, the final track, is a mammoth and actually fairly cool ambient bit, sounding at times like a more accessible Sunn O))), droning away for eleven minutes, with some sound effects coming in and out of the mix. It's actually fairly cool, but it will severely test the patience of most people. The piano/keys at the end are fairly nice though, but it's an anti-climatic way to finish this EP.\n\nThe middle two tracks are a Godflesh cover and a Black Sabbath cover, and are probably the best two tracks here. The Streetcleaner cover is massive. The guitars are distorted almost to the point of static, the riffs are massive, pounding beasts with dissonant, higher pitched guitars adding to the sheer nastiness of the track. The vocals are hugely evil, low pitched and distorted. It's by far the heaviest thing Isis have ever done, and few bands would be able to match this song's hugeness. It's quite hard to really describe just how heavy this song is. This is followed up by Hand of Doom, which is a fairly good Sabbath cover, though it's not up to the Godflesh cover. Aaron Turner actually does a fairly decent job of singing Ozzy's vocals, but all in all, it's an just an ok cover.. nothing amazing.\n\nSo it's hard for me to recommend this. The Godflesh cover is awesome, the Black Sabbath cover is ok and so is House of Low Culture. 1 awesome song, 2 ok songs and 1 bad song. Not worth the money and time to track down. Worth downloading, though.\n",
        "\nDamn, another awe-inspiring Isis release. This too got leaked recently. In a strange, twisted sort of way, I'd almost like a bad isis release, just so I could critise it and not look like a rabid, raving fanboy. Which I am. Maybe I should review a few crappy albums to make up for all the 90%+ reviews I've been giving.\n\nThis album is fairly unique in it's creation. Aereogramme are a post-rock band in Scotland, a fairly good one too (or so I've heard), and in July last year, Aereogramme and Isis laid down these three tracks in 2 days of recording. It was fairly obvious from tunes like Altered Course and Weight that Isis were big fans of ambient music, and while it wasn't explored to a huge extent on their new album, they got a a lot of it out here.\n\nSince this is only a few tracks long, and since each track is fairly different, I think a track by track review is justified.\n\nThe first song, low tide, is very post rock in it's approach and structure. Clean guitars reverberate around the stereo mix with whale noises (or something similar) hanging around. The production is rough and raw, but it really fits the tunes. The slow steady build up doesn't explode into the typical Isis ending, instead, it slowly builds up, with increasingly loud and distant drums echoing away. It's one of the best post-rock tracks I've ever heard, with a pristine kind of beauty flowing through the whole thing.\n\nDelial is the reason why there's no 100% rating. It's fairly heavy, and instead of Aereogramme's singer, we get Aaron Turner singing. The middle section is full of screaming and big riffing, but this song in the end doesn't really leave much of an impression, especcially when it's surronded by two massive epics. It sounds like this song was put in as a very rushed process, which wouldn't surprise me, as the other two tracks would have taken a while to record.\n\nThe third song, Stolen, is quite possibly the best post-rock/ambient tune I've ever heard. It's a very slow burner and chances are most metalheads won't dig this tune. I think it's incredible, however, with a sound very reminscent of Sigur Ros at their most delicate and beautiful. Echoing drums and bowed guitar echo away while the Aereogramme singer sings a gorgeous vocal in the background. The bass comes in once in a while to play a simple and amazing two note beat. By the four minute mark all these elements have slowly stopped, and you're left with a transcendent wall of synths. It's heart in mouth stuff, absolutely incredible and very hard to describe. Eventually, a kick drum and handclaps come back in, but luckily they sound great and they fit the music perfectly. Lush Synths and bowed guitar share the space for this, and from about 7:30 to 10:40 the song slowly but surely deconstructs in a similar way to Altered Course of Panopticon. The song, when it finally ends, leaves you breatheless and speechless, with a general reaction of \"How can humans create something so amazing?\" \n\nSo in the end, this is an EP with two amazing tracks, and a song that is decent but not up to the other two monsters. While I guess Isis fans should check this out, be warned if you don't like Post-Rock/Ambient stuff, because that's what 20 of the 24 minutes are, simply put. For fans of that genre, I would say GET THIS NOW. And buy it when it comes out. Buy two copies!\n",
        "\nMediocre album name, similarly average music.. 52%\n\nEver since \"Hym\" slapped me around with it's huge doom penis seven or so years back I've been a pretty big fan of Isis. The early sludge stuff was tops, the descent into post-rock with extra distortion also full of many satisfying moments. However as with many things in life you can have too much of a good thing; In the Absence of Truth is definitely the moment Isis got a bit too interested in post-rock, Mogwai-loving meanderings.\n\nIt's not a terrible album but it is rather boring. The clean noodlings are fairly decent, but there's no catharsis; \"louder\" sections are full of terrible, worthless riffing, \"whole band slams on one chord\" type thing, predictable octave riffs. Songs wander aimlessly; \"Not in Rivers\" sacrifices a brilliant tribal-ish intro for pointless wandering through a few useless riffing patterns, \"Holy Tears\" drifts from a rather cool gothic-ish intro for post-rock wandering, really boring riffs and a reprise of the intro. I guess the first track's a good enough example for what's to follow; a decent build disappates into the aether, with the climax being some completely unspectacular riffs and weak yells (it's hard to describe the \"heavy\" parts with anything but \"really boring riffs\" but, well, that's what they are, every time). Is this Isis or some completely unspectacular clone? It's hard to tell sometimes.\n\nMoments of goodness are found throughout but overall it's a bit too rare for any real sort of redemption to be had, the songs in themselves tend to collapse under their own weight. \"Garden of Light\" is pretty good, I guess; there's more boring riffs but the ending build rips off Explosions in the Sky very well, wheras \"Over Root and Thorn\" builds up in a manner fairly reminiscent of a few Oceanic songs; always a plus. Caxide's bass is less about holding down the guitars in most sections and that's great; dude is a legend and his unique tone and great lines deserve more exposure. Plus, Harris finally busts out on drums a bit, certainly less of the human metronome from Panopticon and closer to the drum god that he is on Wavering Radiant, although damn if he doesn't way overuse that tribal beat.\n\nSo there's a few good bits. If you search through the filler and sheer unexcitement of most songs you'll find some stuff worth listening to. Overall it's not really too offensive, just not that good and a real shame, because Isis are capable of much better.\n",
        "\nI’ve been trying to get this album for ages. I’m a huge Isis fanboy and though that Panopticon was the album of 2004, if not the album of the decade. So after seeing it on Ebay, I snapped it up for the bargain (note the sarcasm) price of $64 Australian. One of the first things I noticed was that in the liner notes, it said “Recorded on Minidisk…” This made me wonder what the quality would be like, but luckily, it’s pretty decent, if not quite as good as Live 4. Whoever mastered it did a very good job.\n\nThe set is pretty damn good... Everything off Panopticon, with Beginning and The End instead of Syndic Calls. The set starts off with a bang. So Did We is an awesome song and it sounds great in a live environment, though the recording quality robs the climax of its power. Backlit has a minute of synths tacked on as an intro, and the clean guitars at the start are much prettier live. The synths sound great too; generally, it’s a real good intro. All of these songs work really well in a live context, but there’s no point going on about each one individually, as most are quite similar to their album versions, with the exception of Beginning and The End, which gets a real nice synth intro, and Altered Course. It was already a super long song, but here it gets almost 6 minutes of length added, with some effects-treated guitar as the intro, and an outro jam that’s even longer then the original outro jam. While the original does a 6 minute long ambient fade out thing, this version only goes quiet for about 4 minutes, and then the volume picks up again. Unfortunately, a lot of this jam is noise, unless if you’ve got good headphones. It’s really dense sounding, and drags the score down a bit. Still, it must’ve been amazing to see live. After about 2 minutes of this heaviness, it sinks back into ambient stuff, which is a good way to end the album. It’s surprising how quiet the crowd is too.. You hardly know they are there, until they make their presence known at certain parts. They’re very attentive and respectful, which is good. \n\nAll in all, this is a pretty good live album. While it’s not hard to find on E-bay, it’s never very cheap, so you’ll need to be a big fan of Isis to enjoy this. Still, for all of us who missed the Panopticon tour, this is the closest thing you’ll get to it.\n",
        "\nI'm sure we all know some bands that can't pull their albums off live. Sometimes, the stuff is too technical, over times, the amount of overdubs and studio trickery make it impossible to accurately replicate the sound. I always thought Isis might be one of those bands. That the vocals wouldn't sound right. Or that the guitars wouldn't be as crushing as they are on record. Put simply.. I was wrong. This is an excellent live album and while I've never seen their show, to me it confirms Isis as a class live act.\n\nAdmittedly, not every song is as crushing as it is on record. The songs that were recorded earlier (Gentle Time, C.F.T and Celestial) aren't quite as heavy as per usual, and when compared to the stuff that's been recorded more recently, you can see the progression Isis have done over the years in terms of live stuff. Still, they're pretty good recordings, all generously extended with a few riffs extended a bit, and in the case of a few songs on this album, long ambient bits added. These ambient bits sound really good, particularly the C.F.T intro. C.F.T was always my least favourite song of Celestial, but in a live environment, it really shines. What was once a fairly plain song becomes moody, epic and mystical in the live environment. Celestial sounds pretty cool, though it doesn't match the massive heaviness that's in the album version. The improv however, recorded in the same year, really does illustrate how talented these guys are. For a jam session, it's pretty cohesive and sounds pretty awesome.\n\nProbably the best song on this album is False Light. This is probably the heaviest song on Oceanic, and here, it's even heavier. The powerful, pounding riff that's the centrepiece of this song sounds stunning live, and it must be truly intense to see them play this song. There's some pretty cool drum rolls by Aaron Harris too. Basically, False Light sounds incredible. The middle part is great too, and in typical live Isis fashion, it's drawn out a bit too, just for ultimate awesomeness.\n\nThe two tracks that where recorded latest show that Isis have basically got their tunes down perfectly. The guitars are just as heavy as on record (that's no mean feat) basically, everything is as it should be. Glisten sounds pretty cool, but the real good track here is the extended version of weight, clocking in at 12:25. Not surprisingly, this has an ambient intro (which is tacked on to the song's already ambient intro) but it works pretty well. After about 5 minutes, it finally starts going, and like C.F.T, this song works much better live. Unlike C.F.T however, it was a great song already. This is another classic song, that's worth tracking down this CD just to get this song.\n\nBasically, I couldn't recommend this highly enough. Even if you've only got Panopticon, this CD would still be good for you. The recording quality varies a little bit, but overall you can't complain too much. It's not for sale online yet, only on tour, but as soon as it is, snap it up before it's gone!\n\nan edit: Dropping it down by 10%. It's still a damn good live album.. but 97%?? It's not that great. Also, It's out of print, so good luck finding it!\n",
        "\nAfter completely flooring an all-too-small set of metalheads (initially including myself, I must admit) with 2002’s mighty “Oceanic”, Isis faced the unenviable task of having to do it again. Stylistically, fans may have been uncertain as to what sort of evolving Isis would do in the two long years between albums, but as for quality – it had better be some damn good stuff they were giving us. And really, who can blame fans for wanting nothing short of near-perfection, especially in light of the band’s astoundingly impressive track record up to that point. Lesser acts may have faltered badly under such circumstances, getting crushed by the wheels of the juggernaut that is high expectations. Not Isis – no, instead they just proceeded to give us an album the likes of which I realistically had no right to expect, all the while cementing their position as proof positive that metal in the 21st century extends comfortably beyond traditional realms (death, power, thrash, etc.). It does take a while to sink in – like you expected anything else? – and it can appear at times to be one bloated, meandering leviathan of a mess. Don’t let that deter you from experiencing “Panopticon”, for the effort you exert in digesting this beast is repaid in full a hundred times over.\n\nFor those who have never heard Isis, understand that describing their music is inherently difficult to do in anything approaching a satisfactory way. I’ve seen much better writers than myself try and fail, so I’ll just take the lazy way out and recommend you download a couple of songs. Just don’t expect anything rigidly structured or traditional in nature and you should be fine. Various descriptions paint them as “atmospheric sludge”, and while this phrase is certainly appropriate it is also quite confined. The term sludge itself implies a certain subset of doom in which a lurching tempo is favored. Well, Isis songs do have plenty of “slow” parts, but to focus on tempo is really to miss the point completely. In that same sense, it’s not really doom metal either, for I’d say they play more of a melodically “quiet” style than a “slow” style. For that matter, let’s just say the hell with any sort of traditional classifications, because it just ain’t going to work here, folks. If you’ve heard Neurosis, Red Sparowes, Pelican, or bands of that nature, then picture something along those lines. Of course, if you’ve heard and enjoy any of those bands, chances are that you already have this and aren’t wasting your time with this review.\n\nThe essential challenge in crafting a work such as this is keeping things interesting. Indeed, when your shortest song is a little under seven minutes and you’ve got an hour’s worth of material, you’d better know how to write a song with substance AND style. Furthermore, look at some of the lyrics. Two verses total for an eight minute song? Clearly there’s going to be a lot of “downtime”, if you will. This is where Isis, much like instrumental all-stars Pelican, shine brightest. I will say that these songs are the complete antithesis of what I refer to as “driving songs”. You know the kind – speedy, short tracks that are exciting but lack real staying power or creative zest. With Isis you’re probably more likely to find yourself in a coma-induced wreck. Mind you, that coma, for a near-perfect 59:04, is simply wonderful. And that is the main point here. Music such as this is meant to transcend the basic notion of artistic expression – really, it becomes a sort of journey by which you get lost in the desolate atmosphere the band so elegantly creates. Forget things like hooks and catchy choruses, because there aren’t any to be found here.\n\nAs for the specifics of this thing, it’s still Isis. Songs are composed of mainly slow, drawn-out sections featuring sparse drumming and even sparser vocals. Despite the often laborious pace, the guitar work is still exquisite. These guys don’t just lay down chords with their instruments. They use them to develop the dominantly sorrowful atmosphere this thing is so drenched in. Don’t expect any furious double-bass kicks, blastbeats, traditional guitar solos – none of that stuff is here. Isis do not need it. What you can expect, however, is a nice mix of hardcore-ish shouting and clean vocals, with the clean parts especially well done (more clean vocals on the next one, please!). Don’t worry if you hate shouting vocals – I was the same way and I love this stuff. Besides, you’ll rarely notice them.\n\nI suppose Isis aren’t for everyone. If your metal collection consists solely of death, thrash, or power metal, then you may hate this stuff. Actually, Isis will challenge your preconceived notions of what exactly constitutes heavy metal. They’re slow, but not really doom metal. They certainly aren’t very heavy in the sense that you likely won’t be accused of listening to mindlessly incessant noise. Almost entirely instrumental for much of the album, the vocals, such a focal point on most metal albums, are of very little import here. The significance of these songs extends far beyond any one aspect of the creation. If you are an open-minded and patient metalhead, I would urge you to set aside an hour in which to experience “Panopticon”. In the end you probably won’t remember a single song from the album. For most metal albums this would be infinitely damning, but for Isis it’s a complement. “Panopticon” is one of those rare albums that simply shatters the pop-radio-induced notion that music is no longer an art form, but an entertainment form. The fact of the matter is, Isis manages to be both impressively artistic and damn entertaining at the same time. Just give it a chance and you’ll be rewarded.\n",
        "\nI initally didn't like most of the songs on this record, but after a lot of listening (and getting used to the earlier Isis sound) I really started to enjoy this entire album, so, in order to do this record justice, I thought I'd re-review it, because this albums deserves a higher rating then the 70% I gave it.\n\nThis album starts off with a big bang. Well, after the SGNL track. Celestial (The Tower) is a monster of a song. There's some damn big riffs here, particurly the one note riff that dominates the first few minutes. Really headbangable, and with some great drumming. Sure, it's not very techincal, but there's a really heavy groove. It's just awesome. It's followed up by some rather good screaming too, before sinking into a long, slow space rock breakdown, complete with delay effects and lazy guitar leads.\n\nThis album is mostly a mixture of two things: Heavy, chunky guitar riffs with a groove, and melodic, psychedelic kinda stuff. The heavy stuff is always very good, with the possible exception of Glisten. Swarm Reigns (Down) has some really cool, heavy stoner riffing. Deconstructing Towers is actually a fairly fast song. It's got some really good, straight up Metallica style riffing. That is, until it dissolves into a painfully heavy break down, laden with feedback. It's a bit gonzo or whatever, but it's really damn good, and painfully heavy. Gentle Time rocks out with some slow and super laidback stoner riffing. The guitar tone really helps these songs. It's super-distorted, a real wall of sound thing going on. It's not really as evident in songs with more of a single note thing, but songs like Collapse and Crush, Gentle Time and the Title track remind us that Isis are a very heavy band. The drums in this record are great too. I'd say it's Aaron Harris's best effort in Isis yet. It's not ultra techincal blasts or anything, it's fairly simple and very effective, it really keeps the song pumping. The bassist is also really good. jeff Caxide is one underrated bassist, and he has a big role in this album, whether doubling something to make it heavier, or plodding away in the background. \n\nThe thing that makes this record special, however, are the mellow bits. Yeah, the heavy bits are ultimate. But most bands can only do one or the other. Thankfully, that's not the case with Isis. Celestial (The Tower) has a great space-rock break, Collapse and Crush sinks into some really cool melodic beats, which build up with a great fuzzed out bass line underneath. C.F.T, while for the most part being fairly boring, has some really great melodic Ideas too. Once again, the drums should be mentioned. Harris does some great stuff in these softer parts, and why he isn't praised to the skies I don't understand. Maybe it's the lack of double bass blasts or whatever. Regardless, he's an amazing drummer. The vocals are really quite good in this album. While most of it is the screaming we all know and love, there's a bit of experimentation in this album. No cleam vocals, but there is some strange singing kinda stuff in Gentle Time, and the strange yells Aaron Turner does in Celestial really complement the song brilliantly, and they're not that easy to do either. It's also good hearing a bit of 2 vocalist action, as we seen, again, in the title track. That's the last time, and only time I've ever heard that attempted in an Isis song.. I wish they could try it again. \n\nSo, in conclusion, you might well hate this album. The SGNl tracks were a big put-off for me, and it's taken me a while to fully understand and like this album. It's not in the same class as Panopticon or Oceanic, but it's damn close. A must buy for all stoner fans, as it's definetly their most straight up stoner album. Definetly a must buy for all Isis fans too, mainly because it kicks major ass.\n",
        "\nIsis seem to enjoy making people suffer, by releasing a variety of limited edition EPs, live albums and remixes. Oceanic Remixes IV has been out of print for a long time now, but after seeing it for sale at a records store for $100 (!) Australian dollars, I decided to part with some cash and get another record. \n\nThe three songs on this record are all extremely good. Venetian Snares do a crazy remix of The Beginning and the End. It starts off with some thick, chunky guitar, and some good guitar/bass interplay, before going off into a crazy Drum and Bass song, complete with crazy ass drumming and keyboard stabs. Aaron's vocals are slowed down, and the strange drumming continues.. It almost sounds like a parody, but it works really well, though I'm sure some Isis-ites would consider it Blasphemy.\n\nThe next track is very weird.. Out of all the remixes, it's definetly the most far out-there. From Sinking turns from a heavy damn sludge song into a song that could be described as Ambient, but instead of it being the usual relaxing ambient kinda stuff, it's a quite eerie and harrowing experience. It's very spare in it's approach, with normally just the occaisonal sound coming from out of nowhere. Nonetheless, it warms on you, and it's probably my favourite song on this record. The title (From: Sinking To: Drowning) is very appropriate. It's definetly a song to drown too.\n\nThe final song is a little bit of a disappointment. It's a strange remix of Weight, turning the ambient centre of Oceanic into a thing full of guitar noise and feedback. It is quite beautiful, but it only lasted a few listens, until you just get sick of it. Maybe I'm wrong though, as for many people, that's one of the best remixes. Oh well.\n\nSo while all the songs are fairly good, unless if you're an Isis fanboy (like me) there's not really much point getting this record. There's only 3 songs, it's very expensive, and it's only available on vinyl. Get the Oceanic Remixes & Reinterpretations instead.\n",
        "\nOne thing that seems common among most sludge bands is the tendency to eventually release a Space-Metal album. More often then not, the album sinks, being way too pretensious, or just way too boring. Oceanic is not one of these albums though. While it may be epic, with all the songs going over 6 1/2 minutes, it still retains the earthy feeling off previous Isis albums. Isis dont feel the need to go spacey, instead, they seem to have been spending a lot of their time swimming.\n\nThis album has a truely oceanic feel. Guitar lines ebb and flow, with a lick coming to the forefront before sinking back to join the rest of the music. The bass is particurly good, often bubbling away just under the surface, always supporting the guitars but often going off on it's own tangent. The vocals are, as always, buried in the mix, complementing the guitars brilliantly. One thing that really improves the album is the use of Female vocals. They've been mixed very low indeed, but repeated listenings bring them out, and they enrich the songs for it.\n\nIn this album, Isis for the most part are happy letting the songs wander off in their own direction. There's no verse-chorus-verse thing here, with all the songs evolving in their own matter. Isis do this very well, and much of the structures are unpredictable. Carry starts off with ambient guitar, and slowly adds layers, and 6 and a half minutes later, it's pounding you with a huge metal riff. Beginning and the End twists and turns, starting off heavy, going into slow twisting guitar lines, before getting heavy again, then going back to the slow mellow vibe of before. A lot of similar bands will do the whole start off quiet end up loud thing, but Isis don't use that tired formula. The songs just go along very naturally, sometimes with a long extended mellow part, sometimes, just drowning you with waves of noise.\n\nIn the end, this is definetly not an album that will appeal to everyone.Some people will find it too slow. I didn't like this album much from the first listening, but repeated listenings show that albums of this quality don't come along very often. The best release of 2002. If you're curious about Isis, get this album first.\n",
        "\nIm a huge Isis fan, but nonetheless I approached this with some apprehension, having heard how damn brutal this album was. But, it seems my fears where misplaced. This album is insane, but it ranks with Isis's best works.\n\nIt's surprising how loud Aaron's vocals are in this recording. They're rough as hell and extremely abrasive, but they're also a bit more comprehendable then the later albums. The screams really add a huge amount of heaviness to this record, and it's surprising how mature Aaron's vocals are in this album. The lyrics are also very good for a debut, which is a refreshing change.\n\nThe riffs are brutal, and really make this album great. The build-up for Poison Eggs is melodic and gentle, but thats about all the gentleness you'll get from this album. The riffing in Life Under the Swatter is genius, and Hive Destruction sees Isis emphasising more of a groove thing, which works very well. Most of the songs feature much faster riffing then all the next Isis albums too, which surprised me, but they're all extremely headbangable, and it's a refreshing reminder of how underrated Aaron Turner's guitar work is. His guitar work is brilliantly backed by the great bass work of Jeff Caxide (A Criminally underrated bassist) and the drumming of Aaron Harris. The drumming in this is a lot more frantic, with a lot more fills being played then the later albums.\n\nThere's not really anything bad you can say about this album. Isis are extremely heavy on this album, but they still possess the great songwriting skills and melodic genius that would later surface. If you're new to this band though, get Oceanic, because this is a facet of Isis that would only be explored on this album and the vastly inferior Red Sea EP.\n\nEdit: I've taken it down 10%. Why? Because while it's a damn good record, it's not so good it deserves a 95%.. Save that for the later Isis albums.\n",
        "\nOceanic was a monster of an album, an so when this CD arrived, I was both enthusiastic and apprehensive. Theres no denying that the remixers (Mike Patton, JK Broadrick) are all great at their own thing.. But could they do justice to what is maybe the album of the decade? Well, while it isn't as life changing as Oceanic this is still throughly entertaining and really quite good.\n\nThe first song starts off faithfully enough. Ayal Naor does a great remix of False Light, adding a bit of Carry into it. It works really well, but otherwise, it's basically the same as False Light. So nothing really original there.\n\nBut that's where the straight up covers end. A lot of the songs are almost completely unrecognisable. Some of the songs are stripped down to ambient noise and static, like Teledubgnosis's version of Maritime, which sounds nothing at all like the original. Some songs go in the opposite direction, but none of them sound like the originals. Venetian Snares do a bizarre cover of \"The beginning and the end\" Turning the first half into a drum and bass song, and then drifting into calmer waters, before going back to more drum and bass madness. It's crazy.\n\nThe best songs in this though, are ones that go beyond merely screwing with the songs and attempt to create maybe just a better version of the songs. Enter Broadrick. Broadrick did an amazing remix of Celestial for their SGNL05 album, turning a pumping metal song into an expansive trance track. He does it again for Hym, which turns into a 15 minute long epic. Tim Hecker's brilliant 2nd remix of Carry is amazing as well, turning the song into a soaring piece of sound. It's really beautiful, and extremely Oceanic in it's approach.\n\nWhile I wouldn't recommend this to people who don't own Oceanic, anyone who has Oceanic should enjoy this. A little bit inconsistent, perhaps, but overall quite an entertaining album.\n\nStandout Tracks: Carry (Second Version) JK Broadrick: Hym\n",
        "\nI got this album right after Panopticon, and at first, I hated it. I couldnt seem to comprehend that this was the same band as the one who wrote the sparse and fairly mellow grooves that where in Panopticon. Instead of Aaron doing his fairly grungy kinda singing, here he was doing nothing but raw screaming, and all the guitars where permanently set on heavy. Still, as I brought more Isis albums, I began to realise what a great album this is, a perfect mix of the heaviness before and the (relative) mellowness that would come after this album.\n\nThis album starts off with Sgnl 05, and all I can say is.. the less said about that the better. The album really kicks off with Divine Mother, which has an extremely awesome riff at the beginning. It's only a 1 chord groove, but its still awesome. Then Aaron adds his quite awesome Screams over a killer bass line. THe song takes a turn into Melodic territory after a while, which I wasnt expecting. Still, it works extremely well. A very good song.\n\nThe next song is quite possibly the weirdest, and best song Isis have ever made. A great ambient intro, and then a very weird, but extremely cool guitar (?) riff. Very trippy, and the weird, extremely quiet vocal from Aaron Turner (The first clean vocals ever heard in an Isis song, I think.) The riff is really repetitive, but very good. I dont really know why, but I absolutely love this song, and I'd buy the album based on this one song.\n\nWE then have Constructing Towers, which is the weak point on this album. It's quite a shock after hearing Beneath Below. Its very sludgy, very slow and painfully heavy. Its also extremely downbeat and repetitive though, and it gets tiresome. It's very tough listening, and I dont really like it much. If you're into heavier doom though, (eg Khanate, Earth) or something you might like it. \n\nThe album finishes off with a great song though. It's a remix of Celestial (The Tower). That song was a great rocking song to begin with, but with the help of some guy from Godflesh, its a lot better. Gone are the heavy grooves of the tower, and instead of a big riff we get a laid back, doom-y groove from a slightly distorted guitar. As the song goes along, more layers are slowly added and it becomes more and more ethereal, until its just a single chord played on some synth pads. It's a really good ending, and very fitting for this album. All in all, this is a very good album, a very diverse album, and also a great intro to Isis for people, as it has some of their most brutal work on it, and some of their mellowest work on it.\n",
        "\nI'm redoing my review because the last one of it was SHITE.\n\nOne thing that you don't typically associate with Isis these days is the phrase 'Crushing sludge riffage'. Panoption was heavy once in a while but tended to go for more of a wall of sound feel, whereas ITAOT pretty much failed at all the heavy parts. It's sad that the heavy, more metallic parts of Isis's music has slowly been filtered out over the years. \n\nSo it's nice to be able to return to EPs like this one, from way back in the day when Isis were kind of a sludgier, crustier version of Neurosis with their songs mainly consisting of epic, planet destroying riffs that just shat on your head AGAIN AND AGAIN.\n\nYep, this is some heavy and brutal stuff. 'Charmicarmicat' is rather strange in it's perplexing, completely unstructured noise, and it sets the tone (to an extent, anyway) of what's to come later on in the EP. Ignoring the rather unnecessary samples, 'The Minus times' and the title track offer up some really quality riffs. It's rather hard to say much else but 'these riffs are super distorted, slow and really crushing', but that's basically all there is to say, really. For those only familiar with Isis's later work, imagine Celestial sped up a bit, and given a much, I guess \"Spikier\" guitar tone. \n\nNeedless to say, those looking for epic guitar atmospherics won't find much to love here- there's a bit of a concession in the mellow part of the title track, but otherwise this is sludge with some seriously massive riffs- the final riff of the title track would be up there with Hym as the most epic thing Isis have ever done, just a massive, massive riff.\n\nAlso, it's worth noting that Isis slapped their '98 demo on here as well. I didn't originally have that with my version, but I've heard it since and it sounds pretty damn huge. It's basically the same as the rest of this EP but perhaps a little bit simpler, Isis finding one or two huge riffs and just plugging away at them, nice stuff indeed. Combined with the excellent sludge of the Red Sea songs, it's a very enjoyable package, full of epic riffs and not much else.\n",
        "\nFans of Isis’ later works may find this EP quite surprising, shocking even. There are none of those wonderfully melodic and light guitar riffs, or quiet passages, neither is there sound as progressive. But this isn’t a bad thing; this EP is similar in sound to Celestial, but overall it’s much dirtier, with a really thick sludgy sound that makes this EP quite a heavy and intense listen, especially compared to Panopticon or Oceanic.\n\nThe first element that will strike you is the jarring, twisted, razor sharp riffs that go straight for the jugular. The guitars are constantly jamming away and you can clearly hear that layered, interwoven sound that Isis has now perfected. Underneath the guitars is a very sludgy and thick bass line that gives the music its dirty sound, it can be heard throughout the EP clearly and really makes the music flow really nicely. \n\nBacking this all up is some very strong drumming, whilst not overly complex, it’s no where near as repetitive as the drum work on Isis’ later albums can be. The drummers pace is generally faster than in modern day Isis, but never goes above mid-tempo.\n\nVocal wise, Aaron turners drowned out vocals are as savage as ever, and are prevalent throughout most songs, which is certainly a good thing as I’ve always thought he’s a great vocalist. He definitely sounds much more pissed than on there later works. \n\nSo basically, what we have here is a rawer, sludgier, and less repetitive Isis, that goes straight for the throat and doesn’t let go until the tracks done, as opposed to the calming, soothing sound on there recent releases. Some samples from Natural born killers are used as intros for some of the song, which makes a nice change from the usual horror movie samples I’m generally used too (being a big brutal DM fan). Fans of this EP should also check out the Mosquito control EP, as it’s even rawer than this one.\n",
        "\nOne my first review, I only gave this 90%, but repeated listens have revealed how damn good this album is, so I thought I needed to redo my review.\n\nThis album is a masterpiece, with every second perfectly done, every instrument playing the perfect bit at the right time. There's a kind of jammy thing going on in this record that Isis never had in previous records. Isis seem content to lose themselves in open space, and the album seems to be the better for it. While the heavy parts are amazing, the cleaner, mellower parts are what make this album so great. \n\nThe album starts off with a really brutal beginning. The first 30 seconds of \"So Did We\" are really heavy, but after that bit, the guitars move into a great clean part, with some excellent guitar/drum interplay. So Did We is a good summing up of the album, because it's really heavy in some parts, and beautiful and clean in some parts. The riff that goes form 1:38 to 2:19 is amazingly beautiful, probably one of the best clean things I've ever heard played. THe song moves into heaviness again, before cleaning up and then ending in a boom. There's no choruses, no verses, just an amazing progression through different soundscapes. \n\nAll of the other songs follow a similar kind of structure. Some start off really quiet and moody (Eg In Fiction) before building up into a dense wall of noise. Some take the other route. Altered Course starts off heavy, and slowly builds up, before turning itself into a beautiful trance song, which slowly builds up over 6 minutes. The first 4 minutes of Altered Course are probably the best music you will ever hear, and the album is worth getting just for that.\n\nThere's not a single moment of bad music here. Isis have evolved into a band that writes painfully beautiful music. Gone are the doomy riffs of Celestial, and for the most part, the screamed vocals are gone too, replaced by some amazing singing by Aaron Turner. This album is absolutely essential, everyone needs to hear this album before they die.\n",
        "\nIsis is a great, great band. Their early material (SGNL 05 and Celestial) was ahead of its time and 2002’s stunning ‘Oceanic’ topped my best list for that year. Needless to say, the imminent arrival of its follow up ‘Panopticon’ was a major highlight for me. I had massive expectations.\n\nIt’s a rather difficult thing to describe the music of Isis. To the straight up metal head, they’re probably too cerebral. Certainly, they have a massive appeal to the metal fan base, but calling them a metal band is just too narrow. Perhaps that’s why they sit so comfortably on a label like Mike Patton’s Ipecac. All uniquely different heavy music bands seem to reside on his roster (Fantomas, Melvins). Isis is one of those bands.\n\nFor the metal fan that likes to explore musical paths beyond the typical standard, then acts like Neurosis and Cult of Luna are your obvious comparison with Isis. The ball park they all play in is a massively broad and expansive one, but the objective is still the same – to create imaginative, wide reaching compositions that entice and mesmerize the listener with a depth and creativity that very few other ‘heavy’ bands can muster. \n\nPanopticon is another amazing step in the life of this band. It has the same atmospheric feel of ‘Oceanic’, but with some subtle differences. If anything, Isis seem to treading the ‘less is more’ path that Neurosis so eloquently captured on their ‘ A Sun that Never Sets’ disc and took to even more exploratory heights with ‘The Eye of Every Storm’. By this I mean that Isis are content to be even more deliberate in how they combine both their mellow and heavy elements. ‘Panopticon’ is a much sparser sounding album – there is more air in the music and much more low, slow and moodier sections throughout. In true Neurosis style, these mellower parts make Isis’ heavier sections all the more powerful and dramatic. Isis have an amazing ability to make their compositions build to hulk-like crescendo’s, using lush, layered melodies, brooding ‘Tool-like’ bass lines and an unnerving mature, if slightly buried vocal performance from Aaron Turner.\n\nAs a direct comparison to the phenomenal ‘Oceanic’, ‘Panopticon’ sounds like a much cleaner record. Their raw, chaotic Noisecore elements that so enamored their earlier material are now only part of their whole Isis picture. No doubt, their trademark sound is still very much intact, it’s just that Isis are now becoming more progressive in the use of light and shade in their music. As a result, ‘Panopticon’ is slightly more unpredictable in the turns that it makes; there is more intensity, intricacy and depth in everything they do.\n\nIt is hard to imagine where Isis will go to after this album. I remember questioning the Neurosis path after the colossal ‘Through Silver in Blood’ disc. I thought that was it for them. How wrong was I? I hope Isis has the same effect. I’m not sure if ‘Panopticon’ is as grand as ‘Oceanic’ sound wise, but certainly, it has the same hypnotic impact. Fans of truly expansive, progressive music with passion and intensity in equal parts will find the world of Isis extremely inviting. For me, the expectations have been met!\n\noriginally written for www.pyromusic.net\n",
        "\nUnlike any older Isis releases, \"Oceanic\" is not ultra-heavy but now it is elevated to incredible intricate sonic architecture that relies on extreme progression, dynamics, and rich texture. The songs flow in and out of heavy and clean parts, like waves of the ocean, seamlessly with incredible melody. The songs really keep on changing, never leaving a boring feeling or any repetitiveness (except for the two short \"intermission\" songs.) The drumming throughout the entire album is really effective. It isn't really technical or fast, but it is so fitting and blends in so perfectly with the music. The clean guitars add rich melody and atmosphere.\n\nThe vocals are deep, harsh screams, but not too fast or aggressive. They certainly fit the type of music, and I have learned to like them. There are a little bit of semi-clean vocals also. They are really used more for rhythm than melody. Large parts of songs are instrumental anyways.\n\n“The Beginning and the End” starts with a quick tumbling drum beat and quickly starts a very unique melody, very soon adding the aggressive vocals. The cleaner, instrumental parts in this song are some of Isis’ best. Near the end the song slowly gets calmer and fades out. It’s definitely one of their best songs.\n\n“False Light” begins with an awesome, threatening sounding melody, getting aggressive fast, and then containing some great instrumental parts, sneakily changing into the next song.\n\n\"Carry\" is a very interesting song. It is progressive in a different way, providing an incredible musical buildup. It starts out with almost nothing, slowly adding substance, then percussion, then a little guitar plucking, then another guitar, then changing to a very unique sounding riff, eventually leading to the vocal, heavier part of the song, which doesn't stop evolving and growing.\n\nAfter the first four songs, you have a little intermission entitled “-“ full of sound effects, and then two very different songs:\n\"Maritime,\" a short, simple melody that truly has an \"Oceanic\" feel, makes me fell like I am exploring the underwater world on a tropical island, and then the monster song \"Weight.\" This is probably the most inventive song on the album, maybe even my favorite song on it. This song is a bit monotonous on first few listens. (I can really see Mogwai comparisons for this) and relies on the same theme throughout the song, adding and changing some things along the way. It is very minimal, but also complex in a way that is hard to describe. It starts out with a soft, underwater sounding melody and very slowly evolves and gets heavier. The suspenseful buildup is just as great as the amazing finish with female vocals. It provides visuals for the imagination: I think of a scuba-diver getting sucked into an undertow and getting gradually pulled towards the bottom of the ocean because of unavoidable water pressure rapidly getting heavier, eventually leading to his death. Whatever you imagine, this song definitely has an extremely stressful, helplessness, and fearful feeling, but it makes the song amazing.\n\nThis is one of the CDs in my collection that just took a really long time to fully appreciate. This is becoming a classic in my collection and in the world of metal. If you happen to be really interested and then when you finally hear it you're disappointed, give it a lot of time. Isis is beginning to evolve into a truly unique band and hopefully they will continue to do so. Check out their next album, \"Panopticon\" also.\n",
        "\nWith 2002’s release of Oceanic, I knew this band was headed for something really amazing, if that wasn’t it already. The way they had evolved from their previous albums kind of foreshadowed what their next album may bring. This album is significantly softer than previous releases, but I assure you it is still metal. You may have noticed Oceanic started this trend, with a little more clean vocals, some clean instrumental parts in the songs, and overall less total raw hardcore chaotic guitar madness. Panopticon continues with even more clean vocals as before. The clean vocals are rough and usually not so harmonious (but they have improved a lot since Oceanic), but they’re best that way. And Isis’ vocals are usually “behind” the music instead of “in front” of it, focusing more on the music. If you have Oceanic already, you probably know what I mean. Most of the album, like Oceanic, is instrumental (I’d say about three-fourths). This however has a lot more progressive, complex, unpredictable song structures, showcasing the band’s pure evolution and intense depth. Even though the guitars are generally not as heavy, or heavy for as long, they have so much more depth and intricacy. There are much more post-rock like clean instrumental passages, for a sort of post-metal sound.\n\nThis vast masterpiece kicks off with “So Did We,” which may be a candidate for one of my top 25 or 50 songs ever (Not that I keep track). It is probably the best new song I’ve heard this year, and Isis’ best song to date. It reminds you that Isis is still metal by starting off with a pounding heavy riff and sudden hardcore-style vocals. This continues for a very short time until the heaviness abruptly stops and makes way for one of the best instrumental passages Isis have created. After that, it gets heavier again with some pretty good clean vocals. Then for five more minutes it is nothing but instrumental, it keeps on changing and shifting and evolving... couldn’t be better. When you finally get to the end of this song, it sounds absolutely nothing like what it did when it started, which is how music should be.\n\n“Backlit” starts off very melodic and much different from anything Isis have done, and continues on that way; it’s a nice new direction for the band. There are a lot of clean vocals here that actually sound good and melodic, including a part where he keeps switching between hardcore and clean (probably the best part of the song). This song continues on with many instrumental parts with some exceptional melodies and the song ends with a bombardment of heaviness.\n\n“In Fiction” starts off very calmly, kind of similarly to “Weight” on Oceanic. It gradually adds rhythm and layers, and doesn’t have any vocals for the first 4 minutes. Then it starts coming alive with the addition of some clean vocals and keeps progressing amazingly. A very solid song. It cleverly shifts right into “Wills Dissolve” which also starts off calmly with a somewhat pensive and eerie feeling, then a very haunting, clean melody surfaces – also a very different direction for the band. Again, the song steadily unfolds until it has a full sound with vocals, and there are some pretty good, straightforward (for a change) clean vocals here.\n\nAgain, the previous song switches to the next behind your back (a feature that always makes albums more epic, in my opinion). “Syndic Calls” is a very well-constructed song; the beginning of it just has that certain Isis vibe that I find once in a while. There is a small section with vocals and then a quite interesting instrumental part. When this song is almost over, there is a small amount of clean vocals over heavy guitars that come in at the perfect time to finish up the song. The buildup to this part is just magnificent. I have to say these are some of the most powerful of Aaron Turner’s clean vocals and probably the best he has done, even though it only lasts like 30 seconds. This particular song definitely goes by quickly, it definitely doesn’t seem like its 9 and a half minutes.\n\nThe last two songs make the album go downhill a little. “Altered Course” features Justin Chancellor from Tool on bass guitar. This is a 10-minute instrumental (well, 9:57 to be exact), the longest on the album. Unfortunately I have to say I don’t think this song is all that it could be. It starts off kind of suddenly and most of it seems very random and directionless. The individual parts are mostly very good, and there are some sweet riffs, it just seems like they don’t flow into each other too well. Also some of it just drones on too long with very little change. It is still very good, but the rest of the album is so perfect I can’t help but critique it. “Grinning Mouths” starts off suddenly and is another one without vocals for the first 4 minutes. It’s probably the worst song, there’s nothing particularly interesting about it, and I really do not like how it ends the album, it’s very sudden and un-climatic, nothing builds up to it. They should have saved the best for last, not the other way around. There’s a good chance these two songs will gradually grow on me, because it seems sometimes when I don’t like songs right away, they turn out to be better than ones I liked right away.\n\nI don’t really like the track order on this album. Tracks 6 and 7 seem like they should be somewhere in the middle, because they are the least interesting, and I think “Syndic Calls” should end the album because it ends with a bang. Also I think “In Fiction” should start the album because it starts out really gradually and slowly, and “So Did We” is so good I don’t want to get it over with so quickly... but on the other hand it is nice to start out the album with a heavy rush instead of calm gradual progression. Since a few songs flow right into each other, it’s hard to come up with an alternate track order. But I am someone who likes to experiment with this and I have come up with both 1-2-6-7-3-4-5 and 3-4-5-1-6-7-2 and they are interesting to do once in a while. Try them out if you are able to pre-program the track order (like on Winamp)\n\nI think fans of Tool who aren’t into much more obscure music yet would really enjoy Isis, this album especially. They have some similarities to Tool (and have a band member playing on this album) and are a few notches on the heavier side. I also think fans of Godspeed you Black Emperor, who are also into other metal, would really appreciate this album. If you’ve been a fan of Isis for a long time and said they have a lot of potential... this is where that potential has lead them. All the potential has been bundled up and released on this album. They have naturally evolved, most bands do, I think for the better. This is their best release yet and, I feel soon enough might be in my top 10 albums.\n",
        "\nI believe this is the finest EP by this amazingly innovative band. It contains 4 real songs and an intro. It is a great addition or extension of \"Celestial\" so if you like that, you're sure to enjoy this. And it is 35 minutes long, which is as long as some bands' full albums.\n\nThe first track is an intro, and sounds similar to Celestial's intro. The song goes on for a while as a sluggish, crunchy, drawn out, standard Isis song, then about halfway through it; it breaks down into a clean, ominous melodic riff, something I wasn't expecting when listening for the first time, very nice refreshing change in direction in the song. \"Beneath Below\" is a shorter, ambient track with a pummeling bass drum. \"Constructing Towers\" starts off slowly with a quiet chord being strummed, then progresses on, picking up pace towards the end, until it finally deconstructs into swirling frequencies.\n\n\"Celestial (Signal Fills the Void)\" is a remix of \"Celestial (The Tower),\" but I didn't even recognize it was a remix. This is probably the most interesting song, with ambient additions of keyboards, distant screams, and industrial noises to the rhythmic metallic chaos. This song progresses backwards and slowly becomes more empty towards the end of its 10 minute duration, however adding more ethereal sounding keyboards, and finally breaking down into a single chord. It's definitely one of my top favorite Isis songs. Be sure to check out their full length albums first!\n",
        "\nThis is a great, super-raw, super-heavy EP. It is so much more chaotic then what Isis would eventually evolve into. If you have, say Oceanic and want to hear what a heavier, deadlier Isis would sound like, this is it.\n\nThe first song, \"Poison Eggs\" is one of the best Isis songs there is. It starts off with a very minimal melodic melody, slowly adds percussion and a strange radar-like noise for a while, slowly progresses, until the ultra-heavy guitar riffing chaos appears, and the enraged mosquito-king vocals erupt. These vocals are really rough, just like the music, but this song is great. It becomes even more frantic towards the end, and finally stops abruptly with a unique distorted radio frequency noise for a few seconds.\n\n\"Life Under the Swatter\" has extremely fast riffing, as the mosquitoes dodge the furious exterminators and swarm around him and eat him alive. But if you look deeper you can still hear the subtle melodies and percussion that would later develop more into Isis' sound.\n\n\"Hive Destruction\" starts off with a terrifying, yet softer melody and then guitars suddenly rip through it for an even more frightening sound. \"Relocation Swarm\" starts with a suspenseful percussion and then contains strange, close-by sounding vocals and samples that are adrenaline-pumping torture to the ears. This song really drags on after a while and after 7 minutes (it's almost 12 minutes long) it is just samples of screaming and droning guitar noises, part of the reason I only gave it 75%.\n\nIf you're new to Isis, this is probably not a good introduction to them. You might like their heavier side compared to their newer full-lengths, but in that case, you'll only really like this and the Red Sea, both 20-something minute EPs. Like I said already, if you already have their newer albums, this is great also but obviously very different. Isis have only begun to showcase their true aesthetic innovation.\n",
        "\nThe other reviewer of this album has publically revealled to us all how problematic it can be when something is judged under the wrong criteria. ISIS is not death metal of any sort, it's basically heavy rock music.\n\nI often regard them as the logical inversion of dirgers Electric Wizard or even Godflesh (Isis have covered the legendary Streetcleaner track and earlier ep). Where those earlier ep's were abrasive thundering slower paced hardcore, with slight interests in the experimental, Celestial is levels its aim at its title. This is hardcore, rock based, music filtered through a psychedelic aesthetic to produce something which will induce colourful visions in the listener, whereas Electric Wizard present a more monochromatic one: ranging from inpenetrable green smoke haze to black.\n\nWhen i thought rock was sincerely dead, this band showed me that there were momentous riffs that were yet to be written, recorded and enjoyed. The opening opus, The Tower, is indicative of this album and a worthy introduction to this band. For strict metal fans, download before purchase.\n",
        "\nNormally bands have shaky starts, with their first songs being a little iffy, or just downright shitty. This is not true of Isis, their first recording is incredible, easily as good as their later albums. This is the Isis that you know and love, reminiscent of Celestial and Oceanic, but this release is heavier, and the vocals are a bit more harsh. For those who haven't listened to Isis before, they are Doom/Sludge at it's absolute best, with a very atmospheric sound, the music flows over you. All 4 songs are great, from the heavy start of Poison Eggs, to the slow outro at the end of Relocation Swarm.\nThere's not much to say here, if you've listened to other Isis albums and liked them, then you will like this as well. If you love Isis however, this is a must have for your collection. Any serious fan of Doom or Sludge should own all of Isis' work.\n",
        "\nI'm not going to go into too much depth with this review, as the previous reviews were good enough to explain the intrinsic class of this LP. I am on the other hand just going to get off my chest how brilliant this LP is myself so I can sleep better at night. HA!\n\nSome people get put off and scarred by the word \"melodic\", \"oh no, not that poofy style\". Fuck that for a second, this LP absolutely annihilates that typically dull outlook and opinion on the general melodic style used within the aggressive and metal genre.\nThe LP starts off with an annoying riff and I instantly got worried upon listening that it would be as dull as previous CDs they have released. Then the vocals kick in and it gradually gets better. Until it actually becomes a phenomenal LP. The melodies are fantastic, the droned vocals are emotionally arousing and thought provoking and full of desperation. And the guitar work is very simple but almost beautiful expressed through droned tones etc.\n\nTrack 4, \"Carry\" is honestly out of this world. One of the most atmospheric, spiritually beautiful and mind enhancing build ups I have ever heard within this range of genre. A VERY simple percussion starts up with lovely guitar harmonies in the background, takes 4 minutes to get the full tempo of the song going and 4:15 to here the first vocals. It all fits into place extraordinarily, tempo constantly building up and the emotion pouring. \nThe next few songs are like a comedown, pure melodic, simple and suited to the CD.\nThe next few songs being great too, \"From Sinking\" having a truly immense melodic breakdown on it near the end.\nI'm gonna quit my yapping now and go and listen to it. Bye\n",
        "\nUpon my initial listen of this album, many high points were immediately revealed. However, further listens only prove to reveal more details encompassing the sonic structure of this great work. Whereas Isis' previous albums tend to focus more or less on the idea of building up tension and releasing everything in a cathartic blast of fucking insanity, \"Oceanic\" accomplishes that while maintaining a sort of serene beauty and flawless transitions between the songs.\n\nMany have compared Isis to Neurosis, a band from a similar school of though. It isn't really fair, however, to draw a great deal of comparison to any other band when listening to this. This is easily the most original album that emerged from 2002, and for good reason. Each song endures for an average of six to ten minutes, and each second counts. The crushing guitars and the atmospheric effects slowly build upon each other, entailing a sort of expressiveness not normally found in such heavy music. The vocals aren't a huge focus, usually consisting of hardcore type shouts (as mentioned in the first review) or female vocals that serve for a welcome contrast. The bass and drum levels are appropriately configured, not drowning out the riffs, and not really forcing a sense of \"where the fuck are the bass and drums?\" onto the listener.\n\nIn closing, labeling this as doom metal wouldn't make much sense. Electric Wizard or Cathedral this is not. However, fans of doom and atmospheric metal would surely appreciate the content of this release. Rarely is such innovativeness and flawless execution displayed in this modest fashion.\n",
        "\nAnd now for something completely different…\n\nIt’s not often I find a metal record which creates this reaction, there are of course hundreds of bands who push the limits and are truly original in one way or another, but when I first heard Oceanic I could honestly not think of a single album, current or otherwise to compare it to that didn’t have “Isis” written on the cover. The band mix hardcore with Sabbath style doom and add plenty of ambient touches and atmospheric moments, which led one writer to observe; “This isn’t NYHC, it’s NowhereHC.”\n\nThat said it took me an unprecedented amount of time actually get something approaching a handle on this little piece of plastic, to the point where I actually though about returning it to the store. The main problem lay in the apparent lack of anything approaching a hook, catchy riff or memorable vocal line to pull the listener into Oceanic’s watery depths. \n\nThe band construct long songs, averaging about eight minutes (and even almost reaching eleven on the mammoth “weight,”) out of slow to mid-paced riffs and quiet interludes (the quiet before the storm) which repeat for a while then disappear to be replaced by more crushing guitars and percussion. All the time building and gathering momentum, the songs always seems to be on the edge of bursting their banks and going out of control when, without warning the storm subsides and we get another melodic interlude, and again the songs rise and subside (into other songs) like a tide approaching and receding.\n\nThe entire album carries an aquatic theme, from the rising and flowing nature of the guitars to the bass which seems to be constantly bubbling away just beneath the surface. The artwork and lyrics give us images of the sea and at the albums halfway point (-), we get two minutes of running water, whale noises and other eerie deep sea sounds to really set the mood for the albums second half.\n\nThe songs themselves (as already stated) can appear bland and featureless at first, but repeated listens uncover the hidden subtleties of each track, this is in no small part due to the richly textured production that has every instrument at exactly the right level and sounding great. The guitars crash and rage with an almost hardcore feel at times, at others they rise up on successive chords to ascend to new levels of power and emotion. The drums are the back bone but also the catalyst for each new movement, changing constantly but at the same time providing a reference point for each song to return to when an interlude is needed to create light amidst the waves. The vocals (when they appear) are delivered in a familiar hardcore shout, which is given just the right amount of attention in the mix, they don’t rise above everything and become annoying, but neither are they lost.\n\n“The beginning and the end,” begins the album and is a sign of what’s to come, riffs rise and fall whilst the drums and bass work with, and around them adding weight to the mesmerising (yet totally headbangable) guitar progressions so that they never end up going off on a tangent and stay constantly focused. Other standouts include “Carry,” which builds for four of it’s six minutes before exploding into a dizzying display of how to craft memorable yet crushing riffs, and may just be the albums best moment. The lightweight melody of “Maritime” sets the scene well for “Weight,” the longest, most drawn out and slowest building of Oceanic’s nine tracks, it’s hypnotic mixture of sparse guitars, drums and a quiet female vocal line are another highlight.\n\nI’m not going to say this album has to be in your collection because it’s not something everyone will be able to get into, but for those who can it is one to return to over and over, it’s power and originality make for one of the best (and possibly most important) albums recorded since the millennium.\n",
        "\nIsis is primarily an exercise in ambient song writing that falls somewhere between Neurosis, God Speed You Black Emperor! and Sleep (the first of those comparisons being the most pertinent as regards textural/superficial sonic similarities). Isis uses almost exclusively slow to mid-paced repetitive riffs and drumming in order to build momentum towards peaks, and then relax into seemingly post-coital troughs. Vocals are scarce on this album. When they do appear they take one of two forms; a hardcorish bark (that somehow manages to sound warm and unabrasive at all times) or, more rarely, a psycadellic female sung voice. The vocals invariably take second place in the mix to the instruments, and consequently they have a trapped, frustrated feel to them which helps to build the often understated momentum that characterises the song writing.\n\nThat isn't to say that this album is completely devoid of head banging moments; many of the riffs, particularly on the first two tracks, do have a fairly developed sense of stoner groove. However, such passages are almost invariably countered by sensitive melodic interludes which free the mind to wonder the far flung intellectual dimension that this music inhabits.\n\nTo listen to Oceanic casually would be to do the record and yourself an injustice. This album needs to be absorbed slowly through repeated careful listenings in order to appreciate it. Having said that, much of the album is immediately striking on a certain level too, and the album has a tendency to invoke favourable comments in even my non metal loving friends who give it even a cursorary listen.\n"
    ]
}