{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Oxnard, California",
        "Status:": "Active",
        "Formed in:": "2007",
        "Genre:": "Grindcore/Powerviolence/Hardcore",
        "Lyrical themes:": "Anti-Christianity, Death, Hate, Oppression, Violence",
        "Current label:": "Nuclear Blast Entertainment",
        "Years active:": "\n2007-2020,\n?-present ",
        "Number of Reviews": 21
    },
    "Band Reviews": [
        "\nI'm still not sure why Nails released a 90 second song as its own single, but regardless, this is still one of the longest songs on You Will Never Be One Of Us. The main aspect here is the percussion, which alternates with devastating effect between slower, pounding patterns and straight blasting, without overusing either. This, combined with the blinding velocity and tightness of the drumming, makes the aggressiveness and impact of the music more highlighted. The guitars are used in the same way and have a menacing, barbaric sandpaper tone that makes every power chord and every rapid picking pattern sound crushing and groovy, especially during the gallop at about a minute in, which is also ornamented with some Slayer-esque note climbs.\n\nAs always, Todd delivers with a wretched and low bellow, with the music revolving around the venomous stabbing of the verses. As for the song's structure, it's quite varied considering its runtime; opening with a drum roll that explodes into a more mid-paced burst before a slow and punishing breakdown, before resorting back to grinding for the last 10 seconds. This unpredictability complements the dissonance and brute force of the music, making Savage Intolerance a great single, and a standout in the Nails discography.\n",
        "\nNearly 3 years removed from their last effort, Nails return in true Nails fashion with a 2 song, 4 minute single that aims to do nothing but show you that these guys are still one of the most hard-hitting acts on the planet. When I say that this is more of the same, that isn't necessarily a bad thing. Nails have their distinctive sound, with gritty but refined guitars tuned in C# with high amounts of reverb, constant blast beats and relentless howling, like a cleaner version of From Enslavement To Obliteration. Both tracks exemplify this, with tremolo riffs and frantic transitions between blasts, d-beats and double-bass patterns that accompany wretched breakdowns. Of course then there are the edgy, pissed-off lyrics to boot that are expected with this band.\n\nThe most interesting thing about this record is that the second track, Endless Resistance, takes a slower, more riffy approach. The opening riff is slow, drawn out and sounds great; introducing a unique sound without compromising the typical attitude of the band. Max Cavalera sounds like he's recording for Nailbomb again, and it's fitting that he's on this track with the political subject matter. While I do think that Endless resistance takes its time a bit too much for Nails, it's a massive-sounding song with actual structure and a chorus that lasts for more than 6 seconds. Now, speaking more generally about the single; how did this thing take 2 and a half years to make? I understand that Todd has a family now, but Nails had released three brilliant fulll-length(ish) albums in the space of 6 years. \n\nWhat's more puzzling is that it's been over 3 and a half years since this single was released. Due to the short song lengths and the sheer lack of material here, I can't say that it's worth waiting years for. On the other hand, the two songs are both very enjoyable in that they encapsulate a mean take on powerviolence that has taken the speed down a notch in turn for far more impactful riffing, but I Don't Want To Know You is undoubtedly more of the same from Nails, just with a slightly different execution.\n",
        "\nI find it kind of amusing how quickly Nails went from scene crossover darlings amongst metalheads, to the sinking realization that came with by titling their latest album You Will Never Be One Of Us, they meant exactly what you'd think a modern hardcore band would mean by that. Oh really, they're super into the try-hard tough guy hardcore thing and overly concerned with scene politics? a huge swath of metalloids seemed to collectively realize. That said, it's hard to deny that they're one of the best powerviolence groups going. It's kind of like Terror where the riffs absolutely go, but it's hard not to cringe at a middle aged man still blowharding about posers in the scene during every single interview. \n\nThis is the first thing Nails has released since the aforementioned album, besides an exceedingly brief appearance on a split with the equally impressive modern powerviolence torchbearers Full of Hell. \"I Don't Know Want to Know You\" sounds like classic nails, and sounds exactly the sort of song title they'd go for to double down on the hardcore tough guy attitude. It's short, grindy and crusty as hell and sounds like high-octane brutality. Part of me finds it absolutely hilarious that a band roasted by some for going too hard on the lunkheaded machoism stuff decided to bring in Max Cavelera for their next release. It's a bit of a power move, really - they show they don't give a fuck what people not in their scene anyway think all the while getting the mastermind behind some of the best albums from the genre the criticism is coming from. And I'll be honest - the song goes hard. As much as I don't like the groove angle Cavelera has pursued after the Sepultura classics, \"Endless Resistance\" bring in some of the sickest and filthiest grooves I can think of. If simplified a little further, they'd almost sound like a powerviolence beatdown. Max's vocals are aggressive and cutthroat as ever, and the lead guitar parts slash through the chunky filth like a blade through flesh. \n\nI Don't Want to Know You seems like an affirmation of who Nails are - one of the angriest bands out there and unwilling to change for anyone. Violence is forever when you're in a band like Nails.\n",
        "\nI didn’t hear about this record when it came out. By 2010 I had long lost interest in contemporary metal and hardcore. I had been down the rabbit hole for so long that I needed a break from it all. This was a period where I was catching up on other types of music that I had previously neglected. If I had been paying attention then \"Unsilent Death\" would have resonated with me. This is the kind of fast-as-hell hardcore with a gritty production that has always appealed to my sensibilities. Nails is the sort of band that has that corrosive, energising anger that metal bands struggle to capture. Records like this are why I like hardcore.\n\nNails execute to perfection despite their relative lack of originality. If we’re looking at influences, then Discharge is an obvious one. Listen to the way the chords ring out with hefty reverb on \"No Servant\". I hear Nasum too. Nails don't play grindcore, but the opening track (“Conform”) gets close. Like Nasum, Nails tend to strip Entombed riffs down, speed them up and play them with hardcore rage. Entombed lend themselves to such treatment because they were influenced by so much hardcore in the first place. Sometimes it gets a little too obvious, and the title track is near-identical to \"Wolverine Blues\". The guitar tone is similar as well. I don't know if Nails used a Boss HM2 pedal on this, but it sounds like they may have done. \n\nStill, \"Unsilent Death\" reminds me most of those scintillating Canadian hardcore bands like Left For Dead and The Swarm. I love those bands. I love how they interspersed blasting, two-step and breakdowns. I love how they expressed rage with brevity. Every Left For Dead song has a pithy, catchy slogan which is instantly recognisable after one listen. Those slogans often arrive on the breakdown. It is easy to imagine legions of hardcore kids bouncing off the walls in some small town basement show, mattresses lined against the walls to muffle the sound from the neighbourhood. Nails captures the same vibe as those earlier bands. They're not quite as good. Their songs are not quite as catchy, but \"Unsilent Death\" beats the hell out of most hardcore bands in the post-2000 era. \n\nThis record contains ten songs and lasts a total of thirteen minutes. This may feel too brief for those without a grounding in the hardcore scene. Personally, I love the brevity of such records. The length feels right to me. This type of music is too intense to consume over a longer period. The benefit of brevity is that “Unsilent Death” can be spun back-to-back with other similar records to intensify the mood (\"Parasitic Skies\" would be a perfect companion piece). Nails are excellent at what they do. I’ve heard other bands that do this style better, but this record is still great. Check it out if you haven't already done so.\n",
        "\nWe all know that Nails was accepted based on You Will Never Be One of Us. However, at the beginning, Nails' brand of grindcore was more powerviolence based. It was Unsilent Death that made Nails one of the most beloved bands of the 2010s which I am reviewing here. Regardless, this is fourteen minutes of some of the best grindcore ever released. \n\nWhen I mean fourteen minutes, I mean that the songs on Unsilent Death are short, with half of them being under a minute. They're all relentlessly fast and they challenge the listener with blast beats, buzzsaw guitar riffs, and plenty of feedback fpr a high-demand/high-reward result. Nails has a tradition of making tracks #5 and 10 the longer tracks on their albums, which I will give special mention to. Track 5 is the title track which has a vibe similar to Entombed's Wolverine Blues. Not surprising since buzzsaw riffs were popularized by Entombed themselves thus having influenced Nails in the process. Track 10 is more or less a death metal song with some doom metal influence thrown in the mix. Feedback is prevalent in this number and is not only the longest song on the album, but also the heaviest of the ten tracks.\n\nIt may be more \"core\" than grind, but the trio of musicians are playing out of their mind on this release. Todd Jones utilized a mid-range growl-like scream on Unsilent Death while playing Entombed riffs at the same time. Taylor Young's drumming annihilates the listener throughout the album with literally every song containing blast beats, coupled with a little jazz-style drumming. John Gianelli's bass playing is sheer terror on here and is as punishing as \"Depths\". I'm surprised all three members are still in the band considering how fast and technical their playing is.\n\nSpeaking of fast, if you need a fast and heavy album to listen to if your workplace is twenty minutes away from your house, Unsilent Death will have you covered. And if you want to get their faster, turn up the volume and road rage. Music tempo aside, Unsilent Death is a contender for being one of the best grindcore albums of all time and an essential listen for metalheads and punk rockers alike. It's an album that's difficult to get into, but becomes awesome music once you start to appreciate the technicality of the musicians. Heck, I've listened to this more than three times and it never gets old. Just... don't play it next to grandma.\n",
        "\nAnd not with a swift, merciful bullet to the face either, we're talking something more along the lines of a gory mass-trampling. That's how it feels when I throw Nails' Unsilent Death on. It's so unrelenting and so bloodthirsty that I can imagine every pounding riff as a fist to my gut and every drum fill as a flurry of kicks to my head. The danger, chaos, and intensity are so great on this album that having an ax swung or a chair tossed at me would seem totally appropriate. And while there are an uncountable number of bands who go for a sound like that, Nails outdoes damn near all of them and provides just enough of a structure for this explosive mixture of grind, hardcore, and powerviolence to hit all the harder without devolving into nonsense. In fact, that little bit of structure is what makes this stand so exceptionally strong despite being so short.\n\nIt all comes at you with full force the very second Unsilent Death starts and does not let up until the end. Though, this is far from a simple wall of indecipherable blasting. The riffs are skull-stompingly gigantic. The breakdowns come with the force of a fuel-air bomb. The squeals, screeches, scrapes, short solos, and slides riddled throughout this thing scorch like crazy and add even more excitement, violence, and panic to it. Everything sounds big, crushing, and monstrous while also delivering a satisfying level of groove that makes it hold strong in your memory. It's pretty easy to get a lot of this embedded in your head like the concrete-crushing main riff to the title track, the explosive chorus of \"Suffering Soul\", and the savage, blunt rant over the intimidating closing breakdown on \"I Will Not Follow\" all make for tidbits you can't help but come back for time and again.\n\nAlso, these guys don't slack at all. Even their shortest, fastest songs have ebbs and flows weaving through the violence, feeling like fully developed tunes despite their jarring brevity. While the longer jams are definitely the ones to stick around for, they don't neglect even a second of this 14-minute album. There's always another fat riff or pit-destroying breakdown waiting for you among the fray. And that's not even to bring up how Todd Jones' voice pierces through all of this to deliver his hate-loaded lyrics while also giving off an extreme sense of panic. That also compliments Taylor Young's drumming, which obliterates the cymbals and alternates seamlessly between terrifying blasted fills and just murderous breakdown pounding. And the tone of the guitar is perfect; I think the HM-2 pedal (famous among classic Swedish death metal bands like Entombed) really gives this thing a boost by adding mass to the guitar tone and really packing on the crunch. After all, these sorts of albums do best when they can bowl you over as hard as possible, and Unsilent Death certainly does this.\n\nIn short, this is finely structured violence and chaos in such a pure form, and with so much force behind it, it makes me think it's going to reach out of my stereo and try to kill me... and I love it for that. Even at just under 14 minutes, this is as full-bodied and tough as you'll get from grindcore.\n",
        "\nNAILS are well-known by this point, and I am definitely late to the party. But I'm glad to have showed up late than stayed home watching Cutthroat Kitchen re-runs like I normally do.\n\nEverything about this album is grindcore and powerviolence personified. It's a non-stop barrage that never lets up and pummels you for its entire 17 minute run-time. Each track puts forth such energy, hatred, and vitriol that I've yet to sit completely still while listening to this bad boy. And that's in part due to the production.\n\nKurt Ballou is definitely an experienced and popular producer in the hardcore scene. He does a fantastic job here, giving the drums and guitar a punchy and bombastic flair that could be likely to stop someone's heart if they suffered from some sort of condition. However, just because the production is good doesn't necessarily mean unique. While it works here, Ballou really has a distinct sound that he sticks to on the productions I've heard from him thus far. Luckily, the band's unique sound helps them to move past the good but usual production that Kurt generally utilizes.\n\nFor the most part, NAILS only knows two tempos. And that isn't necessarily a bad thing. They understand their strengths and they play to them very well, but the lack of diversity is definitely what holds the album back.\n\nNot much else to say here. An exciting release from NAILS and one that you can really listen to anytime given its short length.\n",
        "\nNails' participation in the Decibel FlexiDisc series shows them eschewing the bigger production values of their album and coming in at their most primal like a sledgehammer to the dick. This is a lot less metal than much of their output, although remnants of death metal and grindcore linger. There's not really that much to say except it's rambunctious, unapologetically violent and would most certainly kick your ass back to the stone age given the chance. Both songs burst forth with homicidal hardcore energy with heapings of powerviolence vitriol to boot. I have to say I like the version of \"In Pain\" that would end up on You Will Never Be One of Us better. The braying solo (I'd compare it to very early Bolt Thrower) really makes the song and while the raw, brutish production here is cool and all, the production on the album is superior. Either way, this is a perfectly good way to spend a spare two minutes.\n",
        "\nThis has to be one of my favorite albums in metal and hardcore. It's an amalgamation of various styles of extreme music. grindcore, powerviolence, hardcore punk, sludge metal, death metal, d-beat and others. It has some of the sludgiest, noisiest, heaviest guitar and bass in music history. The vocals are guttural and harsh. Todd Jones really one ups his last band, Terror.\n\nThe album is not just a brutal beatdown of d-beats and blast beats, there's also plenty of breakdowns that are guaranteed to start a riot in the pit. It goes from circle pit to two step to kung fu at a second's notice. Unsilent Death, the title track is the obvious dance song here. Some of my other favorite tracks are probably Suffering Soul, Scapegoat, I Will Not Follow, and Depths. This album is the ultimate thrash and bash fest. With 10 songs in 14 minutes, it definitely does not overstay its welcome.\n\nThe lyrics are fairly standard topics for hardcore and metal, talking about religion, conformity, and betrayal among other things. But the way they manifest here is some of the angriest anger you will ever hear. I dare you to find a more pissed off record. This album's strength is not in its inventiveness because it certainly does not bring many new ideas to the table. This album's strength is in how it reinterprets old ideas and breathes new life into them. This album is a culmination of various extreme music ideas into a furious explosion of hatred that will beat you to death. It is one of my favorite albums and I can't recommend it enough. 11/10\n",
        "\nMan, this is a cool little EP. Clocking in at a mere six and a half minutes, every second is worth its weight in gold. As far as Nails go, this is probably some of their least grindy material. While the title track is a balls to the wall rager, the rest of Obscene Humanity is more of a powerviolence affair. \"Confront Them\" features an brawny mid-paced chugging riffs and shit gets real doomy at the end of \"Lies\". The rest of \"Lies\" is still very powerviolence-y but has some pretty neat nods to more traditional (albeit raging) hardcore. The shouted vocals are savage as fuck throughout, coming off like a meth addict in the middle of a murderous rampage.The drumming is tight and equally fierce, providing a fortified backbone.There isn't too much to say about this since it's over by the point I'm really getting into it, but it slays when it's on. If you're into hearing some less grindcore-oriented material by Nails and don't mind some chugging, Obscene Humanity is the best six minutes you'll spend all day.\n",
        "\nHaving been introduced to Nails around the time of their previous LP, ‘Abandon All Life,’ I was instantly sold on the band’s unrelenting crust/grind/metallic hardcore amalgam, and in short order I tracked down a copy. While a great piece of work, the album’s 17-minute running time ultimately left me somewhat unsatisfied. As a result, I sort of put Nails on the back burner awaiting more material, still pulling out ‘Abandon’ for an occasional spin. So naturally, once I got wind of this 2016 follow-up, I knew I’d be adding it to the collection as well.\n\nNow, the actual review… ‘Abandon All Life’ was certainly not an easy record to live up to, being a concentrated assault of speed and heaviness that still left room for dynamics in the songwriting. Although most tracks came and went in less than 60 seconds, two of them slowed down the pace and stretched out to 4/5 minutes without ever really losing their momentum, demonstrating the band’s ability to crack skulls at any tempo. And on ‘You Will Never Be One of Us,’ not much in the sound has changed – same guitar/drum tones, same near-nonstop, double-time aggression – but their taste for drawn-out dirges has only increased, as Side B ends with the 8-minute “They Come Crawling Back.” Per usual, they switch things up enough to avoid monotony, with the song changing speeds more than once, and throwing in a feedback-heavy interlude midway through. Something like “Crawling Back” isn’t totally unprecedented, of course, but it’s also distinct from anything they’ve attempted previously. Elsewhere on the record we find plenty of their typical micro-songs, each one unquestionably a neck-snapper, but “Violence Is Forever” also stands out as a more developed composition, spending half its 3-minute length at an unusually moderate pace before briefly erupting into D-beat mayhem, then easing off the gas pedal only to end up swallowed by dual-guitar feedback. This sort of track not only moves Nails closer stylistically to noisy, discordant sludge/hardcore bands like Full of Hell, but also suggests that there’s room for growth even within a seemingly limited (if brilliant) formula.\n\nIf I haven’t been clear enough already, I consider ‘You Will Never…’ one of the essential metal albums of 2016. For those who want it fast, heavy, and angry, these guys are one of the best bets around right now.\n",
        "\nI'm not usually one who seeks out grindcore. It's one of my lesser listened-to styles of metal. Nails is a band that seems to blend elements from crust punk, powerviolence, and mainly grindcore, to create a violent assault of noise-ridden music. I recall checking \"Unsilent Death\" out probably four or five years ago due to a review I saw on YouTube that was extremely positive about this album. Aside from a very few bands, I really don't like much grindcore. Nails has become one of those bands. This is a short album, running at just under 14 minutes total with 10 tracks. In that short amount of time, this album manages to relentlessly take your scrotum, turn it inside out, replace your balls with the eyes of your enemies, and then sew the shit back up once again. \n\nFrom the beginning with \"Conform\", which is 30 seconds of pure speed, aggression, and raw energy, the album seems like it will be never-ending speed and noise. While there is a lot of that here, that's not really the entire story. The second track already showcases this. \"Scum Will Rise\" features a really cool, slower breakdown towards its end. \"Suffering Soul\" allows the band's hardcore influences more room to breathe and manages to be extremely catchy while still retaining its aggression. Again, the breakdown in this song is absolutely skull-crushing. The title track, which is the second longest song running just shy of 3 minutes, is one of my favorites and contains some of the most memorable riffs to be found here. In terms of breakdowns, I think \"I Will Not Follow\" features the best one, although I really wish it could have been longer. The album's closing track \"Depths\" is the longest, running just short of 4 minutes. This song features some really cool elements bordering on doom metal and the atmosphere is quite immense. That brief moment of distorted bass before the pace picks up is extremely welcoming, and that quirky, distorted guitar solo is pretty neat. A lot of these songs feature similar ideas but for an extremely short runtime of 14 minutes, that's not a negative thing at all.\n\nThe production here is some of the best I have heard from this style of music. It's extremely dirty and raw but you can still clearly hear all of the instruments, and nothing sounds \"messy\" in a sense of musical ability. It's chaotic but can be controlled as to not make the music unlistenable. The vocals here are full of hatred and malign for humanity and suit the aggressive music quite nicely. All of the instruments work with one another to create this chaotic wall of noise sound that makes for an extremely atmospheric album. \n\nAside from \"Unsilent Death\", I haven't listened to anything else from Nails. Not because I don't have any interest to, but while this album is extremely good, I really don't have much of an interest in grindcore or powerviolence. Upon revisiting this album, I may have to give the other two records a chance. This is something special for the genre.\n",
        "\nIt's hardly surprising that Nails and Full of Hell teamed up for a split. Both are rooted in hardcore, but mix various of the most extreme elements of punk and metal to unleash an inferno of violence upon the listener. Nails is perhaps the most intense live show I've ever seen, and Full of Hell are nothing to scoff at live, either. \n\nNails only offer a minute of half of music for their side of the split, but boy do they make the best of that time. It has their trademark hardcore bellowing through the gates of hell sound, but also displays more OSDM influence than ever. There's a nice chunky OSDM riff in there that feels like it could be ripped from a host of classic bands. It's definitely not just pure sonic violence and nothing else, but the violence is the main draw, the OSDM nods being the icing on the cake. \n\nWhile Nails' side was a bit better, Full of Hell put in a damn good effort as well. It's still grinding metal-infused hardcore, but doesn't have the same overt death metal influence permeating the mix. This is a slash n' burn assault; they pull no punches and go straight for the jugular. It is supremely scummy and feels ripped straight from the underbelly of some dystopic society. \n\nThis is a pretty damn good use of four and a half minutes. However short, it is exceedingly intense and a nice quick fix to let out some of your inner rage. Would be great accompaniment to a particularly grueling deadlift set. Even if you don't like it, it's not even five minutes so there's no harm checking it out. I've spent much longer waiting in line at the Tim Horton's.\n",
        "\nWell, this basically sounds like gymbro Hatebreed with a few blasts and a brutally loud mastering job, but I still rather like it and there's not too much point trying to rationalize it.\n\nSimple, short tunes generally with some sort of fast bit-pit bit-fast bit structure, all designed to get you punching people. It's certainly not music for reading Nietzsche over a glass of red, just intense blasts of simple hm2-ish hatred. I'm not a powerviolence/beatdown connisseur or anything, so I can't comment on where this album sits between this and ye olde death metal with any particular authority. You'd basically describe it as someone writing PV songs using death metal riffs- the short sharp structure of the former, with the busier guitar work of the latter.\n\nDo I enjoy it? Well, sure, in the right context, and that's what you've got to remember. It's a great way to lift weights you'd never think you could or do nuts amount of cardio, and I've beat the absolute shit out of my steering wheel driving around to \"Life is a Death Sentence\" and basically every other song on here. Energetic, violent, and rather catchy, it's a whole lot of fun, and I'd certainly take it over, I dunno, the new Katatonia album given the choice.\n",
        "\nSigning to Nuclear Blast definitely made Nails sellouts, right? Oh fuck no it didn’t. The Californian trio unleashed their longest album ever (still only 21 minutes) and it’s one of the perfect outlet for aggression and violence I’ve ever heard. The band got added to the Metal Archives due to this record and rightfully so, I could compare it to the movie Alien, a cinema classic classified as both horror and science fiction… Well, YWNBOOU borrows as much from hardcore as it does from metal. Nails puts classic grindcore, old Swedish death metal, powerviolence, crust, Slayer-ish thrash in a dirty blender and crush the mixture till it’s just perfectly bloody.\n\nJust like “Unsilent Death” or Abandon All Life, most of the tracks are short motherfuckers who will slam your head and make you jump everywhere. They never forget to write compelling and truly awesome riffs such as in “Into Quietus” and end the album with a monstrous eight minutes track containing everything they ever been known for. Slow pummeling riffs, spiteful vocals and fast destruction. I was really happy when they played “They Come Crawling Back” live as it’s one hell of a track. The best extreme album of 2016.\n\n\"VIOLENCE IS FOREVER\"\n\nMetantoine's Magickal Realm - Metal Bounty Hunter: Volume 9\n",
        "\nNails are a powerviolence group from California, formed in 2007. They released their first album, Unsilent Death, in 2010, to very high praise from the poweviolence/grind community. They write fast, short, punishing songs about oppression, rejection, individuality, and hatred. This review is for their newest record, You Will Never Be One of Us, released June 17th, 2016.\n\nThis record starts off with the track \"You Will Never Be One of Us\". It begins with a little intro, and instantly, the violence begins. The tracks on this album are all pretty short, about 40-90 seconds, except for 3-minute-and-26-second track \"Violence Is Forever\" and the final 8-minute-and-14-second behemoth of a track, \"They Come Crawling Back\".\n\nOne of the fucking awesome things about this album is that while it is absolutely a brutal, destructive powerviolence record at it's core, it has places where the violence is broken up, either by a short guitar interlude, or a slower, sludgy passage. These areas work well to break up the generally fast-paced songs so the album does not drag or become boring.\n\nAs for the instruments themselves, we have very solid performance on all accounts here. The guitars are fast, pretty much playing chuggy power chord-driven riffs. They're not especially spectacular or unique, but serve their purpouse well and aren't blatant rip offs or anything like that. There are a couple solos on this album, and they actually work pretty well in my opinion, see \"In Pain\" for an example of what I mean. The drums are fast as hell, keeping the equally paced music on time with the blast beats you'd expect to hear in this sort of music. The vocals are a high point here, Todd Jones does a great job on them. They're sort of midway between a scream and a shout, sometimes being almost growls, and sometimes even being reminiscent of goregrind-esque gurgles. Jones keeps the vocals varied, not constantly performing them exactly the same as many powerviolence and grindcore bands do.\n\nThe final track, \"They Come Crawling Back\", is a great example of all of the strengths on this album. It has fast parts, slow, doomy parts, and plenty of hateful lyrical and musical performences. I was wary of this track, just from the 8 minute time mark, but it worked very well, in my opinion, as a closer for the record.\n\nOverall, this album is spectacular. I expected no less from Nails, really - their previous output, especially Unsilent Death, has been nothing short of amazing. This is by far their longest album, still only clocking in at a meager 21 minutes. This is not a bad thing, honestly, because these sorts of records often can't afford to be 40, 45 minutes long, as it would eventually become tiresome. I think this album is deserving of a 90%, it's everything I would want in a poweviolence album and then some.\n",
        "\nAfter releasing two extraordinary records in Unsilent Death and Abandon All Life, Nails had the potential to go for the rare trifecta but a warning sign appeared early. When Nails announced Andy Saba's departure, concern set in. Saba's guitar work and push towards death metal on Abandon All Life helped make that record stand out. That said, early critical hype had me hopeful but the final delivery was deflating. You Will Never Be One Of Us is a step backward for Nails.\n\nIt is hard to articulate exactly what went wrong here as a superficial listen reveals an enjoyable, capable Nails record: a violent, belligerent hybrid stew of hardcore, crust, and grind that seethes with raw emotion and chaotic impulse control. Yet just below the surface, problems emerge in both the songwriting and production. For starters, Saba's departure is keenly felt in the guitar work. The intricate dual riffing, sharp leads, and pronounced death metal influence are all absent here. Back to one guitar, the riffs stick to simple three-chord punk lines and muted chugs. While that worked well on Unsilent Death, it feels regressive here after Abandon All Life's push forward. Generally speaking, the riffs, leads, and breakdowns all sound a bit tired, less exciting, fresh, and gratingly intense as previously. That's a problem when you've built the entirety of your image, sound, and cred on a style based entirely on finding hidden nuance in overwhelming power. It doesn't help that the drums are horribly overproduced and boxy while the vocals sound artificially distorted and way buried in the mix (two rare errors from producer Kurt Ballou). These things conspire together to contain the previously uncontainable Nails sound. \n\nTheir songwriting stumbles slightly too. Three tracks particularly stand-out as excellent and all deviate from previous Nails norms: the insanely catchy title track, the tribalistic double-bass work out of \"Violence Is Forever,\" and the stretched-out morose gloom of \"They Come Crawling Back\" -- all three of these tunes have one thing in common, they are of much longer duration, forcing the band to crafter deeper hooks and step out of their ninety-second grind norms, norms that have come to feel, well, normal/easy/boring. The shorter bursts here have a tossed off feel; the challenge of these longer tracks is welcome and should be instructive to Nails that they can stretch out without selling out.\n\nNails have now followed their two previous classics with a decent record that is by no means a failure yet doesn't manage to capture the band at their fullest potential. Nails would do well to consider what direction they wish to take their songwriting while also considering a change in producer. They have the musical, critical, and commercial resources necessary to truly dig deep and write the record I was hoping.\n",
        "\nI don't often write reviews, as I only like to at the benefit of a band or album I would like to help support. This is one of those bands, and believe when I say I really want you to buy this album. No, I'm not in any way affiliated with the band, it's just such a refreshing take on metal and I hope they succeed.\n\nHaving been a Nails fan for some time now, I've been awaiting this album like the second coming of Christ. The title track was released as the first single and it's still my favorite song here, but each song adds something to the final product and there is quite a bit of variety as compared to the past 2 albums. If you've never heard Nails, imagine an Anaal Nathrakh-esque take on power-violence/grind mixed with Slayer leads, hardcore beats and a buzzsaw death metal production. It's really fucking violent music. Most of the songs clock in well under 2 minutes and they could write a thesis on all the nuance of being pissed off. Where most bands these days have a penchant toward the progressive side of things, Nails cut off all the fat then even some of the meat to give you an EP length album full of mosh parts and headbangers, and it's relentless. A song like Life is a Death Sentence is a good template for any Nails song, exhibiting some of metal's characteristic joyful nihilism over a catchy \"chorus\" and ridiculously heavy riffs, pounding drums and thundering bass. That's not to say every song sounds the same, certainly not, but you know immediately when they start playing that it's them. The closer They Come Crawling Back is a particular anomaly in their discography, bringing a very heavy and doomy 8 minute song to end the album and in a few ways could be quite a eulogy for the band if they were to unfortunately split.\n\nAlso of note is the crossover appeal this album in particular has and will have in the future. Younger fans of bands like Hatebreed will find an introduction to heavier music, while death and black metal aficionados such as myself will revel in such a raw display of musical violence and bedlam. I sometimes feel when listening to the band that they are what Eyehategod would sound like if they went off the rails and played at super-speed and that is a very good thing. Much like Nails, I'll skip the bullshit and tell you to start with this album, then go back to Unsilent Death and finish up with Abandon All Life. That will give you less than an hour of music total and if you're like me, you will start over and listen again.\n",
        "\nWhatever else you could say about it, grindcore isn’t ‘big’ music in any way. By virtue of its sheer viciousness it’s a niche taste even to the dirtiest of dirty palates, and for all the admirable ambition and political earnestness of the practitioners, grind remains amazingly self-contained. Three positions are open to you as a grindcore band; you’re of the left-leaning and honorably progressive Napalm Death/Misery Index batch, or in the swampy company of outright nihilists like Narcosis and Terrorizer, or you’re Seth Putnam. And given that he's dead, that's a poor option.\n\nBut it’s the genre’s aesthetic feeling that never really gets a sense of the gigantic; take any sampling of even the best grindcore, and honestly ask yourself how much of it, fast and ferocious though it may be, actually feels like its polluted wave of grime about to crest and fall on top of you. Can’t find a record quite like that amongst your collection? Desperate to have one? Well then, O’ discerning metalhead with such oddly specific needs, you’ve found it now in ‘Abandon All Life’.\n\nOne couldn’t quite be justified in calling Nails an impatient lot; while this record clocks out after a breathless seventeen minutes, not a single one of them spent idling about. A perfect balance is here struck between the sort of shrieking, close-to-the-brink manic energy of the aforementioned likes of Narcosis (‘Tyrant’, ‘No Surrender’), and an immense capacity for variety in the songcraft. That it's quite so head-crushingly heavy (‘Wide Open Wound’, ‘Summ Ciqiue’) and can shift pace and speed on a dime helps too. This is the kind of record that sounds so utterly brobdinagian it could push a building over, and those who, like your humble scribe, have spent their lives seeking the crunchiest of guitar tones need look no further than the practically crackling one found on ‘Abandon All Life’. \n\nBut be warned; these seventeen minutes may leave you satisfied, but they can easily end up feeling criminally foreshortened. Don’t abandon all life just yet, Nails, not when you’re bringing stuff this good into it.\n\n(Originally published on Soundshock Webzine, 05/04//2013)\n",
        "\nAfter 2009's Obscene Humanity, Nails had already laid their collective feet in the California hardcore scene, but it's here on 2010's Unsilent Death that the band release their mission statement. Across the 14 minutes that constitute this incredibly brief LP, Nails lay down a furious assault of grindcore and powerviolence so unfiltered and rage filled that it's as if they're reaching through the speakers to personally punch your teeth down your throat. 14 minutes is all the band need to crush your soul, restore it to life, and crush it again until you like it. \n\nInstrumentally Unsilent Death takes its influence equally from formative powerviolence of the nineties and contemporary grindcore, with a bit of crust punk thrown in for good measure. Opening track Conform has no build up or intro, it simply bursts from 0 to 100 instantly, crushing you with an onslaught of blast beats and power chords before instantly seguing into track 2- Scum Will Rise. There are no breaks on Unsilent Death, no opportunities to catch your breath, no ambient interludes, all 14 minutes of this record will pummel relentlessly. That's not to say there isn't any variety here. The title track of the album for example is a crust punk number that's sure to get any crowd headbanging in unison and the album's closer is a longer, doom metal influenced burner. It's actually quite shocking how much variety is present across this tiny yet massive album. You'll even hear a couple solos here and there to boot!\n\nNails aren't a band to mince words. Vocalist and guitarist Todd Jones' lyrics and vocals speak to a primal side of man- maelstrom of aggression directed at people and life itself. At times they feel somewhat juvenile, but the unbridled anger in which they are shouted and barked more than makes up for it. The massive breakdown at the end of I Will Not Follow says it best- \"Fuck the sheep who tell me how to live, I wasn't born to follow; or swallow anybody's shit.\" \n\nI would be amiss to not mention the production here. Producer Kurt Ballou of Converge cooperates with the band to create a tone massive and heavy enough to fit the bands furious intentions. There's a murkiness to the album that only shows through on the few slower moments and adds an extra layer of darkness to the already very pitch black mood Nails conjure on Unsilent Death. This album will crush you, it'll make you its bitch, and it'll make you like it, all in less than 14 minutes.\n",
        "\nUpon my first time listening to Nails' Unsilent Death, a feeling crept over me not entirely dissimilar to the quickening of mind, body, and spirit I first felt as an adolescent when Slayer's Reign In Blood accidentally found its way into my Walkman. A keen sense that this was music that evoked all the anger, violence, hatred, and despair that storms and rages inside, seeking release. When I was younger albums like Reign In Blood or Repulsion's Horrified or Assück's Misery Index had that ability to briefly leave me stunned, slack jawed, and spent. But as I've aged, I've found that experience has become sadly rare. I may be awed by an album but that supernova flare of pure aggression expenditure hasn't hit me this hard in over a decade.\n\nWhat Nails have done with Unsilent Death is create a signature sound. Via a violent inducement of hardcore, crust, death-grind, and power-violence (swathed in an insane amount of feedback-driven, blown-out Boss HM-2 distortion), Nails have transcended the obvious homage of influence to graft a true hybrid that takes extreme music down yet another divergent left hand path, of which they are true progenitors. \n\nAt just under fourteen-minutes, Unsilent Death certainly does not wear out its welcome, and yet it is so extreme in its emotional toxicity and harshness of sound that one cannot imagine listening to it for even a second longer. One could drown under the tsunami-like effect of this album's emotional wave of unrelenting violence and hate, it just radiates out of the speakers. Each of Unsilent Death's ten brief tracks unfurls torrents of tinnitus-inducing feedback, incapacitating riffs and breakdowns, pummeling blast beats and d-beats, with ungovernable vocals that are lined with trauma and shouted to the edge of hoarseness. What sets these tracks apart is that, despite a similarity in aggression and tone throughout, each one has clearly been individually crafted to create a sense of voyage through the band's disturbed psyche. So many albums with this type of grind/pv/hardcore tinge to them often blur together but Nails actually craft brilliant micro-songs that stick upon impact. You'll be screaming the 'force fed control' chorus to \"Scum Will Rise\" in no time; or perhaps the invocation to 'losing control' that appends \"Suffering Soul\" will have you wrecking shit in ninety-seconds or less. It also is no coincidence that the two longest tracks (at 2:41 & 3:47) occur at the mid-point and finish line of the record and are mid-paced bruisers meant to spread out the impact of the previous sub-ninety second maulers. Not that these two tracks are soft by any means: the title track is one of the nastiest death-n-rolls numbers ever, twisting Entombed's Wolverine Blues formula into even darker form; whilst \"Depths\" closes things out with a Coffins-esque two-step death metal rattle that succumbs to an eventual mire of stupefying feedback.\n\nOne comes away from this record almost entirely jaded, as if no other hardcore band could ever come this close to perfection again. With Unsilent Death, Nails encapsulate the whole warring, back-and-forth history between hardcore, punk, and metal, with all its sympathies and divisions, and fuses them into one unique black cauldron brew that is instantly, ruinously addicting. Make no mistake, since Unsilent Death's release, an entire cottage industry of similar bands have arisen but just like how no other Holy Terror style Slayer-core band can touch Integrity, none of these so-called Entombed-core bands can even lace Nails boots. Fuck the hype and ignore the imitators, mainline this record and get strung-out on Unsilent Death.\n"
    ]
}