{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Oakland, California",
        "Status:": "Active",
        "Formed in:": "1985",
        "Genre:": "Hardcore Punk (early); Atmospheric Sludge/Post-Metal (later)",
        "Lyrical themes:": "Devastation, Evolution through pain, Spirituality",
        "Current label:": "Neurot Recordings",
        "Years active:": "\n1985-present ",
        "Number of Reviews": 75
    },
    "Band Reviews": [
        "\n\"The Eye of Every Storm\" sounds like the lovechild of \"Through Silver In Blood\" and \"A Sun That Never Sets\". With that bold statement out of the way, I offer salutations; hello and welcome! Is this your first time here? If so, let me show you around the greatness that is Neurosis. The aforementioned quoted titles are three of this post-metal band's best albums. To speak about Neurosis is to do so in superlative terms as they do indeed have about five 'best' albums. They've been around since 1985 and started out furiously punk, hanging around 924 Gilman Street even. It was a phase they quickly grew out of as their core musical nature seemed to suggest something 'experimental' was bursting to come out. As fitting as 'Neurosis' was as a name for a hardcore punk outfit, it would turn out to be just right for the force of catharsis the band became, as their music gradually shifted from industrial hues to tribal tones to sludgy grooves and into the amalgamation of all of the above. \"Enemy of The Sun\" was the first dizzying taste of a sure-footed Neurosis delivering riddles of pain and transcendence. They seemed to peak with \"Through Silver In Blood\" which just needs to be experienced and not described (yes, it's that serious) but along came legendary producer Steve Albini on \"Times of Grace\" and that heftily underscored the ambient traits the guys had been shoehorning between ultra-doom riffs. The album prior to this one under review was \"A Sun That Never Sets\" and it was entirely made of dirges that reached for the skies. It was heart-wrenchingly gloomy and transcendental and once again another 'best Neurosis album'. So where would they go from there?\n\nThey would go to the eye of every storm, of course. They would make this here album that collected the soulful menace of \"Through Silver In Blood\" and the melancholic transparency of \"A Sun That Never Sets\" for a whole new take on damage and repair. There's really no need for other references for Neurosis' style and sound except other Neurosis creations. Neither Explosions In The Sky nor Sigur Rós. Not Black Sabbath and not Godflesh. This band's vision is so singular and intentional that no other bands shall be name-dropped going forward. The band proper is fronted by Steve Von Till and Scott Kelly who both handle guitars - with Steve being the more textural and Scott a tad more immediate. Dave Edwardson and Noah Landis mess around with Moog, organ and sampling but Dave is intentional on that bass and Noah plays good piano. Jason Roeder has played drums on every Neurosis album to the point where his tribal grooves have become trademark at this point. It is necessary to highlight every band member here because they exceedingly pull their weight on this record...and not in the overt way of \"look how much work I'm doing with these nifty complex riffs\" but with such grace and mindfulness. There's a continual amazement to be had by the listener at how keyed-in and together the band can be at times while also able to be disparate and singular in the moments where individual efforts require appreciation. I give this album the utmost score not because it is perfection (for I don't truly know what that is) but because it is so endearing and so rewarding as a musical experience. Neurosis manages to be artistic but not stuffy, and brooding-slash-contemplative but not in the belabored navel-gazing format of bands that shall not be named.\n\nEach song is brilliant and needs to be heard. Preferably, within the context of the full album. I shall use three of the eight tracks to sum up my celebration of this masterpiece but I whole-heartedly adore them all. \n\n\"The Eye of Every Storm\" is an almost twelve-minute prog epic of apocalypse and tenderness. The tribal drumming dips in and out as if to offer echoes of a primitive hankering within the pristine and spacious production. Speaking of echoes, the way the line \"now oathbreaker sinks low\" is repeated calls forth something from the gut that's rather grim but satisfied. Humming Moog punctuates the pronounced halt where Steve Von Till howls those words. The vocals are entirely delivered in this half-sung, half-spoken style that serves the track's quiet-loud-quiet dynamic neatly. The lyrics imagine inevitability as comfortable and wholesome (\"Time brings them all home to the eye of every storm\"). The effect of it all is strangely soothing. \"A Season In The Sky\" is on the folkier side of the spectrum, featuring a crooning Scott Kelly gently weaving personal doom into collective malaise. The questing lyrics guide the atmospheric first half into the melodic and riffy outburst of a very satisfying resolution. It is an emotionally heavy highpoint on the album. It convincingly leads into \"Bridges\" where Noah Landis' piano contends with Roeder's frantic pace that's relegated to the background. Kelly and Von Till harmonize dangerously and soon enough thrust us into debilitating heaviness. The sheer sonic exploration and expansion on display here leaves a discerning ear awestruck. The song moves through layers of minimalism to those of noise and uber-doom. The album as a whole functions against this premise, as if peeling back the very foundations of Neurosis' oeuvre to the barest scraps - and then taking those scraps and stretching them out to their loudest possibilities. Exercises in minimalism, light and shade. It is an experiment of an album and the execution is terrific. Is it Neurosis' best though? Well, there's about four others but personally, this is the one I reach for first.\n\nIt is the kind of album that may change your entire outlook on what's possible within the realms of extreme and experimental metal. Our beloved genre is not famous for a multitude of emotionally complex works and this not only turns that notion on its head but also functions as a clear example of how greatly metal and heavy music (in general) have evolved. It does not exist in a vacuum; there's influences ranging from folk to electronic minimalism, noise and hardcore to doom and sludge. The way everything is blended is so inspired though and therein lies the magic. It may not appeal to you on first listen or if you're casually checking it out but full attention and closer scrutiny will reward you immensely. I wouldn't call Neurosis an acquired taste per se, but they've been known to be inscrutable and rather daunting at initial association. \"The Eye of Every Storm\" is on the more relatable end of their catalog and the words within tell of cycles of suffering and healing in language fraught with imagery and powerful metaphor. It is a triumph on all levels and quite simply, one of the greatest albums ever made by anyone.\n",
        "\nI'll start by saying that this is the first Neurosis album I really fell in love with, so my feelings toward it are a little extra favorable.\n\nThis album is not fucking around. Creepy, dense and savage it kicks of with \"Lost\" which is a hell of a track and perhaps as close as this album comes to being \"catchy\". The crawling bass intro, prescient samples and squealing guitars build to a crushing main riff with some excellent drumming. I love how Jason Roeder leads the band into the brutal sections by speeding up. The midsection of this song becomes increasingly disorienting with some creepy choir-like vocals. This song is massive in every sense and there are so many musical ideas here. The transitions in this song alone are fucking sick.\n\nBesides the utterly oppressive atmosphere, the most notable quality of this album is the sheer variety of material. While this album certainly is dense, I would hesitate to call it inaccessible. There's so much going on here, if you're patient you'll probably find a section you like in every song. It blows me away that Neurosis could create something like this in 1993. The sense of mood is integral to Neurosis albums and here it feels cohesive while bringing in so many different instruments, tempos, and degrees of density. \n\nThe riffs in \"Raze the Stray\" feel especially sinister with the piano line over top, yet at the same time have a real bluesy bounce. The trio of tracks three through five are the most challenging minutes of the album for me to listen to. The horrors of \"Burning Flesh\" transition into the filth of the next couple tracks. Lexicon in particular grows on me every time, but is still an extremely disorienting listen. I think I read somewhere that there are samples of worship noises in here. It's all creepy as fuck and does feel somewhat like drowning in a volcano.\n\nMy favorite song on the album has to be \"The Time of the Beasts.\" There are horns featured prominently that really add to the sense of funereal doom somehow. The second half of this song is probably my favorite four minutes of the album. The spoken word passage is cool, but when the band finally transitions back to the bruising riff, the way they lead into it just has so much fucking swagger. From here it's a hulking, gnarled build into sheer fucking mayhem. It gives me serious goosebumps with the intensity peaking as the song explodes into what can only be described as a spiritual purge through drums. \n\nOverall, I think this album is excellent to the point that I would rank it above both TSIB and TOG. Like all Neurosis releases, there is so much cool shit to notice with repeat listens. Like others have said, Neurosis really came into their own here with the crawling tempos, sludgy textures, DENSE production, non metal instruments and oddball song structures. This music doesn't sound like anything else I've ever heard. I can't really say, \"If you like X, then you'll probably like this.\" It's just a Neurosis masterpiece! Give it a listen if you haven't already.\n\nThis is a harrowing album, but it's as rewarding as it is frightening.\n",
        "\nNeurosis is a band that has influenced many artists within metal and even rock music in general. In the year 2001, Neurosis managed to put out an album that's as good as Through Silver in Blood and Times of Grace. This album is A Sun That Never Sets, which notably continues the atmospheric sludge metal sound that was introduced with Souls at Zero. This time, they changed it up by adding some wonderful melody into the mix. This melody is what makes the naming of A Sun That Never Sets so special.\n\nNeurosis albums in general are special and are meant to be listened to as a whole, which is definitely the case with A Sun That Never Sets. However, if I'm going to pick some highlights, I'm going to pick \"The Tide\", \"Falling Unknown\", and the title track. \"The Tide\" displays the clean singing of Scott Kelly that's prominent on A Sun That Never Sets. It's a ballad that builds up overtime and has some really beautiful violin playing. The title track is more akin to traditional sludge metal and could be seen as the album's equivalent to \"Locust Star\" due to its short time length. \"Falling Unknown\" is a thirteen minute epic that has a rather psychedelic and doomy approach to it. Couple that with the lovely violins nearly the end of the song and you've got something that music fans of all genres could enjoy. As such, this is arguably the best track on A Sun That Never Sets as the melody worked in Neurosis' favor.\n\nAside from the melodic clean singing present in many of the songs on A Sun That Never Sets, Scott Kelly's screamed vocals are still prominent within A Sun That Never Sets with the album being 50/50 in this regard. Scott Kelly and Steve Von Till's guitar work is some of the most eclectic of the pairs within metal. They often showcase their softer side with acoustic melodies with the signature crushing sludge riffs counteracting them such as on \"The Tide\" and \"Watchfire\". Jason Roeder's drumming on A Sun That Never Sets is simply used for atmosphere as the drum beats often come out every one to three seconds. It fits songs like \"Stones from the Sky\" and \"Falling Unknown\" rather well. Dave Edwardson's bass playing is top notch for a Neurosis record. You can hear his Sabbath-inspired bass playing on sludgy cuts like \"From the Hill\" and \"Crawl Back In\". Noah Landis' sampling is fun to hear as some songs like the title track and \"From Where Its Roots Run\" have this cool tiki spirit effect to them. Kris Force's violin playing is breathtaking and gives A Sun That Never Sets a rather emotional feel to it, as her performance on \"Crawl Back In\" is followed by one of Scott Kelly's most emotional vocal performances on the album. More importantly, shout-outs to producer Steve Albini who knows how to treat his clients. I guess Neurosis' partnership with Albini is the reason why most of their albums don't fall victim to the loudness war.\n\nEven though my father would dismiss this as loud and angry due to Scott Kelly's screaming, A Sun That Never Sets is one of Neurosis' more melodic albums within their discography. It still has the sludge riffs of classics like Through Silver in Blood, but with more varied experimentation. This makes A Sun That Never Sets an album with more lasting appeal and one of the best post-metal albums ever. Music videos were made for all ten songs on the album, cementing its legacy. As one of the best metal albums of the 2000s, A Sun That Never Sets is the pure definition of a modern metal album which is also an example as to why Neurosis is on Metallum. 100% high quality metal riffs coupled with the most emotional instrumentation and vocal performance the band put out in their lengthy career. A Sun That Never Sets is not just music, it's art.\n",
        "\nTo be honest, I'm usually not that into live albums. Three hundred and something odd reviews deep and this is my first review of a live album. I am willing to give them a chance with bands I'm obsessive about, and this is a pretty cool one. Seeing Neurosis live at Roadburn would be a hell of an experience, even more so back when this was released as they still had Josh Graham doing visuals for them. Seeing Neurosis live is still on my bucket list, and it's looking like it might happen this summer. Apparently they are a force to be reckoned with live; I've heard people who aren't fans of their newer stuff still say they are amazing live and even one or two people who aren't even into their albums. \n\nThe sound here, while (unsurprisingly) not album quality, is much better than the two \"official bootleg\" live albums they did a few years earlier. While the heavier sections can get a little muddy, the more ambient parts sound quite clear. The songs largely stay true to their studio renditions, but there's enough slight variation to keep it interesting. For example, the keyboards in \"A Season in the Sky\" are a bit different and near the end Steve's vocals get so gruff he's practically death growling. \"Crawl Back In\" sounds way more dreary than the studio recording and the weird vocal effect at the start of \"At the End of the Road\" is even crazier than on the album. They turn the end of \"The Doorway\" into this crazy psychedelic tribal drum jam, which is rad beyond fucking words.\n\nIt's a cool setlist for the albums they're working with, but I wish they'd go back a bit further than Times of Grace. Hell, they don't even have \"Locust Star\", which seems to have been a staple of their live set ever since Through Silver in Blood dropped. One of the main reasons I wish they'd go further back with the setlist is that there are barely any Dave Edwardson vocals here. I've said it before and I'll say it again - Neurosis needs to bring back Dave doing co-lead vocals. His style would have worked perfectly on Given to the Rising. However, it's a really solid setlist even if they are only working with a few albums, and the only thing I'd really want to change would to be swap out \"Left to Wander\" for another long Eye of Every Storm epic to go along with \"A Season in the Sky\". \n\nLive at Roadburn is a thoroughly badass live album, with some of the coolest cover art ever to boot. Neurosis are a band that has done the live circuit extensively (lugging heavy-ass projection equipment across Europe, no less), but have drastically cut down around the turn of the century due to it beginning to burn them out (Steve has said something in an interview like\"it starts to get depressing when you recognize a random truck stop in Indiana\") and wanting to be there for their families and be able to hold down steady jobs. They're no doubt a band to catch if you get the chance - I know they're on my bucket list.\n",
        "\nWhile random EPs have not been part of Neurosis's modus operandi since the early hardcore days, there's a specific reason why Sovereign happened. For Times of Grace they worked with notorious engineer Steve Albini for the first time and ended up booking more studio time then they needed as Steve is one efficient motherfucker and they were used to taking way longer to make an album. A fuckton of material was the result, and this EP was pulled from those sessions. The songs that made it onto the album did for a reason, but that doesn't mean this is disposable extra material. Even if the songwriting isn't to the usual standard, there's a lot of interesting experimentation on display. \n\nSovereign plays it a lot more loose with the songwriting than is usual for Neurosis, which is a big part of why it's a less essential release. However, this allows for much more experimentation; they often drift into soundscape territory. Don't be too alarmed, though. There's still a few tasty big riffs. I'm particularly partial to the big churning one in the title track. While the focus is often on stuff other than big riffs, this is not a pleasant journey by any means. There's a fair bit of ultra-creepy droning guitar lines, a reasonable amount of dissonance and even material verging on dark ambient. \"Flood\" is basically a particularly dark Tribes of Neurot track with some bleak guitar drones and awesome tribal drumming. There's a lot of tribal tom-tom drumming on Sovereign, which gives a war-like backbone to sonic exploration. Much of the vocal work is still fierce and crusty as fuck, with Ed hitting it out of the park in \"An Offering\", essentially giving the last great performance on a Neurosis song (really wish they'd start using him again, he would have sounded great on Given to the Rising and Fires Within Fires). \n\nThis is often viewed as a transitional release between Times of Grace and A Sun that Never Sets and I'm a lot less inclined to believe this than I used to be. The obvious thread connecting them is \"Prayer\". The guitar riff is exactly the same as the vocal phrasing on \"Roots Run Dry\". There's a fair amount of clean vocals on Sovereign, which would be featured heavily on the next two Neurosis albums. \"Sovereign\" does give some indication of where they're headed (but honestly not nearly as much as, say, \"Belief\" off of Times). There's some fairly melodic leads piercing through the grimy gloom and the song relies heavily on a soft-loud crescendo based dynamic that almost reminds of post-rock and is something their later releases would feature heavily (not that they didn't already do a lot of experimentation with dynamics). Ultimately, though, this is a hell of a lot more like Times of Grace than A Sun that Never Sets. Hardly surprising, seeing as this was recorded during the Times of Grace sessions. \n\nWhile hardly an essential component to the vast Neurosis discography, Sovereign is a nice treat for diehards. Although the songwriting is not up to the usual standard, there's lots of weird sonic exploration going down. From the meditative main riff on \"Prayer\" to Ed's cavernous bellows on \"An Offering\", from the hypnotic tribal drums on \"Flood\" to the crushing riff and the creepy piano section on \"Sovereign\", each song is not without its highlights. Definitely give it a listen if you're reasonably familiar with the band's discography and like what you've heard. Just don't expect to get from it the same thing you'd get from an album. In a lot of ways this is probably as close to Tribes of Neurot as Neurosis proper will ever get. Obviously newcomers to the band shouldn't start with this, but you're kind of a weirdo if you start with a random EP, anyway.\n",
        "\nWell, this is far less boring than the snoozefest that was Honor, but it still gets me a bit annoyed, and I haven't rediscovered my Neurosis-faith. Two problems:\n\n1) ever since it occurred to me that almost all Neurosis lyrics are random stream of consciousness BS I've never been able to take it all that seriously. Here that doesn't change, and\n2) every riff sounds exactly the same\n\nWell, not exactly the same, just.. basically, by almost any metric, pretty much the same. The same tempo. A pretty similar drumbeat, certainly the same anti-melody/patented half-step down riff that these guys have been plugging away at since at least Times of Grace, which is 17 years old. 17 years! That is a long time to rewrite the same, maybe 3 (possibly less) riffs? \n\nLuckily, then, a big part of the album is closer to stuff like The Eye of Every Storm, with the last two tunes in particular being a lot more interested in slow, despondent noodling than reexploring riffs which are now old enough to have a part time job, drive a car, or have perky boobs. It's funny in that throughout Reach's slow, moody build - sounds like something off Cult of Luna's Salvation almost, which is definitely a compliment- I was dreading a bad riff. You just knew that somewhere lurking by was a shithouse Scott Kelly-by-numbers deal. As a big fan of post rock and the like, it's a truly alien thing hoping that the quiet bit doesn't end.\n\nIt's become pretty obvious to me that these guys have reached their end of their sound- and that's fine, as for a while it was one of the best sounds out there. That said, there are a few bits of hope in some of the better moments here- these old dudes may not be done yet. Broken Ground has a few really nice moments, and as Kelly croons \"We seek the sun in endless night, and burn in it's forbidden light\" over some nice flittering synths and simple, clean guitar chords- well, it's a real nice moment and it's hard not to hope that these guys go on forever. \n\nThat said, nice/cool moments aside- Fire is the End Lesson has a cool, almost Through Silver In Blood-ish section that's the best heavy moment these guys have done in yonks- a lot of this is an exercise in well recorded boredom. Definitely a fans only album. Here's hoping the next album is something fresh, 'cos this formula is getting staler by the minute.\n",
        "\nOk, this is pretty fucking cool. We've got four classic bands and whoever 411 is covering Discharge classics on one to-the-point split. We have Nausea, who are easily one of the most important crust bands, with Extinction being a mandatory classic for the genre. Final Conflict appear for the second assault, a classic hardcore band with their Ashes to Ashes being as vicious as a rabid rottweiler. Next we have the mighty Neurosis, who need no introduction. However, it should be noted that this is before Neurosis really became Neurosis, still being a hardcore band trying to break out into something different. I honestly couldn't tell you who 411 is, but according to google they were relatively big in the SoCal skatepunk scene. Heh. Then of course we have Extreme Noise Terror. These guys live up to their name, their extreme brand of crust punk leading the way for the development of grindcore. \n\nNausea's cover of \"Hear Nothing\" and \"Aint No Feeble Bastard\" easily takes the cake here. They sound massive, scummy as all fuck and ridiculously powerful. The drumming is great, the sound is full and the vocals supremely grimy and pissed off. Final Conflict lends a hell of a lot of vitriol to \"Look at Tomorrow\" and play a faithful high octane cover. Neurosis's cover of \"Hear Nothing\" is pretty interesting if not just for a look at the development of the band. The drum sound is better than ever, with the huge war-like pounding of the snare, the riffing is big and grainy, but if there's one thing weird it's the vocals. They do a call and response thing and I'm honestly not sure who does the first set of vocals - it sounds higher pitched and scratchier than I've ever heard from Scott or Steve. I don't really like it, to be honest. However, Dave does a stellar job and you can really see the development of his vocals and how it came to be what it was on their slew of crusty 90s experimental sludge classics. \"State Control\" is a really cool Discharge song, it's still quite powerful but leans more towards classic punk and has ridiculously good songwriting. These 411 guys do a decent enough job and their vocalist sounds convincingly pissed off, I guess. Extreme Noise Terror's cover of \"You Take Part in Creating this System\" is surprisingly instrumentally close to the original - I was expecting something more, well, extreme - but the vocals are easily the harshest of the batch. \n\nI remember my dad telling me that when this album came out in '82 it was like an apocalypse in musical form. It's hard to argue that anyone was harder than Dishcharge in punk back then; their incendiary riffs and gruff apocalyptic bellows still sound ridiculously powerful today. For Discharged: Home Front to War Front we have some very important bands paying tribute to an impossibly important band and they generally do a really fantastic job.\n",
        "\nNeurosis’ Enemy of the Sun is among the most inaccessible slab of slow, monolithic music I have ever heard in my life (same can be said for Neurosis records in general, but Enemy is the ONE album that sticks out in this regard). Although it’s a commercially released music, it invites no one to come inside. It’s so uncontrolled, dense, and burly, you have to haggle your way into the soundscape. And if you make the arduous effort to engage with the music, you are thoroughly punished for it. \n\nThematically, Enemy of the Sun deals with vision, the sun, and spiritual absurdity. Although it was released in 1993, the themes, overall sound, lyrics, and their choice of sampled noises across the record gives me a chilling reminder of the story arc over the sarin gas attack that happened in 1995. Bear with me on the following paragraph - the story arc of the attack is a very good fit to how the record progresses from beginning to end. \n\nThe event was among the most frightening terrorist attack that ever happened, where members of a doomsday cult released colorless sarin gas (and hence invisible) on subways in Tokyo during the morning rush hour. It entices an apocalyptic panic and leaving hundreds with permanent nerve damage and psychological trauma, which torments the survivors to this day. Culprits were all caught and most sentenced either death or life imprisonment, and many members who weaned off their cult beliefs are consumed by massive guilt everyday, while the leader went insane in denial of his fate, and now spends his time masturbating incessantly and wallowing in his own feces in his cell while awaiting execution. In short, no one wins. And the music and lyrics on Enemy overlaps this story arc very closely (despite the fact that it was written much before the attack). \n\nThousands of heavy metal literature deals with insanity, death, apocalypse, spirituality, and all that jazz. Neurosis, and Enemy of the Sun in particular, triumphs in this regard because it sounds so real. The music sounds like it is greater than sum of its parts, where no one is “outstanding” but everybody shines - for example, 3 vocalists all deliver some truly tormented growls in spirit of hopelessness with no one being the “main guy” (though Dave’s voice is distinguishable by being noticeably low-pitched), and bass is as essential as guitars and drums, clearly audible. To top it all off, Neurosis does an expert job of deploying right samples at the right time to spike up the paranoia - gaseous noise and loops of monologue at the end of “Lost”, hypnotic chants in “Lexicon”, instrumental dissonance and static noise at the end of “The Time of the Beasts”, just to name a few brilliant examples. There’s so much doom without being a “doom metal” sound. \n\nThe reissue includes two additional tracks - “Takeahnase” and “Cleanse II”. Bonus tracks often throw off the flow of the record, and this is no exception here. However, both tracks are immense experiences in of themselves that aligns well with the spiritual and oppressive nature of the album, and it makes sense for both tracks to be included (case in point - the psychologically intense monologue about the WWII-era Japanese imperial army at the end of “Cleanse II”). \n\nEnemy of the Sun is a timeless classic, composed and played so purely from the heart, and there’s no dispute whatsoever. It’s an underground masterpiece, as a true enemy of the sun should be (pun intended). This is fucking savage y’all.\n",
        "\nNeurosis has long been a been a band that I'm liable to gush about to an embarrassing degree. Ever since I heard the spine-tingling intro to \"Souls at Zero\" as a gangly 15 year old, I knew I had found something very special. In fact, they were one of the bands that really started drawing me to metal when crust punk made up the bulk of my sonic diet. Since then, my appreciation for the band's storied career has only grown. They had always evolved, always pushed forwards to new sounds. Then in 2012 I was thrown into a bit of a crisis of faith - after two decades of great albums (with Souls at Zero being the first and greatest masterpiece), they had found themselves in a bit of a rut with their latest offering Honor Found in Decay. It wasn't a bad album, mind you. But it was their first where it felt they were on autopilot, like they were making an album because making a new album every couple of years is just what bands do. Their other albums had been statements; self-contained worlds. This was just . . . kind of there. \n\nI'd be lying if I didn't say I was a bit worried about where they'd go from there. Had they finally run out of ideas? Maybe it was just an uncharacteristic stumble - Type O Negative did release the lightweight filler-laden Life is Killing Me between two of the most fantastic albums of their career, after all. My fears worsened when I saw the artwork, which is not at all bad but still feels very obvious for the band. The song titles all sounded pretty routine as well, and only having five songs was another red flag - Neurosis albums routinely breeze past the hour mark and was five extremely long songs really the best way to go after the last album's most boring songs were quite long (little did I know that the album would only be 40 minutes long)? Soon they released a trailer from the album, giving us snippets from a few different songs and I was instantly relieved and filled with excitement - while nothing sounded that different from what they've done before, it all sounded pretty stellar. Oh, and they riff again. They fucking riff again. One of the biggest letdowns of Honor was the lack of memorable riffs. \n\nSo in the end what do we get? Well, I wouldn't rank this particularly high in the Neurosis discography, but that doesn't mean this isn't really good. They've set the bar ludicrously high with their decades-long run of fantastic albums, and while this isn't quite on the same level as most of them, Neurosis have clearly steered themselves back in the right direction. Fires Within Fires doesn't really operate on the same modus operandi we have come to expect from Neurosis. Their albums tend to latch on to a particular element of their sound and create an expansive experience out of it. Fires has many of the tried and true tropes of Neurosis in it, but it doesn't come off an exploration of a particular facet of their sound. Rather, while still doing some new things, this provides a panoramic glimpse of their past achievements. In essence, at this point in time, Neurosis is Neurosis's primary influence. \n\nIs this a good thing? I suppose, as long as this an interesting anomaly in their discography and doesn't become the new template. Anyway, for someone who is so nerdy about this band as me, picking apart which songs draw from which past works is really damn fun. The album starts off with Bending Light. The first part of the track is composed of twisted, vaguely dissonant atmospheric lingering, which reminds heavily of Times of Grace. Then seemingly out of nowhere, they burst out a seasick crusty riff (it's pretty amazing how the lyrics speak of being lost in a raging sea, and the riff actually gives off the feeling of a violent ocean storm), which draws heavily on their crust/hardcore work of the early 90s. I wouldn't be surprised if \"A Shadow Memory\" was originally slated to be a song for Given to the Rising but didn't end up being finished on time. The vibes are very congruent with that album, very lush and dark, giving off a feeling of wandering the desert at night. \"Fire is the End Lesson\" seems to be a reinterpretation of the Times of Grace Sound. You've got the vocal pileup thing which Neurosis relied heavily on in the 90s, but without the same crustiness in the vocals. The big riff at the start is really cool, it's quite dissonant, but also oddly bouncy and fun. Neurosis is a band that's all about contrast and this is a great example of this. \n\nThe second half of the album, comprised of the album's two longest songs, is where shit really starts getting real. The only thing that gets close to this on the first three songs is the second half of \"Bending Light\". \"Broken Ground\" is probably the most obvious song on here, but it's also one of the best. It is essentially a look back on everything the band has done in the 21st century. While the atmospherics are on point, and the riffs engaging, what really makes this shine through is the songwriting. This sounds like it probably started as a Steve Von Till solo song, and then he decided that it would work better if Neurosis went to work on it. The song structure works great, the interplay between harsh and clean vocals is at its best, and everything flows seamlessly. As good as \"Broken Ground\" is, \"Reach\" is Fires Within Fires pinnacle. It doesn't sound so much like A Sun that Never Sets as it sounds like something they might have come up with on the next album if they chose a different direction. It definitely has the atmosphere of that album, but works it into a lush, brooding psych rock song, featuring some immense croons from Von Till. The mid-section of the track is filled out by foreboding psychedelic wandering and then fucking BOOM - Neurosis go reeling back into the crawling darkness. We are met with a riff that would fit in very comfortably on Through Silver in Blood and some crusty howls from Scott. The riff has a very cool weird effect on the end that reminds of \"Celestial (The Tower)\" from Isis. \n\nOne thing that really works in Fire's favour is the immediacy of the album, something Scott has admitted was lacking in Honor Found in Decay. Bringing back the big riffs is much to thank for this, and this is indeed their riffiest in quite some time. Not only do we have titanic crust riffs smashing their way back into the fold, but there are a few stoner riffs here, which is pretty new for them (but I guess it makes some sense - Jason is now in Sleep). The humongous stoner riff in \"Broken Ground\" is simultaneously one of the most badass and the most fun stoner riffs I've ever heard. The surprisingly bouncy one at the end of \"A Shadow Memory\" is pretty fun, too. The atmospherics are on point, as one would expect with these guys, but Noah's work on the keys are a bit more subtle than last time, soaking the tracks in otherworldly atmosphere rather than becoming a lead instrument as we often saw on Honor (he does make his keys sound like some off-kilter woodwind in \"Broken Ground\", though). When a song comes to an end, often we're left with Noah's immersive soundscapes lingering for a few moments. The drumming is the least tribal in a while, with Jason making excellent use of the cymbals and largely relying on more utilitarian rock patterns. The production is as big and balanced as we'd expect from Albini, but also a tad muddier than usual, with this balance allowing every element of their sound to shine through, but also allowing the heavier moments to be much more forceful. The drum sound is particularly killer. \n\nAs for complaints, while their aren't a wealth of them, this isn't one of Neurosis's best albums and there's a few reasons why. While I wouldn't say they totally played it safe and I did enjoy the throwbacks, a few more new ideas would have been cool - especially seeing as new ideas are what the band thrives on. They've explored so much it's hard to even know if there's very much unexplored territory left for their sound. Perhaps the biggest lost opportunity for this album was Dave Edwardson, while I understand leaving his vocals off of A Sun that Never Sets, The Eye of Every Storm and even Honor Found in Decay, the more aggressive sections of Fires were just screaming for his ungodly cavernous bellows. While I did like the drumming, imagine how insane it would have been if Jason went full TSiB elephantine tribal war drumming on the ending riff of \"Reach\". In all, there's not much to complain about, and if there's any reason this won't be considered one of Neurosis's classics, it is because it fails to cover the new ground that they typically do. \n\nThis year, Neurosis embarked on a host of 30th anniversary shows, being joined by a host of bands - from Discharge to Earth - all fitting in somehow to their vast wealth of different sounds. With these shows they dug deep into their discography, playing songs that had long been retired from their live sets. Hell, they even delved into their first two hardcore albums. Fires Within Fires really encompasses the spirit of those shows - they spend more time reinventing the old than beating their way into new sonic territory. And fuck it, they deserve to sit back for one album and have a fun time configuring something that encompasses the scope of their entire career into one lean, mean album. I only hope that they leave this approach as a one-off venture.\n",
        "\n\"Honor Found in Decay\" was perhaps the first Neurosis album where it felt like the band wasn't moving forward any more. It didn't introduce many musical innovations, and it's mostly \"At the Well\" that I still listen to from it. It also suffered from an overlong play time. Neurosis made even longer albums, but those also had vastly superior material.\n\nThis album doesn't necessarily have increased amounts of innovation, but the songwriting is back in healthy shape. First off, this just feels like a more focused record, perhaps best highlighted by the 40 minute running time. Many times when I listened to the last album, I found myself zoning out and waiting for the next interesting move. Regardless of how heavy or mellow a section is, this one never drags.\n\nThe 40 minute running time works for me for another reason: I have an admittedly hedonistic relationship with this type of music. There are sludge fans who frown on bands like Ghost Brigade and Eyes of Fire that play Neurosis influenced music in a more accessible style. I'm not one of them. I'm not saying that Neurosis took a more accessible direction here though. In fact, this is an album without standout songs like \"Locust Star\" or \"Burn\". When closer \"Reach\" rings out it feels more like a logical conclusion to a massive song.\n\nWhen I listen to this band I often find myself jealous as a composer. Neurosis use basic musical tools to create something much bigger. The attention to detail is high, and when a mellow part explodes into a sludgy riff it feels as primal as it feels calculated. There doesn't seem to be an underlying formula to it, every transition just comes exactly where it's needed. As always, Scott Kelly and Steve von Till both put in great vocal performances. Kelly sounds especially fierce and drives a lot of the songs. The vocal arrangements also contribute to the combined feeling of passion and precision. \n\nIt feels like there's nothing left to say but to congratulate Neurosis on being back on track with a strong effort. If they build on this foundation of strong songwriting and find their way back to previous levels of innovation, this could be a great sign of things to come.\n",
        "\nMan, these flexidisc things are fucking weird. I thought it would be like a little 7\" or something like that, but what eventually showed up at my doorstep was something more akin of a flimsy piece of plastic paper. I was kind concerned that my record player would tear the puny thing up, but obviously the thing played fine. Anyway, I'm pretty sure the new Neurosis issue of Decibel is the first time I've actually ordered a specific issue of a magazine online. I know I could have just picked it up at the store, but I was pretty excited about the flexidisc that you could only get if you ordered it online or have a subscription. \n\nI know this review is supposed to be about the song, but since no one is probably going to read this anyway, I'd like to take the opportunity to geek out a bit about the band and how cool the magazine about them was. Featuring interviews not only of the current band members, they talk to past members like Simon McIlroy, through and through amazing producer Steve Albini (probably the most insightful part of the whole issue) and even testimonials from everyone from Converge to Baroness. Three albums were inducted to their hall of fame series simultaneously: Souls at Zero, Through Silver in Blood and Times of Grace (would have chosen A Sun that Never Sets over that last one, but eh). As a fanboy of preposterous proportions, I was absolutely enthralled by the history they laid down in regards to these stone cold classics - bringing in punk legend (and probable douchebag) Jello Biafra to help get the sound they want on their experimental masterpiece Souls at Zero, Christ on Parade guitarist Noah Landis ditching his chance to move to Spain to join in for brutal masterpiece Through Silver in Blood and the realization that they were trying to cram too much into to too little space which led to their great thaw in Times of Grace. \n\nAnyway, the flexidisc contains a demo of one of the most classic songs they ever mustered. \"Locust Star\" is easily one of my favourite songs from the band and one of my favourite songs in the vast landscape of heavy music. A metallic crusty rager with a burly tri-vocal assault, it is an unbelievably powerful scorcher. It also shows that this experimental behemoth can also rock the verse-chorus formula with ease (but not without a twist at the end). There's some high pitched spooky keyboards in one part, and marginally different vocal phrasing here and there, but the demo is not far off from the album version, it's just not as strong. Overall, the sound is a bit thinner, the vocals a bit weaker and the drums a bit less overwhelming, but of course it still sounds cool. This captures the essence of the song well, if not quite capturing the same levels of sheer brutality. Edwardson's part at the end of the album version might be my favourite part of any Neurosis song, and it just isn't the same here. \n\nI can't really picture myself actively going out of my way to listen to this over the album version (my TSiB vinyl finally showed up the other week!). However, this is a sweet little relic to own and the magazine it came with made my order well worth it. It's a cool oddity for diehards, but I don't see any reason for the casual fan to go out of their way to check this out. I kind of wish that they released a Times of Grace era b-side instead for this. I remember Steve Albini saying in an interview that along with Times and the Sovereign EP being recorded in one session, they also recorded enough b-side material to fill up an entire album. Either way, I urge fans of the band to seek out the magazine issue, with or without the flexidisc. \n\nBonus fun fact: the sample that anticipates that the raging heaviness usurping the comparatively atmospheric intro is actually Charles Manson sighing.\n",
        "\nI'm a huge fan of progressive metal. I additionally love sludge metal and a good bit of doom! Hearing about these guys and what they've done for these respective genres peaked my interest as to what they're about. To be fair, I expected quite a lot. These guys after all have paved the way for bands like Isis, (one of my all-time favorite bands) and various other atmospheric/sludge/progressive metal acts. When first listening to them about two years ago, I was appalled, and not in a good way. I started with their album \"Souls At Zero,\" an early dabbling into their now progressive and atmospheric sound. I found that not only were the vocals horrendous, the music wasn't all that progressive. Now two years later, my Neurosis hiatus has come to an end and I've done my fair share of listening within their entire discography. I've come to understand a little more as to why they are loved among some. But I've yet to understand the universality of this bands scope among metal heads as a whole. I almost feel inferior in seeing these guys as highly overrated and boring... but that's how it is. This introductory rant has been exhaustive, and I think its due time to get into the meat and potatoes of this album. \n\nThe album kicks into gear with the title track, \"Through Silver and Blood.\" A fairly industrial sounding drumbeat eventually builds up to a reoccurring melody line that loops and progressively grows heavier throughout the first 3 minutes or so of the song. I honestly think this whole introductory section is pretty cool and has the potential to build into something pretty epic. Lo and behold however, the vocalist enters the picture. This dude should be in a hardcore band honestly. I was waiting for the instrumentalists to start playing some thrash because that would be far better for this vocal performance! Yet, for as much as I was annoyed by the vocals, I found the lack of diversity in the instruments to be equally disheartening. For this band being dubbed a progressive metal act, I was bored and taken virtually nowhere. The a minor chord progression established in the early minutes of the song is just about the only chord progression in the entirety of the 12 minute opening track. Repetition in itself really isn't a bad thing, (Ministry: Psalm 69, which is a fantastic album!), but this album takes the cake for monotony at its most mundane. This can be attributed to the absolute lack of buildup beyond a given songs introduction point, the lack of vocal range/versatility and the instrumental repetition. \n\nThere are some bright spots on this album though, and it's obvious that these guys are extremely bright and talented! Many of these song introductions are fantastic, (\"Through Silver and Blood,\" \"Purify\" and \"Aeon\" in particular) The previously mentioned tracks are also pretty decent in their entirety, but certainly average in the larger picture of progressive, atmospheric or sludge metal. What disappoints me about these cool intros is that they build up to something, and ultimately play an established riff for the entire song. The vocalist is the last addition to the hodge podge and suddenly we got us some progressive metal? What of the meter changes? Key signature changes? New chord progressions? Ambient passages? I'm lost as to the exploration that's done in this album. Truth be told... I really don't need exploration or progressiveness to enjoy a metal album, but quite honestly as solely a sludge album, it still kinda sucks! I felt like this album had a huge amount of potential only to be limited to mediocrity and limited exploration on the part of the band members. \n\nI still hope I can come to appreciate Neurosis with more time and more listens. I absolutely appreciate the bands they've influenced and the genre(s) they've helped pioneer, but as of now I'm still on the outside looking in as to this group and their widespread appeal among metal fans all across the board. For something similar yet vastly more exploratory and progressive, I thoroughly recommend Isis' album \"Panopticon.\" \n\nFinal score 55/100 \n\nHighlight tracks, \"Through Silver and Blood,\" \"Purify,\" and \"Aeon.\"\n",
        "\nAh, the pre-Steve Von Till Neurosis days. Like Pain of Mind, this is still very much hardcore. However, there are lots of hints at them trying to break away from the crowd. Scott has said in interviews that from the very earliest days of Neurosis they wanted to do something different, include additional instruments, make their style their own ect. This is still very much hardcore kids who are limited by their abilities, lack of good equipment and only have access to raw production. They do pretty well with what they have here, but at the end of the day this is more a curiosity for people who are really into the band than a standout hardcore release. That said, this is not bad at all and the bass is outstanding. \n\nWhile still relatively bare-bones hardcore, this is pretty metallic and definitely has some thrash influences creeping in. The hardcore is more or less standard, but what makes it different is the little weird parts. There's a few sections with just the bass where they try to create some breathing room. \"Pollution\" starts with a really weird experiment that doesn't really go anywhere and I'm honestly not sure what they were going for. Others are a bit more successful, though. Jason has definitely upped his skills on the kit, starting the album with a pretty funky-ass rhythm. These sort of rhythms return quite often, although there's not really any early signs of the hypnotic tribal rhythms he later became known for. This definitely sees him moving beyond a standard hardcore beat, though. Dave Edwardson is really the star of the show here. The bass lines play circles around what the guitars are doing, and following them is easily the most interesting part of this release. He ups this for The Word is Law, although ultimately takes a different approach starting with their watershed album Souls at Zero.\n\nThis is really nothing revolutionary. It's just scrappy punk kids from Oakland doing their best to try and make something special with limited abilities. I think Steve joining was a major turning point for the band, and you can definitely hear way more experimentation with The Word as Law. Fans of hardcore will probably enjoy this well enough for what it is. No one should come into this expecting Neurosis as we know them. This is a good try and pretty decent for old school hardcore, but they still had a long road ahead of them.\n",
        "\nTimes of Grace is Neurosis’s Khrushchev to Through Silver in Blood’s Stalin. The brutality had reached an oppressive high on Through Silver in Blood and the only logical place to go from there is to bring in a gradual thaw. Don’t be mistaken, Times of Grace is still a damn heavy album, it’s just nowhere as heavy as Silver and has much more room for the light to breach the darkness. This transition reminds me a lot of Swan’s Children of God in that the band had already reached their high-water mark for what they could do with the darkness turned up to 11 and while still a damn heavy and dark record, did have quite a bit of room for more beautiful sections (especially with Jarboe’s vocals) and even something vaguely resembling traditional song structures. Times of Grace is much the same, the song structures, while still quite out there, come across as more structured and some of the quitter sections are downright gorgeous. \n\nFor the longest time Times of Grace was just that one Neurosis album that never really clicked with me. “Belief” was one of the songs that got me into the band, but on the whole it just didn’t strike me as being as interesting as their other albums. I think a lot of this has to do with the fact that it’s such a transitional record. I can hear a choir of fanboys now shrieking “no you dumbass, all Neurosis albums are transition albums”. While all Neurosis albums are transitional in that they were never interested in making the same album twice, this one in particular serves as the link between the two big eras of their sound. With Silver they brought their tribal crusty sludgefest to its logical extreme and with A Sun That Never Sets they began the largely mellower (although Given to the Rising is about as heavy as anything they’ve done), less chaotic and less crusty era of their sound. Times of Grace features heavy doses of both, with the crust element still remaining, many riffs that still feel like a prehistoric beast writhing in a pit of tar and with Dave Edwardson providing his final vocal offerings on a Neurosis album. However, there’s a lot here that showcases a completely lighter element of their sound. \n\nSince Souls at Zero (and even Word as Law to some extent) Neurosis has been a balancing act, with sounds you usually wouldn’t hear on a metal or crust album balancing out the heavier shit. However, here it is mellower and more built into the core of the songwriting. While I wouldn’t call this album a mix of post-rock and sludge, there is definitely an influence from bands such as Godspeed You! Black Emperor here. The bass plays a huge role in these sections, and a lot of it reminds me of post-punk. The mellower song “Belief” shows some of what to come and to some extent seems like their take on early post-punk and classic gothic rock. There are definitely some melancholy autumn vibes here, absolutely beautiful, but in a pensive and bittersweet sort of way. The album closer “The Road to Sovereignty” is surprisingly uplifting in its second half and seems like a more keyboard-based sequel to “Empty”, Souls at Zero’s final track. The inclusion of additional instrumentation once again works out brilliantly for these guys. The strings on here are fantastic and there are even sections with tuba and trombone. \n\nAs for the heavier material on this album, Neurosis still had no qualms about bludgeoning listeners with massive riffs. While the first main riff to “Doorway” is pretty badass, the second doomier one is one of the heaviest and most memorable they have ever mustered. It is simultaneously menacing and catchy, setting the bar extremely high very early in the record. While there are big and chaotic riffs, much of the rhythm guitar work is made up of dissonant chords. There are still remnants of Silver’s industrialisms and this complements them wonderfully. Their harsh vocals are still crusty and raw, but not quite to the degree they had been. This is especially the case with Dave Edwardson, although his vocals are still really unique and twisted. Clean vocals are more prominent than they have ever been (just check out the first half of “Away”) and they really help change the dynamic of the band. The drumming here is particularly interesting. Jason still does some awesome tribal stuff, and on parts like the opening to “Under the Surface” there are multiple people jamming along with him on floor toms. But what’s really cool is he shows that he is also a master of more orthodox drumming, “Belief” remains one of his finest moments and he really shines with his intricate cymbal-work in the mellower sections. \n\nTimes of Grace marks the first album in many done in collaboration with prominent producer Steve Albini. This was a very wise choice for the band, as this is easily their best production yet. Everything has a very organic tone, the band records live (with some overdubs of course) and it feels like you are in the room with them. Noah’s keyboards are captured particularly well, and they give the album an ethereal vaguely Eastern-tinged atmosphere. Lyrically, this just might be my favourite Neurosis album. There’s a sense of violence and redemption that reminds me of old Cormac McCarthy novels. The lyrics are some of their most accessible (this is by Neurosis standards, remember) and they drip of metaphors for life’s trials and tribulations.\n\nTimes of Grace is Neurosis’s great thaw. While still creating monolithic slabs of crushing sludge, there is a lot more room for expansive clean sections to become further integrated into the sound. While this is very much a transitional record, there is none of the awkward growing pains of Word as Law. This stands as a colossal statement in its own right. This really is the best of both worlds, dripping with beautiful atmosphere and oozing with ground shattering heaviness. Having pushed into the deepest corners of the darkness, here they take a small step into the light.\n",
        "\nIf there is one thing to be said about Neurosis, it is that they’ll never be caught making the same album twice. While some may have thought they were headed down more of a prog route after the experimental masterpiece Souls at Zero, they churned out a massive sludgy tribal mindfuck just a year later with Enemy of the Sun. While they would never cease to evolve, Enemy of the Sun proved to be the raw template which they would use as a springboard to explore new sonic territory. For the monolithic Through Silver in Blood, they took what they created on Enemy and basically snuffed out all light. This album is pure devastation. It’s not an immediate blitzkrieg of all-out war, but rather the sonic equivalent of slowly dying of thirst in a post-apocalyptic wasteland. It’s a shame that music like this would be too alienating to use as soundtrack for movies, as it pretty much sums up the atmosphere of The Road. \n\nBeing an opaque clusterfuck of ideas is largely what gave Enemy of the Sun its charm, coming off like a stream of consciousness from the mind of a heroin addict. However, this is much more focused, and wholly focused in pushing the limits of brutality and emotional devastation in a way that hadn’t really been done before. Sludge had been kicking around for a little while before this, with it really taking off at the dawn of the ‘90s. But while groups like Eyehategod, Crowbar and The Melvins were digging into some pretty heavy stuff, that was a walk in the park compared to the sheer sonic massiveness of this. Swans’ early work, which predated Black Flag’s My War (the second half of that album basically being the definitive template which sludge was born out of), seemed to anticipate sludge and was some of the bleakest and most fucked up music around. I can hear the influence, and I would say this is the spiritual successor to works like Filth and Cop – bringing out the same primal impulse and raw vitriol in a way that further pushed the envelope of just how heavy, fucked up and devastating music on the slower side of the spectrum could be. \n\nThere are two elements here that are absolutely crucial in understanding why this is better than the previous album. Or two men, rather: Noah Landis and Billy Anderson. While Billy Anderson replaced Jello Biafra as Neurosis’s producer for Enemy, he has noticeably improved here. Not that the production was bad before, but it is absolutely massive here – I’d go as far as saying that this album couldn’t have been successful without it. Everything is as thick as tar, and sounds huge while still sounding rawer than a freshly slaughtered animal. Probably a big part of why this sounds so thick and big is because much of this is double tracked and the band has said that in some parts there were 16 fucking keyboard tracks going. Basically the modus operandi is to pummel with everything the band can throw at you. This is the first album to feature Noah Landis, creating the lineup that is still intact today. Plucked from the awesome East Bay hardcore band Christ on Parade, his work behind the keyboards really brings to life the crushing and suffocating atmosphere they are going for. While a handful of other Neurosis albums have industrial tinges here and there, Through Silver in Blood is the only one where it is integral to the sound. Much of this has to do with the bizarre dark and twisted keyboard effects. I, for one, can’t imagine the title track without that awesome industrial creaking sound. Like previous works, sampling plays a big part here. Not only in the inclusion of weird and unsettling sounds, but also harrowing spoken word bits, drawing heavily from experimental groups such as Throbbing Gristle. \n\nScott and Steve offer some pretty massive guitar here. Sure, there are riffs that bludgeon you over the head, but a lot of it is weird Voivodian swirling patterns or even the same chord or two pummeled into oblivion. The massive tone is really what allows this to work so well. There’s a lot of dissonance here, and very little melody to be found besides the occasional additional instrumentation. The bass slithers around like some ancient serpent, rumbling menacingly under the roar of the guitars. There are some particularly unsettling parts where the guitars drop out and the bass swirls frantically like an animal drowning in tar. The triple threat of the vocals is undeniably powerful here, with the two guitarists and bassist all adding a pretty unique voice. Scott and Steve both have pretty damn gravelly vocals, both drawing heavily from crust punk. Edward’s voice is a fucking spectacle to behold. He is used the least, making his inhuman bellows even more powerful when they do crawl up from the murk. Basically they are as demented a yell as possible without actually distorting the voice as done in most harsh vocals. Essentially, they are traditional hardcore vocals stretched to their logical extreme (probably past it, actually). \n\nWhile all instruments are more than hauling their weight, the drumming here is absolutely batshit insane and an enormous part of what makes this album so memorable. Jason came into his own as a drummer on Souls, cemented his signature style on Enemy and gave the performance of a lifetime on Through Silver in Blood. That’s not to say he hasn’t progressed since, but never has the drumming gone as all out in Neurosis as it has here. While there is some interesting cymbal work on tracks like “Purify” and killer traditional drumming here and there, the tom-driven tribal patterns dominate and give this a sense of warlike intensity. If the rest of the album is wandering through a desolate desert wasteland, the drums are the lingering fear that you might be attacked by rabid scavengers at any moment. This kind of reminds me of Winter’s Into Darkness, not because the albums are necessarily similar (although there are certain parallels to be made), but because the albums would be awesome even with traditional drumming, but the unique and confrontational styles really gives them the edge they need to be absolute classics. \n\nThe main criticism I’ve heard of the album is basically that all of the songs don’t sound like “Locust Star”. To be fair, “Locust Star” is probably the best song on the album and easily one of the most memorable things Neurosis has ever done. A crusty rager, it condenses the songwriting into a much more accessible package. I mean, Edward’s “Will to Power” part at the end? Fucking forget about it. (Sidenote: check out the video of them performing this live at 1997 Ozzfest. It is hands down the most intense and powerful live video I’ve ever seen.) This starts a tradition of a more accessible song with easier to digest songwriting that would be continued in a few of their other albums – “Belief” and “A Sun that Never Sets” are two examples. I definitely think an album of “Locust Star”s would be pretty cool, but I do think Neurosis took the right approach here with the long, drawn out songs and more open-ended songwriting. Post-apocalyptic imagery aside, this is the soundtrack to being mentally drained and losing all hope. “Locust Star” is a hell of a lot of fun, but on the whole, this album is not meant to be fun. It’s meant to be draining, in a cathartic sort of way. The songwriting allows the brutality and sonic devastation to unfold in an organic way and become the main attraction rather than something giving the songwriting an extra edge. \n\nWhile certainly one of the most dark and uncompromising albums I’ve heard, they don’t play at 11 for the album’s entire duration. This is a very good thing, as heavy music tends to sound heavier when there are lighter sections for them to be contrasted with. The lighter passages are definitely not light in spirit, though. These passages scream mental exhaustion and failure of the will. There are some gruff clean vocals here, which are pretty cool. There’s also some additional instrumentation, even further expanding the scope of the album. There are even some atmospheric bagpipes, which is pretty cool not to mention totally unexpected. The beautiful string/piano intro to “Aeon” offers a rare bittersweet glimmer of light through the darkness. \n\nThrough Silver in Blood is an unparalleled exercise in brutality and easily the heaviest sludge album out there. What most of these atmospheric sludge bands whose existence is only possible because of Neurosis forget is how damn heavy Neurosis could be. Who would have thought that three angry young men screaming at you over tom drums could amount to so much? Take crust punk, hardcore, doom, sludge, industrial and mix it in a tar-stained cauldron and you still would only be at the tip of the iceberg. I could try to pick apart influences all day, but at the end of the day that would be a rather futile endeavour as the whole point of Neurosis combining those influences into something unrecognizable. Bands of this caliber are well above just being a sum of their influences. Neurosis are truly trudging into new sonic territory here. This is the sort of primal shit that speaks to your lizard brain.\n",
        "\nWhile Neurosis’s previous album, Souls At Zero, will always remain their magnum opus in my eyes, it is somewhat of an orphan in their discography. With the band’s general view as it still being a stepping-stone to finding their sound, nothing in their discography sounds remotely similar. It is with Enemy of the Sun where they really started falling into their signature sound. Feeling they were getting too caught up in a cerebral process with Souls, for Enemy they decided to slow things down and play from the gut. The result is a visceral ooze of nightmarish sludge and demented crust. \n\nWhile Souls were filled with sharp metallic crust riffs, Enemy sees those slow down into a cesspool of glacial riffs that slowly churn with the heft of shifting continental plates. The fact that this type of album came out in 1993 is nothing short of astounding. While the Melvins arguably released the first sludge album in 1986, the style didn’t really find its footing until the dawn of the ‘90s with bands such as Crowbar and Eyehategod. While it’s hard to know if Neurois were aware of these two Nola innovators, they were certainly aware of what the Melvins were doing, and moreover the B side of Black Flag’s My War (largely regarded as the spark that set off sludge) had a big influence on the band (Scott even has a tattoo of the release on the back of his neck). However, this isn’t just run of the mill sludge. This is inarguably the first sludge album to bring in atmospheric tendencies as a large part of the sound. Countless bands have this album to thank for their existence.\n\nThese atmospheric tendencies are a far cry from the serene, picturesque soundscapes that many atmospheric sludge bands use today. Rather, Neurosis conjures up claustrophobic hellscapes. In many ways this album seems like an exploration into the darkest corners of the human mind. To achieve the more atmospheric passages, Neurosis use deep, crawling bass lines, nightmarish keyboards and additional instrumentation such as piano, violin and horns. While the additional instrumentation isn’t as prominent as in Souls at Zero and there aren’t many awesomely bizarre clean instrumental sections on this one, they still add a lot to the overall experience. Samples continue to play a prominent role, bolstering the album’s bleak aura of mental disorientation. Interestingly enough, the band was partially inspired to do this from Dr. Dre’s work as a producer. \n\nThe meat of this album is filthy, vitriolic sludge reeking of crust influences. Big riffs are plentiful and Enemy is so stuffed with ideas that the weight of everything going on makes for a pretty claustrophobic experience. Released only a year after Souls at Zero, this was originally supposed to be an EP, but the band was so brimming with creative fertility that they ended up recording a full length. This is certainly more abrasive than Souls and can be pretty opaque, dense and difficult. This is definitely not the best album for newcomers trying to get into the band. However, beyond its callous exterior lies an immensely rewarding experience.\n\nFrom the crushing riffs, to the mammoth bass lines; the tribal experimentation on the drums, to the triple threat vocal assault – this is an album where nothing is an afterthought. Each instrument is used to create something interesting. For example, the album opener “Lost” would lose its charm without that massive crawling bass line (you’ll know the one). This album would be incomplete without the closing epic drum jam of “Cleanse”. One of the most ambitious things Neurosis has ever done, this shows Jason fully realizing his tom-heavy tribal style that was blooming in Souls in one of the most awe-inspiring ways possible. The impetus for this drumming style was what bands such as Crash Worship, Coil and various industrial groups at the time were doing. The vocals are uncompromisingly powerful– often with two members going at the same time, Steve, Scott and Edward provide three distinct and very powerful voices that all seem to stem to some degree out of the crust scene. The lyrics are more potent than ever, and to some degree reflect Scott’s addictions at the time – when he was younger he says he tried to tear down his mind with psychedelics to deal with the past and the loss he has lived through. \n\nIn the reissue, there were two bonus tracks added. This wasn’t a good idea on Souls at Zero, and it’s not a good idea now. Neurosis are very much an album band, and it seems almost preposterous that something would be tacked on to the end of such a carefully constructed vision. That said, the bonus tracks in themselves are not bad. The demo version of “Takeahnase” is very interesting if not quite as good as the album version. Cleanse II (live) is a Floydian experiment of psychedelic sounds with perhaps a slight industrial tinge. A moderately interesting experiment, but hardly gripping like so much of their discography. However, the one thing the reissue got very right is chopping off the second half of “Cleanse” where a sample is looped over and over again. I’m not sure what they were going for (hypnotic repetition, perhaps?), but it just sounded annoying in the original version and went on absurdly long. \n\nTheir shift in focus from a cerebral to a more visceral creative process provided some interesting evolution in the Neurosis sound. While Souls was had much sharper riffs, here the riffs are generally slower and embody the feeling of drowning in tar. A nightmarish and oppressive album from start to finish, this is a harder release to connect to initially, but well worth the trouble. Enemy of the Sun marks where Neurosis really started to find the sound that they would build upon and morph for decades to come. While the production is quite well done, this is still very dense and uncompromisingly abrasive. A harrowing descent into the bleakest corners of the psyche, this is an amazing if not entirely pleasant journey.\n",
        "\nWhere to begin..\n\nThis is one of the most important albums I have ever heard in my life. There, I said it. There's no easy way of saying that, but it's true. I'm not going to lie and say that I instantly got what this band were about when I first heard them in 1996. I didn't have a clue what I was listening to because it was so different from anything else I had ever heard before, and it was much more mature than I was at that age. I was only sixteen. Nothing can prepare you for this at age sixteen.\n\nYet I kept coming back to it. There's just something about Neurosis that keeps you coming back for more. And it's not exactly radio friendly hooks, either. The songs are long and hard to listen to. Especially with this album, I was later to discover, that you can't just really say \"Oh I like Purify, that has some good beats in it, I'll just throw that on then listen to something else\"\n\nNo. This album pretty much demands you to listen to it from start to finish, how it was intended. Not only that, but this just simply transcends music as a whole. It's so much more than that. When I stopped forcing myself to see it as \"an album\" and more like a work of art, a landscape, a painting, nature itself.. then it all made sense. I was sixteen when I first heard this. I was pushing thirty when it started to make sense to me, ,,,and the crushing doom fell on my shoulders with the weight of a thousand moons. The realization of what I was listening to, and what it made me feel, is so hard to describe. And the best part is that it can still make me feel the same way even after all these years. \n\n\"Through silver in blood\nWe stand judged not\nBy eyes of flesh\"\n\nEvery time I hear that it feels like someone is dragging nails across my spine - steel on bone. The title track sets the tone for the rest of the album, but not the emotions. Listen to this on headphones and let the music wash you away. It will take you through all sorts of thoughts and feelings. A journey you're likely weren't prepared for. \n\n\"Purify\" is one of the most special things I have ever heard. When I usually review albums I talk about production values, musicality, etc but none of that even applies here. It's just not important. I will say though, that when the guitars kick in on \"Purify\", it really is an uncomfortable experience, in one of the best ways possible. If there's one track I keep coming back to on this album, without being able to help myself, it's this and \"Locust Star.\" Ah, \"Locust Star\", the song that got me into this band in the first place. I'm sure everyone has heard it by now. There's yet to be another song with such a terribly enormous, frightening ending as this one, save maybe \"Stones From the Sky\", another song by yes, Neurosis.\n\nThis is a concept album, so like I said earlier, should be listened to as such. Actually, must be listened to as such. Some people have gotten into detail about what it's exactly about here, and they are correct, but I would prefer everyone to listen to the album and come up with their own versions, their own visions, of what it's all about.\n\nAnd that's the main thing here. Even though Neurosis use a huge wall of sound approach, what they are doing is essentially painting with music. Huge, sonic landscapes, as far as the eye can see, as far as the ear can hear. The lyrics complement the music flawlessly, and the most important thing here is that everything not only serves the songs, but serves the entire album. You can tell that either Neurosis set off with a very clear idea of what they wanted to achieve on this record, both musically and visually, or I get the funny feeling that honestly, they didn't do much, and just let the music channel itself through each and every member. So pure is the music, and the experience, to be found here that one really can't sit down and plan this sort of thing. It just poured out of them - all the filth, anger, frustration, hopelessness, hunger, blindness and blood - it just poured out of them.\n\nThe album ends on a terribly bleak note. That is another way of saying that it ends exactly the way it was supposed to.\n\nTimeless.\n",
        "\nI've been listening to Through Silver in Blood on and off for a good while now and have never gotten around to reviewing it. Strange, as this is easily one of Neurosis’ best releases and I’m here to tell you why I think this record is awesome.\n\nOkay, so when compared to the precursor Enemy of the Sun, Through Silver in Blood is a massive step up. The production has been improved dramatically given the guitars are much thicker and more well-rounded edge. The song writing has become more immediate, with each track having a much stronger sense of urgency and purpose. This album has got a very natural feel to it despite the grimy industrial atmosphere. Songs feel organic, with each transition being a natural evolution and all of the songs coming together to form one cohesive package. Neurosis has always been good at consistency and this record shows why.\n\nMusically, this is probably the most industrial influenced album by the band. There’s a definite Godflesh vibe running throughout, with the really thick and dismal melodies and the harshly yelled vocals. Thus this succeeds in giving the music a very heavy and abrasive edge. The pacing of the album remains slow to mid paced throughout, there are no sudden eruptions of frantic energy but rather the music succeeds in being thick, dense and dirge like in its hostile slowness. The guitars never play anything outwardly melodic but are instead used primarily for texture. The driving bass and militaristic, tribal drum patterns serve as solid backdrops to the endless wash of droning guitars and anguished vocals. It’s a great mix and one Neurosis pulls off like no other.\n\nIf you've heard later Neurosis albums then you may be shocked by what is on display here. There’s no folk influences, no post rock, but rather pure industrial tinged sludge metal. It’s rather simple and minimalistic as a whole, this is not pretty music, this is music created for the sole purpose of expressing the pure misery of existence. The influence of ambient is pretty clear through the long nature of the songs, with variation coming through only in subtle changes in playing style. Variation is something Neurosis has never strived for within the course of one album and they don’t need to. The band has created a winning formula through the use of extremely heavy riffs, tribal drumming and subtle electronics.\n\nSimilar to all Neurosis albums this is deep music that requires a lot of patience and an open mind to firmly adjust to. The band doesn't function on pop based hooks, but rather the creation of atmosphere through bludgeoning riffs. This is an album that needs to be experienced as a whole rather than listened to with a passive interest. The highly repetitious and abrasive nature of this album may be too much for most listeners, but I find a lot to enjoy in the stark representation of an industrial landscape. As strange as this might sound I’d say it’s probably the easiest, most accessible Neurosis album to listen to. Really, what’s harder to listen to, the bludgeoning riffs and unforgiving atmosphere of Through Silver in Blood or the lethargic rumbling of the bands later works? In fact, it’s probably a good album to start off with along with Given to the Rising, it perfectly embodies the sound of Neurosis but with a more determined sense of song writing. This is mandatory.\n",
        "\nNeurosis is a band that is in a constant state of evolution, with each album marking significant changes from the one before. From the folk inspired minimalism of A Sun That Never Sets, to the grainy industrial soundscapes of Through Silver in Blood to the hypnotic trance metal of Enemy of the Sun. All of this you probably already know so you may be questioning why I bring this up. I bring this up, dear readers, because Given to the Rising is the first album where the band has remained static. Musically, Neurosis have carried on from the dreary post rock of The Eye of Every Storm, and whilst the atmosphere feels earthen as opposed to airy, Given to the Rising is not a huge leap forward in terms of musical innovation, but instead sees the band settling on one good idea and expanding upon said idea.\n\nWhilst musically, comparisons can obliviously be made to The Eye of Every Storm, the metal has been brought back into the band’s sound. The Eye of Every Storm was ostensibly a post rock elements with elements of the bands progressive sludge metal thrown in, Given to the Rising is a reversion of said ideas. The first track is a relatively succinct description for the rest of the album, chugging guitar riffs built around post rock song structures with quieter, ambient interludes thrown in for good measure. The style has remained relatively concise from The Eye of Every Storm, but whilst said album had an airy, light feel to the music, Given to the Rising is more grounded. The metal elements are a lot more pronounced, whilst the post rock interludes and the song structures have remained consistent, the climaxes have a much stronger sense of urgency and aggression. \n\nWith the bands post-rock direction, Neurosis are able to focus much more on atmospheric progression. The use of keyboards works well in the context of the music, always used for ambiance rather than an actual instrument, they harmonize well with the guitar melodies. The guitars themselves don’t meander about a lot, there’s a stronger sense of direction within them and the band has a pretty heavy reliance on the quiet-loud dynamics. Said dynamics are often predictable and overused, but the two differing sections of the music are interesting enough that I can look past this. The harsh sections aren’t as dreary as those found on the prior full length; Neurosis has taken a more rhythmic, heavier approach with this one. It’s more in your face whilst still retaining that element of atmospheric progression. It’s a great mix. \n\nAlthough the band has carried on the style from The Eye of Every Storm, they’re willing to experiment with more interesting dynamics and varied tempo changes. The Eye… was a pretty slow, mellow album that succeeded in creating a very calm yet unimaginably bleak and dismal atmosphere. Given to the Rising is still pretty slow, but the songs don’t meander about a whole much, there’s more tempo changes, more transitions between songs. The guitars once again prove that Neurosis are masters of that dense wall of sound effect. The production is great as usual, with Steve Albini doing a grand job of mixing and producing the album, the guitars are crunchy and abrasive and the drums have a nice crisp and clear tone to them. \n\nVocally, Neurosis have never progressed, there’s the same juxtaposition between the harshly yelled barks and the mellow, cleanly sung sections. Unlike the rest of the band’s sound, vocal evolution is not a necessity as the tortured barks work well when mixed with the dense bombardment of guitars and ritualistic tribal drumming. Tonally, the vocals are as aggressive as I've come to expect from Neurosis but there’s a tired, worn out sense to them that has been carried on from A Sun That Never Sets. This juxtaposition between unbridled rage and a tired, almost languid delivery works well within the context of the music and also makes the abstract lyrics all the more effective. Speaking of lyrics, Neurosis are as abstract and surreal as ever, Neurosis isn't a band who like to spoon feed their fan base meanings through overly simplistic lyrics. Rather the true joy is in analyzing them, picking apart your own meaning and thus creating a symbiotic relationship between the music and the listener.\n\nDespite over a decade of constant evolution and progression, Given to the Rising is the first time the band has remained static musically. Atmospherically this is pretty different, as are all Neurosis albums, but musically this isn't a huge leap forward from The Eye of Every Storm. It’s a bit more accessible, easier on the ears and takes less time to get used to. In fact, I’d probably say it’s a good introduction to the band as it contains all the elements that make them so endearing in the first place whilst offering up a more determined and stronger sense of song writing. Given to the Rising proves once again that Neurosis are masters of their style.\n",
        "\nAs with all Neurosis albums, the first time I listened to Times of Grace it didn't click with me, in fact, you could even say I downright hated it. I went through a prolonged period of time where I saw Neurosis as nothing more than over hyped post metal band offering very little for me in turns of musical enjoyment. However, after listening through their discography and giving Times of Grace much more time to sink in it begun to grow on me, I started to like it, maybe even love it. Neurosis is a band that is so steeped in complexity that each subsequent listen brings about previously unheard elements. \n\nTimes of Grace show Neurosis in transition, the middle point between the densely layered and progressive sound of Through Silver in Blood to the sparser, more folk influenced A Sun That Never Sets. The quieter dynamics that Neurosis have perfected over time are coming a much more prominent force within the music whilst the band still hones their craft of the big riff, and these riffs are really freaking huge. The second track in particular opens with a riff that is one of the bands heaviest moments. The guitars are huge, Steve Albini has done a great job in mixing and mastering this album and as a whole the production is far better than Through Silver in Blood.\n\nAlthough the band still retains elements of their dense sludge metal, the quieter elements are the stand outs of this album. There’s a much greater focus on atmospheric progression than Through Silver in Blood, the mixture of mellow and harsh sections allows Times of Grace more leeway in exploring atmospheric intensities. There’s a large post rock vibe running throughout the album as the band utilize the quiet-loud dynamic to full effect. As a whole much of the tracks work towards a climax, progressing through quiet, atmospheric sections until the band reaches its final bombastic climax. \n\nThe use of different instruments is great too, presenting the album as a grand multi-dimensional opus that runs through many contrasting musical territories yet managing to remain a cohesive entity. Although lacking the raw primal intensity that made Through Silver in Blood such a fantastic record, Times of Grace more than makes up for it through the use of greater experimentation. The ambiance of this album is mind blowing, whether that’s from the creepy synth work of Belief to the post rock inspired sections of The Last You’ll Ever Know, the atmosphere is delivered in spades.\n\nI found that there’s very little to critique about Times of Grace, mixing the harsh, abrasive sound of their earlier days with elements that will come to define their newest releases, Times of Grace is an atmospheric powerhouse unmatched in terms of atmospheric scope and grandeur. As with much of Neurosis’ discography, this is a very bleak, dismal album, and although it never reaches the same monochromatic blankness of A Sun That Never Sets or The Eye of Every Storm, the moods and tones of this album is far beyond what most bands can hope to accomplish. The primal anger that Neurosis deliver has been internalized and as a whole the album is far more introspective than the ones that came before. This isn't an album for those looking for something fun and catchy to listen to; this is deep, poetic music that speaks on an emotional level that is rarely seen. Essential.\n",
        "\nBefore I begin this review, let me begin by apologizing in advance for my apparent lack of knowledge in the field of musical composition and theory. This if my first album review: \n\nA couple of days ago I decided to sit down and listen to Neurosis' complete discography. What better way to generate a full consensus on a band then listening to every song they've ever recorded right? Everyone who's familiar with their history knows that these titans of metal began originally as a hardcore punk outfit. \"Souls at Zero\" saw Neurosis transforming their sound to new and undiscovered territory. But enough with the cheese. Let me just get down to it. To me, it seemed like every single album that prefaced \"A Sun That Never Sets\" lead up to this particular moment. This record represents a culmination of artistic talent and innovation. Not only does Neurosis show off their dynamic capabilities in complete fashion, but \"A Sun That Never Sets\" finds these guys writing and performing at their absolute best, without worrying about protocols that are set in place to dictate exactly what they should sound like. \n\nListening to the whole album in one sitting feels like a cinematic experience. Each track pushes the music further and further, and subsequently, the listener grows a vicarious bond with the uncompromisingly fierce emotions that are being exhibited through the performances. \"Crawl Back In,\" the seventh track, is one of Neurosis' greatest and most endearing moments in their nearly 30 year career. The line \"time is truth, hard and cruel\" reflects the brutal truth of gradual degradation; in whatever sense that may be. It was during this song that I had become aware of the almost unrivaled talent that these guys have to offer. No matter how long the bands stays around, they will make it their mission to continuously distribute authentically original and individualistic music. \n\nI went on to listen to the rest of their discography. While every album to succeed this one is great in unique ways, \"A Sun That Never Sets\" seemed like it took that time out to lay everything out for its listeners. Whether it be to sit in awe at the unflinchingly raw brilliance of one of the most influential metal acts of all time, or to simply contemplate on its gritty and dark lyrical themes, Neurosis' seventh studio album is, in this metalhead's opinion, their magnum opus, and one of the most daring and emotionally unforgiving metal albums to ever be released. \n\nNow I know what you're thinking. I didn't go into the specifics of production, sound, or how these songs are presented in terms of structure and format. The truth is I'm not strongly familiar with these kinds of things. My judge of what makes an album good or bad may differ than the dispositions of the larger demographics around. Despite all of these things, the fact remains that \"A Sun That Never Sets\" generated the strongest emotional response from me during this most enjoyable marathon that I decided to embark on. This album is timeless. Check it out.\n",
        "\nHave I finally gotten sick of Neurosis, or is this album just really sucky? Was it an emperor new clothes thing all along, whereby Neurosis hid very boring musical content under monolithic production and crushing density? Certainly, this album brings up a lot of troubling questions. This is Neurosis by numbers and simply put it's a real patience tester. All the usual tropes are here but it's done in a way that first up, has you very bored with the content here, and second, has you questioning just why you enjoyed these guys in the first place.\n\nWhen you think about, how where the tropes enjoyable in the first place? Sure, Neurosis weren't the first band to possess almost a unique sense of anti-melody (hi Celtic Frost), but at least Celtic Frost had some pace to it. Listening to the profoundly boring un-riff that flows through much of My Heart For Deliverance- this stuff has been done twenty or thirty times before throughout their back catalogue, and it's been as underwhelming each time. You know the riff- a few different chords, none of which really fit together well or are arranged in an interesting manner, but they get repeated a huge amount because that makes it legitimate (??). Perhaps this is just the moment where the production hasn't been gloriously huge enough to cover it up, regardless this song sucks and perhaps in hindsight that riff in The Doorway wasn't all that much chop either. Unfortunately, this sort of thing happens a fair bit. The riffs throughout (when not mixing up with the done-exactly-the-same-way-for-twelve-years clean parts that could be ripped straight off A Sun that Never Sets) are fucking boring; good luck listening to Casting of the Ages without falling asleep! \n\nEven the lyrics have me burnt out. I had to giggle a bit when Von Till and Kelly earnestly yell \"Blood makes no excuse!\" in the At the Well (over another one of those riffs, even). Perhaps give the following a look as they're a good enough example of why Neurosis do, perhaps, suck a bit (this is off We All Rage in Gold):\n\nThe sky it holds my father, the sun recalls my soul.\nThe reasons forgotten, of lessons learned in oak,\nMy always wanting watchers, they laugh and slash at my mind.\nThe deafening redeemer, lays me down and feeds me time,\n\nNow this looks somewhat deep and meaningful, until a quick look reveals that a) this really doesn't make any sense and b) anyone could come up with shit that sounds EXACTLY THE SAME. Check my stream-of-consciousness Neurosis lyrics:\n\nMy blood it cries for justice as my skin is scraped over bones\nThe dirt it demands payment, from they whom will never leave\nSomething about seasons ruining the haggard\nMetaphor about dwarf male-male sex, etc.\n\nEssentially, this is bad lyrics yelled over riffs that have a nice tone but are otherwise fucken boring, with the final kicker being that the songs are really long! Yes, there are some clean parts, some of which are somewhat pretty (Heart of Deliverance's awful riffs are almost redeemed by the rather gorgeous comedown in the middle of the song), but the occaisonal tasty clean part does not save this album, not by a long shot. \n\nI guess the final question, then, is- is all Neurosis this bad to me now, or is it just this album? I certainly had a grand time seeing them live a few years ago so hoping it's latter. This all said and done, I highly recommend avoiding this album, as it's piss weak and all but guaranteed to throw you into a serious crisis of faith.\n",
        "\nWith all art forms, whether literature, music or film, progression is key. Human beings by default have very limited attention spans. You can only keep feeding them the same dish over and over again until they beg for change. Some of the less creative artists such as Drudkh seem content to rehash the same tried and true formula, and yet despite enjoying the band, I find their lack of variation rather unsettling and I often find myself becoming jaded by them. Neurosis on the other hand are constantly evolving, from the crushing walls of monolithic sludge of Through Silver in Blood to the drawn out folk inspired dirges of A Sun That Never Sets, Neurosis never seem to run out of their creative juices. The Eye of Every Storm carries on with their constant metamorphism, adopting for a clean cut, post rock sound, Neurosis drop much of their intensity in favor for an atmospherically poignant sound. Yet whilst fans of the band might be disgruntled by what they perceive as a softening out, The Eye of Every Storm is indisputably Neurosis, the thick dreary atmosphere of monochrome blackness is still present, the distinctive vocal work still here. Yet Neurosis have smoothed out the edges of their sound by incorporating much more of the post rock aesthetic than what they have previously employed.\n\nThe post rock elements come about in an overall cleaner sound. The production is crystal clear with each instrument having a significant amount of clarity. The guitar work is constantly flowing, moving between transition after transition. There’s a strong sense of forward momentum present within this album yet this never undermines the distinct undercurrents of hopelessness and depression. Carrying on with the desolate atmosphere of A Sun That Never Sets, The Eye of Every Storm manages to take the emotional weight to even greater heights than that of its predecessor. When done correctly, post rock is a delightfully dark, emotional and perhaps even surreal form of art, with long song lengths and a developed sense of how to fully structure and formulate each individual song, post rock can be one of the most beautiful music forms known to man. Neurosis has certainly captured this image and have fused it with elements of abrasive sludge metal and a strong sense of metamorphism. Whilst Neurosis have certainly included post rock for much of their career, they have slowly but surely been honing their craft until they were ready to make the full transition. The Eye of Every Storm is the result of years of artistic progression, the resulting effect being a more mature and perhaps even more serious musical endeavor than what we have witnessed before. And while A Sun That Never Sets touched more upon the softer dynamics of their sound, the band still had a large amount of metallic fury. Therefore, I find it difficult to classify The Eye of Every Storm as a metal album. There are elements of it, no doubt about it. But the overall sound is more akin to that of dark post rock bands such as Godspeed You! Black Emperor. This isn’t to say that Neurosis sound similar, not at all, just that the overall feel and atmosphere that this album emulates is akin to that of the works of Godspeed. \n\nSimilar to A Sun That Never Sets, this is a very bleak album, almost unimaginably so. The vocal duties handled by Scott Kelly and Steve Von Till are suitably dreary, with each vocalist sounding similar to a weary old man reflecting back upon his life. The lyrical work is outstanding as usual, dealing with feelings such as hopelessness and depression, the band deals with it subtly, never feeling overwrought or histrionic. Neurosis has always had the stark ability to communicate with the listener and The Eye of Every Storm carries on with their craft. With subtle changes, beautiful lead work and expressive vocals, The Eye of Every Storm is a magnificently powerful and wonderfully subtle work. Songs are complex, yet never outwardly so, the songs are always building up to something, yet despite this, many of the transitions are often stopped short as the band goes into another quiet section. This gives an aura of unprecedented unpredictability to the music that is often lacking in modern day metal which often falls victim to the cruel embrace of rigid formulas. To improve ones art, one must evolve, to remain in the same territory is futile and hazardous to a bands future status in the music scene. Neurosis work by constantly adding elements onto their music, songs might start off simple yet gradually the band adds more and more elements to their music. The resulting effect being one that never wears out its welcome, constantly evolving and always holding the listeners attention. The Eye of Every Storm is an endearing piece of work and my personal favorite of this bands discography. The post rock elements are beneficial, rather than a detriment and once again Neurosis have proven themselves as musicians. Essential.\n",
        "\nPost metal is an ambiguous term. Ask three people what the genre is and you are likely to get three different answers. The genre covers such a huge array of styles that its very legitimacy has come under scrutiny from the metal world. Perhaps one could argue that the post metal style does not exist, instead the term is often used to describe progressive, sludge and black metal bands that have elements from post rock and shoegazing among other genres. Therefore it seems that post metal is a continuation of a genres original blue print, and therefore is more of an idea rather than a concrete musical form. In the general eye of the metal public post metal loosely defines bands such as Cult of Luna, Isis, Pelican, Rosetta and most importantly Neurosis. Based on that, post metal comes to define doom and post hardcore/sludge metal bands that have elements from non metal genres such as post rock and ambient. This is where the term “atmospheric sludge metal” has come into prominence in order to better define post metal. Indeed, many of the bands associated with the sludgy post metal scene have ties to the hardcore/post hardcore scene. Harshly yelled vocals and dissonant chords torn directly out of a hardcore book are often used by bands of this caste, and therefore post metal comes to define metallic hardcore bands with elements from post rock. However, this leaves out countless of other bands such as Alcest and Agalloch who, whilst often classified as post metal have zero connections to the hardcore scene. Post metal therefore is rather a progression of the original traits of a genre rather than a distinctive sound.\n\nBy using this definition, then A Sun That Never Sets certainly fits the criteria. At its heart this is a sludge metal album. Harshly screamed vocals, abrasive guitars, slow tempos, a thick overbearing atmosphere, all the criteria for what sludge metal is can be applied to this album. However this is far from typical sludge as there is far more going on here than what such a genre label would typically entail. The songs are often long and drawn out with expansive instrumental passages. The post rock elements are present in how the songs flow, with each song having a strong sense of forward momentum; they twist and turn running through multiple transitions. Each song is often centered around a slow and gradual build up before a sudden release of energy. Whilst this aspect of song writing is often overused, Neurosis adds a fresh take on it by mixing a number of different elements into their music. The instrumental sections are long and exhausting, they are suitably bleak and unimaginably dreary conjuring up images of a decaying urbanized world. The metallic sections are rough and abrasive, with a sense of anger that comes across as primal and desperate. \n\nScott Kelly isn't the best vocalist I've heard but his voice suits the atmosphere of A Sun That Never Sets. He sounds just as you’d expect someone suffering through crippling depression to sound; angry, frightened, tired, exhausted and hopeless. His voice carries a massive amount of emotion and when mixed in with the poetic and powerful lyrics the sound is enhanced tenfold. All aspects of the album come together to form an image of being weary of life, there’s not much energy behind the music, even the harder sections are suitably tired and languid. Going on what I've described so far the reader may be led to expect something boring and uninteresting, referring to this album as tired will undoubtedly send signals off in all the wrong places. Yes, this album is tired, but it works with it. What I mean is that whilst it might feel apathetic on first glance, it’s easy to get sucked into the dreary and even detached atmosphere of this album. It takes a while to get into this album, I’ll admit it took me about a dozen before it managed to sink in. This is not an easy album and I really can’t stress that enough. A Sun That Never Sets is an album for people who are looking for music that’s deep, atmospheric and takes a while to fully sink into. Don’t be discouraged if this album doesn't sit right on the first few listens, this is an album that is more than just a grower, this is an album so steeped in complexity that one could find new elements with each subsequent listens. Going on that, this could be one of the most entertaining or boring albums you've heard in your life, make of that what you will.\n",
        "\nThis monolith of experimentation and vigour shows Neurosis coming into their own. While they would ultimately go for a sludgier brand of experimentation, this is the most visceral music they have ever recorded. This raw energy is evened out by twisting psychedelia, a vast array of additional instrumentation and countless layers of intricate nuances. This is something that could truly only be captured at a certain moment in time by these certain musicians - it's elaborate sound is all but impossible to recreate, which goes a long way to explain why the album enjoys a high degree of positive reception but does not have hordes of imitators - something their later albums would spawn. This is something truly special that doesn't come along very often - a wholly unique album, impossible to pigeonhole by genre, that cuts deep, and is so intricate that after dozens of listens new details are still revealing themselves to you. \n\nRecorded a mere two years later, Souls At Zero - which gets it's name from a chapter in Clive Barker's The Great And Secret Show - comes on the heels of The Word As Law. This predecessor was the last Neurosis album to be predominantly in the vein of hardcore punk. The band says they had the seeds planted with occasional experimental passages, but they couldn't bring what they had in their heads to life. Before that the band played pure hardcore punk rather successfully. While the influence still lingers, Souls At Zero shows Neurosis moving far beyond the hardcore punk template into something much more adventurous and unknown. It is simply astounding how the band managed to progress so much in terms of both vision and musical ability in a mere two years. \n\nThis album is truly progressive - not as in it has a proggy sound by any means, but as in what true progressive music is - that which moves music forward by exploring new avenues. This doesn't sound remotely like anything else before or after the fact. It is certainly apparent that bands take some influence by it - but they usually adapt these influences onto a different template. For example some black metal bands such as Cobalt and Jumalhämärä take the occasional queue from this album. Not surprisingly, some influence from this seeps into the sound of bands that take a queue from the template that Neurosis laid out, but the bands just about unanimously take on the sludgier sound that Neurosis would come across on their next album, Enemy Of The Sun. That album basically started the whole post-metal/atmospheric sludge (or whatever the hell they're calling it now) scene. This album stands completely on it's own as a wholly unique sound. \n\nThe sound is a vast tapestry of varied influences and styles. At this point the heavier aspects have one foot in the metal pantheon with the other being firmly rooted in the punk scene. There is still some hardcore present in their sound, albeit in a highly evolved form. A gritty crust edge also makes it's presence known. Many of the riffs are most certainly metallic, with doom metal playing a large role in the music. The riffs tend to be varied, with both vicious scorchers and crawling dirges. It is at this point were the band really started experimenting with weird guitar tones and alternative tunings. This release is generally much more down tuned than the previous hardcore recordings. \n\nPsychedelia also plays a large role in the construction of this album. Not that the band draws on the most obvious tropes of the genre - they adapt it into their own sound. This is manifested with seasick clean guitar sections enhanced by strange timbres. This is also often backed by additional instrumentation, such as the flute. These section bleed otherworldly atmosphere. These passages twist and turn, winding their way into the subconscious. Psychedelia also works it's way into some of the distorted guitar tones. After the opening sample is finished on \"Takeanhase\" a slow massive bass line is added, featuring quite the psych-heavy sound. This influence is perfectly moulded to the sound, creating bizarre atmospheres. \n\nAll instruments feature not only genuinely enthralling execution, but provide something original. The bass is used as much more than a supporting instrument. It hangs incredibly low, adding a great degree of depth. It is not unusual for the guitars to stop for a short while to leave an incredibly heavy bass trudging forward with it's earth-shaking tone. On the first real riff of the title track, the last note for the guitar is sustained in a drone, letting the bass fill in the rest of the pieces. Jason Roeder's drumming would become known for their immense tribal rhythms. Here, that is somewhat present, but in a more primordial form. There are certainly hints of what's to come. By the drum break in album starter \"To Crawl Under One's Skin\", it becomes immediately becomes apparent that Jason has transformed into an absolute beast behind the kit. The gritty production on the kit makes the music all the more visceral. The patterns he comes up with are consistently interesting and hard-hitting. \n\nFeaturing a tri-vocal assault, Steve, Scott and Edward all give an unforgiving and powerful performance. The vocals really have the grit and filthy fervour of crust punk, which really shouldn't be all that surprising seeing as they came out of hardcore. Dave's performance is the biggest outlier in the group. Being extremely low and almost inhuman, his vocals provide yet another unique entity to this recording. Both other vocalists have tendencies to sing at somewhat higher pitches, which Scott's voice being particularly raspy. However, Steve has plenty of instances were his voice goes lower, especially during his cleaner melodic parts. The interplay between the three vocalists is incredible, they sometimes play off each other, with one providing a line and the other jumping in almost as if to answer it.\n\nThe floodgates have been open when it comes to the song writing. All this instrumental exploration would be cheapened if it didn't have strong songs to anchor it. Like many things in the album, variety is key, yet it all has something in common and sounds like one cohesive album. In some respects many of the songs are written like hardcore songs at their core, although completely transformed by the instrumentation. The songwriting is solid enough that if stripped down to it's hardcore roots and played in the same fashion as their first album, the songs would still be worth listening to. It's the expansive instrumentation that really bring these songs to life and make them something truly rare and unforgettable, though.\n\nThe use of sampling enhances the atmosphere and adds intrigue. The album starts with a sampled piece about media purported confusion - the double layering of the same voice sample with a slight delay really gets across that feeling of disorientation. The sample at the beginning of \"The Web\" that goes \"I am my own god, my own jury, my own executioner\" starts it off in a truly chilling manner. The samples are not only limited to spoken word. On the addition of using samplers Steve Von Till says: \"There was a whole sound palate outside of traditional instruments. We heard about people using samplers and wondered if we could do it. If you wanted to make your music sound like a train crash, you could get a sampler and make the train crash. Why not have sounds of the environment and beasts and nature all be part of your palate? There wasn’t anyone playing like that. We found a guy who was into goth (Simon McIllroy) and had a synthesizer and sampler and we dove in\". This culminates in some truly weird and unexpected sounds. A sample in the title track does indeed sound like the roar of an ancient primordial beast. \n\nThe additional instrumentation is truly impressive - they managed to find guest spots for a violin, viola, trumpet, flute and cello. This allows for something incredibly different to occur. They both bolster the atmosphere in the background and take over in the foreground when needed. One of the greatest moments of the albums is a riff in \"Stripped\" - the first part is ended by a string section and the second part is ended by what sounds like church bells. It sounds completely cinematic. From the trumpet in \"Sterile Vision\" to the strings in \"A Chronology For Survival\", this additional instrumentation makes the music all the more epic. Simon's keyboard proves to be a worthy addition, as well. All this came from the band members realizing that the sounds they had in their heads couldn't all be achieved by guitars alone. It's also something that could have been a complete mess. The band says that they really didn't know what they were doing and it was a learning experience. They just let the guest musicians find their place and it ended up working out absolutely perfectly. It almost feels like this album was created by some divine intervention - a young band coming out of raw hardcore decided to do something more just went with what could have ended up being a jumbled mess and everything ended up fitting perfectly, culminating in one of the most unique and inspired pieces not just in punk and metal but in general. Being mixed by punk legend Jello Biafra (who the band says later screwed them over financially) couldn't have hurt, though. This was also originally released on his label, Alternative Tentacles. \n\nLyrically, this also shows a push for something greater. Although some of this content is there through metaphors, there is no straight ahead political lyrics. Although still retaining a dirty punk edge, the lyrics are draped in imagery and their meaning is no longer made so readily blatant:\n\n\"No seed will grow of this barren earth. Our hope\nunborn has died. I've slept in the dirt under the light\nof the moon and I know our souls have perished.\n\nCalling to those that would hear but I am deaf.\nClawing at those that would feel but I am dead to my\nown fears.\"\n\nAlthough in a way all Neurosis albums could be considered transitional records as the next album always evolves off of what came before, Word As Law came off as especially transitional as new elements were added to the raw hardcore - a (somewhat unsuccessful) push towards something greater. Souls At Zero can also be seen as a particularly transitional album in their career as it provides that something more while being removed from the sound they later took on. Their next album would prove to be the first sludge album with highly atmospheric and experimental sensibilities (and remember, this is still very near the beginning of sludge metal). The title track is probably the biggest indicator to what they would turn into. Featuring one of the best intros to a metal song ever, an eerie and engaged one with gradually added layers, this track is more doom oriented than the rest. While perhaps not full on sludge, it does mix doom with some hardcore stylings. The shift in dynamics apparent in Enemy Of The Sun comes from letting go of the cerebral process and playing from the gut. The riffs aren't as sharp and immediate as they are here, they are sludgy and the type that gradually draw you into the atmosphere rather than hitting you right away. On the title track the playing is much more closer to what's to come - the riffs are drawn out, the songwriting more sparse and a larger focus on garnering a certain feeling through a lingering atmosphere. \n\nComing from the punk scene, the band's DIY ethic should be expected. They said they got much of how they run their affairs from the attitude of hardcore legends (and one of the main inspirations for sludge) Black Flag. Neurosis would later go on to run their own record label, Neurot Recordings. Steve, being very much into the 1973 cult classic The Wicker Man, wanted to use the still of the burning wicker man from the movie but the band could not afford the several thousand that this would end up costing. In true DIY spirit, they built their own, being encircled by a serpent swallowing it's tail on the album cover. \n\nThe album was reissued twice - once in 1999 with three added bonus tracks and once again in 2011 with the bonus tracks retained as well as new artwork. The artwork makes sense as they wanted to reissue their discography to have it all conform to a certain aesthetic so that all of them would look natural on a shelf next to each other. The bonus tracks, however, were not the best move. They include two demos of tracks on the album as well as a new track. While they are actually quite good, they just don't belong on the album. This record is a slab of towering grandeur, something truly captivating. Throwing some extra bonus tracks at the end kind of ruin the cohesive nature of this beast, and while good the added tracks can't touch what's on the original album. It just kind of cheapens the experience, which is why getting the original album if at all possible is advisable (or you could always just end it early). One track is a rawer version of the title track, although not as strong as the original, the wandering bass is quite interesting. The second is the first incarnation of \"Zero\", a track which follows \"Souls At Zero\" on the album, with the intro lingering back with samples added on top. There isn't really much point in listening to this as it isn't much different than the album version which does it much better. The star attraction of the bonus material is \"Cleanse III (Live In London)\". Like the original \"Cleanse\", which would appear on Enemy Of The Sun, this is an epic drum jam. Weird psychedelics are added over the top. This is definitely an intriguing track, although it still not one that should have been tacked onto the end of this album. \n\nThis album is a rare occurrence. It's something so gripping and involved that it never gets old, something so intricate that new facets are always revealing themselves to the listener. It pulled something out of nothing, creating a wholly unique sound. The sonic pallet used on this album is vast, encapsulating a vast array of different timbres. Sous At Zero is grandiose, visceral and cinematic. This recording is an enigmatic occurrence, and no words could ever truly do it justice.\n",
        "\nNeurosis lost me a bit here. They've released some of the finest albums I've ever heard, and many more that are mystifying offerings of deeply unique and enchanting pieces of whatever it is Neurosis does. It took some time (five years) for \"Honor Found in Decay\" to emerge from the mental collapse of a womb which hosts Neurosis' altar after they heaved another missile of fantastic material on 2007's \"Given to the Rising.\" Neurosis appears to be effectively lost between the multitudes of musical vortexes they've exploited and sapped for several years at this point, not necessarily venturing into territory too weird for even Neurosis, but cutting holes into their own postulate and flooding fertile ground with songs that are almost directionless and even remarkably stale. \n\n\"Honor Found in Decay\" sounds like an atypical album from Neurosis, so paradoxically it sounds like Neurosis. Fragments of metal, hardcore, sludge, ambient, progressive, and tribal elements bolster the machine which has bound this excellent band together, all entwined in a cohesively natural sound, like beams of some dark, sprawling nexus connecting parallel worlds across untold dimensions. \"Honor Found in Decay\" has these colors and more as expected (or unexpected) but adding on, however, a subtle decline in heavier themes, making the album showcase an introspective, rise-from-the-ashes mentality. The scope of songs weaves through extremely pulverizing heavy parts and somber, meditative sections which together balance out the Neurosis equation excellently at times. Consequently, the vocals strike me as the weakest part of the album, as the yelps and whelps tend to add little or sound misplaced.\n\nI suppose \"Honor Found in Decay\" isn't poor or running on a low wave, but it certainly fails to keep its own energy sustained. The album's beginning numbers are all fantastic (minus my little gripe with the vocals). \"At the Well\" and \"My Heart For Deliverance\" both nail the trademark idea of Neurosis, together displaying multitudes of complex, abstract sections that sing songs of atonal, distant memories and feature substantial amounts of fire and calm; they definitely bring the whole sludge and progressive themes to mind. Noah Landis has a remarkable presence during \"Honor Found in Decay\" as the band's keyboardist, and he does a sensational job manipulating his surroundings with samples, keyboard effects, added atmosphere, the whole shebang.\n\n\"Bleeding the Pigs,\" although a bit of a decline, conjures enough imagination and persistence to make it another keeper. However, the last two tracks, \"All is Found...in Time\" and \"Raise the Dawn\" do very little for me. The dreary, introspective nature of \"Honor Found in Decay\" begins to unravel a bit by the time \"All is Found...in Time\" rolls around, because the song simply retraces a geometrical measure that we've seen before; it brings nothing new to an ever-evolving project. Same goes for \"Raise the Dawn.\" To clarify, both tunes are choppy and insipid compared to the opening cards which set a demanding tone, but ultimately this standard is not met during these final numbers, very uncommon for the monolithic Neurosis.\n\n\"Honor Found in Decay\" is an acceptable record, even fantastic at times, yet its unearthed capability remains entombed. Granted, they still appear as an ancient and perplexing idol spewing fathomless storms over a barren earth, but the divine powers occasionally come out a trifle rusty and aged. It's actually quite relieving to think Neurosis released an album as such, one that wasn't rushed or a cop-out, but authentic at its roots: \"Honor Found in Decay\" still has the chameleonic eyes of Neurosis. A legitimate release for the Neurosis veterans abroad, yet worlds away from legendary efforts like \"Through Silver in Blood\" and \"Souls at Zero.\"\n\nThis review was written for: www.Thrashpit.com\n",
        "\nNeurosis is a band that is known for balance. Ever since 1992’s Souls at Zero, the Oakland legends have constantly found new ways to integrate acoustic, ambient and avant-garde elements into their ultra-heavy brand of sludge metal. Even 2001’s A Sun that Never Sets, which injects a heavy dose of folk and blues elements into the mix, still manages to achieve a beautiful harmony between soft and heavy, dark and light.\n\nMore recently, Neurosis has struggled to simultaneously maintain its identity and continue to innovate. 2004’s The Eye of Every Storm left the metallic dimension at the fringes of the compositions; the result was a Neurosis album in name, but not in sound. The group seemed to recognize they had strayed too far and in 2007 released Given to the Rising, their darkest, heaviest and most emotionally demanding album since 1996’s Through Silver in Blood. However, Given to the Rising is perhaps a little too retro; though it is a riveting album, it lacks the experimental spirit that typifies Neurosis.\n\nNeurosis’s latest offering, Honor Found in Decay regains equilibrium, providing a number of new sounds while preserving the group’s core features: dense riffs, tribal drum patterns, doomy tempos and Steve von Till’s blending of bluesy croons and grizzly roars. Though the primary sounds are similar to those found on other Neurosis albums, they are employed to create a slightly different mood. For the most part, Honor Found in Decay displays a more introspective and less ferocious side of Neurosis. The primary theme of the lyrics is the challenge one faces when trying to let go of his or her past. The songs are littered with images of cleansing, departing and releasing.\n\nHarsher, more violent riffs are employed to depict the burden that is being extricated. For example, “My Heart for Deliverance” starts with riffs that rumble like biblical thunderstorms; yet, their force feels like a distant memory that is still tangible but fading. Von Till sings of “a life spent in broken arms” and yearns for deliverance from his origin. In the second half of the song, he seems to receive that freedom. The music becomes brighter, achieving a gentle catharsis, spearheaded by soaring, rustic string samples. “Bleeding the Pigs” opens and closes with the type of slow, crushing passage that characterized Enemy of the Sun and Through Silver in Blood. However, even here, von Till’s lyrics speak of a cleansing oneself from the past. “Scrape the black tar from your past life,” commands von Till as the song enters its most severe passage.\n\nKeyboardist Noah Landis is in especially strong form throughout the album. Listeners will have a hard time convincing themselves that there are not actual violins, violas and accordions on the album, but apparently all those sounds are the product of Landis’s keyboards. His organ on “Casting of the Ages” is the driving force that makes the song such an epic, toilsome journey. His splattering of eerie beeps and buzzes throughout the album’s quieter passages keeps the audience anticipating the metallic roar that inevitably lays a few bars away.\n\nWhile the aforementioned tracks display the sort of compositional brilliance that has come to be expected of Neurosis, other songs are surprisingly unfocused. “All is Found… in Time” wanders from one trope to another before ending somewhat randomly. The lethargic and monotonous “Raise the Dawn” breaks the band’s long-standing tradition of ending albums on a high note (though the passage of Asiatic violin and acoustic guitar that close the song is exquisite).\n\nWhile it’s nice that Neurosis did not simply retread its old footsteps this time out, it’s disappointing that the quality of the compositions is so inconsistent. Most Neurosis albums are powerful journeys that keep the listener hooked form track one to the grand finale; fair or not, Honor Found in Decay fails to live up to that high standard. There is certainly enough quality material on here that fans should not overlook it, but after a five year wait, it would be fair to call Honor Found in Decay a minor disappointment.\n\nOriginally written for ourvinyl.com\n",
        "\nWhen I was first introduced to Neurosis by way of a sampler in 1995, my taste was centered around Cannibal Corpse, Morbid Angel, Death, Slayer, etc. and so my ears were in no way ready for what turned out to be a truly unique sound that so far only Neurosis has really mastered. \"Through Silver In Blood\" is an angry release that has combustible energy but is presented in a format that sets it apart from any other release that may have at their core that same sense of anger. Scott Kelly and Steve Von Till's screams coupled with Dave Edwardson's growls are again (forgive me for belaboring the term) a truly unique sound but on this release (especially tracks such as \"Through Silver In Blood\" and \"Locust Star\") they carry with them this very intense primal fury that conveys more aggression than many half-hearted death growls I have heard in my time.\n\nNot unlike Opeth (how's that for an odd comparison? But stay with me) Neurosis is a band with which you need to be open minded and often patient and this is evidenced in several places on this album. The first full 2 minutes of the album is built upon this tribal like drum pattern that is surrounded by short previews of the upcoming guitar work and ambient soundscapes. An interesting thing to note is that after the full band kicks in - vocals and all - the drumming pattern while different than the opening rhythms is still using exclusively drums (no cymbals) save for a crash here or there. It is not until the 5:30 mark in that track that we even hear the hi-hat being used. While that may seem to be a small detail just browse through your collection - listen to how rarely you hear any drummer lay off the cymbals and focus on just the drums for an extended time (let alone over five minutes). The ending of the first track is another harbinger of things to expect on the album. There is a droning repetitive section that feels and sounds far more like some incantation than a verse. I know how boring it must seem to say they play the same two chords with a constant tribal drumming pattern and the same lyrics repeated over and over for over four minutes (!) but somehow it works - it just puts you into a trance. When Neurosis gets repetitive (or as some may view, self-indulgent), it seems somehow pure and transcendental.\n\nThat really brings me to the impression I got of the entire album. Songs like the title track and \"Eye\" drive with a steady aggression while songs like \"Locust Star\" have this intense melancholy couched in them and then there are songs that challenge the listener like the album closer \"Enclosure in Flame\". Among these tracks are these momentary diversions (\"Rehumanize\" and \"Become the Ocean\") comprised of ambient noise/soundscapes and manipulated samples that help propel the album to this other plane. This isn't some typical metal album about hell or death or torture or anything so commonplace or banal. I can't even begin to suggest what the unifying idea is behind the album. The lyrics, the motives, the samples, the feel overall make this a completely subjective experience - you will take from this album what you want to take from it. \n\nThe one thing I would think any fan of this band would tell you is that Neurosis operates on a different level than most. They aren't shredders with killer leads. They don't grind. They don't have headbanging breakdowns, familiar choruses, or a main theme. You can hear it in the music especially on this release, they really want to convey something and stimulate the mind not just get your head moving. They want to get your head thinking. \"Through Silver In Blood\" is one of those albums you need to experience not listen to. Start the album from the beginning and listen straight through, lay on your bed with the lights off, and let the music take you somewhere else.\n",
        "\nIn 1990, Neurosis released their second album, Word As Law, on vinyl. This version contained eight tracks. A year later, they released it on cd, adding seven additional bonus tracks. These included re-recordings of several songs as well as a cover and a new track. \n\nWord As Law features different production than their debut. While this by no means has a polished production, Pain Of Mind was much more raw. The gritty punk energy is not as well captured on their sophomore. One thing that may strike some people as odd about this album is the bass; it is not unusual for it to be higher in the mix than the electric guitar. There are some truly killer bass lines, but at times it can become distracting. Songs like \"Double-Edged Sword\" and the fantastic \"Tomorrow's Reality\" confirm that Neurosis is still strongly rooted in the punk scene. One thing that makes \"Tomorrow's Reality\" awesome is the dynamic between the two singers, something that's not as prevalent on this album as it was on the debut. While Neurosis would come to be much more metaphorical in their lyrics, lines like \"today's nightmare is tomorrow's reality\" shows that Neurosis is still sticking with the political lyrics typical to punk bands. The creeping atmospheric section in \"To What End?\", the lingering guitar at the beginning of \"Insensitivity\", and their attempt at a new style of song with \"Blisters\" show Neurosis trying to do something atypical and new. \n\nFive of the seven tracks added for the 1991 version are re-recordings. While decent, a few of the re-recordings aren't exactly necessary. The only one that could really be considered an improvement would be \"Life on Your Knees\". The bass is awesome on this version and the production and vocals are much more powerful. The forceful yells of \"life on your knees, get down on your knees\" is one of the best parts of this record. \"Pain Of Mind\" is a decent re-recording with the riff becoming much more crushing. The version of \"Pollution\" featured on this record is completely unnecessary. It is basically just a more sanitized version of the original. \"Grey\" is especially disappointing. While the chorus was one of the best parts of Pain Of Mind, they change the timing of the vocals on this version, destroying what made the song special. \n\n\"Day Of Lords\" is a cover of a haunting Joy Division song. It is really something to admire when a band can take an amazing song and make a high quality cover in a completely different style than the original. Neurosis keep the song slow and use an almost doom metal approach. Like the original, the Neurosis version is strong on the atmosphere front, but their version evokes a completely different ambiance than Joy Division. The album ends with an untitled track that is pretty much ten minutes of weird feedback, evoking a creepy mood. This is one of those tracks you have to be in the right mood for or it won't be enjoyable at all. While it would have been alright if this track was four or five minutes long, but ten is just too damn long. While longer song lengths are often needed to establish atmosphere, a shorter length would have sufficiently done so here. This track is notable because it foreshadows Tribes Of Neurot, Neurosis's ambient side project, which began releasing music in 1995.\n\nThis record shows Neurosis in a transition between their punk roots and coming to their own unique sound. Word As Law tends to lean more on the punk side, but there are numerous hints at their future style. Steve Von Till has said during this period they wanted to create something more, but weren't yet able to bring to life what they heard in their heads. This is something that would become realized two years later with the release of the groundbreaking Souls At Zero. While this album undoubtedly contains some really great songs, not all of them are amazing. Also, the album (with the 7 new tracks) does seem a little long and can be a bit much for one sitting and is something more variety would have remedied. Despite probably being Neurosis's least enjoyable full length, it is a very important part of their discography as it shows them beginning to deviate from genre based restrictions.\n",
        "\nFans of Neurosis's later material may find it hard to fathom that this crust-laden hardcore punk album is by the same band that made Given to The Rising. Hell, Souls at Zero was only four years later and they were already a completely transformed band. While this album doesn't push the limits of what heavy music can be, like their later albums did, this is a highly enjoyable collection of punk songs.\n\nNeurosis are not known for sounding like other bands. If anything, they are the ones being constantly copied. However, this album features Neurosis playing a more conventional style. Yes, it is true that this type of thing has been done many times before, but Neurosis did a damn good job at playing it. The music does not completely follow a formula all of the time, however. There is the occasional emergence of a thrash or doom metal riff. The instrumentation never becomes very complicated and the production is raw - both of which work perfectly for this type of music. The dual vocals create an energetic dynamic, as well as keeping the album from getting stale. Another thing that wards stagnation away from this record is that while there is plenty of fast stuff, they often slow it down for a change of pace.\n\nWhile not all songs are created equal on this album, none of them are bad. \"Black\" features a positive sounding introduction, which is quickly contrasted by muddy punk guitar tones. This song features great bass lines and some of the best vocals on the album. Their brilliant riffing on \"Domino Falls\" is not something a punk fan will soon forget. \"Grey\" is another highlight of the album, which really shows off the chemistry between the two singers. \n\nThe lyrical content of these songs are what you might expect from a punk band; being largely about political struggles and injustice as well as providing a condemning critique of society. As you probably assumed, every thing about this album is punk, and if that isn't your thing, then it is highly unlikely that this album will convert you. If punk is your cup of tea, then this record will not disappoint.\n",
        "\nNeurosis are a band whom needs no introduction within the underground metal scene. Having been pumping out music for over 20 years, including stellar albums such as the agressive, apocalyptic monster that was \"Through Silver In Blood\" (often hailed as the band's magnum opus), the foreboding, folk rock-ish \"A Sun That Never Sets\" and the unforgettable gigantic slab of noise that was \"Enemy of the Sun\".\n\nNeurosis also go through a process which all bands must go through in their lives - evolution. Sometimes, so called evolution can be disastrous - let's not discuss Metallica, shall we? But for Neurosis, evolution is an important part of the band's sound. They began as a hardcore punk band in the mid to late 80's, knocking out two agressive thrashing punk albums, \"Pain of Mind\" and \"Word as Law\". Later on, the band first showed the world their true genious with \"Souls at Zero\", followed by quite possibly the two most foreboding records you will ever hear - the aforomentioned \"Enemy of the Sun\" and \"Through Silver in Blood\".\n\nAfter a three year hiatus following the release of \"A Sun That Never Sets\", the Californian post-metal pioneers finally rearrived in 2004 with their massive 8th album \"The Eye of Every Storm\". \n\nTo many long time Neurosis fans, this album was a shock. Neurosis had explored their softer sounds on \"A Sun That Never Sets\", but this album is their most experimental to date, which is saying much for Neurosis. With this album, Neurosis have managed to successfully blend extreme heaviness with soothing ambience and melancholy. The opening track, \"Burn\", which is rather upbeat (for a Neurosis song, anyway), immediately kicks the listener into submission with tribal drumming, grunge-ish guitar riffs, and the gritty, angsty vocals of frontman Scott Kelly. This continues on for a short while, but then around the 3 minute mark the song finally dies down to be replaced by soft drumming barely playing in the background and some ambient sounds with Scott Kelly continuing to chant in his accented, almost spoken-word vocals, and once again the song kicks your ass, then stops again, and so on and so forth. \n\nI also spent alot of time on Kelly's vocals - compared to other Neurosis albums, where he sung in an ear shattering, throat rupturing hardcore-esque and wholly honest scream, he does alot of beautiful gritty clean singing on this album. Neurosis fans need not worry, though - Scott still gives off the occasional scream once in a while, but besides this, he will likely still be able to please the most avid TSIB fans with his honest and captivating clean-style.\n\nThe title-track, \"The Eye Of Every Storm\", is the pinnacle of the album. It's the title-track and longest song (11:58) for a good reason. There is much experimentation on this song, and is one of the softer of the 8 songs. The first line Kelly musters is the inspiring \"A wind carries your scent to those who will find you out\". This song has an even more post-rockish sound than some of the other songs on this album, and would not be shunned on an Explosions in the Sky album. Around the 5 minute mark, everything stops dead in it's tracks to be replaced by a deep humming sound, followed by the lone vocals of Kelly, who suddenly barks out at 6:22 - \"Now oath breaker sinks low!\" The band finally aches back in with their post-rockish sound at the 9 minute mark. The song finally climaxes at the 10:12 mark, and from then on, it becomes some of the greatest post-rock/metal riffing you will ever hear. There is another 11+ minute epic somewhere later on in this album, entitled \"Bridges\" but I don't think it musters up as much emotion as the aforomentioned title track, though \"Bridges\" is still a great song in itself.\n\nThe title track isn't the only highlight here, though. The closing track, \"I Can See You\" is a great way to end the album - a thought-provoking, deeply saddening tale of the loss of a loved one. Here Kelly sings to his fullest in all the song's heart wrenching glory. Like many other tracks on this album, it lulls you into a soothing trance within the first few minutes, and then cruelly pushes you down the next, repeating the proccess.\n\nBeauty, passion, emotion, and heart are not usually the things a person looks for in metal music, and would make one question if it is actually metal music in the first place, if it were to be casually described in words. But no - Neurosis is 100% metal, but like any good underground musician refuse to stray into the stereotypes of metal music. Neurosis, despite having changed their sound so much over the years, have always remained a consistent and powerful band who honestly and truly care about their music. While albums like \"Through Silver in Blood\" and \"Enemy Of The Sun\" may be the most glorified by other fans of this band, and while they are both great album, they are unparralled compared to the beauty, scale and passion of \"The Eye of Every Storm\".\n\nPersonal album highlights: \"The Eye of Every Storm\", \"I Can See You\", \"A Season In The Sky\".\n",
        "\nThe harbingers of the so-called \"post-metal\" postulate were riding fairly high on creative wings after Neurosis tossed away the punk theme and shifted into one of the most radical and bloodcurdling identities ever documented. The multi-layered facet that included sludge, tribal elements and dark ambient could only scratch the surface of Neurosis' subconscious, and the group was enjoying a stint of consistent, otherworldly albums which redefined much of what metal was conceived to be by the time of \"Sovereign.\" The small release (by Neurosis standards, anyway) features just a few tracks that pasteurize the agonizing thoughts and feelings created by Scott Kelly and the remaining members of this esoteric faction with the typical Neurosis mediums of depravity and perplexing cataclysm, although the overall content is a little lacking compared to the usual Neurosis output.\n\nThe provided songs function in the same sludgy atmosphere that Neurosis has eroded throughout their career, maybe dancing around an edge of minimalism or a perceived sense of something digestible, maybe even a little meditative. The opening \"Prayer\" summons seven minutes of corrosive guitar work nodding in and out of a hypnotic rhythm underneath tribal percussion, and the cut simply slithers in and out of a number of passages that flow in the same spectrum of sound. Overall not a bad tune. This blueprint is pretty much what the other tracks follow, albeit at different levels of content compared to the attractive opener. \"An Offering,\" for instance, is a fatigued number compared to the other tunes; there's just not a pinnacle moment during \"An Offering\" that makes the listener gawk at the perceived product.\n\nThe title track, however, circles back to the success of \"Prayer\" with over ten minutes of neuroticism, whipping through acidic sections of redefined post-rock, crushing sludge, bombastic vocals and the usual experimental strangeness of Neurosis, all packaged neatly and ready to go. A good song, but it's quite a fragile piece compared to other epics like \"To Crawl Under One's Skin\" or \"Purify\" which trend through an array of emotions and colors, and that unnamable process has minimal impact on \"Sovereign\" and its collage of tunes. The instrumental \"Flood\" works as a cool transition between songs, but again, the extra nudge of power isn't as mighty. \n\nThe essentials are there, the writing sticks, the performances are tight and electric, but the threshold of brilliance is only slashed by the impending assault instead of blown to smithereens. \"Sovereign\" is an acceptable product that fully deserves the label of Neurosis despite the minor inconsistencies and general deflation inside of the EP, and overall it idles passively on what it is and what it demonstrates. However, “Sovereign” has some glimmers of unobtrusive brilliance on occasion, and scenes of sheer power shine into the band like a sun that never sets. \"Sovereign\" should not be a starting place for the herd of unexposed listeners, yet the EP still adds another interesting perspective into the world of Neurosis, and one most fans should definitely investigate.\n\nThis review was written for: www.Thrashpit.com\n",
        "\nWidely held to be one of the cornerstones in the post-metal world, the reputation and legendary status of Neurosis is not in question here. Along with Isis, the band innovated a genre which has now legions of adherents behind it. As with many great bands though, the sound most often changes, or develops from album to album. Ideally, this sound either reivents the band's existing sound into something even more exciting, or changes things up completely, for better or worse. In Neurosis' case with 'The Eye Of Every Storm', the sound has certainly become more mature from their earlier work. However, while the essence of the band is here, Neurosis seems to lack the same intensity and excitement that initially drew me into the band.\n\nTopping seventy minutes in length, one can expect Neurosis to be in this for the long haul; 'The Eye Of Every Storm' is a record that certainly tests the patience of the listener. The ideas are drawn out, and often there will be large breaks from the more metal leaning moments. In fact, the greater part of 'The Eye Of Every Storm' relies moreso on a sombre mellow sound that keeps the same introspective and brooding vibe, but conveys it in a very different light. More often than not, the sludgy guitar textures are exchanged for electronic atmospherics, or minimalistic instrumentation. For these long winded passages, the focus is almost entirely on the gravelly voice of Scott Kelly, of whom this almost feels like a solo album. Much of what 'The Eye Of Every Storm' has to offer revolves around Kelly's distinctive vocals, at times belting but- in the case of this album particularly- resorting to a very sombre croon. Granted that the man's voice is not for anyone, but the really deadpan and rough delivery throughout the most mellow parts does wear thin regardless.\n\nWhere Neurosis still strikes gold is with the heavier metal sections, but most of all, the lyrics. Based on what has already been said about Kelly's voice being the centrepiece of the album, the lyrics become that much more important. Although the music often borders on stagnation, there is the sense that this is the work of a weathered poet; rough emotion etches through almost every verse, and it makes 'The Eye Of Every Storm' a surprisingly contemplative effort from these experienced post-metallers. The 'metal' moments here are fairly few and far between, but given the mellowness of the rest of the music here, the dynamics do get more powerful than they would be otherwise, and Neurosis still has a penchant for tasty guitar textures intact.\n\nA disappointing album in some respects, but a reaffirming one in others. All the same, Neurosis has no lack of ambition here, and although the music may not be as enjoyable to me as I was hoping it to, I can still hear the artistic passion in the work of this band.\n",
        "\nWe can call this one a classic, can't we? It's considered a monumental release by one of the most important experimental bands ever...not to mention \"Souls at Zero\" has stood the test of time and remains a mandatory listen for those of us that walk the thin line of genius and insanity which interconnects experimental metal with the rest of the world, so yea, why not? The sense of hidden horrors and equations of the unspeakable Neurosis achieved throughout “Souls at Zero” remains one of the most unique and haunting atmospheres ever captured. It's just one of those albums that has an undetectable presence to it; something unexplainably abstract, yet excellently molded.\n\nAnd holy fish-sticks, it is a giant in a land of midgets. The dudes of Neurosis are excellent at writing songs that progress (key word) their identity with bizarre riffs, melodies, tunings, techniques, bass scales, vocal samples, and so many other inclusions that somehow collide and form Neurosis’ extraterrestrial genetics. But those of you not into abnormal equations will be quite fond of the mega-heavy production which crushes and grinds during every second. I’m sounding vague, but Neurosis are hard to describe; their approach here really can't be labeled with a genre-tag, as there are times when the band is simply out of definition. For example, Scott Kelly somehow manages his wailing yells to synthesize against the outlandish melodies and mechanical riffs that mince and pound in a strange, atmospheric equation beyond the realms of basic music throughout \"To Crawl Under One's Skin,\" and the result is just...formless.\n\nBut the great thing about Neurosis is that this beast that blessed them...this possession of some ancient spirit that makes Neurosis so volatile and singular never, ever exiles. \"Souls at Zero\" does not have a concrete 'direction' that it follows. Instead, Neurosis are able to make each track stand on its own feet through stellar repetition on the title track(!) or creating psychotic interludes throughout \"Flight.\" You need to really pay attention though: sometimes Neurosis will churn out an energetic, fast-paced riff that will suddenly be placed underneath slow percussion, soft guitar strums, and melancholic vocals instead of leading the band's charge; it sounds crazy and deceptive, but so fantastic at the same time.\n\nThe tribal influence Neurosis incorporates remains one of the group’s signature qualities, but its presence during “Souls at Zero” is in a strange, prototypical stage forming itself throughout flutes, keyboards, brass instruments, and Jason Roeder’s algorithmic percussion which correlates with tribal beats and sophistications. “Sterile Vision” and “A Chronology for Survival” are easily some of my favorite tracks from “Souls at Zero,” mainly because the tribal touch is so fluent and open-ended that the instrumental possibilities beneath said-feel adapt with Neurosis’ annihilative heaviness majestically, and produce wonderful, unique expressions. Additional perceptions make appearances too, such as Gregorian chant on “Stripped,” samples during “Takeahnase,” or cellos, horns, the whole orchestra of the underworld. There is simply too much experimental gold here; most attempt the feat, but Neurosis remains dimensions ahead.\n\nI'm going to give you some guidance and tell you to just listen to the damn record, because no review or reviewer can properly channel its angular sense of depravity or the black divinity within its soul that flows like a leaf in rushing water with a five-paragraph analysis. \"Souls at Zero\" is something that needs to be heard to believed. Throw whatever preferences you have about experimental music out the window and let Neurosis cover your thoughts with its infinite depth of knowledge and rage...just be careful to not get lost in the maddening maze of torment yourself.\n\nThis review was written for: www.Thrashpit.com\n",
        "\nThe jury's still out on whether I'll have enough cash to see some very old neckbeards make a lot of noise in December- and whether they'll actually play any of their older, intense-r tunes- so for now this'll have to do. Allow me first up to take issue with the packaging or severe lack thereof- shit album cover, no gig photos, nothing. It's like they're asking for this to get pirated!\n\nStill, all is forgiven when that punishing riff on The Doorway begins. The sound quality is pretty good and things are pretty close to the studio version, which I'm surprised about as based on the massive guitar tone this was played at a truly earth shattering volume. In general the set list is pretty cool- no Enemy of The Sun or Through Silver in Blood, unfortunately- but I am a bit miffed at the length of the thing. Yes, I know you guys get really into it live (I imagine everyone on the net by now has seen the \"Locust Star at Ozzfest\" videoclip) but c'mon, 58 minutes? Really? 6 songs?? Is it really too much to ask for, I dunno, 8? Not entirely sure if Neurosis were still a full touring band back in '99, but there's no excuse, really. Don't be lazy and play a bit more! There's a fair few bands that are much older, tour all the time and have no problem smashing through 15+ songs. \n\nStuff is intense, though. The claustrophobic mix helps a bit, but there's a lot of DEEP MANLY FEELINGS being emitted here, there's no doubt. Locust Star as expected crushes, it's a bit slower than the other live version I've heard, but that massive riff around the 5:30 mark will always cause me to lose my shit. Hugest riff, and a real simple one too- amazing what three or so chords (and overwhelming volume, of course) can do in the right context. As mentioned, most of the songs here deliver on the intensity and do a good representation of the studio material. They're the usual slow, brutal and completely inaccessible grinders that Neurosis were all about at this point of time; not something to get fans into the band, perhaps, but live albums never are.\n\nHonestly I'm not entirely sold on the point of this release, it really does sound a lot like the album versions, a few subtle changes in riffs here and there but that's about it. Get this if you're a massive fan.\n",
        "\nEnemy Of The Sun\" is probably the first album that showed to the world Neurosis' undeniable genius. It's also the precursor of what they went on to summon on the infamous \"Through Silver In Blood\". And even though the latter usually gathers all the praises and will maybe forever be remembered as their magnum opus, I will always have a soft spot for \"Enemy...\". \n\nThis one is really not an easy album to sit down and write a review about. I found myself many times in the uncomfortable position of having to explain to my dumb-ass friends why Neurosis is so special and I've always failed in my task. I am starting to believe what some other reviewer said earlier: this is a band that you either love or hate. Neurosis' music requires your attention, you carefully listening to it, you NEED to read and know the amazing lyrics... it's not some stuff you put in the background while you wash the dishes and expect to remember something of what you heard when the record's over. And this album is, in the band's career, the first clear example of that. \n\nThere's not one single track on this album sporting a catchy melody, a hook, even a hint of a chorus. Each one of the eight tracks on \"Enemy Of The Sun\" is an agonizing howl of pain that comes straight from the hearts and souls of these guys, like the suffered lament of a dying man who's seen the world entire fall to pieces and his life destroyed before his eyes while exhaling his last breath. And that uneasy feeling prolongs itself for 72 minutes, 72 long minutes of slow, endless agony, one last desperate search for a way out of the sunburnt valley of death that's life on this earth.\n\nThe ostentatiously arrogant opening statement (sampled off the movie \"The Sheltering Sky\") makes all the more sense after the first, doom-slow, bass driven groove of \"Lost\" kicks in. Hissing guitar riffs conjure up with confusing sampled noises, while the slow march carried by the drums and the bass finally leads to a series of devastating riffs where all the scorn, all the pain and all the passion finally find the chance to vent through Scott Kelly's and Steve Von Till's agonizing screams. There's still space in this catastrophe for Neurosis' trademark excursus in quiet and hypnotizing repetition, but it's not the kind of repetition they got us used to with their latest albums. No, there's something vicious and malevolent beyond all imagination even in the relaxed bits, so that, if your ears can rest, your soul can certainly not. \n\nThe agony goes on and on through \"Raze the Stray\". Shivers are sent down your spine as soon as the female vocals start, in an unknown language, setting an ethereal tone for the song. A sudden explosion then breaks in, destroying all the hope for peace of mind you could have still harboured so far, and after a slightly easterly guitar/strings duet break Dave Edwardson enters the scene unleashing his infamous growls. He is soon joined by Kelly and Von Till, creating one of the most amazing and effective vocal interplays I've heard in my whole life, where one singer finishes the other's sentence and vice-versa. \"I will not STRAAAAAYYY!\", they stress, while a pleasantly dissonant sound (obtained by playing that short portion of strings which is not on the fret-board of the guitar but on the paddle) introduces some of their most earth-shattering riffs in their whole repertoire. And while the song ends, inevitably in definitive hopelessness, the female vocals fade back in, like Neurosis wants you to feel safe and relaxed when the end comes.\n\n\"Burning Flesh In The Year Of Pig\" is an account of what happened in Vietnam in 1967 when buddhist priest Tich Quang Duc self-immolated in a busy intersection in the capital city, in front of hundreds of incredulous passers-by. More than a real track it's got the taste of a warning that something terrible is going to happen soon.\n\nFrom the combination of \"Cold Ascending\" and \"Lexicon\" we get to know the most savage, furious and telluric side of Neurosis' music. There's absolutely no melody for the poor listener to grasp on. Jason Roeder's hammering drum beat opens the dance, while the bass crawls along with a sound that calls for nothing safe. This unlikely, sick march is aptly followed by highly dissonant single guitar notes that keep doubling up until the song bursts into one demonic chaos, a violent raping of the listener's ears and feelings, something that makes you forget any other way heavy music had been played before and introduces a new point of view, one that looks at you in the eyes directly from the depths of a psychological inferno. And when things seem to calm down a little and a small gleam of light seems to be shining again on you, a long, troubled, tortuous waltz accompained by the sickening sound of ghostly voices finally lets this nightmare take its toll on you. \n\nBy the time the title track kicks in your senses should be already so nullified that the eerie drum intro must feel like the distorted sound of your own heartbeat resounding in your subconscious. The guitars and bass lay down on each other creating an ever thicker fabric of inter-reacting notes until a signal is given to start the beating. \"The sun bathes my wounds with a veil of rage/ its rays dyed with the blood of our disrespect\": the punishment is due, and the war-drum's frantic tribal rhythm leaves no chance for a safe place to hide. \n\nYou've finally reached the point of no return; if you've been submissive enough to take all of the punishing rage so far unleashed upon you, now it's finally time for you to let it out. If you bow down, close your eyes and listen to the final requiem \"Time Of The Bests\", to the decaying, funereal melody carried by the horns section, you can actually experience a sort of purifying feeling, a purging force driving itself through your body, until the tribal drumming of \"Cleanse\" brings you back to reality. And when it does, you're a different person. Especially, if you are a musician you will never look at music the same way again.\n\nThis is an album that changed a lot of people, it changed me, and it opened many doors for us to look upon a new way of making music, where aesthetic laws and formulas, genre restrictions and mere song structures don't mean anything and all that matters is your feelings, and being able to translate them in music. After 15 years this album still has the power to shock and please, to satisfy and horrify and definitely set contrasts among people who listen to it, people who either run away from it in disgust or will grow to love it as one of the best metal albums of all time.\n",
        "\nThe Neurosis live experience is an immersive and overwhelming one. The band plays at crushing volumes in bleakly light surroundings while projections of haunting artwork flicker in the background. Where many live acts are forced to engage their audience in trite and gimmicky crowd participation antics or rock star clichés, Neurosis merely need to plug in, tune up, and DESTROY. No stage banter, no call and response, just a crushing and all encompassing atmosphere. The audience does not give energy to the performance; they simply gape in awe and suffer an hour long beating.\n\nThis particular bootleg was recorded during the tour for Times of Grace, Neurosis’s last true “heavy” album and as such half of the material here focuses on that album. Though the set list relies heavily on the claustrophobic and furious sludge metal of Neurosis’s middle period with fan favorites such as “The Doorway” or “Locust Star”, Neurosis also indulge in some more introspective material that would become their focus in the coming years. The first half of the set pummels the listener with riff after monolithic riff. “The Doorway” especially proves itself to be deadly potent in the live setting. The second half of the set begins with the haunting and hypnotic “Away” a song that demonstrates the growing ability of the band to manipulate tension and atmosphere using as little volume as possible. This is followed by an explosive rendition of “Locust Star”, which at 7 minutes feels oddly brief in this context. Finally Neurosis ends the concert with an appropriately epic performance of “Times of Grace.”\n\nThe songs aren’t all that different from their studio versions, which isn’t very surprising considering the live approach Neurosis use in the studio. While the performances are spot on, the production on this recording is definitely bootleg quality. The guitars sound huge enough, but the vocals drift in and out of the mix and the drums are very flat and dry. The recording has however perfectly captured the live sound of the keyboards and samples Neurosis use. Keyboards squeal and rumble across all of the tracks bringing some of the more subtle elements of the Neurosis sound to the forefront.\n\nTo this day there exists no accurate replacement for seeing this band live in concert but this bootleg does its best job. It serves as a documentation of the band right before they changed styles and serves to jog the memory of those who have seen the band live before. This is not a very good place to start for those unfamiliar with the Neurosis brand of atmospheric sludge metal from beyond the confines of reality, but for the avid collector it’s a nice addition.\n",
        "\nFrom the opening samples evoking fears of death and worries of the shortness of life of the opening track to the 16 minute tribal rampage of “Cleanse”, Neurosis show their burgeoning musical prowess on Enemy of the Sun. Even at this premature stage, the direction their music would take could not be anymore clear, and still this album is exceptionally unique from the rest of their discography. Indeed, Neurosis have crafted one of the greatest pieces of sludge out there, far surpassing even those contemporaries who have gone further to master the genre themselves.\n\nThe bass is a driving force on this album, being front and center for much of the album, grinding and gurgling like some sinister machine-beast hybrid, keeping the more monstrous tracks like “Lost” and “Raze the Stray” focused, setting stage for the epic build in “Cold Ascending”, and churning the stomach in “Lexicon” (which has some of the coolest goddamn bass-lines ever). \n\nMeanwhile, the dense, sludgy guitars float between meandering drones to a unique mix of atonal and melodic leads: a menacing building, gradually speeding-up, higher-pitched riff clashing against a heavy drone in the opening build for “Cold Ascending”; or the screeching, robotic lead coupled with the acoustic rhythm section on the breakdown for “Raze the Stray”; or the just swirling, whirling guitars fighting for supremacy on the title track. \n\nThe drumming is phenomenal, whether it’s the more traditional metal style found on most of the album or the tribal percussion onslaughts making appearances on the last three tracks, “Cleanse” being the major standout, consisting of around 9 percussionists and some slick didgeridoo (yes, the Australian Aborigine wind instrument), making for a very unique, mystic adventure in the wilderness. \n\nOf course, the album is outstanding in the vocal department. Kelly and Von Till’s screams, bellows, and singing are all done very passionately and expertly, adding so much emotion to every song, particularly in “The Time of Beasts” (by far the most expressive song on the album). On top of that, Dave Edwardson is more in the spotlight on this album that a lot of their other albums with his howling growls, adding a more sinister edge to the music when used, which is not often, adding even more impact to his vocal execution.\n\nFinally, the addition of various electronics, keys, and samples adds an amazingly amount of depth to the music: “Lost” with its eerie opening sample and amazing keyboards later in the song, “Burning Flesh In Year of Pig”, the very necessary breather after the first two monster tracks, or the haunting keys and just strange sounds fluttering around in the background on “Raze the Stray”. \n\nMoreover, the sheer diversity of this album is enough to impress: “Lost”, the building, post-rock-influenced mammoth; “Cold Ascending” and “The Time of Beasts” being the most passionate tracks (the former being an almost-thrash, manic piece with the ladder as the moist anguish-filled track on the album with some very melancholic trumpet playing that enhances the atmosphere greatly); “Burning Flesh in Year of Pig”, wholly electronic; “Cleanse”, the “calm” tribal rampage; “Lexicon” being reminiscent of a more upbeat Khanate mixed with early Mastodon…. Neurosis explore a great deal of territory not common to most sludge, and do it quite successfully.\n\nThe only downside to this release is the production, a flaw that is wholly negligible.\n\nThis album is most certainly a classic and is highly recommended for sludge fans, metal fans, and people who really appreciate music in general. It’s hard to believe this album came out in ’93 – this was more ahead of its time than Godflesh was during the early nineties, and unfortunately its status hasn’t carried over, solidifying it as an underground-underground classic.\n",
        "\nImagine living through a nuclear catastrophe. All that was around you now lies in ruins. Imagine moving amidst the devastation, alone, a wandering nomad roaming the bleak landscape. There is nothing but you and your slowly deteriorating sanity. That's what Through Silver In Blood is like.\n\nEach song moves like a morose chapter, exploring all of the horrible possibilities that one may experience in the above scenario. Cycles of crushing hopelessness, terror, depression, and even a smidgen of joy in the forms of songs, all flowing meticulously, creating an immersive, gripping, and most enjoyable experience. \n\nThe album opens with the crushing title track, a representation of the fall of everything followed by an analysis of sorts with \"Rehumanize\". Then the track \"Eye\" shows the album starting to move, seeming like it is literally traversing this post-apocalyptic world, unsure of what one may encounter, with an eerie feeling of being watched. And then a gleam of some empty, but wonderous hope in the form of \"Purify\", wherein it seems that one is not alone after all, followed by \"Locust Star\", the terrible realization that the world once held dear is dead; all that was once loved has taken the form of vast wastes of utter ruin, and that nothing can ever repair it. The next track, \"Strength of Fates\", if when one's sanity slowly starts slipping away. Contemplations of suicide and gnawing thoughts of hopelessness and bluedgeoning despair take hold and slowly erode the individual. Despite making contact with other survivors, one trudges on with burdensome despair, empty and exhausted. \"Become the Ocean\" tries to make sense of all that happens and suggests to surrender to death. \"Aeon\" is the indivdual standing on the edge, looking in the gaping mouth of the only possible solution, weighing the options and consequences. The decision is made. One takes that final step into oblivion, ending this terrible story on a desparagingly bleak note on the final monster \"Enclosure In Flame\".\n\nThe atmopshere of the whole album is dense, crushing, and unforgiving, enhanced with layers of subtle, haunting electronics. The guitars serve mainly as textures, focusing more on adding atmosphere than riffing, but still impressive in the way they are written and played, with the heavily distorted bass driving much of the music. The drums drive the music the way it should be, sometimes with surging tribal drumming and other times with a more traditional, but no more less skillful, style. And, to top it all off, is the extraordinary vocal performance - Scott Kelly's angsty, melancholy screams and soft, bleak style of singing; Steve Von Till's supportive screams and backing vocals; and Dave Edwardson's sinister growls and bellows.\n\nAll in all, Through Silver In Blood offers up quite possibly the most unique and well crafted musical experience. Very few bands can hold a light to Neurosis's unmatched skill, let alone this relentless beheomth of an album. Although most are usually reluctant to label an album as being the best (or one of the best at the least) albums of all time, it is safe to say that this could very well be that album. The album is virtually flawless and will most likely remain unrivaled as being the best for years to come, even by the band that produced it. Listening to this album should be mandatory!\n",
        "\nSabbath is the kind of thing that pretty much any metal band can cover with class. The slower bands just slow the things down; the faster bands just pick the more uptempo Sabbath tracks and speed it all up. This one's a pretty excellent example; Neurosis get Children of the Grave and make it sound like one of their own songs, while Soilent do a pretty cool medley and don't screw with anything too much.\n\nThe Neurosis one is clearly the best. It's a pretty cool song, and the whole thing sounds just like a Through Silver in Blood outtake. Tribal beats open it up, and the riffs are also very Neurosis-ish. It's covers like this that make you realise that perhaps Sabbath has a very big sonic influence on Neurosis. It's a bit long, perhaps, and while (like the Soilent cover) the vocals are fairly irritating, it's still a pretty enjoyable song. Simple, straightforward huge freaking sludge, certainly hard to resist.\n\nSoilent Green's medley is alright, kind of lacking the huge bass tone that made the Neurosis one so monolithic. Vocals are pretty irritating- never been a huge fan of hardcore-ish vocals over these sort of doom grooves, but it's no big deal. A good deal less heavy then the Neurosis one; it's nowhere near as good but still a pretty enjoyable tune with some tasty riffing; I've always been a huge fan of that \"Lord of This World\" riff, and it seems that overall these guys picked the songs for the medley well; the amount of flow is decent and the songs are of a high quality.\n\nThis probably isn't really worth tracking down but if you're a huge fan of either of these bands it'd be worth getting. Entertaining doom stuff that the whole family could enjoy.\n",
        "\nI wasn't gonna bother reviewing an album that's nearly 20 years old cos so much has been done since then that it seems kinda pointless, but then I decided that I have to put my two cents in. \"Souls At Zero\" kicks ass. Always has, always will. I listen to it now and my opinion of it hasn't changed in 17 years. I don't like it cos it's nostalgic, I like it cos it's probably the best fuckin record I've ever heard.\n\nNeurosis pissed off alot of punks when they made this album cos it was metal, though I'm not sure how many metalheads really got into it at the time. They dared to sonically purge their anger and sadness without giving a fuck about pleasing anybody or kissing their fans' asses. And that, my friends, is punk as fuck. I remember getting in arguments with my buddies back in the day cos I insisted that it's influenced by Pink Floyd (a major league no-no for punk music). Plenty of soft, gloomy guitar intros. Plenty of spoken word samples regarding insanity and humanity's demise. The Native American man warning that \"we are not following the law of the Great Spirit\" that leads into \"Takeahnase\" still sends chills up my spine. That song, by the way, is probably my favorite on the album, simple and catchy with a chorus that I find myself wishing would never end.\n\nStill adhering to their punk roots, the talented bass-playing finds a decent level of prominence throughout the record. Like I said before, many of the songs start off soft and dreary before the guitars erupt. I'm a sucker for that shit. The opening song, \"To Crawl Under One's Skin\", has everything that I've mentioned so far in this review. The howling vocals harmonize with the chaotic yet melodic guitars perfectly. The only problem I have with it is that there's a simple little guitar riff towards the end of the song that I wish would've been in there longer.\n\nThe title track ends about three times before it actually ends. And by the time it does end, you're wondering if that wierd little insane asylum guitar lick is gonna come back around one more time and give you deja vu. This song goes really well with inhalants.\n\nWell, fuck. I could go on about this all night, but the damn record's old enough that it doesn't really matter. Listen to it, though. It's not just good for its time, it's fuckin good. \"Sterile Vision\" is another of my favorite tracks, the vocals absolutely screaming the latter half of the song, somehow managing to utilize some kind of horn (sorry, I'm not a fuckin horn expert) in the midst of all the sadness and the madness and the badness. I like everything Neurosis has done since \"Souls At Zero\" but honestly, I don't think they ever topped it. Nobody else has, either.\n",
        "\nFor those searching for a weak Neurosis record in the vain hope that they can subject it to substantial amounts of criticism, well, you had better look elsewhere. As far as Neurosis records go, whilst this doesn’t stand firmly at the top of the food chain, it is up there with the best of them, competing for the crown. Once again, Neurosis have managed to create a sublime metaphorical piece. With ‘Times Of Grace’ acting like a supposedly dormant volcano which has suddenly burst into life and begun to stir deep beneath the glowing surface to erupt into many shapes and sizes. This would be best shown in songs such as the magnificent and aptly titled ‘Under The Surface’, which underlines the image of Neurosis as a metaphorical presence due to the fact that it stirs from deep within with it‘s crushing bass and fast flowing drum beats, but is still tremendously beautiful with it‘s mesmerising leads and ambient sections on keyboards. Whilst the foreground is a spectacular haven of beautiful imagery, the background is dark and sinister with an immerging beast beginning to stalk it‘s audience as if they were an oblivious prey. \n\nThe career of this illustrious American band is littered with as many delights, such as ’A Sun That Never Sets’ and the laidback and mellow sounds of ’The Eye Of Every Storm, as a sweet shop. This is OUR drug. If the past tells us anything, it is not to expect anything. Neurosis’ journey from a standard hardcore band with punk influences has evolved into an enigmatic beast, experimenting with every passing record. ‘Time Of Grace’ is no different to the other Neurosis records, in the sense that it delivers high quantities of experimentation in almost every sense of the word. Whilst, as I said, this isn’t the definitive Neurosis record (which would be ‘A Sun The Never Sets’ in my eyes), it still deserves an equal amount of plaudits as the rest. Neurosis’ definitive positive, which will be mention time and again as long as people continue to review musical works, is the fact that no matter how much or how little the experimentation factor takes hold, Neurosis always manage to enthral audiences worldwide since the birth of their largely sludge based career.\n\n‘Times Of Grace’ can stand up and take credit for being one of the best sinister sludge based records in the history of the genre. Many people accredit the formation of this genre to bands such as Isis and Neurosis themselves. Whilst that might be true, one can see the other influences that stream through the band like a raging river. The tribal feel. This has long since been a major positive of Neurosis’ game and ‘Times Of Grace’ once again displays this aspect of their music in full view for everyone to see. Generally speaking, the guitars are the main proprietor of this most prosperous sound. There is a distinctive feel to all of Neurosis’ works, so one cannot suggest that ’Times Of Grace’ stands out merely for it’s presence in terms of a distinctive sound because every Neurosis title has it’s own direction and it’s own methods of getting to the destination which, in this case, is to a far more aggressive spot that, lets say, ’The Eye Of Every Storm’ decided to venture to. \n\nOf course, whilst Neurosis do manage to successfully fuse the eerily sinister nature with the tribal genius, the experimentation factor of the instrumentation never allows for Neurosis to become dull, especially on this piece with it’s use of immaculate clean guitars, keyboards and once again, outstanding vocals from the leading man behind the microphone. The sheer amount of instruments used on this piece will show how far Neurosis are willing to take the experimentation - the cello, tuba, violin, trombone and even bagpipes are including on this piece. The brilliance of the song writing has to be given a mention because, which songs like the sombre ‘Away’ will show, though there may be an abundance of instruments used on this record, they’re all used well and effectively. Due to the classically controlled production, the musicianship of the band members is gloriously and justly magnified by the clear and concise sound of the production. There are a number of bands out there, in the metal world, who try and fail miserably to incorporate a variety of instruments into their soundscapes. Neurosis, on the other hand, manage to successfully do this and in the process, create a number of varied and interesting soundscapes which are all brilliantly portrayed well due to the top notch production that Neurosis use.\n\nOnce again, Neurosis have managed to bridge the gap between using harsh and mellow music all on the same record. The essence of Neurosis seems to be to lead it’s audience into a false sense of security, and then pounce upon their unknowing mind, body and soul by claiming another scalp through mellow passages, which are conveyed through acoustics, ambience and spoken vocals and are then followed up by harsher sections, which is where the distinctive screamed vocals come into play, distortion takes hold and the percussion is let loose on it’s undeserving audience with uncompromising use of cymbals and double bass. The aggression behind the record is different to any other Neurosis record, making it fresh and instantly likeable. Lyrically, the themes are portrayed through even more angst and testosterone -\n\n“Behind a burning red fog\nthe great mind swims in confusion\nits blood ferments in anger\nhonour and wisdom will cower\n\nYour river's flow is damned all to hell\n\nDrifting in a current to stagnate\nencircle the vision of rust\n\nYour river's flow is damned all to hell.”\n\nAs far as negative points go, one struggles to think of any worth mentioning. The bass, can, at times lag behind the rest, but the sheer amount of distortion on the aggressive patches of play takes over the mood anyway and when slower passages are produced, the bass stands up and is counted for. Immense.\n",
        "\nThere's not much to be said about Neurosis that hasn't been said. Violent, powerful, crushing, numbing; those are some terms one can come up with upon first listen. But after each repeated listen, and after letting go of all pretenses and just feeling the music, one can only come up with a single word for the whole Neurosis experience.. Cathartic. Yes folks, this is the kind of music that warms the insides of those most primitive, who see very much in darkness but still search for a light. It's a type of music for people who feel some sort pain, or blocked by percieved barriers. It's real music.\n\nGiven to the Rising is Neurosis' most recent outing, and after a lengthy time with it, I've come to the agreement that this really is the most achieved and interesting release of their whole catalogue. It manages to use repetition without repeating itself, the right contrast of beauty and beastly, and of course two perfectly executed extremes. The way that the boys in Neurosis mesh together in the quiet/loud way they do is perfectly fine tuned. You really start to notice this after hearing the first two tracks (the title track and Fear & Sickness, respectively) and the beginning of To The Wind. After repeated listens, the dynamics start showing themselves even more, leaving you with a full picture and a better idea of music.\n\nTrack 4, At The End Of The Road, switches things up a bit. Very ambient in nature, until it turns into a tranquilizer of a beast. It's one of the longer songs, (8:25) so there's plenty of time to get stoned and get real deep into the song. The creepy intonations in the beginning are gripping, and when the full vocals come in they are so much more powerful. \"Fall unto!\" are the last violent cries you hear before more creepy quietness, topped off with a spoken word passage worthy of the noise with it, which marks the end of what I like to refer to as \"the 1st Movement\" of this album.\n\nNext we're up with the most intimidating song tracking to ever grace my ears. A one-two-three punch knockout of Neurosis at their heaviest, beginning with Hidden Faces, which doesn't mind taking it's time to assault you from all angles, turning into an all-consuming vehicle of power. You can't help but to move your body to the waves of music; you wouldn't be human otherwise. The same follows with the next two, as Water Is Not Enough has one of the golden moments on the album with it's last riff into noise, and Distill is another wrecking ball of Neurosisness, with some crazy shit going down all the way through, morphing into another creepy spoken word passage.\n\nOf course, the last song on the album, Origin, is about the largest percieved thing to ever come off any kind of record. I know this obviously sounds like gloating on and on about the band and kissing their asses, but when it all boils down to, there is absolutely no denying Neurosis writes good music. Anyways, back to the review. When Origin starts up, there is a distinct Times Of Grace vibe floating around in there, you'll see what I mean. I'd rather not fail at doing the song justice with words (an impossible feat itself), and will leave you with this bit of opinion.\n\nIf you've already heard Through Silver in Blood, Times of Grace, Enemy of the Sun, etc., but are wondering what Neurosis would sound like with all those accumulative elements, then this is the album. If you really listen to it, it will not disappoint you.\n",
        "\nI'm a big fan of \"Souls At Zero\", standing by that album as one of the best albums by anybody. Ever. Neurosis' next two albums were both good, but my expectations were lifted high enough by \"Souls At Zero\" that I was a bit disappointed in them. Then came \"Times Of Grace\", lurching out of the shadow that \"Souls\" had cast.\n\nIt fades in with a dreary synthesizer tune that's short but sweet, followed by \"In The Doorway\" which is my least favorite song on the album (and the reason for a 99 and not a 100). The song is heavy and driving but, like their previous two albums, just a bit on the dull side of the spectrum. Good but not great.\n\nBut next comes \"Under The Surface\" which opens with a solid tribal beat and Steve Von Till's kickass screaming vocals. Somewhere in there the song actually gets louder than it started out being, which seems almost impossible (and which will totally fuck your speakers up if you're not careful). It quiets down for exactly long enough with some ambient noise, only to erupt once again with deafening anger and sadness that Neurosis convey with such perfection.\n\nThe entire length of \"Times Of Grace\" drifts easily from wistful ambience to primal rage, namely in \"Descent\" and in \"Away\". Between those two songs is a weird yet catchy bagpipe tune that hints at more greatness to come from their following releases. It ends with a pleasantly sad little tune that somehow manages to successfully incorporate horns and a strummed accoustic guitar, rising to an epic climax before finally lulling into silence. \n\nThen you press \"Play\" and listen to the album again. I've been doing that for about 9 years now and I still haven't gotten sick of it.\n",
        "\nOften known for experimentation, Neurosis have sifted through the realms of metal and ended up at a crossover. When, for most, the road is blocked, Neurosis merely skip by it and create something that puts most other bands to shame. Experimentation has always been in their nature and I daresay it always will be. Throughout the career of the band, which has spanned many years, Neurosis have been tagged everything from doom to post-hardcore, from progressive to sludge. Truth of the matter is, no one can really define Neurosis. Their sound eludes every genre you could even attempt to pin it down to. Their sound expands and escapes the supposed inescapable territories of metal. Whilst the majority considers most genres and sub-genres within metal to have a particular sound, or certain characteristics that each and every band within it’s grasp adheres to, Neurosis seem to forget that and create something that can only stand on it’s own. Neurosis are, in truth, a mixture of things. An enigma, if you will. In fact, one could state, even from the beginning when they were mostly considered a hardcore punk band, that Neurosis were any one particular genre. Where there have been boundaries, the Californian based act have broken them down. Where there have been obstacles, the Californian based act have destroyed whatever it is that lays in their path. It is hard to believe, but ‘Through Silver In Blood’ is the fifth full-length in Neurosis’ career. It is, by many, considered to be the pinnacle achievement and the most outstanding work within the metal genre. Whilst this may seem like a deliberate exaggeration on my part, to those familiar with Neurosis and the inner circles of metal, that probably doesn’t seem that far-fetched a statement. Although most Neurosis records seem to breach the one hour mark, ‘Through Silver In Blood’ is truly an epic journey. Perhaps this sounds clichéd, but it is the only description one can give for such a mammoth record.\n\nIn regards to previous efforts, ‘Through Silver In Blood’ represents the first time in the North American bands career that all elements of their experimental nature came together in perfect harmony. Whilst I, personally, consider ‘A Sun That Never Sets’ to be their defining effort, this is the pinnacle, as I previously stated, to the majority of people around the world. It consists of the best elements that Neurosis have shifted together in one recording. Take songs like ‘Locust Star’ for example. This song exudes confidence. The band were in their prime at this particular moment in time. This song begins with mesmerising drums, which continue throughout the record, not just the song and an ambience that Neurosis have long since devoured and spat out. In terms of the atmospheric nature of this record, it’s a lot more punishing that previous efforts and more recent records. In comparison to something like ‘The Eye Of Every Storm’ which was more subtle in it’s approach, this record is blunt, brash and exposed. It allows the audience to see the true talents that are behind the instruments. ‘Locust Star’ was actually the very first Neurosis song I had ever heard. I remember the first time I heard it, sitting quietly, stunned and motionless, the song caused me to alter my mood and reflect upon everything under the sun. The odd thing about this Neurosis treat is that, personally, I consider this to be the bleakest Neurosis effort because of it’s dark and dismal soundscapes that surround the bare bones of the album. \n\nFor instance, I point out ‘Locust Star’ again, the influence of the bass on the record is superb. I love it when bands utilize the bass for all it’s worth and Neurosis do this on their fifth effort. The bass is constant and creative. It knows when to take center stage, when to back off and it’s concise and precise nature is everything that the bass section needs in order to be successful. There are times when bass will take the band in the direction it wants to go and will enhance the dark atmospheres that this record revolves around. Being such talented song writing and musicians allows Neurosis, as always, to incorporate other elements into their music. For example, piano sections, played in low notes that further develop the dark styling of the sound. Tribal influences have long since been a factor in Neurosis’ music and ‘Through Silver In Blood’ is no different. Synthesizers utilize the tribal sound well. Creating an abundance of rhythmic space like sounds that swirl and twirl around the guitars, the bass and even the steady percussion section. Vocally, Neurosis are the same as they always are. Scott Kelly has a distinctive voice and is able to carry the sound that the band portrays very well. His voice is rather gruff, so it’s dark and low sound flows alongside the superb melodies very well and creates a melody of it’s own. Vocals don’t have to be great, they just have to be suitable to the music. My main problem with this Neurosis effort, well, my only problem is the lyrics. In the past, I have enjoyed reading and listening to the lyrics being spouted out by Scott Kelly at the helm, but the lyrics present on this effort seem a shade poor in comparison to other efforts like ‘A Sun That Never Sets’ or ‘The Eye Of Every Storm’. For example, the lyrics to the title track, whilst they could be considered appealing to the senses as they deal with very human emotions and use words that humans can relate to, they don’t really have the same affect as other Neurosis lyrics have had.\n\n“Through silver in blood \nWe stand judged not by \nEyes of flesh, when \nTransit times cross \nPrey vision consumed \n\nBleeding one \nBleed alone \nBreeding love”\n\nAlthough, especially lyrically, this may not be my favourite Neurosis full-length, one cannot doubt the sheer intensity or power of it. It has stood the test of time and only continues to enhance the reputation of this already much loved band. Classic, in many people’s eyes.\n",
        "\nNeurosis have made some of the best and most difficult heavy metal music of the past twenty years. From their humble beginnings as a mediocre hardcore band, they soon evolved into a sludge metal band that incorporated elements of their hardcore past with the atmospherics of ambient and industrial music. Souls at Zero was a metal revolution; it remains one of the most original and heaviest albums of all time. Afterwards, they proved themselves further with Enemy of the Sun, Through Silver in Blood, and Times of Grace, but didn't really evolve their sound until their 2001 magnum opus A Sun That Never Sets. It showed a giant leap in songwriting for the band, doing away with their sometimes repetitive heavier songs and focusing more on the atmospherics, which became so bleak they were near unbearable. 2004 showed Neurosis blending their mid-period styling with A Sun That Never Set's atmospherics, creating yet another Neurosis era, and honestly the first time they sounded like true veterans. Which brings us to Given to the Rising, which could very well serve as a \"sound collage\" for Neurosis's past.\n\nGiven to the Rising is the first Neurosis album that utilizes their sludge AS the atmosphere, creating a dense wade through a tar pit, to reach the other side and realize you just crossed the river Styx. Some of the passages in \"To the Wind\" and \"Hidden Faces\" are reminiscent of Neurosis's ambient folk side project, Blood & Time. \"To the Wind\" and \"Water is Not Enough\" contain some of Steve Von Till's best vocal work, furthermore, \"Water is Not Enough\" showcases him at one of his most guttural moments. \"Water is Not Enough\" contains the \"lost souls\" that opened A Sun That Never Sets, and leads into \"Distill (Watching the Storm)\", which might be Neurosis's best showcase of dynamics. The standout is \"At the End of the Road\". It's like watching the apocalypse crawl at you like a giant zombie, and you are unable to escape. It also serves as more evidence to how great Neurosis is dynamically. The epic closer \"Origin\" is the only track on the whole album that uses Scott Kelly as a vocalist, which is unfortunate because of his great voice, but appropriate as their new style seems to fit Von Till's style better.\n\nThe only place the album really suffers is it seems to plod through some sections with no direction, as most evident in \"Fear and Sickness\". Still, it's a great reminder that Neurosis are still many steps ahead of their peers, and another incredible work of art in one of the most consistent metal discography's one could find.\n",
        "\nSince the release of Through Silver In Blood, Neurosis has steadily become one of the most influential bands in extreme metal. Their influence has spread beyond the post-metal sub-genre and the countless Neurosis clones that they spawned to influencing black and death metal bands. Admittedly, the last couple of albums has seen the band slow down a bit and experiment with slightly calmer structures and while the last album, 2004's The Eye Of Every Storm was terrific in its own right, it didn’t really display the visceral intensity of the band’s earlier work. Given To The Rising is the band’s eighth full length recording and was released earlier this year. \n\nRight from the start of this album you get the feeling that Neurosis is onto something special here. As the title song rumbles out of the speakers with its vintage Neurosis riff, the band yet again prove that there’s nobody who can even come close when it comes to creating that dense wall of sound. To The Wind feels like the band was paying close attention to Isis’ last album In The Absence Of Truth, as a calm soft guitar part starts proceedings before the song transforms into another crawling, lurching behemoth in true Neurosis fashion. At The End Of The Road is another terrific song starting off almost ambient like before the dense riffing, thunderous drumming and Kelly’s big man bawling vocal style come together to create another crushing experience. \n\nShadow is a short ambient piece with spoken word narration that allows the listener to catch his breath and breaks up the claustrophobic density that was created by the ending of At The End Of The Road and the cold riffing of the following song Hidden Faces. Water Is Not Enough is probably the most accessible song on the album with an opening riff that’s as traditionally metal as Neurosis have gotten to playing in a while although the song does progress into a Melvins kind of groove. The album closes with Origin and while I won’t even bother to describe this song I have to say that it’s worth the price of this album on it’s own. Vintage Neurosis and an absolute classic song. \n\nWhat elevates the songwriting on this album is the dynamics. The interplay between the thunderously heavy and the almost gentle ambience all topped up by Scott Kelly’s tortured vocals hasn’t sounded this good in a long while. It is a bit pointless to go through each song (although I did it anyway), suffice to say that there are no individual highlights here. Every song on Given To The Rising is there for a reason and like the band’s best works, the songs all come together to create a sonic experience that is simply unmatched. I also have to mention the band’s use of electronics. It’s subtle and often hiding beneath the surface but is present on every song and does a tremendous job of enhancing the atmosphere of this album. Four years after their last album, after creating a new genre almost single handedly, with that genre, post-metal starting to become the new trend, and bands like Isis flirting with mainstream acceptance, this was the album that Neurosis had to make. There isn’t anything here that’s new for the band but it’s like they distilled the finest essence of everything that they’ve done in a recording career spanning twenty years and then used it to write Given To The Rising.\n\nIf you’ve never heard Neurosis before, then this is the perfect place to start as Given To The Rising displays the many facets of this incredible band. For the long time fan of this band, Given To The Rising is simply validation of the fact that Neurosis are still the undisputed masters of this style.\n\nhttp://www.kvltsite.com\n",
        "\nContinuing where they left off, Neurosis are back with their tenth full-length record, a fantastic achievement. 'Given To The Rising' is an odd Neurosis record, it doesn't continue the trend of evolving, in my eyes. Neurosis have stood still for the first time in their career. 'Given To The Rising' is just a continuation of what 'The Eye Of Every Storm' started to experiment with. To be honest, that isn't a bad thing. The aforementioned full-length was one of Neurosis' best, in my opinion. It developed a new sound like Neurosis have never seen before. It's focused a lot more on progression in terms of atmosphere, whereas Neurosis used to focus on sound experimentation in terms of their former aggressive sound. Well, I say former, but it still continues today.\n\n\n'Given To The Rising' has that spaced out feel 'The Eye Of Every Storm' had. This is largely due to the use of keyboards. They create a distinctive sound throughout, a sound that is very appealing to the senses in every human being. It's a sound that tends to twirl and swirl it's way around the instruments. Especially the guitars. Considering the fact Neurosis use two guitarists, it has a big job on it's hands, but still, it does a fantastic job of wrapping itself around those powerful riffs and keeping them, as well as the listener, enclosed in a small space from which the noise cannot escape anywhere but in to your ear drums and through your body. The title track is a particularly good indication of this swirling sound. The keyboards are used prominently throughout the song and they're used very well. As I also said, the use of two guitarists serves well to the atmosphere Neurosis have decided to spend much more time developing this time round. One guitarist plays one riff, whilst the other layers a different, yet more subtle sound on top of it. Neurosis do this superbly, it has to be said.\n\n\nProgression in terms of vocals hasn't really been on the cards for a long time for Neurosis and it's a particular area that doesn't really require much change. What with the low sound of the guitars, the vocals guttural bombardment doesn't need to change. Whilst the keyboards give an airy feel to the music, the vocals aim to keep a bit of that aggression we're so used to alive and kicking. They do a fantastic job of it as well. There are times when the guitars revert back to how they were on full-lengths like 'A Sun That Never Sets' and produce a more advancing and aggressive touch. This is an element that should surely delight fans of the older sound, but also tweak their interests in this new, multi-dimensional sound. New fans will be acquired by 'Given To The Rising' as well, which can only be a good thing. \n\n\nI'm a big fan of that tribal feel that hovers ever so closely in the background. It's unique and totally owned by Neurosis. I've never heard another band produced this sort of tribal feel and execute it so well. Hats off to Neurosis for that, again. Of course, it helps when you have fantastic musicians who can amply incorporate synths into the mix, as well as other instruments like keyboards, an organ and the piano. The songwriting has to be taken note of again, as well. Neurosis have been on top form for over a decade now when it comes to these imperative elements of music. Neurosis have always had good lyrics as well. Lyrics that tend to appeal massively to people who like to analyse them, as well as the senses. Using themes of nature and colour do this effectively.\n\n\n\"Of black to cut us down \nOf white to light our sound \nOf red to burn and drown \nAnd grey to spread like ash to the ground\"\n\n\nAs we can see. In terms of highlights, 'Given To The Rising', 'To The Wind' and 'Water Is Not Enough' should have audiences salivating uncontrollably.\n",
        "\nHere we go, Neurosis, the ultimate influence and a band who simply loves to change with every full-length. 'Souls At Zero' was a major turning point in the careers of the Neurosis musicians at the time. It was signified by the transition from hardcore influenced music to amazing band we have today. This particular full-length is where Neurosis really started to experiment with their sound. Taking elements from a wide range of genres such as; post-hardcore, sludge and even the unique sound of tribal music which flows throughout every single Neurosis full-length since this one.\n\n\nExperimentation is Neurosis' middle name. They dissect genres and bring them back to life, both new and improved. This is a band that has been granted a great deal of respect and admiration. 'Souls At Zero' is where that respect began to increase tenfold. It will go down in the history books of the metal genre for being where their career really began to take off and also, where the influence for so many others bands including; Isis, Cult Of Luna and many others took their influences from. 'Souls At Zero' isn't the highlight of a glittering career, but it certainly is an important full-length. As important as they get really.\n\n\nWhen you strip the works of Neurosis down, what you find is a sea of complexity. Neurosis may seem simplistic on the surface, but what flows beneath is what counts. Neurosis are a bad to suit every mood and there aren't many bands that can say that. Neurosis have an astounding ability to be able to mesmerise. Listening to Neurosis is like taking a potent drug, it's intoxicating and captivating. Neurosis will invoke hallucination in the audience with their straight forward, no nonsense styling. 'Souls At Zero' is a unique full-length for several reasons. No one can deny how dazzling and delightful that tribal feel is. A vast array of textures is layered on to 'Souls At Zero'. It gets it's tribal feel from using keyboards, flutes, violins and whatever instruments the Neurosis musicians can get their hands on.\n\n\n'Souls At Zero' is the epitome of experimentation. The use of several instruments allows Neurosis to showcase what brilliant musicians they are. Therefore, we can mark this full-length up when it comes to musicianship and songwriting, both of which are outstanding. Neurosis have come a long way since the days of their straight up hardcore style. This indicates that. Not at any stage does this style make Neurosis seem unprofessional. It's an accomplished piece of fine art. The musicianship is a stark indication of that. Everything has improved since the beginning. From the percussion to the vocals, it has all been bettered.\n\n\nNeurosis have a wild side, that much is true. They like aggression and 'Souls At Zero' is packed full of it. This can be seen it the harsh riffs that tumble out from the speakers and the overwhelming vocals. Lyrically, Neurosis portray several different issues. They aim to connect with a wide ranging audience and their music certainly does so.\n\n\n\"Bury me in a shallow grave. So the rain will \nwash me away. And the sun will burn my soul \nand the earth will feed on me.\"\n\n\nUsing such imagery is healthy for Neurosis. It appeals to the senses in man. What with the sparkling vocal performance, these issues are brought across to the audience with anger, venom and wrath. Elements that make Neurosis a captivating listen. Neurosis' lyrics can always be analysed in great detail, which I love. I see Neurosis' lyrics as them using personification. \"So the rain will wash me away\" in particular. This feeling could be used to describe how Neurosis' ambient tribal sound washes over it's audience and feeds them with the necessities of life. \n\n\nThe production is thick and heavy, this is where the new sludge side to the band comes into play. It's an appealing new quality. It slowly enhances that aggressive feel that weaves it's way in and out of Neurosis' soul. Prepare for your being to be encapsulated by 'Souls At Zero'. This is Neurosis in all their spell binding glory.\n",
        "\nNeurosis' 'A Sun That Never Sets' represents a quieter age of the band. To awaken the dormant beast, you must stir him. In this instance, the listener is the dormant beast and Neurosis are the very element that will stir and drain every emotion you could possibly feel. Much like 'The Eye of Every Storm', Neurosis have opted for a more intense and atmospherically pleasing approach. A Sun That Never Sets is a long and winding journey across many soundscapes. You will come across every musical terrain as possible and live every emotion man can muster. Neurosis are as powerful as ever. As intense as ever. And more importantly, as brilliant as ever.\n\n\nNever before the moment upon first hearing this full-length have I been left with such a great impression. Words fail me. Whether we're talking about the beautifully crafted title track, or the immensely powerful and potent Watchfire, each and every song plays a part in creating a masterpiece beyond all comprehension. \n\n\n\"Walking amongst the stones \nfrom the sky, feeling their rhythm wash over me.\"\n\n\nNeurosis have always had a stark ability to be able to speak to the listener through their lyrics and seemingly use their lyrics to act as a metaphor for how the music will make you feel. The listener will be taken higher than ever before with Neurosis' undoubted qualities at being able to uplift your mood and set it back down with a stunning ambient riff. Beyond the sky is where Neurosis can take you. They have the ability to be able to control your emotions with beautiful ambience and fantastic song writing. The rhythmic backbone will wash over you and sweep you away. Using the forces of nature in the lyrics, is pleasing to read. As an avid fan of literature and poetry, I am very fond of all things nature related. Specifically written pieces of art that depict nature as a force to be reckoned with. If nature is the mother of all things, then Neurosis is the mother of nature. Neurosis are boundless. They are a force that drives on through powerfully pounded drums and exceptional solos. A force stronger than nature itself.\n\n\nNeurosis are accustomed to change, as are their fans accustomed to the band changing. The problems people seem to have with the difference between this full-length and earlier pieces is confusing. Neurosis themselves aptly suggest what those listeners should do, \"A time to think back and move on.\" Neurosis have evolved, and with that evolution comes a sound so frightfully beautiful, it's unbelievable until you hear it for yourselves. The addition of backing vocals is welcomed. It adds depth to the songs and builds upon the lead vocals. The addition of samples and keys is highly effective. They create stunning sounds and emotive atmospheres which will please all. \n\n\nThe most important aspect of Neurosis isn't the awe inspiring vocals of Scott Kelly, or the spectacular ambience, it's all about the lyrics. They evoke such emotion and are perfectly suited to the music. They ask questions of the listener and describe precisely how Neurosis are evolving and how they wish to take you for the ride. \n\n\n\"Under the cloud cover, the flares signal change. \nWill you ever know? \n\nThe fields they are burning, the smoke chokes your breath. \nWill you stand or run? \n\nYou dream of a mountain, the peaks rise to the sky. \nWill you answer its call? \n\nIs your heart still beating? Can you feel this at all? \nThis landslide will bury us all.\"\n\n\nTo me, this all explains what I have previously said. With all the expectations listeners had upon first listening to this full-length, they should let them go as Neurosis welcome change. With the use of rhetoric Neurosis are seemingly asking if the fans will stand by them during this change, \"Will you stand or run?\", and by the end of it all, those who survived the current change will have to withstand more change as time presses on. \n\n\nA Sun That Never Sets is the landmark of Neurosis' career in the music industry.\n",
        "\nThe Eye of Every Storm is another fine example of the ever changing nature of Neurosis. As a fan, you have to become quickly accustomed to transformation on a major scale. This time round, to me, it comes in the form of the subtle aggressiveness, as opposed to previous outings where Neurosis have been out right and straight forward and the difference in soundscapes. Both aspects appear to be somewhat different from they were on previous full-lengths. \n\n\nFor instance, Through Silver In Blood had a dirty and unpolished sound which suited the style at the time, but The Eye of Every Storm has instead created long drawn out ambient passages by using heavily distorted down tuned guitars, a synthesiser and a less aggressive approach to the vocals. Subtlety is the main aim in portraying the lyrical themes the band spits forth with a harsh tongue. \n\n\n\"A wind carries your scent to those who will found you out \nA storm forces you down to seek shelter from the rain\"\n\n\nIn my opinion, these very lyrics act as a metaphor for the bands progression into a more humble force, as opposed to the savage beast they once were. The first line represents the fact that Neurosis have a very distinctive sound unparalleled to any other and that no matter how many times they change that sound, it can still be recognised. The second line represents my previous point that Neurosis have decided to make a much more subtle approach on this very full-length. The adoring public may have become used to Neurosis playing in a hard and harsh manner, therefore they have decided to mix it up a little. This fresh approach is very appealing. Noah Landis becomes a very pivotal member in this instance as he has a helping hand in creating the swirling ambience.\n\n\nNeurosis have always had the ability to entrance it's audience with slow melodies, rasping vocals and emotive lyrics, all of which are appealing to the senses. As well as this, Neurosis have always had the ability to conjure emotions, twist them until they reach breaking point and force the listener to have an out of body experience by sweeping them away with their beautiful tones and textures, driving drum beats and particularly on The Eye of Every Storm the difference in soundscapes to previous albums. \n\n\n\"In the void the stones are turning and turning and turning\"\n\n\nThat particular line sums up the entire album for me. Taken from the track I Can See You, it acts as a metaphor for the albums atmospheric nature. It's picturesque feel manages to take something ordinary and make it stunning. The eerie, yet solemn atmosphere creates a certain diversity in sound, which is refreshing to hear. Hypnotising and spellbinding. Perhaps the greatest thing about The Eye of Every Storm is the lyrics. I can spot potential metaphors everywhere and it pleases me greatly to be able to sit and analyse decent lyrics for once. Lyrics that depict the very feelings I go through each time I hear this record. The vivid imagery and connotations of colour are vastly appealing. From:\n\n\n\"This world of cold stone gives nothing in return \nTo those who sleep while the restless burn \nThere are those few driven to flame \nMost are content to drown in the wake of dreams\"\n\n\nDuring the unsuspectingly quite upbeat track Burn, which seemingly depicts the struggles we face in day-to-day life. Working hard in a cold world which gives little in return and for those few who succeed even more drown in the wake of dreams. Fighting lost causes and losing battles before they have begun. To anything else that stirs an emotion in the listener.\n\n\nAn intense ambient journey from darkness to light. Despair to hope. My personal highlight is 'I Can See You'.\n",
        "\nNeurosis. When the name comes to mind, I can't help but think of an ever-changing, introspective yet purely degenerate state of mind. Snaking through the consciousness, filling in grey areas with even more grey. Bleak and solemn, yet still emotive enough to create feelings of happiness, The Eye of Every Storm is a musical masterpiece for those who like to hang around inside their own head.\n\nThe lead track, \"Burn\", is fitting of that description. Starting off slightly more energetic than any other Neurosis track, it catapults you into the realm that the band lives in, and you can feel every push and pull of the atmosphere. But this isn't any other arty post-metal/post-rock atmosphere that most bands utilize, this is straight up blue jeans and black t-shirt metal, no metaphysical/esoteric bullshit. Anyone can listen to and enjoy Neurosis, and the track \"Burn\" makes it blatantly clear, going from the upbeat tempo of the introduction to a very atmospheric break (with intense vocals by S. Kelly), until the last final shout where the song explodes. A song ending worthy of any Neurosis album, it sets you up for the melancholic mood of the next track.\n\n\"No River to Take Me Home\" starts off with a slow, hypnotizing riff that circles around your head, like a vulture waiting for prey. The whole track track however, serves as lead-in to the epic title track, \"Eye of Every Storm\". Nearly 12 minutes of apocalyptic ambiance (not the kind found of ToN's 'Grace' however), this track serves as the first magnum opus of the album. The vocal work is absolutely stunning, and at some times there is a slight feeling of loss of breath from the weight of this track alone. If they wanted to record a 70 minute song, this would serve as great groundwork.\n\nLater on in the album, we come across the next magnum opus, \"Bridges\". Following in the same vein as the title track, it's an oppressive, moody and bleak amalgamation of ferocious heaviness, melody, and ambiance. The lyrics are some of the best, with the last lines (Your cup is empty and you are running out of time/Caving your head in, don't dare to dream it will implode) being my favourite. There's no use typing more about this track, just listen to it eleven times in a row and believe.\n\nAfter being bludgeoned for the last hour, we're presented with a slight shift. The closing track \"I Can See You\" involves just acoustic guitar, cello and vocals during the first half, serving as a moment of release before the inevitable storm. And that's exactly what we're treated to for the last 4 minutes of the track, a heavy, cathartic and mind-bendingly bleak track. Don't play this around your mother.\n\nNeurosis has had a long journey, and this is just another fork in the road for them. Time and time again they have chosen new paths, some parallel to each other, and some completely sideways and twisted. Yet it's all Neurosis, and all a masterpiece. Let's hope they have it in them for one more after 'Given to the Rising'.\n",
        "\nVeteran post metal band Neurosis's masterpiece, A Sun That Never Sets, is one of the darkest work of art one will ever hear. Each song has almost the same pace, but this does not take away from the experience, it makes the tracks flow into each other, creating an apocalypse in 60 minutes. Yet, some may not be able to discern one piece from the other, and if not listened to in the proper way, may take away from the experience, presenting the only flaw of this otherwise amazing album. The tracks may also sound similar, but each one has its own unique nightmare encompassed in the doom/sludge metal music and ugly vocals.\n\nNeurosis has two vocalists, Steve Von Till and Scott Kelly. Once you hear both you will immediately notice the difference between the two. They sound similar, but Von Till has a softer, technically better voice, while Kelly, clean singing, and has a rougher voice. From my understanding, Kelly does the heavier vocals.\n\nThe album opens with the instrumental \"Erode\", setting the tone with atonal feedback and dinosaur-dying-in-a-tar-pit pace, as it fades out, the opening ambience of \"The Tide\" leads in to the album's stand out track. Starting as an apocalyptic folk song with acoustics and violins underneath Steve Von Till's dark, soft voice, it gives way to a breathtaking climax where the listener gets a taste of what the rest of this album will be like; slow drums, heavy guitars, tortured vocals. The next piece, \"From the Hill\" is even slower, an almost minimalist metal. The title track is the most accessible, with an ever so slightly quickened pace and straight forward doom metal, slightly reminiscing of Black Sabbath. \n\n\"Falling Unknown\" is the most post metal-esque song on A Sun That Never Sets. It has a Godspeed You! Black Emperor-like suite feel to it, with the first piece having a bluesy feel, and the best vocal performance on the album, with Kelly's prolonged howls. The next part to \"Falling Unknown\" begins with shuffling drums and builds up with dark piano chords and violins, and then erupts with the typical Neurosis sound, eventually settling back down into howling acepella finish. \"From Where It's Roots Run\" keeps up with the slightly faster middle section of the album, with tribal vocals that give the experience of the Mayan Indian tribe when 2012 rolls around. \n\n\"Crawl Back In\" starts with an almost uplifting guitar intro, but quickly gives way to a single atonal guitar. This is the slowest track on the album. It is different than most of the songs on A Sun That Never Sets, with soft, heartbroken melodies that would provide a sense of hope if they weren't surrounded by a hellish maelstrom. \n\n\"Watchfire\" begins with Kelly singing, over ominous minimalist guitar. It is the hardest piece to listen to, as it often switches from the softer sections with Kelly singing, to the typical dirge metal assault found on the rest of the album. \"Resound\" sets the mood for the final stage of this apocalypse, sounding a lot like opening piece \"Erode\". Finally, the album concludes with \"Stones from the Sky\". The apocalyptic name well represents the sounds hidden inside. Opening with funeral-like bells and soft guitar, and Kelly singing again for the first two minutes, giving way to the most tortured vocal performance on the whole album, and ends rather abruptly, with everything crashing down at once with a hellish scream, and the nightmare is over.\n\nThere isn't really any problems with the album, except it might take some forceful listening to do so, as the songs are all centered around the same tempo. Other than that, it is flawless.\n",
        "\nOne thing Neurosis won't ever be accused of is that they never change their sound. From the hardcore punk of Pain of Mind, to the draining, trance-metal of Enemy of the Sun, to the bleak, drawn out folky dirge of A Sun that Never Sets, and finally to this album. (And onwards to whatever their new one is going to have..). Yeah, this albums is pretty different from any other Neurosis release. It's lush and yet quite Minimalistic, it's repetitive but it still slowly evolves, trudging purposefully to the catharsis at the end of every song. Comparisons? Well, there's not really any good Metal albums that come close, except for maybe Panopticon, and that's pushing it. A better comparison might be Sigur Ros' Brackets album. They're both long, draining, meticulously orchestrated and really intense in their own way. Oh, they're both Masterpieces too.\n\nOf course, that comparison will sound pretty false when the first song kicks in. 'Burn' is deceptively upbeat compared to the rest of the album, starting off with a big driving drum beat and some ringing, melodic guitars. Sure there's an ambient interlude in it, but the ending is so upbeat you may be asking yourself if this is really a Neurosis album. It's a nice song, but one that's out of place in an album otherwise full of doomy epics. The second song tells you what this album is about. There's dense, slow guitar riffs, that Neurosis vocal interplay we all know and love (no screaming, of course..), and a song that doesn't really seem to go anywhere, just hanging around in a introspective haze, until a perfectly placed guitar line brings along light and redemption. Indeed, almost every song here is really long and can be quite hard to originally take. Left to Wander and a Season in the Sky are both over the eight minute mark, and they both certainly take their time in getting anywhere, but when they do, it's majestic, intense, epic, and there's plenty of Neurosis-style light and redemption for everyone. The ending of Left to Wander is indeed intense.. It definitely brings to mind some Through Silver in Blood song, with strange filtered guitars and oscillators flying around, with a tribal beat behind it, until the whole thing gets filtered into some ringing synth. It's really powerful, and it definitely makes the long wait worth it.\n\nStill, it would definitely be wrong to say that the album is just a series of really long builds. Maybe that's the one major difference between this and Brackets. Bridges is over eleven minutes long, but it's a nice ride. The drums are, as per usual, amazing, the piano is placed perfectly, and the vocals are really good. Just when you'll be getting bored, all these synths and bursts of noise will come out of nowhere, slap you round a bit, and then disappear back into the ether. Of course, nothing in this prepares you for some seriously epic, overwhelming distorted guitar. It's quite a shock when you have it up really loud! Bridges is a great song, showing Neurosis' impeccable command of really extreme quiet loud dynamics. Mogwai wish they could do this kind of stuff. After a few more huge dynamic shifts, we're left with some real nice riffs, probably the only riffs on this album that are reminiscent of earlier Neurosis.\n\nA quick paragraph here should definitely be dedicated to the production. Put simply, it's amazing. Everything is crystal clear, there's lots of bass, every instrument is perfectly in it's place, there's heaps of dynamics. Yet despite the perfectly crisp production, it still sounds raw, still sounds passionate. Steve Albini and whoever Mastered this deserves some mad props. Along with Times of Grace (also by Neurosis), this is one of the best metal recordings in terms of production. If you're at all interested in producing records, buy this album and Times of Grace for a lesson on how to do it.\n\nWell, it's kind of hard to say anything else about this. All of the songs are at a consistently high standard, although Burn does feel a little bit out of place. The production is excellent, but really, the best thing about this album is the songwriting. This album will definitely test some people's patience, but repeated listens reveal an excellent command of dynamics, brilliant layering, great guitar parts and a rock solid rythym section. As long as you don't mind long songs you shouldn't have any problem with this. Go out and buy it, and while you're at it, buy the rest of this band's discography.\n",
        "\nEver watch a film that showcases destruction on a massive scale and follows it up with scenes of weeping agony and retrospective? Say, a nuclear detonation with a mushroom cloud that slowly reaches for the heavens and the post-apocalyptic lifestyle that ensues? Or a meteor impact which produces a shockwave that slowly creeps out across the landscape and the consequent images of wrecked countryside? Maybe even a fire that sweeps across an expansive forest and the miles of charred earth that result? Perhaps a war that takes a catastrophic toll on two nations?\n\nWell, on this here slab of post-hardcore sludge metal, Neurosis paint evolving pictures of gradual devastation that would easily go hand in hand with such events. \n\nRight from the introductory seconds of the album - which feature odd industrial sounds, tribal drums, and a menacing guitar progression that ripples with volume and distortion - you sort of get that feeling you'd get if you were to wake up in the morning, walk out into your front lawn, look up into the distance, and watch in horrified disbelief as the sky itself cowers under an encroaching shadow that is slowly spreading across the atmosphere. Before you can figure out what the hell is going on, your ears are shattered by a desperate roar - \"THROUGH SILVER IN BLOOOOOOOD!!!\" - marking the transition from a purely suggestive sense of dread to something far more immediate. Guitars swell, still subdued as they crawl along, gathering strength much like a tornado that sweeps across the countryside, gradually becoming bigger and stronger; the bass, slightly distorted, shakes the very ground you stand on; the drums continue to pound out relentless tribal rhythms; Scott Kelly's pained yells fill your head, backed by the guttural intonations of Steve Von Till. Soon, the storm reaches its peak. The earth begins to split before you, the bleak sky begins to rain fire, and the skyline in the distance slowly begins to crumble to the ground. With several bowel-shaking bass slides, the same guitar riff that was but a shadow in the corner of your mind six minutes earlier explodes into a roaring, indiscriminate wall of sludgy ruin. The drums transform from a hypnotic pulsing to a creeping, pounding onslaught reminiscent of a wrecking ball methodically crushing its victims into dust. The next thing you know, you're on the ground. Your vision is blurred, your head throbbing. Sitting yourself upright, you look off into the distance. The storm is slowly retreating, and you are finally made aware of the utter desolation around you. The tallest buildings have been laid flat across the now barren landscape, the oceans themselves have been set aflame, and ash falls from a sky that sunlight no longer seems to touch. As the drums resume their primal throbbing and the guitars send shockwaves of undulating distortion across the diminishing soundscape, you notice other people around you. They are cold, empty... mothers clutch their children as their lost eyes sweep over a homeland that has been turned into a post-apocalyptic wasteland in the course of twelve minutes. As a final show of power, the music briefly reverts to the opening motif of rolling tribal rhythms punctuated by industrial noise before finally dropping out for good.\n\n...and that was only the first song.\n\n\"Rehumanize\" is a brief, slightly disturbing, yet oddly compelling track that contains twisted samples of various people talking about subject matter that is spiritual and strangely chaotic on top of a cerebral collage of mechanical sound. \"Purify\" is an immense moment of music that moves from a melancholy arrangement of gently ringing guitars and orchestral elements throughout the introduction, to a lengthy evolution of sheer intensity wrapped in trademark tom-heavy drumming and slithering, sludgy guitars... and on to the striking closing sequence that features rolling drum patterns and atmospheric bursts of distortion placed against uplifting and highly melodious bagpipes. Yes, bagpipes. \"Aeon\" starts with gentle pianos and subtle snare rolls in its first half, only to ascend into a monolithic scene of uncompromising tragedy in a second half that's as powerful and emotionally moving as it is destructive and militaristic. The remainder of the album shares a similar sense of crushing intensity and swirling dynamics.\n\nThrough Silver in Blood is immense. It is an absolutely triumphant soundtrack to the apocalypse and the subsequent rebirth of the world anew.\n\nListen and be swept away.\n",
        "\nThis album is easily one of the best records Neurosis has ever put out, if not a contender for their absolute best. It's astonishing how effortlessly the band seems to evolve from release to release... and each time, they only get better. Upon listening to this record I was somewhat blown away by the fact that after more than twenty years they've still been putting out music at the same stupendous level of quality that they did when they were fresh and new to the music world.\n\n\nThe album's lyrical themes seem to center around the usual Neurosis stuff: tribal rituals, spiritual challenges and triumphs, and lots of religious allegory thrown in the mix. It seems like Neurosis's lyrical content is one of the few things that rarely changes from album to album. I don't have a huge problem with this; while their lyrics certainly aren't the best in the world, they're distinctive, and suffice it to say, Neurosis would be a very different band without them. The vocals are the usual scratchy, rough, and characteristic roar, except they're a bit lower in the mix this time. Scott Kelly gets in some gut-wrenchingly long and brutal howls near the end of the third track, To The Wind, the final lasting over twenty nine seconds. Really fantastic, if slightly unnerving, stuff. The fairly standard vocal style of the band's vocalists is more than made up for with the enormously visible passion they put into everything they sing. It's enough to make hairs stand up on the back of your neck.\n\n\nThe production of the album is once again handled by the great Steve Albini, one of the finest producers in the business. His usual warm drum and guitar production, as well as a characteristically organic guitar tone, set the stage fantastically well. Albini is one of the best things to happen to Neurosis in a long time; the band has come a long way since their older recordings like 1992's Enemy Of The Sun and 1995's Through Silver And Blood, and Albini's production is likely a big part of that. Everything is wonderfully crisp, but not sharp - the heavy moments (and believe me, there are plenty of them) are wonderfully crushing and dense, just the way they should be, and some of Neurosis's best riffs are on this record.\n\n\nIt seems that there has been even more attention paid to the more ambient parts of every track, and this has proved to be enormously effective. Some of Neurosis's old experiments with post-rock and ambience have proved to be disastrous; just see the achingly long and dull track Strength Of Fates, off of 1995's Through Silver And Blood. But on this latest offering these often-dreaded sections have become beautifully elegant and crisp, no longer prone to bad song-writing or pointless meandering, but perfectly emotive and subtle. Lately, Neurosis has been putting out albums that are constantly labeled as their 'swansong' or their 'best work'. But they just keep getting better.\n\n\nThe title track is, quite simply, a Neurosis classic. It's at once very unique, yet perfectly representative of the band's style, and would make a great introduction to Neurosis for anyone. It immediately assaults you with a grueling riff from the get-go, and continues on this way for awhile, swapping out the tense riffage with two perfectly placed atmospheric sections that set up the jaw-dropping synth-soaked finale of the song perfectly. 9.4/10\n\n\nFear And Sickness is probably my least favorite track on the album, but it's still great. With lots of ominous bass work and crushing riffs, it's probably the heaviest song on the album. There's a semi-fast riff near the end of the song that absolutely kills, and the drumming throughout the track is probably the among best on the album, aside from Distill. 8.6/10\n\n\nTo The Wind is, quite obviously... a departure. An experiment. And I'm happy to say that it succeeded. This is easily the album's standout track, and definitely my favorite; a beautiful, melodic, almost happy - almost - track with a fantastic repeating riff and harmony section that kicks in a few minutes into the song. Tremendously unique... and wonderfully heavy. I would absolutely love to see more songs from Neurosis in this vein. Totally kick-ass track, with some exceptionally brutal vocals near the end. 9.7/10\n\n\nAt The End Of The Road begins with a long atmospheric section, something that will likely turn off some people. This track took the longest to grow on me - I found the distorted vocals a little grating at first, but now I love it overall. I would easily compare this to Purify, one of the best tracks off of Through Silver And Blood, as the song structure is quite similar, if a little more drawn out, and a little less rewarding. However, every part of the song is very solid and well-written, and the latter half of the song is definitely very dark and powerful. A challenging listen. 9/10\n\n\nShadow is the first of two filler tracks. I don't care too much for either of these; while they certainly aren't bad, and serve as little breaks nicely, there's nothing particular noteworthy about them. The spoken word bit is great, though, very well-written, and definitely creepy. 6.5/10\n\n\nHidden Faces is another standout track. It's the shortest song on the album, excluding the two filler tracks. It begins with a Godflesh-esque slash of guitar feedback - at least, that's what I think it is - and eventually settles into lurching, groovy riffs that continue for the rest of the song. The synths and keyboards throughout this song are particularly noteworthy, and the vocal bits are rather catchy. I love the way this song ends. 8.8/10\n\n\nWater Is Not Enough was the first track released from the album, and it's probably one of the best. It begins with a rather odd riff which leads into one of the best heavy (and LOUD) parts on the album very nicely. The vocals on this song are quite different from the vocals on the rest of the album, but I love them. They're kind of snarly and raspy - more so, that is. This song is also a little faster than the others on the album. The last \nriff in the song is, in typical Neurosis fashion, probably the best. Fantastic song. 9.1/10\n\n\nDistill (Watching The Swarm) has the best atmospheric, 'post-rocky' moments on the album. The intro riff is quite catchy, as is the drum work that goes along with it, speaking of which - the drum work on this song is probably the best on the album. There are a lot of noisy, distorted bits, too, which are something I always enjoy. The heavy parts on this song are very slow and drawn-out; but nonetheless, they're some of the best riffs on the album. Overall, I'd say that this song is the most 'balanced' song on the album, as far as juggling atmospherics and balls-crushingly heavy dirges go. 9/10\n\n\nNine is another filler track; and it's probably the lesser of the two. The lyrics aren't as interesting as Shadow, and some of the samples are a little irritating.\n6/10\n\n\nOrigin is the album closer, and it begins with a eerie synth line floating over a minimalistic drum pattern. It continues in this way for some while, but it's quite dynamic, so it doesn't become boring throughout. The first two thirds of the song make up the longest atmospheric passage on the album, although it's far better than the one on At The End Of The Road. This leads into, as one might expect, a crushing riff around the eight minute mark, and what a riff it is. It's probably one of the simpler riffs on the album, but the way it's presented is perfect and really helps it to stand out, which is something fitting for an album closer. A weepy little violin line comes in a little ways through and perfectly accents it. The riff ends suddenly, and without warning, the album is over. Certainly a good song, but like At The End Of The Road, a challenging listen to one who isn't familiar with Neurosis's song dynamics. 8.9/10\n\n\nOverall, the album is a solid contender for album of the year, and maybe even one of Neurosis's best albums. I can't wait to see this performed live. \n\n9.6/10.0\n",
        "\nIf there was one band I'd describe as 'difficult', it'd be Neurosis. It's not just their music- there's a lot of funeral doom out there that's much harder to listen to.. But it's the lyrics, the imagery, the huge amount of side projects.. Basically, it's impossible to understand exactly what Neurosis mean, what they represent, what they espouse etc etc.. I was hoping this DVD would help explain some of the mysteries of Neurosis, but it makes me more confused.\n\nBasically, this DVD consists of a 70 minute long video clip set to A Sun that Never Sets. There's a few shots of Neurosis playing (which is nice, because for ages I've had no idea who's who) which is all interspersed with some really confusing (some may say \"abstract\") pieces, most of which change from song to song. When I say 'really confusing' I really mean that. \n\nDon't think it will be that weird? Here's one good example: In 'Crawl Back In', a dude comes out of fetal position and hit his chest every few seconds for about a minute. Then, we see him standing in front of a person who's been tied up in a big, body-sized bag (which probably has some very deep symbolism). The dude proceeds to cut the ropes tying this guy up, and obviously it's something very traumatic for him. Eventually, he cuts all the ropes, and we know see that the bag is covered in blood. Turns out the guy inside the bag is also covered in blood, and he proceeds to kill/hug the other guy, who then lies down, dies and gets covered in sand. As you can tell, it's really weird, and the other's aren't that less weird.. You've got Falling Unknown's perplexing mix of shapes, some sort of fire and some other stuff (it's real weird), the rebirth from desert sand that in From the Hill, (which is real weird) and just general weirdness all round. Damn, every video is just freaking weird. \n\nIt's a shame about the videos, because the songs are really good. This album is the start of the 'mellow' Neurosis stuff, and there's some great tunes here. Falling Unknown is real epic and has a huge, post-rocky ending, The Tide is melancholic, quite folky with some excellent riffing around the end, and the Title track is slow, a bit Sabbath-sounding and has an excellent ancient vibe. From the Hill has some real grating vocals, but after a while you'll get used to it and be digging the slow, steady grind. Another sweet song is Watchfire, which is also very slow and mournful. For those more familiar with older Neurosis, it's basically Through Silver in Blood slowed down and made a lot less dense, with more clean vocals. It's a real good album, basically. It's a shame the video footage is so damn weird.\n\nIt's hard for me to like this, but it's also hard for me to hate it. Basically every Neurosis album I've ever bought, I've hated it for a while before suddenly understanding the point of it. Still, despite quite a few watches, I do not understand. I don't understand it at all! It's a well executed video, sure, and chances are it is the most meaningful thing EVER RELEASED, but I can't get my head around it. If I based the rating purely on enjoyment, this would only get a 30 or so (because the music is good.) But, because there's probably a fair bit I don't get, and because Neurosis hardly ever put out anything bad, I'm giving this a 50. Just be warned: IT IS REALLY WEIRD. Perhaps you should just buy the album instead.\n",
        "\nBefore they started releasing perplexing, monolithic slabs of punk/metal/ambient noise, Neurosis were a left of field hardcore band. While their debut album, Pain of Mind was a fairly straight ahead hardcore/thrash album, this album shows Neurosis stretching out a bit more, though this album is still very primitive compared to Souls at Zero.\n\nOne of the things most people will be surprised at is how damn loud the bass is. It's a great showcase for Dave Edwardson- a lot of the bass lines are really damn good, and there's a few particularly hard bits, like in Obsequious Obsolesence. Still, it would be good if the guitars were up a bit more. Otherwise though, the rest of the band haven't really achieved the brilliance they would get later. There's very little of the awesome tribal drumming we all know and love, the guitars don't really pack any punch, especcially when compared to, say, Raze the Stray from Enemy of the Sun, and while the vocalists are indeed passionate, with the exception of Dave's low growl, they sound quite screechy and immature.\n\nStill, there are some good songs here. Pain of Mind is full of energy, The Choice has some decent lyrics and is real entertaining, and Tomorrow's Reality has a lot of great basslines and some interesting riffs, along with some effective tempo changes. It is a shame though, as whenever Neurosis get a bit interesting in this album, like Pollution and Common Inconsistencies, it doesn't take too long before they're going straight back into the shouty, hardcore punk stuff. There's also a tendency to lose focus, like in Pollution, To What End?, and.. almost every track. Oh well.\n\nBasically, I didn't really like this album that much. The bass playing is excellent, and there is some interesting guitar riffs to be found here and there, but for the most part, this is the sound of a band that had a good idea of what they wanted to do, but completely stuffed up the execution. Still, I don't mind, because they did execute perfectly in what, the next 6 or so albums? Nonetheless, this release is for Neurosis completists only.\n",
        "\nOn 'A Sun That Never Sets' Neurosis play a brand of post-sludge that focuses on a steady, perhaps one could say, ambient rhythm. As a consequence of this, the composition meanders along consistently, developing a feeling of a slow, militaristic march into the depths of some bleak existence. There is some truly good stuff on here, some excellent clean sections that add to the sparseness of the composition. Also present is crushing sludge/doom type riffing mixed with ringing detuned chord arrangements that are backed by a densely processed guitar production, which comes down with the weight of a lead block. The vocals are generally lacking in range and usually take the form of a half-hardcore scream with a raspy edge, or sometimes monotone crooning in the punk sense of clean vocals. But although they are without the operatic dynamism of the better extreme metal vocal stylings they serve as an emotionless backdrop that adds to the eerie, desolate atmosphere that the band is trying to produce. \n\nWhere can a band fall down when they have this entire array of positives going for them? The answer lies in the fact that it isn't just the sound alone that dictates the quality of the music, it is the immense journey that it takes you on. Here there is a journey - to a place without feeling, a nihilistic haven for the depressed souls of this world that could not handle the loneliness of existence, nor the futility of modern society. One may look into Neurosis' collective eye and see a bleak, empty world staring back at them, gaining the impression that nought can be done to subside the meaningless of life or the destruction of man. Where is the celebration of this dark life, the beautification of death as found in the best bands that excelled in the genre? It is not here, instead we unfortunately find depressingly bleak sorties that share the apathy of grindcore. Life rewards those who make the best of what they have, not those who accept the worst with an eager sense of fatalism as seems to be promoted here. Thus, in reality this album comes off as a 'jam session' that is surprisingly coherent. But that is all it is, a jam session that is pleasing to the ear, but has no real purpose or direction - entertaining for a few listens but what can one take out of it but a temporary sense of hedonistic satisfaction? Perhaps it sounds better when exposed to excess amounts of THC, but quite frankly this does not interest this writer too much as the best music is a drug of its own.\n",
        "\nI'll say this plain and simple: Neurosis is the Pink Floyd of metal - and of our generation as a whole. They are completely unwavering in their experimentation; take a look at Pain of Mind, and compare it to, oh, A Sun That Never Sets. You would think of them as works of two completely different bands, and for all intents and purposes, they are. Neurosis is no longer the hardcore/crust/crossover thrash band it used to be in the 1980s/early 1990s. I have seen them bunched into just about every genre, falling under such extremes as indie rock and progressive death metal. And yet they are completely indefinable - one of their best traits. They are able to seamlessly blend together every type of music into a chaotic, melodic, crushing, and heart-stopping mixture that can confuse and startle even the most seasoned metalheads. Neurosis's style has been described before as a \"wall of sound,\" an acutely accurate description. Forget your brutal death metal and grindcore; these guys are the heaviest and loudest stuff around.\n\nNeurosis has really shifted in their sound recently; The Eye of Every Storm is far less punishing than their earlier works when they began really experimenting with metal. It was around this time, beginning with the release of Enemy of the Sun, that Neurosis began to make music that would push the boundaries of heaviness. Like, holy fucking jumping Jesus, is this album heavy. This is the kind of music that not only knocks your socks off - your feet come off in the process, as well. Through Silver in Blood is arguably their best work; it takes everything that was great about Enemy of the Sun, and knocks it up ten or so more notches. Like all of their better work, the album is completely unpredictable. The first twenty minutes, your ears are shredded by the colossal “Through Silver in Blood” and “Eye.” Then things seem to tone down into mellow, almost Floyd-ish territory for “Purify”… and then the rug is pulled out from under you yet again. Like all of Neurosis’s albums, Through Silver in Blood is long as fuck. Yet even at 70 minutes, the album neither drags nor bores. These are guys who truly, passionately care about their music – “real” musicians, if you will. Many of the songs exceed ten minutes, and yet they always leave you wanting them to be ten minutes longer. If my message has somehow been lost, I’ll be very clear: This is an incredible album.\n\nAs much praise as I could pour out for these guys would never be able to do them anywhere close to enough justice. Nor could I possibly (or properly) encompass the vast range of emotions captured in this musical offering. All I can say is this: After you finish this review, get up, grab your coat, keys, and wallet and go buy this album.\n",
        "\nNeurosis have created what I consider in many ways their best album, or at least their most mature album. Far from the grinding noise of yore, this is more like Through Silver in Blood, but in many ways more written out then even that album. The feeling on this recording is of the march of life, how each event occurs and then an event is on the horizon and though you struggle against its coming still it comes and without hesitation. A ceaseless steady march of life, existence and history. \n\nThe band recorded this album with Steve Albini, and being very familiar with his work due to the fact of listening to Shellac, Big Black, Rapeman and owning many of the albums he has recorded, I have to say that he has only gotten better as a producer. This album is everything I love about his producing style and nothing I hate. The vocals unlike most of his recordings are up front, while the drums have the distinctive and violent presence that he always has managed to capture. The guitars are full, and like usual with his productions the bass is quite present and perfectly for Neurosis looming. \n\nThis album is tied together by a general sense of bleakness and the overwhelming presence of being wearied by life. There is a strange tired quality to this album that makes is very much a hangover album. It is looking backwards and forwards at the same time, desiring to escape from the endless cycle of life, yet resigned to it. \n\nYes you could call is post metal, but it is ultimately metal and its roots are very obvliously in the sludge metal genre, but there is something so much more cosmic about this, something so beautiful and possessed, that Neurosis ultimately transcend all genres and are simply Neurosis. Many people who liked their noisier recordings, may not like this much, but if you're like me and prefer the darker, more mature side of Neurosis, this album is essential.\n",
        "\nNeurosis are a band that don't need too much introduction. While their first two releases didn't set the world on fire, ever since then there's been nothing but monolithic albums full of tribal, punk, ambient and metal stuff that confounds and excites in equal measures. Jarboe may not be quite as well known, but she spent a fair bit of time in the different but equally strange group called Swans, and now she's collaborating with a fair bit of other weird groups. This record doesn't really live up to Neurosis's excellent 90's work, or most of Swans' stuff, but it's still really damn good.\n\nThe first track kicks in and you know you're in for a good, if harrowing time. A Neurosis tribal, tom heavy drum beat that we all love, some excellent instrumentation and some extreme dynamic shifts all creating a very mystifying experience, all of which is complemented by Jarboe's strange chanting. It's a great track but there's not really enough of a resolution to satisfy fully, which is probably the biggest problem in this album- that much of the songs don't seem to be fully developed in their structure, and however intoxicating they may originally be, they ultimately disappoint.\n\nBut while the lack of resolution in some tracks is disappointing, the music is probably among Neurosis's best. Sure, you won't find much trancey, pummelling Enemy of the Sun style riffs here, but instead, you find dense, droning, intoxicating layers of synths and sound. Seizure is a strange, spaced out country-drone thing with some good vocal interplay between Steve Von Till and Jarboe. Taker is another great tune, one that's somewhere between melody and dissonance, harmony and discord. It's freaking amazing, put simply, with some nice clean guitar over some heavy, and melodic guitar. It sounds a bit like some stuff of Times of Grace, and to be honest I don't see why they didn't just put Neurosis vocals over it.. but they didn't. It's real nice though.\n\nUnfortunately, while Neurosis excel in this record, Jarboe doesn't do quite as well. She is by no means bad.. Her singing is decent and her lyrics are awesome.. But compared to the sweet tunes Neurosis come up with, Jarboe's efforts just don't really compare to Neurosis's music, and as such it drags the quality of the music down. Her effort in the first track is particularly disappointing, just consisting of a lot of spoken word, when the music calls for more, as does Taker. Also, the way her vocals were mixed is very frustrating, because it sounds like Jarboe is just singing over backing tracks. Maybe that was deliberate, but it definetly makes the music suffer as a result.\n\nNonetheless, this is a pretty damn good album. Neurosis do extremely well and while Jarboe could've done better, she could've done a lot worse. If the worst complaint is \"The vocals weren't as awesome as I hoped\" then you know your onto a good thing. Recommended, but strict metal fans won't find much for them here.\n",
        "\nIn case you didn't know, Neurosis are one of the most ambitious, intelligent and experimental metal bands around. Their deep, unnerving mix of sludge, folk, noise and hardcore sounds like no other band around, and much of their 90's output was about a decade ahead of its time, creating interesting prog sludge stuff when other prog-sludge bands weren't even born.\n\nLike Times of Grace, this album treads the line between their 90's stuff and their latest two albums, but it's a bit closer to A Sun that Never Set's Minimalism then Times of Grace's heaviness. Prayer starts off pretty quietly, and for those who have A Sun.. will notice that it's extremely similar to From Where its Roots Run. A clean, haunting guitar line kicks this track off, before the song goes into Roots Run.. territory. It's by no means a bad song, but this is Neurosis.. you expect a great song! The climax is somewhat disappointing- in the end, the song doesn't really to go anywhere.\n\nThat's basically the main complaint about this album.. THe songs aren't terrible, indeed they're all quite good, but they don't seem to be fully completed. To me though, that is a valid, and major complaint. An Offering is probably the heaviest thing Neurosis have done since Raze the Stray, and Flood is a pretty cool Interlude, but the first three tracks don't seem to have any sort of release in them. They build up, they end; there's no catharsis. Chances are, the crazy folks in Neurosis did this deliberately, regardless, it's still a fairly annoying way to end songs.\n\nSovereign, however is a pretty cool song. It's not the most accessible song ever, but it still rocks. It follows a very Post-rock structure (quiet, loud, quieter, SUPER LOUD!!1) and it works quite effectively. Guitars drone away in the background, noise elements come in while the drumming builds up, there's some awesome dual vocal action with big riffing, this continues for a while until the ten minute mark comes, when clean vocals and an ominous piano line plays in the background. There's another final build before an awesome, nice, heavy and melancholic ending comes on, with some good use of synths and the typical big Neurosis riffs. It's a bit too brief, but it's still a good song.\n\nBasically, all the Neurosis elements are here in this EP. It's crushing, fairly well produced, we have the great rythym section and the super passionate screamed vocals we've all come to know and love. However, the first three songs really don't have that much of a climax, and perhaps should've been worked on more. REgardless, those songs, and the album itself, are good listens, though chances are you won't feel satisfied when it's done.\n",
        "\nNeurosis's discography can probably be divided into three parts. The crusty hardcore beginnings, into the dense progressive monster they where for much of the nineties, and finally into the more sparse and folk influenced that there last two albums were. While most of their 90's stuff is much loved and worshipped, you can only take one style of music too far. (Unless if you're in Slayer or AC/DC.) In this album, Neurosis take their dense Prog-metal as far as they could possibly do it, and at the same time, they start looking to new places to take their sounds. The result is a slightly disjointed but still fairly awesome cd.\n\nThe introduction is a deceptively gentle and atmospheric piece of mood setting, with some cool and unusual instrumentation, but as soon as the next song kicks in, all hell breaks loose. The Doorway is one of the heaviest songs Neurosis have ever done, with huge riffs and pounding drumming over some fierce and unnerving screaming. The guitars sound massive, and the production as a whole is far better then Through Silver in Blood. Steve Albini did a great job here. The next track is another old style Neurosis tune, full of the awesome tribal drumming and walls of guitar that Neurosis are known for. \n\nThere are a few surprises here though. Belief has some strange synths and there's a lot more focus on atmosphere, on tension, then there is in most Neurosis songs. Descent is a pretty cool interlude with some bagpipes and some great marching band style drumming. Sure it's just an interlude, but Neurosis had never done anything like that before. Away takes a very long time to go anywhere, and for the first six minutes or so it's a very slow, mellow jam with violin, piano, guitar and some clean vocals (!!!).\n\nThe only real complaint I have about this album is the track ordering, with the ending of the album being a bit anticlimatic. For the most part though, this is a very cool CD with a lot of different stuff being attempted. This CD is surely a few years ahead of it's time too. In 1999 Isis were still a crusty doom band, and Cult of Luna, Pelican, etc., probably hadn't even formed yet. The use of lots of different instruments is great too. Recommended!\n",
        "\nBands like Neurosis don't just come around quarterly. In the realm of bands like the might Isis, Red Sparowes, Cave-In, and Old Man Gloom, Neurosis take the helm of the artsy post-sludge/hardcore, but cleverly manage to escape being pigeon-holed into the same well of black turtle-neck wearing poofters like Dream Theater, or all those Gothic bands who claim their music is 'art.' \n\n\"The Eye of Every Storm\" is Neurosis' latest take on music as art, and the band works wonders with their initially minimalistic sound as they layer textures upon texture until the music has progressed into something truly beautiful and touching, even if in a dark and cold way. The initial track \"Burn\" is a strong indication of where Neurosis are at in their interesting career, and is clearly indicative of how the album will play out. To match their lyrics, Neurosis have taken on an edict of allowing their music to evolve, more than it progresses. It starts out dissonant and heavy, and slowly forms into a theme that was much more than what it began with. By the time \"Burn\" has ended, you'll wonder if it was even the same song. \n\nOf course, Neurosis still rely on an impossibly dense atmospheric ambience to get their points across. \"No River to Take Me Home\" and the album's title-track, \"The Eye of Every Storm\" are too of the most disdainful tunes you will ever hear, thanks mainly to the extremely clever mixing of the tracks and the ambience invested in them, even though the two songs sound absolutely nothing alike. \"No River to Take Me Home\" opens with a searingly mournful riff that just sounds lost, and developed into a very midpaced flow until the guitars hush, and a slightly soothing, quiet section rolls in with Steve Von Till and Scott Kelly delivering a chilling vocal performance. The title-track, though, is without a doubt the epic of the album. It opens with a mournful atmosphere provided by a very drolling bassline and nonaggressive drumming, while hints of guitars are distorted in the background very slowly. The first chorus consists of humming and feedback producing a melody that makes your heart feel like lead. At about the five minute mark, though, things shift into a depressive passage. Bass hits undulate like waves, sounding like a transmission of apprehension and anxiety. Ambient noises strike and squeal in and out of the atmosphere, and Steve Von Till provides eerie vocal chants, and out of the hushed anguish screams: \"Now Oath-breaker sinks low.\" After the chants are over, distorted ghost notes amplify the intense internal discord, while the song continues to drone in an unsettling feeling that will stay with you until the end of the album. \n\nThe album evolves in a uniform fashion, until \"Bridges,\" which any Neurosis fan will admit to never've seen coming. The largely acoustic track gives light into the complete power of Neurosis, by delivering a subtle, yet still mournful and atmospheric sound, and haunted vocals give way to an esoteric story of turmoil producing strength and beauty in form, which seems to be not only the lyrical, but musical theme of Neurosis' entire career.\n\n\"The Eye of Every Storm\" is the type of album that many bands wish to make, but don't achieve. In the often minimalistic sound of Neurosis, they tend to give way to unimaginable feelings. They give you that creeping, yet amazing feeling that few artists are able to supply you with. Those goose-bumps that you get whenever your ears hear something that almost causes Stendhal syndrome. Amazing opus.\n",
        "\nOr then again, maybe not. I thought Khanate was the most extreme band out there, but Neurosis gives them a run for their money with this stunningly inaccessible, super dense slab of noise. There's basically no let up in this album. The spine-chilling intro to Raze the Stray and a few other moments in this album are the only let up from the massive, densely produced pummeling riffs, the overwhelming rhythm section, and the passionate, powerful screams that fill this album. Upon hearing that Cleanse (I got the shortened version, :( ) was a 16 minute long tribal percussion thing, I took heart that at least that might be easy to listen to. Or maybe not. The mystical, unnerving, constant beating of the drums, along with various other noises, is just as massive as the rest of the album.\n\nSo it came to the point where I was going to use this CD as a coaster, but then something happened. Riffs, brilliant conceptual songwriting, and just pure genius were coming out of the speakers as opposed to the dense walls of noise that had come out on the previous listen. The screaming started making some sort of sense. A good example of the amazing songwriting buried in this album would be Raze the Stray. After the intro the volume goes straight to \"blowing up speakers\" level, yet the Piano line that introduced the song is still audible. There's some great tribal drumming in the title track that blows my mind. The Time of the Beast has some great mellow parts, while Lexicon is Neurosis at their most fearsome and primal. The demo version of Takeahnase is pretty cool, though it's surprisingly normal for a Neurosis song. (And it's better produced then the album, which is strange for a Demo version). \"Cleanse II\" is interesting, but nothing compared to the original at all really. I would've preferred the full length version of Cleanse instead, oh well.\n\nSo, let me just warn you all. This is a tough album to get into, and while the rewards are great, it's still a very abrasive recording. If you only like Neurosis's new album, don't get this one. If you only like Gothic crap, don't get this one. It's one massive slab of noise and it should be treated with caution. But, if you like dense (I keep on using that word, but it fits so well!), punishing sludge, you should run out and get this.\n",
        "\nI've often found it strange about the lengths people go to praise Neurosis. The two albums I previously had, A Sun That Never Sets and The Eye of Every Storm are both amazing albums, but other bands have improved on those two cds'. But then I bought this cd, and it's an absolute monster. It's an exhausting, exhiliarating, mind-altering epic. It sounds primal and ancient. You get the feeling that Neurosis didn't actually write this album, rather, that they're all a bunch of mediums who channelled god, or satan, or quite possibly both, and got them to write an album for them.\n\nI probably should stop raving about this CD and describe the music. The music is progressive doom metal with a big dose of ambience. The title track is probably the best point of reference. It's a dark, oppressive 12 minute monster, with frantic tribal drumming, brilliant and disturbing noise, and pounding, primal guitars. The guitars don't do a whole lot of different riffs, but they never get repetitive or boring. The anxious screams of the two singers, the brilliant rythym section and the crushing guitars add up to an experience that could best be described as overwhelming. Still, it's not all crushing tribal doom. Purify has a great mellow introduction that slowly builds up to massive riffs from hell. Aeon, maybe the best track here, has a beautiful piano, which continues it's slow melody while strings and drums slowly build up. Heavy guitars come and go, before a massive, despairing riff kicks in, and then the song slowly fades away into another melancholy strings and piano piece. The interludes are good too, particularly Rehumanize. It's a thought provoking spoken word passage, with some disturbing and awesome noise bits added.\n\nEverything is perfectly in its place in this album. The guitars are chunky, a little bit muddy, but they are always playing the perfect thing. The Neurosis rythym section is very dynamic, and never sounds out of place. The only rythym section that even comes close would be the Isis one. The bass is content to fill the bottom end in, never really standing out, but the drumming really adds to this album, with the tribal, tom-heavy beats making each song better. The singers dont have the heaviest scream ever, but the commitment to their art is undeniable. The lyrics are all very well written, fairly opaque and abstract. I'm sure I could spend a lot of time trying to understand these lyrics, but with this kind of music, proper understanding is impossible. You're not really meant to completely understand this music; you're meant to surrender to it's awe inspiring power. And that's maybe a good line to end this review on.\n",
        "\nIf I was in Neurosis, I'd be pretty pissed off. Young upstarts (Isis, Pelican, Cult of Luna..) are doing something that these guys have done for years, and now, they're being praised to the skies (Fair enough though..) while Neurosis, despite putting out brilliant albums for over 15 years, have generally been ignored. While this album may not reach giddy heights of Panopticon, I'd like to challenge anyone to find a Post-Metal album this good.\n\nThe album kicks off with a short little instrumental, some strange, squealing guitar thingies flying around before a solid drum beat enters and pieces start falling into place. The first real song, \"The tide\" is pretty mellow, and driven by some clean vocals. There's the usual Neurosis here: the great use of dynamics, the good layering of instruments, the subtle ebb and flow of the music. Synths and violins float around in the background, while a piano comes in once in a while. Spine-tingling, majestic stuff here folks. Then, the guitars kick in, and you're suddenly in an epic, sad and super heavy song. As far as songs go, it's hard to beat.\n\nSome people will critisice this album as being too \"Post-Rock\" but that couldn't be further from the truth. Post Rock for the most part relies on the quiet at start noisy at end dynamics, but Neurosis have none of that. Every song weaves and twists, and you have no idea what you'll be hearing next. You might have the strange, tribal kind of beat of the title track, the powerful, alien atmosphere in Resound, the heavy, meaty riffs in Watchfire, or the painfully beautiful middle section in the excellent Crawl Back In, with clean guitars and a mournful, beautiful violin part being played over it.\n\nOne thing you'll notice is that for all the epic-ness, this whole album sounds really earthy, like a less heavy, more dynamic version of Isis's Celestial. You get the feeling that this record could've been recorded 15,000 years ago, back when we lived in caves or whatever. There's a huge primal thing about this whole album, which is reinforced by the great, deep lyrics and the primal voices of Scott Kelly and Steve Von Till. While they're not the most amazing singers ever, there's so much passion in their voices, which more then makes up for it.\n\nThe production deserves a mention here too. Steve Albini is a very well known producer, and here you can see why; everything is in it's perfect place, guitars are meaty, the drums sound big, and the vocals fit perfectly in the mix. Neurosis wouldn't sound too good if they where produced like Darkthrone; they need a full, rich sound to get the full point across.\n\nThis record is basically essential listening for those who like Metal that's complex, deep and takes lots of listening to fully understand. Neurosis are an amazing band, and if there was any musical justice in this world, you'd see them on MTV instead of all them crappy pop acts. Deep, moving and really quite awesome.\n\nEdit: Having recently purchased the rest of the Neurosis Discography, I can say while this is still an awesome record, it's got nothing on the previous few albums or the Eye of Every Storm. Marked down by 10%. Still a great album though!\n",
        "\nIn 1992 Neurosis released what was their best album, and one that would stand the test of time. Having heard Neurosis first on a mix tape given to me by a friend, I had to have more from this band. This was about 1995, I was about twelve at the time. So the first album I buy is Souls at Zero. Back then, I wasn't really sure what to think (considering I was going through a hardcore/punk phase). As I grew older, the album grew on me.\nThis album, for its time, was one of the only albums like this in metal. Yes one could say that bands like Christ on a Crutch and others were hinting at this, but nothing was recording previous of this enormity. This album reminds the listener of sludgy post-Neurosis bands (such as Buzzoven's Sore) but the album is really so much more than that. The guitar work on this album is not overdone or over distorted to the point of being overbearing, much like thier two later works. The vocals hold a certain emotion and fit the music perfectly. The drums have that Neurosis tribal feel to them, but a lot less percussion oriented than Enemy of the Sun. The music is slowed down from their previous hardcore works, but still a heavy slow, not slow as in a doom metal band, but a slow sound that sticks to your ears as you're listening.\nAnother interesting aspect of the album is use of instruments rarely found in metal (at least back in 1992). The accompanyment of violins, cellos, and french horns add a certain dynamic aspect that was not heard often in music of this caliber.\nThis album is not one to look at just in retrospect, because it holds its ground today. When faced with the opposition of the genre they created (Isis, Cult of Luna, etc). this album blows the others out of the water.\nThis album cleary shows the transition from the more hardcore oriented Word as Law to the more tribal feeling Through Silver in Blood (Enemy of the Sun furthered the sound a little more, but without the immense effect this album had).\nThis album is recommended to fans of sludgy styled metal, as well as anyone looking for an absolute metal classic. This album should be among every metalheads collection. Eleven years after purchasing this album, it is still constanty in my rotation.\n",
        "\nNeurosis is one of those cult bands in extreme music that transcend labels and genres and seem to have a devoted fanbase. 20 years of brutally heavy, yet thoughtful and dynamic extreme music will do that, and they fully deserve the credit they get. This particular record takes them to a more mellow direction, often utilizing some cleaner vocals, perhaps due to the solo projects of Scott and Steve that were released around the same time period. However, mellow in Neurosis terms does not mean a loss of the trademark chugging-flowing heavy riffs and dynamic rhythm section that the band has been famous for. Stones from the Sky, familiar to some via the video clip that has gotten some play on music channels is the standout track, working off a brilliant, simple little riff that just flows through the listener's body. I'm gonna call it the most transcendental metal song. Sun that never sets is also a remarkable effort, albeit a bit too short. Falling Unkown is the second best song on here, with the cacophony at the end, around the 11minute mark, but the slower, drawn out riffs work well throughout the song. The singing is also notable. \nNeurosis' lyrics are simple on this album, yet the passion with which they are delivered make them work. They have a hypnotic type of effect, and fit in pretty well with the music and Neurosis' views (Sun metaphors, their outlook, etc -I almost used the word philosophy, but as a person who reads a lot of real philosophy and is discusted with the abuse of the word from basketball coaches, to Jerry Springer I'm not going to-.)\n\nA highly recommended album for fans of the Neurosis sound, because it has the goods of the old brutal sound, but it incorporates melody exceptionally well. For all fans of extreme music that will alter your listening habits.\n",
        "\nThis EP/Single was a sign of what was to come after \"Pain Of Mind\". Mostly straightforward hardcore songs here. What really makes this EP(and \"Word As Law\") stand out is the work of Dave Edwarson on bass. His basslines are mixed perfectly, driving most of the riffs/songs. His presense on this recording(and the next few as well) reminds me of the shift in Death when Steve DiGiorgio joined, where the bassist's work makes the music more dynamic and thier sound to stand out quite a bit more ( a difficult feat in the late 80's cali-hardcore/crossover scene).\n\nGetting to the point here: This isn't metal, \"metal influenced\" at best. Bass driven hardcore/crust punk with song structures far less bland than most bands within said genre(s). Decent production(still raw tough), memorable songs. Worth the download(or purchase, if you're lucky).\n",
        "\nOn thier first full length Neurosis(comprised of ex-Violent Coercion members) combined the most furious elements of hardcore groups like Amebix, Black Flag and Discharge. Pain Of Mind is a brilliant mix of D-Beat(bands that emulate Discharge), West Coast hardcore punk, with some metallic influences here and there. Even in this primitive incarnation Neurosis' music remained progressive (check out \"Reasons To Hide\" and \"Black\") and thrashing (\"Progress\" , \"United Sheep\", \"Bury Whats Dead\"). Excellent beginnings from one of the few original groups that has proven themselves both progressive and consistently entertaining (both live and on cd) over the years. \n\nI'd recommend this to fans of 80's hardcore punk, D-Beat, and maybe even Crossover fans. Keep in mind this is fast, crusty screaming punk music. Not metal by any stretch of the imagination. Crucifix, Nausea, Discharge, Rudimentary Peni are just a few bands to check out if you're liking Pain Of Mind.\n",
        "\nI’ve actually been waiting for Neurosis to slip up. Surely after seventeen years of releasing high quality material, the creative juices just have to dry up sometime. But like the very best wine, Neurosis just keeps on getting better with age. Neurosis is simply a stand-alone band - It doesn’t take a genius to realize that we’re talking about a very rare breed in the heavy music scene. Since 1985, with each and every album they have thrown at us, Neurosis has always been able to surprise. ‘The Eye of Every Storm’ is no different – it’s exactly what you expect from them, but as with everything they have done, there are always those subtle progressive changes that keep this band fresh. Quite simply, Neurosis is one of the very best heavy music acts in existence.\n\nIf you are a fan of Neurosis, you will have experienced and witnessed the bands metamorphosis from the oppressive Hardcore merchants they were in the early days to the dark, melancholic masters they are now. Like every record they have done, ‘TEOES’ is the result of the one before it. 2001’s ‘A Sun That Never Sets’ was the point in Neurosis’ career where a ‘vocal’ appreciation was developed. Hence, you will find this aspect to be the most noticeable progression made on ‘TEOES’. Other than the opening track ‘Burn’ where Steve Von Till and Scott Kelly pursue a more aggressive rasp, everything else is rather restrained and calming. The effect is rather dramatic, in the fact that one, this album becomes ‘vocally driven’ and two, that the colossal merging of their quiet passages with the heavy sections is accentuated even further. Furthermore, the vocal changes have allowed the bands dark, yet subtle melody lines to shine through – as a result, and quite unbelievably, Neurosis sound more confident in their musical direction than ever before. \n\nThere is no doubt that Neurosis strives for something different with every release. But it’s always subtle and never completely ignorant of their roots. In this regard, fans of the band can approach ‘TEOES’ with the confidence in knowing that this sounds very much like what you would expect. Just like every album before this, the ability of Neurosis to build a song with such hypnotic dexterity is on show - The deep melancholic moods, the tribal drum patterns, the drone-like ambient sections, the stunning movement between passages of serene quiet to powerful riff laden heavy climaxes are all here. Structurally, one could deride Neurosis for sticking to what are fairly common musical threads – songs that are built around the ebb and flow between peaks and valleys; the quiet and the heavy. Each and every track follow the same pattern. Thing is, as much as you know what’s coming, you can’t ignore it’s magical beauty. Neurosis have that uncanny ability to draw the listener in with a slow lulling atmosphere, and just when you think it done and over…BANG! - Cascading riffs and drums pound you into submission. Check out ‘the simply astounding ‘Bridges’ for proof - It’s irresistible. \n\nOne of the greatest aspects about Neurosis has always been their production values. TEOES is no different in this regard. Using Steve Albini (who has presided over the last three discs), the band has once again come up with a terrific sounding album. Albini has been able to capture that very ‘open’ and ‘sparse’ like atmosphere that is now a major part of what Neurosis do. The ambient soundscapes blend brilliantly with the quiet melancholic moments, whilst the drumming of Jason Roeder is once again given high emphasis in the mix (although, it doesn’t sound as ‘BIG’ as the ‘Times of Grace’ album) - Overall, a simply perfect production. \n\n‘The Eye Of Every Storm’ is nothing short of colossal - One of the darkest and the most expressive pieces of work that Neurosis has ever unleashed. It goes without saying that it is an album that requires patience. Typically vast and lengthy compositions await you. Each bathed in that essential Neurosis magnetism. Without question, ‘The Eye..’ is one of the high water mark albums of 2004.\n",
        "\nThe first song off this album I heard was \"Takeahnase\" (well, the demo version that's on the 'Enemy of the Sun' re-release), and I was blown away. When I finally bought the album and listened to it, I felt that it was easily one of the best metal albums ever. That was well over a year ago, and I still feel the same way. This is a practically perfect album. They took their early thrash/hardcore crossover sound and gave it a more experimental and progressive sound, like in the direction of later albums 'Through Silver in Blood' and 'Times of Grace.' The album is simply amazing. \"Takeahnase,\" the opener \"To Crawl Under One's Skin,\" and the title track are just simply fantastic, \"The Web\" and \"Flight\" must be great moshers at shows, and \"Sterile Vision,\" \"Stripped\" and \"A Chronology for Survival\" are more laid back, but still rockout as much as everything else on the album. As for the short interlude tracks (\"Zero\" and \"Empty\"), you practically need them in there to balance everything out, and yet, they don't slow the album down at all.\n\nOver the 12 years that have passed since this album's release, the band has changed quite a bit, many would say that their more recent sound is better than in the past, but 'Souls at Zero' will remain one of their best, period.\n",
        "\nNEUROSIS - A Sun That Never Sets (Relapse Records~2001)\nSometimes an album comes my way that I sit down to comment on but lack the words. \"A Sun That Never Sets\" is that sort of release and goes beyond mere words and simple explanation. It is an experience and thus can literally only BE experienced rather than explained. The best I can say is it represents a journey through moody soundscapes, emotionally drenched vocals and passionistic, thick guitarwork. I think these guys have listened to a lot of PINK FLOYD and Doom Metal. The slow, sludgy pace reaches new dimensions of musical expression that cause the juices to flow in your brain as you try and come to terms or decipher what is going on. It is a heavy, solid album to fully digest in solitude, preferrably with the volume cranked up. This is not the kind of album you can put in the background and do something. It requires your full attention.\n-Cheryl \n"
    ]
}