{
    "Band Information": {
        "Country of origin:": "Sweden",
        "Location:": "Eksjö, Jönköping",
        "Status:": "Active",
        "Formed in:": "2013",
        "Genre:": "Melodic Death/Groove Metal",
        "Lyrical themes:": "Science, Mythology, Struggles of humanity",
        "Current label:": "Seek & Strike",
        "Years active:": "\n2013-present ",
        "Number of Reviews": 10
    },
    "Band Reviews": [
        "\nIt takes something truly special to pull me out of my writing silence. Orbit Culture have been making quite the stir in the metal scene recently, and I must admit I have no idea under what rock I was living that I didn’t find them earlier. 2020’s “Nija”, the third full length record from the Swedes, established their position as one of the strongest up and coming new names in the industry and many previously poor clueless shmucks (myself included) have had the revelation of their lives when finding the band with that album. But like many, the album barely saw the stage which left our rising stars locked up with their festering misery, which led to the rapid development of further demons to battle by means of angry sounds. Thus enters “Shaman”, the soon to be released 5-track EP, with a reworked aesthetic and tweaked sound to boot, which we will now attempt to dissect before it proceeds to dissect our ears necks and emotions.\n\nFor those that are still under a rock, let me give the ADHD appropriate description of the band. Put Metallica, Gojira, Meshuggah and Septicflesh (the sounds, not the actual band members) in a blender, season with some classic Swe-death flavors and Scandinavian melancholy, make it about brain issues, and wrap it up in the finest modern production to ever be fitted on a death metal record and Voila. As far as Scandinavian melancholy goes, ‘Nija’ nailed that best, both in sound and aesthetic, which is exactly where ‘Shaman‘ changes the recipe. This time orienting their vibes closer to the Equator, the Cultured men from up in Orbit went for a much more tribal feel surrounding their well-defined romps, grooves, growls, and breakdowns. A strong nautical feeling with captivating maritime motifs further accompanies this new tropical witchcraft aesthetic. Got the big picture? Great, let’s get into the details.\n\nThere isn’t a groovier, more headbang-able or infectious band in death metal, PERIOD. Riffs are full of chunky chugs and roaring chords, but still with a strong melodic edge and beautiful harmonies. The bass thumps a lot (that’s it really ¯\\_(ツ)_/¯). Touches of black, thrash and metalcore pop in occasionally to add diversity of dynamics, and the pace is overall set by the drums. The sense of alternating kick-snares with breakdown-esque grooves (and ACTUAL breakdowns) and the blast beat or double kick frenzies is what gives Orbit their unmistakable pace (so mosh-worthy). And then there’s the atmosphere laid out by rich, orchestral, epic, uplifting soundscapes and some particular choices of sound that are all new this time around. Also the harsh vocals are scary and deep, and the clean vocals are James Hetfield but not quite.\n\nOpening track “Mast of the World” is OC at their most dynamic. From the fuzzy effects in the intro and hard hitting main riff/groove, to the blasting pre-chorus and the (hold on to your butts… ) CHURCH ORGAN, in and around the chorus as well as a deep sounding string section in the bridge, this opener might be the greatest shock moment in Orbit fandom history. The following “Flight of the Fireflies” and “Carvings” are already released as singles and structurally these are most similar to the previous album. Some moments in these songs are worth a shout-out though, such as the cymbal play in the chorus of Flight and the tribal vocal melodies in the bridge of Carvings. Both also have insane breakdowns with a low detuned down-slide effect (there’s that little metalcore edge). Coming up “Stranger” brings a much more thrashy pace with some strong battle scream gang shout effects in the chorus. Yes it’s the shortest on the EP. Yes it’s just as loaded as the others. Yes it’s just much faster. And the closing track “A Sailor’s Tale”… I’m not gonna tell you anything about it, because I really really REALLY don’t want to. The surprise I had with this one has to be lived completely un-spoiled, especially if you’re a fan.\n\nWhile Orbit Culture is a band with a bit of recipe, it’s one of those precious cookies yo’ mama used to make that you don’t mind gobbling up in astronomical quantities. And with the changes in tone and aesthetic surrounding every new release, it’s obvious they have paved a long road ahead of them. Yes, I know I’m the pretentious prog schmuck that usually criticizes bands with recipes. Yes I know I’m a hypocrite and I’m breaking my principles. Orbit just does that to you, OK? So let me be a hypocrite, and you’ve probably got things to do than read some doofus’ ramblings on the internet. “Shaman” is out through Seek & Strike, Bandcamp, Spotify, and whatnot. Brace hard for this one, and as always…\n\nEnjoy!\n\nOriginally Written for The Metal Observer\n",
        "\nOrbit Culture’s Nija was a milestone release in the bands catalogue that combined the best elements of their song writing and yielded a masterfully executed album. Rather than resting on their laurels, Orbit Culture had commenced writing a follow up EP to Nija between February and April of 2021 and have now presented their latest offering Shaman. Is Shaman an example of a band striking while the iron is hot, or is it a lazy release of Nija leftovers to whet fans appetites for new material? \n\nShaman is opened by the song “Mast of the World” which begins with ominous guitar effects and electronics before transitioning into a wild ride of heavy riffs and haunting church organ melodies. “Mast of the World” is familiar territory for Orbit Culture and features all the heaviness and orchestration that fans have come to love. Niklas Karlsson’s vocals on this track tastefully transition between growls and melodic singing without following the traditional verse-growl/chorus-sing structure that is employed by so many metal bands. Similar vocal placement is also utilized on the primal sounding “Carvings”, where Karlsson saves his singing voice for its own dedicated section rather than using it in the chorus. This deviation from the traditional formula really works on Shaman because it adds variety to the EP and makes triumphant choruses such as the one on “Flight of the Fireflies” resonate much harder. \n\nThe vocals on Shaman are very well executed and compliment the EP’s impressive collection of riffs and instrumentals. The foot-stomping main riff of “Carvings” has a very catchy, tribal sound to it that will make it a certain crowd pleaser at live shows. The following track “Strangler” also maintains this live show energy and features the bands most anthemic chorus to date with a fantastic guitar solo. The EP’s greatest track, however, is saved for last with the Pirates of the Caribbean-esque “A Sailor’s Tale”. Clocking in at 7:11 minutes, this is the longest track that Orbit Culture has ever released, and it is truly an epic. The orchestration and riffs give the track a grandiose feeling and harken back to the bands debut EP, Odyssey while simultaneously feeling new and fresh. The tracks featured on Shaman are some of Orbit Culture’s strongest material and “A Sailor’s Tale” may be the bands best song yet. \n\nA mere six months had passed since the release of Nija, and Orbit Culture had already returned to the studio to create an EP that picked up right where the album had left off. Rather than feeling like a collection of B-sides and songs that did not make the cut for Nija, Shaman contains five expertly crafted tracks that build on past work and push Orbit Culture’s sound to new heights.\n\n91%\n\nFavourite Songs: Flight of the Fireflies, Carvings, Strangler, A Sailor’s Tale\n",
        "\nIt's been a while since I've listened to a melodeath album that really scratched that itch for me. I've been wanting to get back into the subgenre for a while, so I decided to go to a few different places and see what people have been listening to lately. After at least eight or so songs that just didn't grab my interest, I listened to \"Behold\", and it immediately captured me. \n\nI'd like to preface this by saying that I know nothing about Orbit Culture. I haven't listened to them before, nor any of their other works aside from Nija, so I can't really make any sort of comparisons to the rest of their discography.\n\nNiklas' vocals are quite interesting. His clean vocals sound like James Hetfield, for the most part, and his harsh vocals sound like Christian Älvestam. It's a combination I wouldn't have ever thought of, but it works incredibly well! Even then, he occasionally breaks away from both comparisons, and it sounds just as good. He makes for quite the dynamic vocalist, especially since he doesn't just do the harsh verse/clean chorus structure that so many melodeath bands trap themselves in. I bring this up because, unfortunately, the genre is so oversaturated that it can quickly become stale.\n\nEvery now and then, there are acoustic guitars, pianos, and even some electronics (The latter of which stays towards the back of the mix, so it never sounds annoying or overbearing), and they all sounds quite nice. Any sort of additional instrumentation, aside from the standard guitars, drums, and bass, are used sparingly to enhance the music, and they never overstay their welcome. The guitars, drums, and bass all sound pretty good, though the only real noteworthy thing to say is that they sometimes go into more of a groove metal sound. While one might think of someone like Devildriver to compare them to in that regard, it really doesn't work- and in a way, listening to both of them really does show an 'American' sound versus a 'Swedish' sound. I think I prefer Orbit Culture's take on groove metal to Devildriver, with only three or four songs being exceptions for me.\n\n\"Behold\" is interesting in the fact that it starts off with an alt rock/alt metal ballad sound, but halfway through it goes into a groove-styled breakdown. It's something I can't quite describe in words, you'd have to listen to it for yourself to understand. \"Day of the Cloud\" has a mainstream melodeath/metalcore style harsh verse/clean chorus structure, though it's one of the only songs to do so on the album, and thus actually sounds unique on that front. Even then, the band shows off some incredible musicianship with a clean instrumental break halfway through and a nice groove at the end. Meanwhile, \"Set Us Free\" is a beautiful orchestral instrumental which acts as a near-perfect one minute closer, with its only flaw being that I wish it lasted longer.\n\nThe frustrating thing is that there is no good way to put anything about this album into words. Yeah, Niklas' vocals sound like Hetfield and Älvestam, and yeah, it's mostly melodeath and groove metal, but that isn't even close to all of what this album has to offer. Each song is a different experience, and what might be my highlights might be less of your thing, and vice versa. Sure, it's nothing revolutionary, but I don't really think that there's much that is or can be anymore. Even still, they stand out amongst the crowd for their talent, musicianship, and overall fantastic product in the midst of an oversatured, stale genre which can often be stagnant in what artists do with it. If there's anyone who I'd recommend this album to, it's Scar Symmetry/Solution .45 fans, or people who enjoy Älvestam's harsh vocals but just can't do his clean vocals. Hell, I'd even recommend this to Metallica fans, especially if they're looking for a way to get into melodeath. I doubt that there are many fans like that, but if there's even one, this is the album for you.\n\nI love this album, it's injected new life into melodeath for me, at least for my listening of the genre for right now. I really don't think that this review does it justice in the least. I don't know that anyone can really put this album into words, much less do that well. It's something you'd absolutely have to listen to for yourself.\n\nTracks to Recommend: \"Behold\", \"Day of the Cloud\", \"Open Eye\" (It captures a thrash metal sound incredibly, and if anything, sounds like what Metallica could've and should've been in the 90s, at least in my opinion)\n\nTracks to Avoid: N/A\n",
        "\nWith just over one year passed since the release of their EP Redfog, Orbit Culture had returned to the studio in June of 2019 to begin work on their third full length album Nija. Short time frames between releases, while a positive reflection of a bands work ethic, can sometimes raise questions regarding the quality of the final product. For instance, has the band allowed themselves enough time to produce a fully fleshed out creative output, or are they just trying to release rushed music to make a fast profit? In the case of Orbit Culture’s Nija, a short writing time frame has evidently worked to their benefit as the band has produced one of their most dynamic and well thought out releases yet. \n\nFrom the introductory drum fill of the opening track “At the Front”, the band instantly captures the listeners attention and straps them in for a white-knuckled thrill ride of melodic death metal riffs and anthemic choruses. The following track “North Star of Nija”, displays one of the albums most memorable riffs; a mid-paced, foot-stomping head banger that transitions excellently into the epic chorus section. Tracks such as the Metallica “Sad but True” inspired “Mirrorslave”, and the simple, but effective riff in “The Shadowing” are also stand outs in the riff department although there is no shortage of strong instrumentals packed into Nija. My only criticism with the riffs, albeit a small one, is that some of them can sound a bit muddy at times due to the low tuned guitars. However, this is not a significant issue due to the album’s strong production where the instruments can be heard with clarity much of the time. \n\nOne of the areas where Nija really excels is with its pacing. The track list is arranged where the songs are evenly spread out and the band breaks up the chaos of heavier tracks with the occasional ballad. These softer songs are very well executed and are sung by Karlsson with passion and feeling before adding in distorted guitars and transitioning into heavy segments. The reverse also happens to many of the heavier songs on the album where they are broken up by a well-placed clean/melodic section. Anyone familiar with Orbit Culture’s past work knows that they are no stranger to these melodic passages, and they are executed masterfully on Nija. A strong example is the melodic bridge section of “Day of the Cloud” but the real stand out of the album is on the finale of “The Shadowing”. On this track the band teases a breakdown but then transitions beautifully into a clean guitar break. Horns, choirs, and strings are added in layers to build tension and create a finale of truly epic proportions that is then followed upon by the albums closer/epilogue “Set Us Free”. \n\nAlthough conditions for the heavy metal scene have looked very bleak in 2020 and will continue to look this way for the foreseeable future, Orbit Culture’s Nija is a prime example that the music side of 2020 is as strong as ever. This 10-track offering is melodic death metal executed at a masterful level and is proof that Orbit Culture continue to out do themselves with every release. I would highly recommend listening to this album as well as checking out the bonus track “Wargblod” as it is another fantastic track worthy of attention. \n\n90% \n\nFavourite Songs: North Star of Nija, Day of the Cloud, Behold, Mirror Slave, Rebirth, The Shadowing\n",
        "\nOrbit Culture had undergone some changes during the interim between Rasen and their second EP, Redfog. Guitarist Maximilian Zinsmeister and bassist Christoffer Olsson had departed the band and made way for new additions Fredrik Lennartsson on bass and Richard Hansson on guitar. Although half of their lineup had changed, Orbit Culture persevered, and like the phoenix emerging from the ashes, came back as strong as ever with their new EP Redfog.\n\nRedfog features Orbit Culture’s leanest and most refined songwriting thus far in their career and consists of five new tracks containing some of the band’s best material. Each of the songs on the EP have their own unique sound and can be easily distinguished from one another which was something I felt was a bit lacking on some of the bands earlier work. From the thrash riffs and punishing breakdowns of the title track “Redfog”, to the beautiful string melodies in “The Newborn One”, each track on Redfog is a unique experience for the listener to enjoy. \n\nAlthough each track on Redfog stands on its own legs, there is one element that they all share: an infectious chorus. A prime example of this is the aptly named “Saw”, which features arguably the catchiest chorus the band has ever written fit between sawblade-like riffs and pounding drumbeats. The strength of the choruses on this EP can be credited to the catchy guitar leads and Karlsson’s singing voice which is more prominent than ever before. The track “See Through Me” almost contains singing the entire way through and is a strong demonstration that Karlsson has the vocal prowess to carry a song singing or growling. \n\nWhile singing has taken a step forward on Redfog, make no mistake that Orbit Culture has still maintained their heaviness and aggressiveness from past releases. The final track “Way of the Masses” is worth noting for this reason because it has some of the bands heaviest riffs and does not feature singing until the melodic bridge section of the song. This track is an example that Orbit Culture knows how to pace a song and keep the listener interested by changing up the tone and adding variation to the traditional verse/chorus formula. \n\nOrbit Culture seems to be a band that improves with every release and Redfog is no exception. The band continues to develop and refine its sound and has released its strongest work yet despite having lost half of its lineup. The songs on this EP demonstrate a band that is mastering its craft and leaves no question that Orbit Culture is a rising star. \n\n88% \n\nFavourite Songs: Redfog, Saw, Way of the Masses\n",
        "\nSwedish melodic death metal band Orbit Culture has an impressive level of work ethic having released an EP and a full-length album within less than two years of being a band. In 2016 the group adds to their burgeoning discography with their sophomore LP Rasen and successfully build upon their past works while also proving they have plenty left in their bag of musical tricks. \n\nIf you thought that you had heard it all from Orbit Culture at this point, you would have been pleasantly surprised with album opener “Svartport” which introduces clean singing for the first time in the bands career. That is right, clean singing! One of the issues I had with Orbit Culture’s previous releases was that there was a slight lack of vocal variety to distinguish the songs. The bands decision to include melodic vocals solves this issue and breathes new life into the bands sound without sounding overtly commercial or contrived. Karlsson’s screams/growls are also in top form on Rasen and sound as menacing and powerful as ever against a backdrop of down-tunned guitars and furious drumbeats. \n\nThe instrumentals on Rasen are another of the albums strong points worth mentioning. The band builds upon the orchestral elements incorporated into In Medias Res and utilize horns and synthesizers to create atmosphere and epic soundscapes across the albums ten tracks. One of the many examples of this is seen on the intro to the title track Rasen, where the band uses metallic background sounds and pulsing synths to add ambiance to the guitars and drums. The band also makes good use of orchestration in the chorus of the track “The Haste to the Pyre” to create a chorus that sounds simultaneously epic and melancholy. This is coupled with beautiful melodic guitars in the verses and creates an epic melodic death metal power-ballad that could touch the heart of even the most stoic of metalheads. \n\nThe guitar playing has also been stepped up on Rasen as the band demonstrates that they have plenty of riffs to offer in their arsenal. The opening riff to “Obsession” is very catchy and memorable and “I, the Wolf” is certain to get the listeners blood pumping with its thrashy verses. Guitar players Niklas Karlsson and Maximillian Zinsmeister also show off their skills with many of the albums blistering guitar leads and melodic passages as seen on “The Umbilical Cord”. My only real gripe with the instrumentals on this album, as with some of Orbit Culture’s previous work, is that some of the chugging guitar riffs can get a little bit monotonous at times. However, this is a small concern as these moments are few and far between on Rasen.\n\nWith Rasen, Orbit Culture has taken elements from its previous releases and improved upon them in almost every way. Orchestral soundscapes are woven into each track at a masterful level and create an album that sounds bigger and better than everything that they have done before. The guitar riffs are also as strong as ever despite being able to benefit from a bit more variation however, Karlsson’s clean vocals add an exciting new dynamic to the band’s sound and keep things fresh and interesting. With this release, it is apparent that Orbit Culture have developed a sound of their own and that they are a force to be reckoned with in the world of metal.\n\n82% \n\nFavourite Songs: Svartport, Obsession, Rasen, I, the Wolf\n",
        "\nWith less than one year having passed since the release of their debut EP Odyssey, Orbit Culture have wasted no time in following up with their first full-length album In Medias Res. Clocking in at 38 minutes and featuring a track list of 10 new songs, In Medias Res offers a lot for Orbit Culture fans to enjoy and also experiments with new musical ideas that build upon the sound established in Odyssey. \n\nOrbit Culture’s blend of groove and death metal is on display in full force with this release, and the band expands upon this sound by incorporating orchestration and other instruments beyond just guitars and drums. Experimentation with string instruments is seen on the track “Kalabalik” as well as on interlude tracks “Tribes” and “Arrival”. The interlude tracks are a nice touch to the album and give the listener a moments respite from the barrage of heavy grooves and tremolo picking of the other songs.\n\nIn Medias Res also shows Orbit Culture experimenting with other subgenres of metal and even different genres of music for that matter. A perfect example of this is the track “Aluminum” which has an almost country/folk music sounding segment and, dare I say, djenty riffs in the style of bands such as Periphery and Born of Osiris. Although this may not be a metal purists cup of tea, the experimentation and ambition are admirable and make for a unique and, in my opinion, enjoyable listening experiencing. \n\nAlthough Orbit Culture has taken steps forward in experimenting with new sounds, this albums only short coming is that the band tends to lean on a lot of groovy/chugging/tremolo picking riffs that can sound a bit similar when listening to the songs back to back. As mentioned earlier, the interlude tracks do a good job of breaking the songs up, but it would be nice to see a little bit of further development in the riff department and maybe the inclusion of a guitar solo every now and then. \n\nIn Medias Res is a step in the right direction for Orbit Culture and it signifies a band going through the growing stages of developing and refining its own unique sound. The groups use of orchestration and inspiration from other metal subgenres expand upon the ideas introduced in Odyssey and display a more ambitious approach to song writing that shows a lot of promise for the future. A slight lack of variety with some of the album’s riffs hold it short of being a leap forward, but In Medias Res is nonetheless a strong indicator that Orbit Culture is on the right track for success. \n\n78% \n\nFavourite Songs: Kalabalik, Obscurity, Aluminum, Automata\n",
        "\nOrbit Culture’s debut EP Odyssey is a five-track collection of groove-oriented, melody-infused metal songs with some death and thrash metal undertones. With a name like Odyssey, certain expectations can arise regarding the epicenes of the music. Does this EP live up to its title and feel like an epic adventure or does it fall flat and feel more like a tedious errand? \n\nThe title-track Odyssey certainly lives up to its name as it features a memorable guitar hook and a beautiful melodic section that feel like the soundtrack to a heroic journey. Opening track The Planck Distance is another strong song that captivates the listener instantly with its groovy, Gojira-esque riffs and soaring lead work. Arguably, the EP’s strongest riffs, however, come from the following track Wildfire that feature a bit of death and thrash influences as well as some crushing breakdowns. \n\nThe strong instrumentals on this EP are accompanied by a solid vocal performance from lead guitarist/vocalist Niklas Karlsson. Karlsson’s screams have a lot of body and depth to them and they suit Orbit Culture’s music well. However, as the EP progresses, a slight lack of vocal variety starts to become apparent and this drags the EP down a little bit when listening to it from start to finish. Thankfully, this is not a significant problem as the EP is approximately only 19 minutes in length. \n\nOdyssey is a strong debut by any band’s standards. The EP displays strong musical ideas and skillfully mixes melodic sections with heavy down tuned guitar grooves. The vocal performance could have benefited from some diversity, but this does not hurt Odyssey significantly thanks to the strong instrumentals and riffs. Overall, Odyssey shows that Orbit Culture has a lot of potential and that metal fans should keep a close eye on this band. \n\n75%\n\nFavorite Songs: The Planck Distance, Wildfire, Odyssey.\n",
        "\nOrbit Culture are progressive melodic death band from Eksjö, Sweden. Orbit Culture is a four piece band with Niklas Karlsson handing vocals as well as guitar, it is also worth mentioning he is listed as the songwriter and lyricist. Fredrik Lennartsson is on bass, Richard Hansson handles the lead guitar and last on the band list is Christopher Wallerstedt on the drums. Niklas is the only founding member, the rest of the band has joined relatively recently, Fredrik and Richard joined in 2017, and Christopher joined the band in 2019. \n\n2020 has been an absolute shit show so far, however it has been arguably one of the greatest years in terms of releases for heavy metal. With Nija Orbit Culture are looking to strengthen and add their names to that list. If I were to get someone to check this album out I would simply start with the comparison of a band that is Metallica meets Gojira, that may sound like high praise for a band that is just starting to achieve mainstream success, but allow me to explain.\n\nOrbit Culture show with this album why the hype surrounding the band is warranted. It has everything a person can want from a metal band, let's start with the damn near perfect guitars, and yes they even successfully pull of the Gojira-esque pick scraping. They set the stage on fire and continue dumping gasoline into the fire, non stop action. Drumming in my opinion is arguably the most important piece for a band, it is the backbone, and Orbit Culture clearly have a backbone made out of titanium. Vocally the bands screams are fucking phenomenal, and you couple that alongside a young James Hetfield sounding cleans, it's a perfect mixture. I will say I personally enjoy his screaming way more, in my honest opinion the screams may be some of the best in metal to date.\n\nNija has serious tone, its lyrical theme tackles many issues that are currently plaguing planet earth. I will always enjoy an album that tackles serious issues, as I believe metal is about telling these things in true meaningful lyrics. 95/10 is a very fair rating in my opinion, especially as this album will be contending for album of the year.\n",
        "\nThe Gothenburg melodic death metal craze of yesteryear has seen a fair number of interesting offshoots, perhaps none more visible than the commercialized melodic groove metal that became all the rage in the late 2000s, coalescing around a sound heavily informed by the post-Clayman studio work of In Flames. One would be remiss not to note the popularity of several other noted Swedish acts such as Sonic Syndicate, their more stylized continuation The Unguided and Solution .45, each providing a largely formulaic product that’s tailor made for rock radio, yet not without a certain degree of charm. There has, naturally, been a darker and more forbidding side to this coin that leans a bit more closely towards the thudding heaviness of a number of American groove acts like Lamb Of God and the industrial styling of Mechina, and it is from this wellspring that Eksjo’s own Orbit Culture flows.\n\nHaving originally formed in the middle of the previous decade, this outfit basically carved out a curious niche of older 90s groove metal and industrial underpinnings of Ministry and Fear Factory and married it to the post-Gothenburg craze of their day, resulting in two solid yet largely unsung studio LPs. As the 2010s drew closer to a conclusion front man and guitarist Niklas Karlsson would see all his original band mates jump ship, being replaced with a trio of relative newcomers to the scene, but this would not see a significant impact upon the band’s overall sound, as Karlsson proves himself to be the most consequential and noteworthy part of this equation. This isn’t to say that the rest of the band doesn’t bring their “A” game to this outfit’s 3rd studio outing Nija, but more so that Niklas’ unique blend of ferocious death barks and gritty, Hetfield meets Chuck Billy yet tuneful gruff vocalizations is what makes it truly distinctive.\n\nThough of a generally moderate length and featuring an assortment of songs that shy away from breaking the 6 minute mark, this album proves to be an engaging and surprisingly varied excursion into the cold, metallic world of industrialized groove metal. The mixture of mechanized yet frenetic drumming, pounding low-pitch guitar grooves and occasional thrashing riffs and multifaceted vocal work contains occasional flourishes of latter day Nevermore, minus the overt technical noodling, but more often than not the presentation here tends to cross paths with the likes of French acts like Gojira and Dagoba, having more of an atmospheric aesthetic that blends seamlessly with the more repetitious and harsh moments. The shifting of moods in the music itself tends away from the generally monolithic heaviness of Lamb Of God, though when things are at full blast comparisons to said band’s recent handiwork are difficult to avoid.\n\nWithin this diverse melee of auditory violence, there are a few recurring formulas that make for a cohesive listen, and occasionally give the impression of a more formulaic album underneath the surface. On one end of the spectrum are a number of longer and more nuanced offerings such as the quasi-balladry turned pile driver aggression of “Behold” and “Rebirth”, and a couple of similarly slower yet more militaristic groove machines like “Nensha” and “North Star Of Nija” that express the duality of consonance and ferocity without the quieter moments. However, the truly gripping moments that make this album work are the faster and more consistently rugged offerings such as the Lamb Of God-inspired punch of opener “At The Front” and its twin and album closer “The Shadowing”, balancing busy riff work with some solid chorus hooks indicative of this band’s melodeath underpinnings, while this album’s leadoff single “Open Eye” stands out even more by laying on a chaotic thrashing riff assault accompanied by an eerie keyboard presence that brings things dangerously close to the most brilliant moments of Fear Factory’s Demanufacture.\n\nIt’s a curious and sometimes confounding path that this album walks between subtlety and also being about as unsubtle as a 2-ton anvil to the skull, but Orbit Culture carries it quite well and delivers a consistent package here that rivals the more experienced adherents to the industrialized side of the groove metal coin. If there is any flaw in the presentation here it is that the band doesn’t quite exploit the lead guitar contingent of their formula to the extent that they really could, and rely a bit more on repetition and shifts in timbre, resulting in an overall listening experience that feels a tad understated. The few moments Richard Hansson throws in a couple of intricate lead lines, such as the wah wah solos that filter in and out of “Open Eye”, their sound gets that little extra something that makes it all the more satisfying. But as far as bands that trudge the polluted ponds surrounding the abandoned factories of the metal world go, one could definitely do a lot worse.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n"
    ]
}