{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Washington, D.C.",
        "Status:": "Active",
        "Formed in:": "1971",
        "Genre:": "Doom Metal",
        "Lyrical themes:": "Doom, Occultism, Death, Love, Society",
        "Current label:": "Peaceville Records",
        "Years active:": "\n1971-1972,\n1972  (as Macabre),\n1972-1977,\n1978-1979,\n1983-2005,\n2008-present ",
        "Number of Reviews": 72
    },
    "Band Reviews": [
        "\nIn the metal underground there are few bands more respected than North Virginia's own Pentagram. With a history of recordings and releases all the way back to 1971, multiple break-ups, at least three name changes, and a lineup best described as a revolving door, they really are the little metal band that could. I even consider them the first North American metal band as opposed to the likes of Sir Lord Baltimore who, while predating the band, I count more as hard rock/proto-metal ala Led Zeppelin or Uriah Heep. They are also arguably the first doom metal band assuming of course you don’t consider Black Sabbath as such because you’re a fucking weirdo.\n\nThe first noticeable aspect of this album is, of course, the legendary guitar riffing of Victor Griffin. With a guitar tone thicker than concrete and enough doom riffs to make Tony Iommi jealous, there’s not much to say other than “Unga Bunga Me Like Riffs” but god damn the opening of All Your Sins is just too fucking good.\n\nJoe Hasselvander and Martin Swaney compose the rhythm section playing drums and bass respectively and they do a great job. Joe is a great drummer as shown not just by his time in this band but also his 30 year stint in NWOBHM legends Raven. Meanwhile Swaney certainly exists. He’s a bassist, what do you want from me? He gets in, gets the jobs done, and gets out in time for dinner.\n\nHowever no conversation about Pentagram is complete without the living medical miracle that is Bobby “Fuck Keith Richards, how the hell is this guy not dead?” Liebing. The band’s only constant member, founder, and main creative force. With a Ghoulish stare and a vocal style that’s equal parts Macabre, Sinister, and Relentless he’s one of Metal’s most underrated front men and I hope he lives long enough to make it through the 50th anniversary tour the band are supposedly doing later this year.\n\nThe songs themselves are a front to back assault with not a weak track among them, however my personal favorites are Sign of the Wolf, Death Row, and 20 Buck Spin. Honestly at this point Sign of the Wolf has transcended whatever meaning they meant it to have when writing it and now stands as a testament to Bobby as a whole. “A lone soul at night sits and bays at the moon/Though sometimes he's a man it's a Pentagram” and “And to end his life though the silver is old/He will reach his goal by the Pentagram” sums up his career and you can’t convince me otherwise.\n\nHonestly the only two complaints I have with this album are the time in which it was released and that it’s not my favorite Pentagram release, my favorite is actually the First Daze Here compilation, but I’m not gonna hold that second one against this album. The problem is simply that this album was released originally released in 1985. While the band may predate basically any band in the genre not named Black Sabbath, by the time this album finally dropped there were plenty of other bands playing music that they pioneered. NWOBHM doom legends Witchfinder General had already come and gone, Cirith Ungol had dropped King of the Dead a year previous, Saint Vitus would drop their second album the same year as would Trouble, and then Candlemass would put out their genre defining debut the very next year so Relentless just got lost in the mix which is truly a shame. Especially since they easily could’ve beaten them all to market having been originally signed to Colombia records all the way back in the early 70s but that wound up falling through as the label would call them “The hardest band we’ve ever had to work with!” For more context I HIGHLY recommend the Last Daze Here documentary from 2011 where the original member Geof O’Keefe describes the experience. They also got to have a disastrous audition for Paul Stanley and Gene Simmons of Kiss back then just to add to the bad luck.\n\nAt the end of the day this is easily one of my favorite albums of all time and I cannot praise it enough. A lightning in a bottle that even the band themselves would fail to recapture on their subsequent, yet still very worthwhile, releases. It belongs in every metal collection. Hell, album closer 20 Buck Spin was influential enough to inspire the name of one of metal’s best underground labels so it’s worth checking out for that if nothing else. Pentagram are eternal and as Bobby says when closing the album “I ain’t got time for a rival, oh no!”\n",
        "\nJoe Hasselvander apparently had enough of Liebling after they finished their two decent LPs and decided to leave for greener pastures (AKA his solo project, Hounds of Hasselvander). Undeterred, singular constant member and vocalist Bobby Liebling got together with Internal Void's lineup for yet another Pentagram album.\n\nPentagram is a doom metal band first and foremost. Perhaps you could argue that their secondary genre label is stoner rock, but who asked for a whole Pentagram album of 70s retreads? That's what this album basically is! By this point, Pentagram had re-recorded/rereleased all their good 70s stuff, so they're really scraping the bottom of the barrel here, packing out this album's tracklist with B and C grade stuff from 30 years ago. The original song Elektra Glide isn't much heavier, so mostly all we have here on a whole is a softer, neutered Pentagram. Even the production is way less heavy than the last two albums, solidifying that this is truly the intended course Liebling was trying to make the band run.\n\nI just don't understand why they thought this was a good idea. It's not bad, since every note is in tune and there's no objective production flaws. In fact, the bass tone is really thick and nice on here, it's reminiscent of Dave Ellefson's on Peace Sells by Megadeth. A couple 70s songs like Starlady and Catwalk shine through as pretty good based on sheer songwriting/riff power, but the 70s versions are better because young Bobby had a much better voice back then. On here, he's similar to how he was Review Your Choices, and by that I mean he's sometimes drawled out, which is almost comical and lessens the material significantly, but at other times he's pretty normal sounding. One shining moment of his (and the album's) is the other original/new song City Romance. He goes as hard as actually screaming on this one, and he really commands the mic during the singing parts Last Rites-style, and I mean that in a good way because I actually like that album.\n\nThe only things I find worthwhile on Show Em How are the two Carmichael/Liebling originals City Romance and Elektra Glide. 80% of the stuff on here has already been done and was done better in the 70s. Since 2006's First Daze Here Too now exists, Show Em How no longer has a reason to. Get all the enjoyment this album has to offer and more by listening to the First Daze Here collections or bootlegs like Human Hurricane. Only for diehard fans.\n",
        "\nDay of Reckoning is Pentagram's second album, made just two years after their esteemed 1985 debut. I've been sticking to reviewing their later albums because the first three LPs from this band are classics, so what else can or should really be said about this one? Well, I'll tell you right now that this is my favorite Pentagram album, and I'd go so far as to say it's one of the greatest doom albums of all time.\n\nThis album was originally released with a different mix and tracklist. When the first two LPs were reissued under Peaceville Records, the debut was renamed Relentless and Day of Reckoning's drums were redone. While Relentless was generally improved due to its remaster and reordering, I can't honestly say the same benefits were applied to Day of Reckoning. On the reissue, it sounds as if Joe Hasselvander used the same kit as on Be Forewarned. The drum tracks are well-done and well-produced, but in my opinion, do not fit the mix quite right, seeming to float in a separate aural space. The drums on the original version were just fine in my opinion, they sound consistent with the rest of the mix. The tracklist on the reissue was also switched around, and again, I must reiterate that the original is better. The flow of the tracks on the original version, starting with the title track into Broken Vows and ending with Evil Seed into Wartime, is impeccable. All in all, the album isn't hurt too much by the changes but I highly, highly recommend that you track down a copy of the original mix, because the drums fit, everything sounds a little more analog and real, and the tracklist flows much better.\n\nWith that out of the way, let's discuss the content of this release. This is prime traditional doom delivered by one of the genre's pioneers, and they know exactly what they're doing. Every song on here is great, but satanic epic Burning Savior and the Sabbath-worshipping duo Evil Seed and Broken Vows shine especially bright. One positive change of the reissue is that Broken Vows got a harmony lead guitar track, which I must admit does enhance the impact of the solo. \n\n70s tracks Madman, Day of Reckoning, and When the Screams Come appear here in all their bluesy, gloomy glory. They're doomified impeccably, and fit into the tracklist perfectly. When the Screams Come is one of the greatest proto-doom songs ever written and I'm glad Bobby was able to vocalize a great rendition of it on here before his voice changed. \n\nOne drawback to this album is that there's less songs than Relentless and Be Forewarned, but the songwriting on here is super strong. There's not a single skippable moment on here, not one song you'll wanna miss. There's also not a lot of fat on the songs, either. No time is wasted with songs about sexy vampires or anything like that. There are no filler tracks and no filler passages within these songs. Although Burning Savior does rely heavily on a certain chromatic riff towards the end, it is done quite epicly and uses satisfying effects to make the passage more exciting.\n\nDoom metal is often pigeonholed as slow, brooding, and sad. But this album actually is quite dynamic with its pace. The title track is downright upbeat, so is Madman. Evil Seed and When The Screams Come are the two slowest tracks and they milk the shit out of that aspect (in a good way). Otherwise, it's pretty mid-paced for the most part.\n\nBobby is in top form on this album. He doesn't put on quite as good of a performance as on Be Forewarned, but he definitely sells it. Victor Griffin gives us catchy riff after catchy riff, and plays some sizzling solos, with Burning Savior being the highlight of his lead guitar work. Martin Swaney plays with a nice trebley bass tone which sits nicely in the mix and is hearable on every song, but noticeable especially during a couple Geezer-esque melodic fills. The original drums sound good, as stated previously. I won't say they sound amazing, since they're a little thin, but they're certainly not bad enough to have been redone. It really sucks that they wrote Stuart Rose out of Pentagram history by removing his drums because he plays with a lot of personality and does a great job.\n\nNeed more be said? This is top shelf 80s doom metal right here. It's not just solid, it's masterfully crafted. Some point to the archetypal doom on Relentless as Pentagram's apex, while others prefer the heavy production and tasty riffage on Be Forewarned. I love those albums too, but they've got their flaws, and it's so very hard to find any in Day of Reckoning.\n",
        "\nSub-Basement is the second collab-era LP from Pentagram, which at the time was sporting only drummer Joe Hasselvander and vocalist Bobby Liebling among its ranks. It is a very similar release to the duo's previous LP, Review Your Choices. One thing that's immediately, clearly different is that the production on here is much less huge and heavy. It's still doom-oriented, but compared to the previous release, Sub-Basement sounds far less fat.\n\nFor the most part, Sub-Basement is dripping with a creepy atmosphere, which is unlike the normal spookiness Pentagram tends to bring. Buzzsaw and Go in Circles both thrive on this vibe. This album gives you the feeling that you're trapped in a dungeon with a crazy old hippie. The band sticks to this creepy, burnt-out atmosphere for the most part, and it is quite effective at boosting the merit of the album's otherwise just decent songs.\n\nHasselvander still handles the entire rhythm section on this LP, and just like before, his lead guitar playing isn't super great, but it at least services the burnt out atmosphere of the album. Bobby sings quite creepily for a lot of songs but he's especially good on Go in Circles. He's not amazing or anything, but it sounds like he's putting more effort into his vocals this time around. He sounds a lot more threatening and in control of his voice. I also believe his vocals are better mixed than on the previous album, often with what sounds like a tape echo effect. \n\nLike I made pretty clear before, this album doesn't really have any masterpieces. The songs on here are all fair to good, whereas predecessor Review Your Choices has what I'd call peaks and valleys. Tidal Wave is a highlight for me. It's an otherwise pretty standard doom song, but it utilizes ocean wave noises quite well, I find that they really enhance the song's atmosphere. Drive Me to The Grave is another highlight, it features what I'd call fast doom metal, something like Mow You Down from the previous album, only better. After The Last is a good slow, brooding song, like something off their third album. My favorite song on here is Go in Circles (Reachin' For An End). It operates at the apex of this album's atmosphere and features Bobby at his best, at least by this album's standards.\n\nSub-Basement relies on new material mostly, which I admire, but as a result, it plays like a version of Review Your Choices without the 70s classics. Mad Dog and Out of Luck are the only 70s Pentagram songs on here, and they're so out of place. Mad Dog breaks the album's creepy atmosphere for a more \"rockin\" vibe which does not meld well. Bloodlust has that same \"rockin\" feel to it as well, but only during the chorus, so it's not as huge of a sin. I don't wanna say that these are bad songs, but rather that they stand out, since they're without that dungeon-esque feel.\n\nSpeaking of not fitting, Sub-Intro is a 4-minute atmospheric track which supposedly is the intro to the album's title track. It could have just been cut entirely because it doesn't even perform its function as an intro, it just plods on for 4 long minutes with rattly chain noises and whatnot. Like I said before, the atmosphere of this album is important, but it's not worth wasting 4 minutes of perfectly good space on ambient noise!\n\nI think that this album truly suffers because, and I'm theorizing here, they probably used up a bunch of great tracks for Review Your Choices, so when it came time for Sub-Basement they didn't have as many quality songs to fill it out. It's a shame really, because if they had planned out the tracklists for both albums to incorporate a good mix of songs, rather than giving so many good ones to Review Your Choices, we'd have two solid B-tier Pentagram albums rather than the imperfect ones we got. I would say personally that Review Your Choices's heavier, fatter production and better 70s material means it scores more points with me than Sub-Basement, since both have a creepy/burnt out atmosphere but the latter only has merely decent songs for the most part. If you wanna listen to this album, my advice is to make a playlist of both collab-era albums and put it on shuffle. While Sub-Basement is competent and consistent, it is the lesser of two evils.\n",
        "\nLast Rites is the worst Pentagram release according to many. It was released alongside the rockumentary Last Days Here, which exposed the band (mostly Liebling) Some Kind of Monster-style. One would think Liebling would give us 7 years worth of goodness to accompany the movie, but this album, like the other 21st century Pentagram albums, is just alright, though it's honestly better than you might expect.\n\nI must admit, track one is one of the bad tracks. Treat Me Right is lyrically lazy, and with such a basic riff, it's leaning hard on the vocals to pick up the slack, so the bad lyrics really stand out. The next two songs are both alright, but the first undeniably great song is track 4, titled 8. It starts out with a reverb-laden clean section before breaking down into a big and heavy doom riff. It incorporates what I would call stoner rock riffs too, but there's a definite doom emphasis on this track. It even features those great mysterious Victor Griffin lead guitar harmonies! The best track is album closer, Nothing Left. Liebling sings this one quite well, and the riffs absolutely bang, so it's definitely a highlight.\n\nWe get a couple 70s era songs on here too. Everything's Turning To Night is actually very well performed and fits right in. Liebling pulls together a great vocal performance for it, which I was legitimately impressed by, and Griffin's guitar leads are sizzling hot. Windmills and Chimes is a little out of place but features another great Liebling vocal performance. I think they could have done a more heavy version than this, but this release is supposed to celebrate all eras of Pentagram, even the hippie years. If it really celebrated every era they would have done a full rendition of All Your Sins instead of that short snippet at the end, weird that they even included that.\n\nI must mention one particular moment on this album, and that's when Victor frickin Griffin takes the mic on track 7 and sings the shit out of the song American Dream. Kind of makes me wish for more Pentagram classics sung by Griffin instead of Liebling. Though that's unfair to say in this case, because, as I may have hinted at before, I don't think Liebling is so bad on this album. He puts on a great performance for many of the songs, better than Show Em How and even Sub-Basement. His voice is definitely the new drawly one but he has such a good command over it and it's well-produced. The whole album is produced nicely come to think of it, with well-mixed, doom-focused production a la Be Forewarned.\n\nSince this album has a couple bad/filler songs on it, I can see why some say it's the worst one; however, I actually find it quite decent on a whole. I'd even go as far as to deem it my favorite post collaboration era Pentagram release. Liebling is good enough and even great at times, the riffs are all good to great as well, and Griffin plays many memorable solos. I find it to really be the comeback album it claims to be. This sounds like classic Pentagram to my ears and it's all done quite well for the most part. It should be regarded more highly in my opinion.\n",
        "\nTo many, 2011's Last Rites was a disappointment as far as comebacks go. But I'm not one of those people. I was more disappointed by their 2015 album, Curious Volume. What a curious volume it is! I was expecting doom-oriented material with huge production, but that's not quite what I got. Alas, Pentagram made a record which doesn't focus on doom metal, but rather on doom's chiller brother, stoner rock. One could say they're going back to their roots since, as we all know, Pentagram was started as a gloomy psychedelic/stoner rock band. However, I find that their 70s material is a lot better than what's on here, and Curious Volume doesn't even come close to touching the greatness of the first three Pentagram LPs.\n\nThe title track, thankfully, rocks pretty damn hard and has a great intro which sets a nice, gloomy mood, one it manages to uphold for the entire song. Sufferin' and Devil's Playground are two of the few tracks on which doom legend Victor Griffin is allowed to ball out with some of those classic filthy blues guitar riffs and solos this release had me starved for. Because I Made It, the closer, is probably my favorite of the bunch because it contains great solos, doomy riffs, and very effective clean parts.\n\nMost of the other songs on here are not doom. This album only gets truly doomy for less than half of the songs! And unfortunately, the stoner rock tracks simply aren't that great in my opinion, other than Earth Flight, a reworked '70s Pentagram track which shares lyrics with its gloomy cousin Change of Heart from Review Your Choices. It's really a shame because I know this band is capable of turning out some absolutely killer stoner rock tracks, just check out the First Daze collection or Human Hurricane to see what I mean.\n\nDespite weak songwriting, the instrumentalists all do a pretty good job. Griffin doesn't have very many good riffs to work with, but plays the shit out of them regardless. He only plays a couple memorable leads, though. The bass is a little bit drowned out in the mix because the guitar is so huge, but it is hearable and has a couple nice moments like on Earth Flight. The drums are also well done, but never really have a stand out moment.\n\nNow it's time to mention the elephant in the room, Liebling's vocal performance. It's bad. Lackluster was apparently not enough for just a single track though! They double tracked his vocals, making it all the more apparent how shot his voice is. I love Bobby just as much as the next guy, but he's easily the weakest link on this album, and that's saying a lot because the majority of the stuff on here is merely decent to begin with. His voice just isn't there anymore, and it only really works on Devil's Playground and perhaps Close The Casket. It's not a true Pentagram album without Bobby, but I am damn sure that someone else could have nailed his vocal parts.\n\nIt at least can be said that this album was a good try. None of it is really that bad, but it really isn't super great either. I will say that it is definitely better than Show 'em How. It's comparable in quality to the collaboration-era albums Review Your Choices and Sub-Basement, but it's way less doomy. I think my score might be a little tainted by my expectation that Pentagram would deliver another solid doom album like Last Rites. Despite the fact that it's mostly rock, I'm not all that mad at it. At the end of the day, it's another average modern album from one of metal's legendary pioneers.\n",
        "\nPentagram broke up some time after their third album, leaving behind only Liebling and Hasselvander, who chose to continue creating music together under the same name. This is the first of two \"collaboration-era\" albums by the band, in that Liebling is on vocals, (for better or worse) and Hasslevander is on literally everything else. The album which resulted wasn't really that bad, but was also not quite as good as the first three are.\n\nThe rerecorded oldschool Pentagram tunes are nice to hear, and are mostly there as a result of the band wanting to record official versions of tracks that were present on the prolific bootleg Human Hurricane. Fan favorite Forever My Queen is on here, as well as Living In A Ram's Head, Review Your Choices, and more. They're treated pretty well musically speaking, with doomified arrangements and huge-sounding production. Forever My Queen's earlier versions, though less doom metal-oriented, I find more enjoyable than this version, mostly due to their frenzied psych-rock guitar solos, (I'll speak more on this album's lackluster lead guitar soon). However, the double kick drum on this album's version does add a nice heavy metal touch to it, and it features a few new lyrics which are two new things not present on the older recorded versions.\n\nBobby tries his best to deliver a strong performance but comes up short more often than not. This is partway through his vocal transformation, so at times he sounds like 80's and 90's Bobby but at others he sounds like post-2000s Bobby, all drawled out and such. I guess I would call this an inconsistent, but not terrible vocal performance, something marginally passable. It often sounds like he's not even trying at all, so it's a miracle Hasslevander got him to record for two whole albums. While most of Lieblings solo writing contributions exist on here as re-recorded old tracks, they're doomified enough to fit right alongside the collaborative tracks.\n\nHasslevander plays the drums, his main instrument, just fine on this album. Exceptionally, even. His bass and guitar skills, while most certainly decent enough to handle the rhythm section, are lacking in the lead department. Most of the time, his lead work is reminiscent of, but not quite as good as former guitarist Victor Griffin's style. Griffin's trademark harmonies helped make the first three Pentagram albums classics, and his command of the axe was integral to making the first three albums as great as they were, which could be a reason I don't find this album as good as its predecessors. Hasslevander doesn't really play anything very technical while playing lead, and this fails at least this album's version of Forever My Queen, which originally relied heavily on a long, frenzied ending solo. He tries his best though, and the leads are in fact doomy, despite not being super impressive.\n\nHasslevander co-wrote the new songs with Liebling. Gorgon's Slave shines as a highlight of Hasslevander's riff-writing, it features this great downtempo riff consisting of a couple power chords with strummed arpeggios, and it's just undeniable. The heaviness and great structure of this track manages to impress despite its weak lead guitar and vocal performances. It also picks up in the middle and gets nearly thrashy, a style which is also present on Mow You Down.\n\nNew song I Am Vengeance, despite being heavy and having a couple cool parts, features Bobby sounding like a crackhead from the southern US going on a rant for most of the runtime. It's ultimately too slow and unchanging to be anything special. I can't believe it's only about 6 minutes long, it feels so much longer because it's really so boring for most of it. They accomplished everything this song was going for way better in the album closer Megalania, which features heavy as fuck riffs and actually quite good lead guitar sections. It's a force to be reckoned with, sounding like a more burnt out version of Be Forewarned from their third album.\n\nLast but certainly not least, the production is fucking massive on this album. The drums sound just right. When the guitar and bass sync up, they are mixed to create a giant crushing wall of doom that could make any bluesy riff fat as hell. The mixing and mastering jobs for this album and its sequel, Sub-Basement, are the main attractions from this era of the band my opinion. It enhances the hell out of otherwise pretty decent tracks. My rating is as high as it is because I believe they did the perfect job making this handful of tracks sound as big and powerful as they could, despite technical limitations in the vocal and lead guitar department. One thing you can say about this release is that it definitely still sounds like classic Pentagram, even though half of the classic lineup is missing. While the tracks themselves don't feature the best songwriting to ever grace a Pentagram release, they are performed well enough and sound fucking great. They did the best they could, and it's certainly nothing to scoff at.\n",
        "\nPentagram further embraced heavy metal by time they re-emerged in the 80's, since self-titled, a.k.a. Relentless has got more emphatic metal riffing than anything featured on the First Daze Here rehearsal demos (I hope I will be forgiven for bringing up the compilations as source material since they're my only exposure to the music, being a younger fan). However, what they followed it up with in 1987, the 34-minute LP Day of Reckoning, introduced the sound that makes Pentagram a relevant band to this day (you have bad taste if you don't think they're still relevant), by actually regressing a bit to their 70's self but with more Master of Reality type heaviness. This album right here is essential doom structured concisely and perfectly. It's the perfect metal album all around and astonishingly accessible. Before I dive into the songs here, I've also got to say that Day of Reckoning is the sheer proof that doom metal substantiates much more of the formative years of now standardized metal subgenres than anyone gives it credit for - this is, along with Candlemass, Trouble, and Saint Vitus albums released around this time, the culmination of 80's doom. I recall some 50 year old groove-thrash knucklehead once telling me doom metal wasn't a known thing in the metal world till the late 90's, and Type O Negative was this guy's idea of a doom band. That's hilarious because I don't think Pentagram would be writing songs like \"Evil Seed\" with such burnt out delivery and ominous melodies if they didn't know they were onto something yet. The Skull existed by 1985 for crying out loud and \"Pray For the Dead\" sure isn't USPM. And for god's sake, Candlemass' first album from 1986 literally has doom metal in the title.\n\nSo yeah, the songs on Day of Reckoning, they've got balls! The title track is really an intense, driving banger that makes one \"review (their) choices\" in life, so to speak. It's really proof of how no one understands doom metal, because that song is forth-charging in a way that projects slothiness without actually being really slow at all, thanks to the power chord battering ram of Victor Griffin's riffing in between Bobby's vocal lines. Not to mention, the melodies in the bridge are doom as fuck. \"Evil Seed\", though, as mentioned above, is where the album slows down for the first time, having a typical early Sabbath riff during the intro and chorus, but being entirely bass and drum-driven during the verse. Again, the doomy melodies shine through much more than on Relentless, lending an introspective feel to the music. \"Evil Seed\" seems so have lyrics concerned with being led on by a woman only to be manipulated or dumped, which suffice it to say was relatable in my high school days.\n\nThe take home point of the latter paragraph is that the album opens with a damn fine one-two punch, but delivers yet another duo of fantastic doom standards in \"Broken Vows\" (which seems to be about moving past strife such as that brought up in the previous track) and \"When the Screams Come\", one of the band's oldest songs but once again defining doom metal further this time around. \"Burning Savior\" is of course the fierce centerpiece here, and it's a lot of people's favorite Pentagram song. You gotta love Bobby's downcast vocal delivery during the refrain on this one, and once again Victor's riffs are total slugs that pack a massive haymaker of a punch. Martin Swaney is also a better bassist than most would give him credit for, and drummer Joe Hasslevander is an unsung hero all around (though apparently some other guy recorded drums for a couple tracks on some versions of Day of Reckoning, I forget the exact details). Oh, and \"Wartime\" is the stoic closer every classic metal album needs of course. \n\nFUCK. Again, I'm a youngin, so I'm reviewing the now-standard reissued track-listing. It wasn't always this way, though. If I remember correctly, \"Day of Reckoning\" was still the opener on the original issuing, but \"Evil Seed\" was way later on in the album. \"Madman\" was weirdly stuck in the middle of the record too. So yeah, the reissued track-listing is better paced but all the songs here are excellent, bar-none ESSENTIAL doom, so it doesn't matter too much how you organize them, as listening to the Turn to Stone compilation from Peaceville Records reveals. That CD has a lot of their best songs on it, and it starts with \"Petrified\" from Be Forewarned which is a mid-paced deep cut.\n\nNow, I've already essentially said this, but it doesn't really get any better than Day of Reckoning musically. Review Your Choices is generally doomier and heavier (and my #1 favorite), while Be Forewarned is a hell of a lot more varied and complete, perhaps even more creatively bright, but Day of Reckoning is just it, man. You need this record and you have no excuses for not owning it that aren't related to finances. It's accessible. It's doomy. It's good.\n",
        "\nRecorded at \"The Keg\", in 1978, yet re-issued in 2003 under Italy's Black Widow Records, Pentagram's A Keg Full Of Dynamite represents transition period which saw the American doom act progress from all-out heavy blues rock into rather metallic, edgier incarnation, eventually yielding 1980s/90s gems such as Relentless, Day of Reckoning and Be Forewarned. If anything, it also transpires as sole instance where Pentagram subsisted as dual guitar quintet, with Richard Kueht and Paul Trowbridge handling axe duties. (Standard members Martin Swaney and Joe Hasselvander complete this unique line-up.)\n\nWhile most 70s daze tracks are readily reprised - top commemorative highlights \"Living In A Ram's Head\", \"When The Screams Come\", \"Day of Reckoning\", \"Review Your Choices\", \"20 Buck Spin\" and \"Earth Flight\", among them - B cuts \"Madman\" and \"Maddog\" (\"Mad\" everything, what!) are complimented by true oddity in the weirdly differing-from-its-original \"Much Too Young To Know\". Whereas the Human Hurricane compilation's version featured insane lead-off minor pentatonic soloing seeming to go forever, alongside frantic high-wire drumming, this here feedback laden, swampy bayou-burnt edition adheres to greatly jiving or kinetic, helter-skelter guitar lick à la early Black Sabbath, compounded by snare-heavy thwack job and front ham Bobby Liebling's slackly vaunted vocal hijinks, which somehow remain very low in the mix. (Despite his rangy and gruff demeanour, it shows a lifetime of drug abuse hasn't yet fully taken its toll!)\n\nThe whole show, minus sparse High Voltage renditions of \"When The Sceams Come\" and \"Living In A Ram's Head\", sounds recorded in some gloomily smoky New Orleans or Biloxi dive-bar; at times, we hear the crowd cheering the gang on, and there's always a pervasive sense of drunken familiarity. It also sounds like somebody simply stuck a microphone out in front of the stage and let the dated technology work its magic. Either way, A Keg Full Of Dynamite has aged well, over the years, despite the guitar tones' strident scratchiness, not to mention jittery-as-Hell instrumentation. Notwithstanding fact the leads, overall (especially on \"20 Buck Spin\"), sound even more wizened than Vincent McAllister takes, it's interesting to take home viable live sampling of a still-youthful Pentagram.\n",
        "\n\"But if they already peaked creatively, then how can this album be their \"ultimate statement?\" Well, a creative peak and an ultimate statement are both very high praise, but in this case they differ in many ways - more on that later. But, just know, forming the ideas behind this review requires an in-depth look at this seminal American doom institution.\n\nPentagram is one hell of a curious band, and I don't use that word simply because I just reviewed Curious Volume on here yesterday, I actually really mean it. Their 70's material (which, as a younger fan, I have experienced exclusively through the First Daze Here compilation CDs) reflected early metal as far as I can tell, but in my opinion, it bordered more on psychedelic rock than Black Sabbath's seminal metal classics like Paranoid, Master of Reality, or Sabbath Bloody Sabbath, as evidenced by the fact that a 70's Pentagram-inspired doom band like Witchcraft is considered to have a psychedelic rock component themselves, right here on the Metal Archives. But why does this musical tendency of early Pentagram matter? Well, I think when they were known as Death Row in the early 1980's, they further embraced heavy metal music (since, as the metal historian knows, heavy metal was evolving fast at this time, for example the NWOBHM was going strong) while still retaining their distinct melodies that we know so well from songs like \"When the Screams Come.\" As a result, the first three Pentagram albums are all classics, and there can be no debate about that - while Pentagram (Relentless) serves as the best introduction to the band's wholly original doom sound for the average heavy metal listener, Day of Reckoning and Be Forewarned place a greater emphasis on those doom metal melodies I mentioned above, which to me makes it clear how once their music got a little bit heavier than it was in the 1970's, they were playing fully \"matured\" doom metal - that said, from the very beginning, they were a doom band. \n\nThis brings me to a point I do not necessarily need to bring up to make my case, but I would still like to expand upon since I could talk about Pentagram all day, this being from the user gasmask_colostomy's 2015 review of Day of Reckoning. In this slightly critical but ultimately insightful review, this user astutely notes two things - one, Pentagram in the 1980's is far removed from the band they were in the 1970's, and two, Day of Reckoning introduces the sound that would be expanded upon on Be Forewarned (by which I assume they must be referring to those distinct melodies which define the doom metal genre and can also be heard in early Trouble or Cathedral songs). Indeed, both albums are littered with those sorrowful and mysterious guitar lines like on the bridge of \"Day of Reckoning\" or in the chorus of \"Nightmare Gown\"(which along with \"Fear No Evil\" by Trouble are palpable examples of \"fast\" doom metal - melody, progression, and mood defines this music, whereas slower tempos are often just coincidental.) I like these points on their own but I would like to unify them by saying this - Pentagram circa 1985-1994 doesn't resemble Pentagram circa 1972-1980 because they became more of a heavy metal band, but I still think they remained somewhat faithful to their original sound by retaining those melodies I've talked so much about. \"When the Screams Come\" fits perfectly on Day of Reckoning while still doing justice to the original, and I'll always stand by that.\n\nBut hey, look at this, I can come up with a better example of rerecorded old songs being put to damn fine use for a new album, that being 1999's overlooked Review Your Choices, which actually relies heavily on the band's 70's material, but to its merit. After Be Forewarned, which in many ways was the band's creative peak (since it featured so many at the time new and overall tastefully dark songs), Pentagram's (superb) lineup tanked and Martin Swaney and Victor Griffin left. Granted Joe Hasslevander was still in the band and he's actually the main hero of Review Your Choices since he plays every instrument and totally gets the songs, but there's no denying that he and Bobby were under strain on this outing. Some people fault them for reusing the title track and \"Forever My Queen\", but honestly it goes perfectly with the new songs like \"Gorgon's Slave\", which is actually the most gloomy song Pentagram had written up to this point and is one of my favorite doom metal tracks. And yet at the same time, the rerecorded songs are entirely faithful to the original versions, just way heavier and murkier sounding. Those chord progressions were always doomy as hell! \n\nAdditionally, I originally thought that songs like Gorgon's Slave or \"I Am Vengeance\" were written as an attempt to fit in with doom metal circa 1999 since by that point, metal subgenres were well established and there were plenty of classics to be found in each one. However, as I made clear above, I think Day of Reckoning and Be Forewarned already were totally mature doom metal. It's just that while songs like \"Madman\" and \"Lifeblood\" from those albums rely on chilled and mysterious doominess, songs like \"Change of Heart\" from Review Your Choices are simply very downcast, which reflects the loneliness of the lineup at the time and Bobby's addiction struggles. In fact, I think the title of this album is really very apt, especially if you know the lyrics to the title track - \"Review all of your choices now, there's no one 'round to show you how.\" That song especially makes me feel lonely and depressed, the version from this album in particular. And they totally did review their choices here! It shows, because what a monster of an album this is. It's like Mournful Cries and Lunar Womb in that it's doom I have nothing bad to say about. It may not be Pentagram at their most creative but it IS Pentagram, the definitive experience of their music I'd say, even if the muddy production here makes it a bit less accessible to get into than the first three albums. Songs like \"The Diver\" or \"Mow You Down\" might seem a bit like \"filler\" to some, but I think deep cuts can add completeness to albums, and they do here. Most albums with this many tracks aren't this strong overall, anyway. Lastly I would just like to note that the doom to be found here is a bit less melodic than that of Day of Reckoning and Be Forewarned. To me they went for more of a Saint Vitus kind of trudge on this one, just not as punk-leaning as their younger brothers in that band obviously.\n\nOverall an essential doom metal album! These guys were a pioneering band of the style and this album is the ultimate testament to that - for this reason it's still my favorite Pentagram album and I do find it pretty interesting how it fits into their discography. Sub-Basement from 2001 also uses the same formula as here but honestly I'd only rate that one an 85% which is a bit low considering Pentagram is one of my favorite bands, just because the songs have less of a sense of direction on that one, but on Review Your Choices it's like the perfect balance of variety yet consistent doominess and strong songwriting. I'd definitely recommend picking up the Season of Mist CD pressing if you can too, because it's fairly cheap from most websites, that way you can get some great doom in your collection! The only thing is, I don't recommend starting with Review Your Choices if you're just getting into traditional doom, because this one is a bit more bleak and burned out sounding. Try one of Pentagram's first 3 albums or maybe The Obsessed!\n",
        "\nAmerican doom band Pentagram has done more for metal and heavy rock music than most would give them credit for, largely by virtue of just how long they've been a band, in one form or another. And while they've certainly had a great deal of hiccups along the way, whether that be uncertainty about which moniker to go by, Victor Griffin coming and going, or Bobby Liebling struggling with addiction, it's clear that this is a band that takes what they do seriously, if nothing else. So while 2015's Curious Volume was being touted as something of a return to form for the band, I didn't see it that way, especially since I had no qualms with liking the previous Last Rites. Both albums were simply Pentagram reacquainting with Victor Griffin and came right on time, when you consider the 7 year gap between Day of Reckoning and Be Forewarned that had defined the band's past. Really though, Curious Volume was simultaneously the album that all of traditional doom and heavy metal needed around this time period, along with Sacred by The Obsessed, and that's not because those are really unique or groundbreaking records for the most part.\n\nNope, Curious Volume is totally just a band that formed in the 70's sounding like a band that formed in the 70's, and I love that. First of all, say what you will about the band reusing decades-old material like \"Earth Flight\" (a far more upbeat anthem than the gloomy \"Change of Heart\" which it shares lyrics with) for their longplayer, but that's part of what makes every Pentagram album solid, is that you can pick any one of them up and know you're getting Pentagram. And besides, plenty of people who listen to Day of Reckoning for the first time have no idea that \"When the Screams Come\" was written way before \"Burning Savior\", because those songs totally fit together and the same stylistic consistency can be heard on the newest album.\n\nThat's not to say there's nothing setting Volume apart in the band's catalog though, because in fact I think it sees Victor Griffin exploring a new side of his guitar playing, which on the doomier tracks like \"Dead Bury Dead\", the title track, and \"Close the Casket\" I can describe as having some subtler shades of despair to them than classics like \"Evil Seed\", which simply goes from being thunderously heavy during the intro to depressingly melancholic during the verse. I think on this album though, Griffin makes use of some softer picking techniques and more refined chord progressions, which meshes well with the now aged voice of Bobby Liebling, \"Devil's Playground\" being the prime example. Along those same lines, I also notice that the music overall here is a bit \"groovier\" doom than what Pentagram has typically been known for. Sure, there's, as expected, tracks like \"Lay Down and Die\" and \"Misunderstood\" which are the absolute definition of upbeat doom congruent with songs like \"Leaving Town\" by Iron Man, but morever there's oddball songs like \"Sufferin'\" which have a bizarre swing to them, the type of thing where I can't tell whether it's a modernization of traditional doom or a technique that actually predates Born Too Late, if that makes any sense. \n\nOne complaint I have got for this otherwise splendid blast from the past would be the lack of bass in the production. Oh sure, it's probably actually louder than the bass in most other modern traditional doom and heavy metal albums, but it's still not loud enough, because I want Review Your Choices-level beefiness, it'd suit the music here a lot, I think. Plus, Victor Griffin's nephew Greg seems to be the type of bassist who totally gets what traditional doom is all about, and you can believe it because he was in Place of Skulls, too.\n\nOverall though, Curious Volume represents Pentagram still being Pentagram all these years later and for that reason it's the album that old school doom needed circa 2015, especially since that's when doom-lite like Khemmis was getting big. If you're just getting into doom, honestly you could do a lot worse than to give Curious Volume a listen. It's not as good as the first four albums but it is still True American Doom Metal.\n",
        "\nPatience, milads, we'll be getting around to Pentagram's killer live A Keg Full Of Dynamite, as well as golden era compilation tryptich (comprised of 1998's Human Hurricane, 2002's First Daze Here and 2006's First Daze Here Too), soon enough.\n\nUntil then, contend with this minute, two minute jam band rehearsal suitably titled \"Bang It Out\", originally recorded, albeit shoddily, in 1971, yet released to utter lack of fanfare by Decibel Records, in 2015 - the first year I came this close to fully realizing, clean and (stone cold) sober.\n\nWe hear, right away, from watery, muddled mixing how this riotously cram packed bass/drum/lead guitar fest belongs on said HH amalgam, as Geoff O'keefe's loosely slambashing drum roll intro paves way for Vincent McAllister's snappily sliding, trilling, warbling swing riff above Greg Mayne's flopping/glooping ruminator of a bass line, not to mention Bobby Liebling's erratically inflected and ever-demented-but-spry blues provocations. (Dig his wonky midpoint cry of \"Smoke that bitch!\")\n\nGood gravy! That kookily tooting, carnivalesque power chord bridge yields such a hip and bojangling, breaking bass turnaround, with respective, free-wheeling as hot (vanilla) fudge signature dash of V.McA (RIP) soloing, have reeled this Flexi-leash, er, disc, over half dozen times, already. A must for any heavily rockin' 70s metal and/or P'gram fan.\n",
        "\nAs the underground was forged throughout the 1980s, an explosion wrought in the crucible of punk, it took a special discipline to go against that grain. It may have gathered a larger following of tourists in the 2000s, but back then it was doom metal was decidedly not cool. The impact this had on traditional versions of the form played out in a number of ways. Whether it was the murky boisterousness of Saint Vitus, the unapologetic bombast of Candlemass, or the drabness of Pentagram. Away from the distractions of the extremity arms race of this time, it offers an interesting perspective on metal’s quest to overcome its routes. To shed the rock and blues origins that defined the proto metal of the 1970s. \n\nPentagram are a band that should need no introduction here. Their second full length offering, 1987’s ‘Day of Reckoning’, reaches even further back, combining the suffocating doom of Sabbath with a sheen of Americana and roadhouse rock that would later become a staple of modern stoner doom. If Trouble took their cues from British heavy metal, Pentagram place their influences very firmly within classic rock and blues. When they do pick up the tempo, the outrageous simplicity to the riffs is borrowed more from punk than anything else. They shun the twin lead attack that had become a requirement in heavy metal by the mid 1980s. This more minimalist approach not only emphasises the drabness and sparsity of the riffs, but allows them to explore the spaces within this music.\n\nFor this reason, tone and layering would become much more important to stoner doom than it would for heavy metal, whose priority was always first and foremost to the riffs and their relationship to one another. Take any of the solos on ‘Day of Reckoning’ as an illustration of this. The melodic core has been hollowed out for the sake of creating a break with the music that preceded it, a contrast and not a progression, usually achieved by dropping out the rhythm guitar and applying liberal delay, in order to squeeze as much as humanly possible from each note. Whether this works or not is entirely dependant on how it links up with the music that surrounds it. It can offer an escalation of the drama, and provide a build into the next theme to be unpacked. Alternatively it can simply stop the music dead while we listen to what sounds like effects peddle fiddling. On ‘Day of Reckoning’ Pentagram achieve mixed results with this approach. ‘Burning Saviour’ is a great example of a gradual and patient progression of an idea from start to finish, that sees them once again attempt to transcend the proto-metal that birthed it, and empty space is used to comment and frame the riffs. ‘Broken Vows’ by contrast, although sounding ridiculously on trend despite being released in 1987, meanders without really taking the listener anywhere from start to finish.\n\nDrums are again battling between the cheer of a bouncy groove, and a more straightforward rhythmic framework in which to augment complex fills and interplay with the guitars characteristic of metal. Liebling’s ghoulish vocals are as consistent as ever. Flexed with the bittersweet religious anxiety that characterised a lot of early metal. Despite its shortcomings as a work that taps into the epic and eternal spirit of metal, one has to admire the focus and streamlining that went into this release. The fact it is mastering two competing musical traditions into a unified work of apocalyptic doom metal is to be celebrated. The only major shortcoming being its tendency to dwell on layering guitar tones at the cost of advancing the narrative core of the music. The hordes of imitators that would later follow in Pentagram’s wake would be far more guilty of this however, and they remain a considerable cut above their many imitators.\n\nDespite the class and charm to ‘Day of Reckoning’ however, one cannot help but conclude that it was an album that was holding metal back. There are many ways to buck the trend and swim against the tide of history, but looking even further to the past for answers without adding much in the way of originality or substance is not the favoured method to go about it.\n\nOriginally published at Hate Medtitations\n",
        "\n\"I was the finder and the keeper\nI never thought I would need to be the creeper\nBut my keeper\nTurned out to be the reaper\nAnd now it's bloodlust!...\"\n\nThus begins the ultimate in crushingly plowing and piledrivin' Pentagram overtures amidst many, on this, its sixth full-length'd album overall, titled Sub-Basement and released on CD/12\" vinyl in 2002 under Italy's Black Widow Records. Alongside opener \"Bloodlust\" and swift, succor-providing successor \"Buzzsaw\" - which, on their own, constitute the Americans' fiercest entrance in their entire discography - a spectrally fist-pumping visitor rocks out to further gut-punching razzlers with the centrifugally carousing \"Drive Me To The Grave\" and/or later worthies \"Mad Dog\" and \"Out of Luck\" as they carve fun-filled, furious furrows across their \"loufoque\" (wacky) brainpan.\n\nBack to said twin knicker-twisting send-offs, front man and long-time 'Gram leader Bobby Liebling assuredly drives the crucifix nail home with his demented stride and knuckle-dusting, quasi-poetic bop; nary a minute in, he swoops in for kill atop Joe Hasselvander's hypnotically grinding and grueling, Golgothian ripper of a guitar riff, in an even more knurled and scurvy manner than usual - or thought possible! - with the gripping-as-all-get-out pre-chorus, tinged as it is by a sweeping \"The killing floor may drag me down/But not without a fight/And even though they think I've lost my soul...\" immediately followed by the most knavish drawl this side of Washington (D.C.): \"If they could just keep me confined at night!\"...It's a crypt keeper, alright!\n\nHasselvander's guitar soloing on this release is simply amazing, due to his crazed use of pedal-induced embellishments, like on the wickedly fluttering, if not downright ghostly, lead punctuating \"Bloodlust\", or throughout mi(d)st of the severely reverb'd razor grater \"Buzzsaw\" - consider both among my favourite within the Pentagram song vault. This last, equally brief, 2.5 minute long highlight starts off with stark power chords quickly yielding a bone-jarring pas-de-deux betwixt an electronically eldritch as well as weird, cleanly reverberating passage and a fully fulminating, \"pulled-back\" kind of massively resonating palm-muted/down stroked riff, the likes of which invariably raise my esteem for Lielbling's multi-instrumental, masterminded wing-man. \n\n(Of note, Joe covers all sharpened - or wizened - musical angles on both Sub-Basement and the earlier Review Your Choices, from 1999. In any case, the former and here subject of this enthused review bows or slithers low as the stronger and less erratic of the two, considering the other, with its freakishly disjointed song segments, evokes the doom metal equivalent of Picasso's Guernica). \n\nFor all its front-loaded glory, however, Sub-Basement falters somewhat with the turgid and lugubriously meandering, \"Disturbing The Priest\" kind of bullcrap gleaned on \"Sub-Intro\", a relatively atmospheric but otherwise irrelevant instrumental heralding an as-slowly paced title track on which not only do Bobby's vocals sound swamped or drawn-out by the tempo's mealy-mouth'd, catacomb-crawling pace, but also draw detraction to themselves with, as follows, the oh-so-revealing, ironic line: \"I've been called a dinosaur relic/Stuck in the twilight zone(/But sticking' in the sub-basement/Keeps me lit to the bone...\").\n\nIn fairness, the song picks up towards the end, but it's still a far (banshee) cry from the draw and appeal of its prior brethren. Nevertheless, this mildly elective pair of momentum killjoys finally cedes the (bottom) floor to a way more exciting, not to mention exoteric, series of rampant numbers ranging between the psychedelic, kooky wayfarer \"Go In Circles (Reaching For An End)\" - which, disarmingly, isn't quite as killer as Show 'Em How's \"Prayer For An Exit Before The Dead End\" (!) - and swanky, rhythm n' blues chthonic (s)hip-shaker, \"Target\", an apt finale which, along with its catchily crooning predecessor, \"Out Of Luck\", are stoutly reprised from their original 1970s incarnation, officially put out, among several other \"golden oldies\", on 1998's (must-have) Human Hurricane compilation under one-off - and later failed - Pentagram label, Downtime Recordings. \n\nElsewhere, the short and spiritedly unhinged \"Mad Dog\" (also listed on 2003's live A Keg Full Of Dynamite re-release) will likely induce a full-some jig or five. The same applies to the ruefully expunged, yet not-half-bad - it'll grow on ya! - \"After The Last\" a groovily rutting/rut-inducing stroll down caustic avenues of atypical Liebling bonhomie i.e. those nasally wrung verses, with a slyly sardonic chorus in tow. Hell, the latter teeters between a stilted albeit highly tripped out patter and bell-slidin' twang liable to awaken yard owls, pissed-off and blinking, in addition to an extensive tribal drum roll over which our g-man keeps acceding to nutty, haywire heights. \n\nWhat I dig most about Pentagram's Sub-Basement - and it's far from a preferred album - is its un-apologetic apoplexy, laid down over fat, girth-y guitar riffs and bass lines, with some of the band's hardest, most slam-bashing drumming to date. Logically, if I know what's good for me, I'll tune in to Joe's Hounds of Hasselvander, asap!\n\n\"Tales of woe I was strung out on the line\nAnd I though my life was fine\nIt wasn't mine\nFell a little short and ran out of time\nAnd now it's blood lust!\"\n",
        "\n...though rest assured it ain't that funny dentist-cum-farmer country bumpkin from Iowa, so classically presented beside his squat, austere wife in 1930's American Gothic.\n\nRather, it's none other than this brooding pre-millennial slab of quintessential American doom metal sordidly titled Review Your Choices, by the one and only Pentagram - front-runner of Washington, D.C.'s heartily pioneering doom metal scene for as long as anybody, most of all, Bobby Liebling, can remember. \n\nHell, I remember it all too well myself, being the massively celebrated glory-piece of my one \"token\" stonerrock.com mail-order back in the day when the genre was still a fledgling in evil eye of populace at large; Pale Divine's quintessential Thunder, Perfect, Mind and Witchcraft's withered self-titled beginnings served as palatable asides, while Electric Wizard's dominatrix bound Supercoven constituted a meandering, humdrum let-down. \n\nOK, so the brick-hued, Devil-hyped cover rocks like nobody's business...what about the album, and/or tunes themselves? \n\nWorth noting at inset, alongside 2002's studio album number five, the dungeon-esque Sub-Basement, RYC solely features Mr. Liebling on the mike, with heavy metal carouser Joe Hasselvander handling everything else; namely the drums and both bass and guitar. Between us, this here is the firmer and punchier, as well as more \"deciduous\", volume. \n\nFollowing starter \"Burning Rays\", an incandescent and brief, stiff-upper lipped pacemaker whose combustive-ly bursting, gritty riff-work duly conjures vistas of the Sun's flaring corona, things take a gruelling, molasses dipped, squealing turn with monolithic morass of \"Change of Heart\"; that is, right up until 04:13, whence mild drumstick clatter and cumulative skins tumble set acid tone for a \"heart\" rendering and downright pumping guitar progression followed by gnarled, albeit lively, pentatonics in form of Joe's sleazily panoramic, valedictory guitar solo. Vintage, 1970s 'gram paragon \"Living In A Ram's Head\" then charges into full-fiery focus while doing justice to its 1979 7\" single under High Voltage Records, which, inexplicably, failed to spur the lads to greatness...until, as the fable goes, years - even decades - later.\n\nThe predatory vibe and paradoxical wanton kookiness of \"Gorgon's Slave\", admittedly, is a take it or leave it affair, owing to its sinister tempo and flair, in addition to Bobby's nasally drawn out and demented thespian candor which gives impression the ole serpent coiffed demoness of Grecian lore herself took a sabbatical from her equally fowl islet-dwelling sisters in order to cast mythical round of \"petrifying\" glares within the cloistered confines of the studio. Then, slightly half-way in, his truly springs back to life as both a slippery guitar shuffle and jarring drum run set the (craps) table for Joe's by-now reminiscently rueful and rocking hammer-on'd fare. That said, he adheres to a more compact and neurotic style than Pentagram's usual go-to (contemporary) ax-man, Victor Griffin, who takes on a vociferously symbolic and intense - at times, seemingly never-ending - \"hard line\" approach to his soloing.\n\nClacking shut the A-Side is the ominously no-frills, semi-automatic, rapid-fire dirge, \"Mow You Down\" - this LP's token hard-driving grit-ster akin to \"Relentless\", \"Day of Reckoning\", or perhaps even \"Mad Dog\", from 2002's upcoming Sub-Basement - before titular masterpiece \"Review Your Choices\" elevates things to a proper level of Pentagram pep, if you will. \n\nDig the following helter-skelter opening verse, juxtaposed as it is over a diabolically teetering - however maddeningly poised - 70s styled retro-riff, to put it wildly:\n\n\"Man and woman try to keep a tie\nWhile looking at what passes by\nVillage thieves and all the tramps\nSomewhere someone left some gaps\nLook before you leap my friend\nShould god take you in his hand\nIt's a very small price for your sins you spend\nAnd there's a man with a pitchfork around the bend\n\nAlright!\"\n\nParticularly poignant is how, upon development of an extensively laid-back and sleek, if not downright wizened (!), blues-y guitar solo, each subsequently slack vocal line yields further dangerous and dexterous, hellbent mysticism, and thus, until this gem's satisfactorily saturnine denouement. Alternately, the brisk, yet odd, pair of B-Side openers - \"The Diver\" and \"The Bees\" - are better appreciated off the low-brow, uncanny and raw Human Hurricane (vintage) collection, from 1998 - a must for the erudite Pentagram connoisseur, along with the First Daze Here Collection, #s One and Two. \n\nAt 2.5 minutes a'piece, these twin \"lugubrio-sities\" fail to stir like their unholy brethren; to be fair, Liebling's vocals are as glum, gloomy and despondent as ever, if not more so...the guitar licks are gnarled as fuck, no surprise there...While not necessarily filler, consider them graveyard dirt of the first order. (Interpret as thou wilt.) Now, \"I Am Vengeance\" is a rarity worth its ranting weight in tortured Bobby-isms; it truly is an exercise in mangled oratory expression, plus the down-tuned, debasing string bends are their very own monster, not only for this record, but the entire Pentagram song vault as a whole. The fortune-teller evoking sprinkling, twinkling keys four minutes in yield grooved the frig out power chords sure to crowd your thoughts, burr-like, to far side of your cranium...a decent offering, no-how!\n\nPrimordial to this here flailing review, the \"Forever My Queen\" version at hand is much meatier and stout than (during) its initial, incarnate, fleeting heyday. Although Hasselvander does terrific job of layering down the fuzz i.e. wild fire leads, favor the time-honored Vince McA. variant any day. To wit, he appoints his own nifty, sinewy signature, in a similar arch-type manner as the \"Griff\" master on respective, crisp whippersnappers such as \"Sign of the Wolf\" and/or \"Dying World\", both from 1985's ground-quaking turning point, Relentless. \n\nWhile \"Gilla?\", bluntly put, is a coy and pointless \"connerie\" - French for inanity - consisting of bonzo'd Bobby going full-blown nasal on the ubiquitous main (fifths) riff to DP's \"Smoke On The Water\", \"Downhill Slope\" and \"Megalania\" perfunctorily close this wry, fickle-minded package along comparatively reflexive and glad, placid tones as, say, \"If The Winds Would Change\", or possibly that ill-bred Dutch (oven) whimsy from 2011's Last Rites, \"Windmills And Chimes\" (I'd prefer chives...). The latter, however, with its grinding, slow-burn palm-muted groove and spellbinding, coffin nailing lyrics, makes for a deadly doom metal \"wine-and-cheese-pairing\" with 2007 Show 'Em How humdingers in the festively cool jugular vein of \"Elektra Glide\" and \"Prayer For An Exit Before The Dead End\". (Hence, I forever pine for further Pentagram production featuring said one-time Internal Void line-up.) \n\nNostalgically speaking, the LP sleeve for Review Your Choices is worth its weight in gold, what with memorably depicted Pentagram keepsakes ranging from Count Chocula to Old Scratch himself in myriad manifestations. Even the verso's knobbly Willow tree and crepuscular surround beckon from here to Geno(v)a, Italy, headquarters of exalted Black Widow Record Label - known for wheeling and dealing in highly collectible, albeit rather obscure, 12\" wax from likes of Bedemon (a proto-metal Pentagram spin-off, also from the early 70s), Blue Dawn, Northwinds, and, ah, the misspelled but fetching Witche's Brew. \n\nWell, then. \n\nGrab that oversized three-prong fork and have a stab at 'er, already!\n\n\"The evil churns, you'll start to burn\nBut will you crack, you can't turn back, oh no\nReview all of your choices now\nThere's no one 'round to show you how\nBut the hand comin' down has-a reached it's end\nYou know who's still around the bend!\"\n",
        "\nAs someone who would call himself a dedicated metal fan, it was with some surprise that I had never heard of Pentagram until I saw the 2011 documentary, Last Days Here. The film told the tragic tale of Bobby Liebling, the front man of the Virginia-based doom metal band. Judging from the initial part of movie, I'd have been surprised that any new music from Pentagram would ever see the light of day. However, the conclusion of the film charts Liebling's course to recovery from drug addiction and depression. \n\nPentagram, as a band, began in the early 1970s but their debut album, Pentagram (aka Relentless, as it became known when it was re-released in 1993), wasn't released until 1985. It became something of an underground classic. The band sort of stalled and churned its way through numerous line-ups and releases of older material up until the release of the documentary. Energized by the reception of the film and the exposure it brought to Liebling's twisted talent, Pentagram experienced a rebirth of sorts. Curious Volume is the band's second studio album since the documentary was made.\n\nAs many of the band's albums have been, Curious Volume is comprised of older material from the 1970s and newly-written songs. The result is a unique mixture of modern doom and vaguely psychedelic metal. Liebling is backed up on this effort by long-time guitarist Victor Griffin and bassist Greg Turley, along with new drummer \"Minnesota\" Pete Campbell.\n\nThe album opens with the blistering \"Lay Down and Die\" which has a definite 1970s vibe to it, complete with wah-wah solo. Immediately followed by the equally swinging \"The Tempter Push\" and the ominous sludgefest \"Dead Bury Dead\", the album gets off to a great start. \"Earth Flight\" begins with a spare percussive intro and then launches into a road-ready riff. The title track slows things down a bit but still provides ample doses of heaviness. The tempo picks back up on \"Misunderstood.\" Other highlights include \"Close the Casket\" and \"Devil's Playground.\" Liebling's vocals sound like he looks: grizzled and spaced-out but yet oddly compelling.\n\nIf you're a doom metal fan and you haven't already done so, you owe it to yourself to get acquainted with Pentagram and their new album. Dark, fuzzed out, and heavy as hell, Curious Volume is an album that demands to be cranked to the maximum.\n\nOriginally written for Media-Assault.com\n",
        "\nTake if from Bobby Liebling and I: much like drug addiction is a progressive disease – meaning a relapse will bring you right back to where you left off – Pentagram’s legendary and timeless appeal never wears thin, even after a decade of abeyance. In other words, I’m dutifully re-cramming the DC doomsters' 1994 release, Be Forewarned, back into my cake hole in order to fully do it justice; by God, the hour-long, thirteen tracked Peaceville Records offering sounds better than ever!\n\nGranted, the reconstructed outfit’s third album, which starts off with the craftily haphazard and sloppy “Live Free and Burn”, may initially come across as off-kilter and hammy but rest assured it’ll grow on you right quick whether you’re an inveterate, seasoned doom fiend or open-minded genre tenderfoot thanks to its grisly choppiness and theatrically lugubrious ardor courtesy of Liebling’s back-handed, debonair flair (consider him the Vincent Price of doom metal) as well as stellar cast of musicians comprised of the incomparable Victor Griffin on guitar, the equally competent Martin Swaney on bass and long-time heavy metal journeyman Joe Hasselvander on percussions/drums. \n\nAside from a creeped out and carnival-esque “All my Sins”, the breath-taking-ly evil “The World Will Love Again” and plaintive albeit majestic jeremiad which is the eponymous title track and old school, 70s era Pentagram classic, the raucously rendered and largely upbeat compositions constitute new material I now consider trailblazing doom gems in their own right, from the freakishly swelling but soon-to-be all-out madcap liberating frenzy, “Too Late”, to boxy and appropriately kitsch chthonic romance aptly christened “Vampyre Love”. Sardonic chuckles aside, count on the latter's infectiously cyclical tempo and \"toothsome\" grit. Ha! I can't quite get enough of its swaggering square-dance umbrage dauntingly festooned with bleating percussion-based “tocks”. Dig Liebling’s greasy, laid back and oh-so-rock-ish overture on the former, backed as it is by a most gripping hard-driving slider of a riff/thunderously thwacking drum beat:\n\n“Where in hell are we going\nCause heaven just can't wait\nThere's a hole in the sky\nAnd there's dreams a dying\nAnd I wonder if it's too late, too late\nOh yeah – listen!”\n\nYou could even say it puts Ozzy to shame! Once the track compellingly reverts to its slower wheezing groove all bets are off as modern-day 'gram ax man Victor Griffin swoops in for the kill with a spectacular, highly emotive pentatonic delivery whilst Hasselvander’s provocative clanging lends a further air of malevolent debilitation to the proceedings, the lot of sensually segueing back into said howling riff. \n\nElsewhere, Liebling’s wryly nasal falsetto is perfectly exemplified on the seven-minute “Life Blood” (on which Hasselvander unsurprisingly stars at the piano), where \"Griff\" readily proves his mettle with languidly drawn-out leads which feel like they’re crying out their pain for entire World to bear, his woeful squeals and Hasselvander’s maniacal percussion, notwithstanding. That said, even the more sulking guitar riffs and solos are rife with a dynamic and enthralling quality. At times, they’re downright explosive, amazing really, such as on the ravishing piece of vocal and instrumental wizardry which is, without a shadow of a doubt, my preferred track not only on this album but out of anything Pentagram has ever produced, the immortal and impeccably phrased “Wolf’s Blood”. Wow! It’s certainly one for the ages, with its rollicking and slambashing opening drum roll as well as succeeding, radical shuffle-boogie riff and bluesy, wailing lead harmony which masterfully swoons about thirty seconds in following a meticulous gang breakdown. Furthermore, I'm absolutely mesmerized by Liebling’s insanely captivating verses, possibly the coolest and most evocative horror themed opening lines I’ve ever heard:\n\n“I hear stories about the nightlife\nBut not the ones that you know\nTales of terror and desperation\nSomewhere out in the cold\nUnder the moon\nWhen we hear the hounds\nWhat's going down\n\nSomething knows what it's all about\nAnd I gotta find out – wolfsblood!”\n\nBelieve me! His “wolfish”, inflective motilities fly off the handle! Every verse and bar is killer! Suffice to say, it’s my #1 lycanthropic tale/heavy metal penny dreadful by a long shot. What’s more, Griffin’s guitar soloing is unabashedly orgasmic and every bit as amusingly twisted as Tony Iommi’s on Black Sabbath’s “Paranoid” and/or “Hand of Doom”, for instance. \n\nAs soon as said harmony wraps up with a black bow, brace yourselves, whence throat-ripping split-fingered chromatic riff paves the groundwork for most dazzling, if not most incredible, pentatonic solo section you’ll likely ever hear; sectioned off in multiple parts, Griffin unleashes a ferocious slew of sizzling fret runs which, between 03:49 and 04:00 include downright scintillating and scorching finger-taps sure to get your “blood” pumping. Actually, I’m quite sure these wondrously ebbing and flowing, poignantly phrased leads, which unequivocally showcase him at the top of his game, are amongst my favorite of his, be it with Pentagram or the equally commendable Place of Skulls. \n\nAside from such detailed eloquence, what essentially makes “Wolf’s Blood” such a fascinating and highly memorable track is its balancing contrast between the happy-go-lucky main riff and mournful, elegiac secondary riff as well as Liebling’s widely varying vocal range; while these alone are reason enough for chair-catapulting fireworks, the rampant bridge (compounded by Liebling’s “The silver bullets my only threat/Wolfsblood runs black it runs deep...”) and incendiary lead break leave me trembling in awe...\n\nShuffling along now, “Frustration”, with its welcome undistorted guitar cool-down i.e. intermittently re-emerging intro as well as philosophically sagacious opening verse and overall cranky and dramatic riffing/soloing is another thirst-quenching humdinger worth mentioning alongside the characteristically heavy-hitting yet arresting and poised “Bride of Evil”, whose downwind cadence and moon-baying, swing-around chorus is sure to fasten itself to the psyche for some time to come. Expect wiry and elongated pentatonics as well as hat clamping drums to further reel you in past the point of no return!\n\nOne track which harkens back to the “day of reckoning” is the caustic and chiseling, mallet-swinging mid tempo grouchy wrangler “Petrified”, as it’s along the lines of past heavily brood-some worthies such as “Evil Seed”, “The Ghoul” and “Wartime”; if anything, it effortlessly makes itself at home amongst its more festive brethren. It also features a rather nifty and called for tribal tom-tom patter and rattle, thus enforcing expectations rising from the track’s solid, stone cold moniker. Rounding things off is the 2.5 acoustic instrumental. “A Timeless Heart”, which, if the rumors hold true, is gleaned years later on Spirit Adrift’s Curse of Conception (wait, am I thinking of \"Change of Heart\" here?). Regardless, this last is an auspicious Grand Canyon state development worth looking into as well as it strongly incorporates numerous Pentagram-ish vibes. \n\nAs implied, the self-titled closer (and longest track) is an unforgettable masterpiece in its own right as it beautifully displays Liebling’s natural singing talent. Essentially, he’s far from being simply some overblown and wantonly charismatic front man – he’s also a highly talented tenor as attested by his wistfully composed verses and convincing emotional presence throughout. As well, the version of the song presented here is as superbly rendered as the original from 2002’s First Daze Here compilation. For that matter, make to sure to stay tuned for Griffin’s mellifluous flamenco passage in addition to Hasselvander’s atmospheric percussion medley. \n\nOn the whole, the production on Be Forewarned is much sharper and rich than on Relentless, which ascribed to a rather muddy and damp level of production. Despite somewhat paralleling Day of Reckoning in both tone and musicianship, this release can be considered one-of-a-kind amidst the formation’s extensive, if not erratic, discography. While Swaney’s bass slightly sheds its overt punch and prevalence from past ventures, worry not as the rhythm section goes above and beyond to supply Griffin with more than enough fodder to work with. \n\nAll told, I almost (pro) rated this musical paragon slightly lower (i.e. 92-94%), but, considering, once again, I'm freaking hard over Liebling’s deadly prose and delivery, along with Griff’s stellar, mind-blowing chops backed by team Swaney/Hasslevander’s battering onslaught, makes sense to rate it highly so. Who cares if the frivolous, frill and ridiculously shrill albeit shudder-some, rabid drum fill dominated “Nightmare Gown” porte-manteau comes across as tacky with a capital “T” filler or that some of the tracks take a little while to duly take off?! \n\nI dare all & sundry, upon giving Be Forewarned a spin or two, to challenge such panegyric praise, or counter with elaborately smug retorts, as Pentagram’s triad of revival releases, including here revered, constitute some of the greatest doom metal around. \n\n(You can thank me later...)\n",
        "\nThe mid 80s were a pivotal time for D.C. doom masters Pentagram, fronted by no other than the darkly charismatic Bobby Liebling. Despite a smattering of top notch tracks recorded in the 70s with the original line-up, the band remained in the shadows, only finally emerging on the World stage with the release of 2002's quintessential First Daze Here vintage compilation. Nevertheless, a then newly re-grouped line-up comprised of legendary doom metal \"electric ax\" man Victor Griffin alongside Martin Swaney on bass and heavy metal journeyman Joe Hasselvander on drums unleashed a furious storm of must-have classics, namely the titular 1985 album (re-issued with a differing track order under Peaceville Records in 1993) which I know like the back of my (left) hand, having given it innumerable gleeful spins over the years. Bear with me as I attempt to do it justice without running us \"into the ground\".\n\nKeep in mind a couple of the more \"brooding\" tracks forcibly do so with the full impact of a stone mallet. Despite their slower tempos, \"All My Sins\" and \"The Ghoul\" possess a decidedly sinister and stoic momentum - hypnotic even! - whilst the powerful and ornery revolving riff to \"The Deist\" has me madly spinning around, its poignant closing guitar solo notwithstanding. On the whole, despite a murky and swampy production, Griffin's tone is grisly crisp; his leads are downright piercing and exhilarating as many notes are tinged with a diabolically sustained warble - this particular signature is to Pentagram what Tony Iommi's evil and twisted pinkie trilling is to Black Sabbath. In any case, he astoundingly honors the quartet's original bass player turned guitar hero Vincent McAllister, who tragically died of cancer in 2006, departing all too soon at fifty-one years of age. \n\nEvery track is killer but wait 'till you hear the \"Paranoid\"-esque \"Sign Of The Wolf\", with its hard-driving main riff capped by a slew of exciting hammer-ons and super sinister albeit liberating and soaring leads. Speaking of which, Liebling's vocal delivery here is devastatingly awesome! Get a hold of this rad opening verse:\n\n\"A lone soul at night sits and bays at the moon\nThough sometimes he's a man it's a Pentagram\nShotgun blasts as he runs with the wind\nBut he just can't win it's the Pentagram!\"\n\nTo paraphrase mad_submarine, he truly sounds like a werewolf! \n\n\"Relentless\" also strongly resonates with me, as it's of the same instantaneously appealing, as well as downright propelling, caliber. In fact, years ago, when I figured it out by ear on my black, battered '79 Westone, it helped me understand my musical limitations and leanings; I knew I'd never become a shred-master, but by golly, from then on I knew where my loyalties lay, and that was no-frills, meat & potatoes doom in this vein. Curiously, \"Relentless\" is devoid of leads, but trust me, any kind of guitar soloing here would simply detract from the expedient main riff and cranky chromatic bridge's gripping, instant appeal. (If you disagree, I'll wear any dorky hat of your choosing!). \n\nIts not all pure doom and gloom though; \"Run My Course\" is a kooky admonishing dirge which would sit nicely on First Daze Here among the likes of \"Earth Flight\" and \"Walk In The Blue Light\". The second half of the song features a row of strident Banshee sounding guitar squeals giving way to a short but exquisitely phrased blues solo backed by a stocky sliding guitar and bass riff. As well, Liebling duly hits the hammer on the nail at times with his evocative and despondent, rather poetic prose. A prime, gloomy example consists of the wistfully crooning third verse of \"Death Row\", in addition to the scathingly haunting entirety of \"Sinister\". Oh, another golden oldie here is the literally and figuratively snappy downwind anthem \"You're Lost; I'm Free\" . While nothing extraordinary, it's quite a special track all the same thanks to its chillax and liberating, old school flair.\n\nAlong with Griffin, the rhythm section bows down to Greg Mayne and Geoff O'Keefe. Granted, Swaney and Hasselvander (who goes on to single-handedly play all the instruments for 1999's Review Your Choices and 2001's Sub-Basement) are definitely way more forceful but then again, you have to remember Pentagram morphed from heavy rock/ proto-metal to straight up \"doom\", thus establishing the aforementioned hallowed D.C./US East coast doom scene which is slowly but surely taking over the globe! [insert mordant laughter here]. Anyhow, Swaney's bass clings and cloys fast to Griffin's riffs without missing a step; he even goes nuts poking around all over the place on \"Dying World\", another stand-out track which features the band mates in full tempestuous form. \n\nOn this last expect another no-nonsense go getter of a guitar riff which eventually yields an incremental, ramped up bridge which, capped by Liebling's eerily reflective \"Is the world near it's end/ My god what's 'round the bend/ Will you fall to your knees and pray/ When hell; it heads your way\", dramatically sets the table for an inflamed Griffin who unleashes a veritable mind-bender of a lead break; while it's not his most expressive or colorful outing, does he ever rip! Just when you think he's wrapping up i.e. running out of gas, he simply keeps plowing ahead with a farrago of bends followed by more frantic fret runs thus leaving the listener gasping for breath! This fulminating display of pentatonic acrobatics goes on for ever and brings to mind McAllister's fast n' furious finger work on \"Much Too Young To Know\" (from the Human Hurricane compilation, which I can't recommend enough as well, along with the aforementioned First Daze Here). \"20 Buck Spin\" is another lead choked humdinger and most welcome reprise from the early \"daze\". The ribald lyrics evoke Liebling eschewing a cheap trick in a seedy back alley in favor of classier encounters with the fairer sex - ain't nothing wrong with that!\n\nWhenever I bring up Pentagram and its stupendous (albeit inconsistent) discography, I'm taken for some wanton Devil worshiping yegg but really, it behooves fans of hard n' heavy blues rock/ \"Sabbath\" inspired metal to check 'em out, pronto! Personally, this particular release not only represents the blueprint of my addled youth, but a passionate re-kindling of my love for heavy metal as well.\n\n\"Now I don my electric ax\nI'm gonna lay you on your back\nAll psyched up and ready to go\nTake you to hell and won't say hello\n\nWalk with me through the black house\nWhat a wild trip You're such a louse\nFeel my power as it prevails\nAs you listen to sinister tales!\"\n",
        "\nIn my long-winded review of Pentagram's sole disappointment, 2011's Last Rites, I rattled off the majority of the D.C. Doom legend's stand-out studio releases save one: 1987's exceptional Day Of Reckoning courtesy of Napalm Records (re-released in 2005 on CD under the reputable Peaceville label), my favorite 'gram recording aside from the groundbreaking First Daze Here (compilation) from 2002, which stands in a class of its own. \n\nJudas Priest's \"Exciter\" may win the golden palm for best \"heavy metal\" opener before the genre's flood gates flew open; alternatively, my vote for stockiest \"doom metal\" opener goes straight to Pentagram's unholiest of Devil dancing hip-shakers, \"Day Of Reckoning\". Alongside Martin Swaney's throbbing, throttling bass line in tandem with new-coming guitar hero Victor Griffin's lugubriously mesmerizing pentatonic darkness, Bobby Liebling is aflame:\n\n\"Now take your last look the world's about to fall\nYour efforts are useless to move a brick wall\nYou didn't seem to listen to a thing I say\nI think that today will become your day\n\nSo open your eyes to which path to take\nThe man's gunna laugh as your resistance he breaks\nButchers and cowards they've been running your life\nThis day is for reckoning if you wish to survive!\n\nBreakdown!\n\nSo why don't you open your eyes to which path to take\nThe devil will laugh as your resistance he breaks\nPlease be strong stretch your arms down at length\nHe'll dance in the flames he thrives on your strength!\"\"\n\nWhile the lyrical content's condensed, the opposite's true of the diabolically enchanting instrumentation, from an eerie and scratchy guitar shuffle to mightily haranguing guitar riff following \"Breakdown!\", Griffin is in top shape especially on his down-to-earth, no frills solo after the last verse - definitely one of his best leads, be it with Pentagram or his later outfit, Place Of Skulls. In terms of bass, Swaney is phenomenal throughout. While 1970s Pentagram featured a laid-back and groovy Greg Mayne (remember \"Lazy Lady\"? Zoinks!) the late 80s took a turn for the gloomier and mildly (as opposed to overtly) gregarious with the auspicious hard-driving trio of Griffin/Swaney/Joe Hasselvander (on drums) and a cantankerous Bobby L. tearing up the mike like a resigned Mick Jagger - minus the cattle prod this time around...\n\nAlso of note is how Hasselvander beat the skins on \"Burning Savior\" only. For some reason, the other six are handled by Stuart Rose (R.I.P), and nicely at that. You'd be hard pressed to notice any difference between the two. Day Of Reckoning (the album) appears to have been born under a bad star - a good thing in this case. \n\nWith only seven tracks topping out at thirty-four minutes, these \"burning saviors\" make every second count; effectively, you'll be compelled to replay this without exterior prodding. \"Broken Vows\" is another go-to track of mine, as I can't get enough of Bobby's despondent and darkly introspective ramblings and Griffin's super commanding, wavy riff half a minute in. Simple in its structure, it slays by way of sheer bad ass conviction, perfectly underlying Bobby's epic prose. Griffin's poised solo and Rose's dense drum out-take only serve to heighten an already gloomy but fun experience. \"Madman\" hits like a ten-ton hammer of doom while you're still recovering from Day Of Reckoning's twin ass-kicking openers. Again, the rhythm section supplements an ideal backdrop for team Griffin/ Liebling's overtures thanks to Rose's tactful pummeling and Swaney's bass line, which pokes around like Seth's staff while keeping a respectable distance - great stuff. \n\nThe only 1970s/ Vincent McAllister (RIP) reprise is \"When The Screams Come\", considered a top Pentagram gem by fans far and wide. Simply put, this track is awesome! Varying between a sardonically wonky opening guitar riff - which will lodge itself in your skull without missing a beat -, honky cow bell and a jangling jam/ solo following Bobby's unforgettable and demonic \"You've entered hell I guess and weren't so cool/ NOW SATAN MAKES YOUR RULES!\" \"When The Screams Come\" is not to be missed! I don't know what it is exactly about this track but it encompasses everything I love about Pentagram, be it Bobby's diabolical vocals or minions' slackly fierce musical prowess. \n\nThe track placement is spot-on. From the 2.5 minute opener to the incremental nine-minute eulogy of \"Burning Saviors\" (which includes more of Griffin's pentatonic wizardry in the form of spastically amped solos) and revved up romp & stomp of a closer, \"Wartime\", Day Of Reckoning, along with the 1985 self-titled dirge and Be Forewarned from 1994, represents Pentagram in top form after a decade long hiatus. Who would have thought the D.C. legends would carry on well into the new millennium alongside a rising generation of doom metal purveyors? It must've been written in the stars…I almost forgot to mention \"Evil Seed\". While it gets off to a slow and cumbersome start, fear not as both Swaney and Griffin knock this one out of the park with their respectively brooding and soaring leads three minutes in or so.\n\nAs a parting note, I've always dug Pentagram cover art but I must say this architecturally pleasing church/ mausoleum montage is a fresh change from usual \"satanic imagery\" i.e the covers for Pentagram ('85) and Review Your Choices ('99). Either way, repent for Day Of Reckoning!\n",
        "\nWhile Pentagram and its exuberant front man Bobby Liebling's strong comeback with 2015's Curious Volume silenced the D.C. legends' detractors for good, it would be unwise of me to laud 2011's Last Rites, which many agree constituted a disappointing setback at the time for this otherwise ingratiating doom metal trailblazer. \n\nI won't beat around the bush. The main drawbacks to Last Rites are thus: While a couple of reprises from the 70s in the form of the eclectically nightmarish \"Everything Is Turning To Night\" and a cool reprise of the third cut from Pentagram's fantastic First Daze Here compilation from '02, the kooky \"Walk In The Blue Light\" along with a craven smattering of newly minted originals - \"Into The Ground\", \"8\", \"American Dream\" and, to a certain degree, \"Death In 1st Person\" - slay, big time, on the whole on and off Pentagram guitar god Victor Griffin is lacking that certain je-ne-sais-quoi which initially drew me in like iron shillings to a magnet. Call it a certain predisposition to beautifully melded hard-driving jams with an unmistakeable psychedelic flair but what made tracks from the past like \"Startlady\" and \"Wheel Of Fortune\" along with the more recently composed \"Goddess\" or \"Prayer For An Exit Before The Dead End (from 04's Show 'Em How) stand out seems to be lacking in Last Rites' openers \"Treat Me Right\" - more like \"Treat Me Trite\" thanks to rare, uninspired lyrics along with Griffin's criminally watered down, repeatedly sliding riff - and the equally tepid \"Call The Man\". Weak instrumentation again aside, (and I know Liebling means well overall) this song just doesn't sit well with me. As a hard-case recovering user (that's one more skeleton out of the closet!) I'm trying to distance myself from the whole drug subculture of rock n' roll and heavy metal, regardless of sub-genre. This said. I recommend skipping these two right off the bat in order to revel in the next three, which make up the better part of Last Rites' positive flip side.\n\nBefore I continue, rest assured that while his general riffing may dismay at times (the slouchy \"Horseman\" and \"Nothing Left\" are no prize either; aside from usual, par-for-the-course lead breaks by Griffin once again, these late filler tracks could have easily been dropped along with the unnecessary and stupidly cut-short \"All Your Sins\", which did a fine job mind you in its entirety back on 1985's wicked self-titled Death Row debut) his trademark raunchy yet always soulful and at times downright sizzling solos are for the most part largely unaffected, notably on \"Into The Ground\", which draws closer to 2001's dark & heady Sub-Basement or Curious Volume's output in terms of confidence and depth, and the second half's high point, the slowly budding \"Death In 1st Person\". In fact, his lead work following the final lines, \"No child's life in vain/ vulture, walk your final mile today\" tops out big time on this last. It wouldn't sound out of place on something from the Liebling/Joe Hasselvander collaboration, 1999's Review Your Choices, as it starts off quite lugubriously (think \"Gorgon's Slave!\") before Griffin & co. take the gloves off and turn things up a notch. Also, you gotta love drummer Tim Tomaselli's early drumstick patter (\"tok! tok!\" style) reminiscent of the mellow first few bars of Sabbath's \"Hand Of Doom\" - always a good thing. Actually, Tomaselli and bassist Greg Turley aren't to blame for this album's shortcomings (except maybe on...\"Call The Man\"? I found the rhythm section to \"Treat Me Right\" quite respectable in its \"mow-you-downess; it's really Liebling and Griffin who are at fault on these two). With a thick stocky level of production all around - no complaints here - still, don't expect any \"Lazy Lady\" style wanderlust here. Check out First Daze Here and even Show 'Em How for such wild, wonky fare. Nevertheless, Turley and Tomaselli keep this bold grimoire bolted down while you flip through its pages. It's not the kind of release worth sticking with from beginning to end nor is it a page turner. A mediocre album with a handful of humdingers worth bookmarking is more like it. \n\nWhich brings me to another stand-out cut, the cryptically titled \"8\", which features an array of ominous, reverb laden progressions, tribally inclined thumping on behalf of Tomaselli and Liebling back on top of his game as the enigmatic and quirky front man long-time Pentagram fans have come to love. Richly textured and dramatically layered, \"8\" delivers right up to Griffin's distinctly Iommi-ish (circa Heaven And Hell as well as The Mob Rules) soloing, which, although somewhat cramped, is also more direct and bombastic compared to his standard soulful fare. \"American Dream\" happens to open up with some attractive reverb-ery and some brief wah-wah action before taking a pleasing turn of events, as Griffin competently takes over the reigns on vocals, which he decidedly has a knack for. It's no surprise then this track is a dead-ringer for an early \"Place Of Skulls\" track, fellow \"D.C. Doom\" acolytes for whom Griffin was front man, sole guitarist and founding member. This was definitely a smart move and it pays off in the grand scheme of things. \n\nUnfortunately, I'm not quite as taken with the saccharine, hippie-like whimsy of \"Windmills & Chimes\" - despite, you guessed it, more of Griffin's expressive and well-poised axe work - which fails to match, let alone surpass the heavy psych groove of Show Em How's \"If The Winds Would Change\". It's a nice attempt but alas, bluntly put, it sounds very much out of place as it tries too hard to create an envisioned balance which isn't exactly called for this time around; I mean, as the 'gram's first release in seven years, balls-out hard-driving grit should have been par for the course. Lo and behold, a nice balance of sorts is certainly achieved four years later (as you may have gleaned from my much shorter write-up for Curious Volume). \n\nAlternatively, I absolutely love the nostalgic renditions of \"Everything Is Turning To Night\" (originally appearing on the flaky First Daze Here Too) and \"Walk In The Blue Light\" (from its much superior predecessor, the shorter, 12-track First Daze Here, a bona fide desert island pick in my book). While the former is laden with creepy reverb laden progressions and Liebling's shuddersome invocations along the same lines as \"Nightmare Gown\", a fun and eerie Pentagram porte-manteau from Be Forewarned, the latter's intrinsically mysterious theme eludes me to this day. What should I make of:\n\n\"Come with me now the midnight calls \nAll are asleep as the kingdom falls \nSeeking our goals as a life had planned \nWalk in the blue light you'll understand\" \n\n(and so on...)?\n\nIs this a case of \"beam me up, Bobby!\"? Who knows...\n\nWhile definitely obscure, it makes for a fun albeit perplexing occult mystery to delve into from time to time. As well, I can't get enough of Liebling's seldom employed, high-pitched crooning when he goes \"Walk in the blue light, you can find out - You'll find out\" for the last time before Griffin's redolent and tactful solo wraps things up while beautifully paying homage to the late, great Victor McAllister (RIP) from Pentagram's early days.\n\nAt the end of the day, longtime, faithful Pentagram fans such as myself were left sorely wanting coming on the heels of 2004's masterpiece Show 'Em How. Last Rites is basically a not-so-great album with a few great tracks scattered though out. In short, this makes it the ONLY release I DON'T recommend to those of you new to Pentagram's pioneering brand of devil-may-care, hard-as-it-gets blues skullduggery to the tune of Bobby Liebling's at times solemn, at other times hysterical vocal/ stage hijinks. To older 70s hard rock loving bluesmen I highly, highly recommend First Daze Here (not so much First Daze Here Too although it has its moments) and to a younger generation looking for grittier but no less gripping developments, ANY of the releases mentioned above. Thankfully, as conveyed by the title of this review, Last Rites constitutes no more than an unfortunate setback on the road to newborn success, namely the Curious Volume LP released a couple of summers ago. On a somewhat related note, isn't it uncanny how closely the cover art of fellow Americans Hessian's full-length debut, 2014's Bachelor Of The Black Arts, resembles that of Last Rites'? Just figured I'd throw this out there for shits & giggles.\n\nHighlights:\n\n\"Into The Ground\"\n\"8\"\n\"Everything Is Turning To Night\"\n\"Walk In The Blue Light\"\n\"American Dream\"\n\"Death In 1st Person\"\n",
        "\nPentagram's first three albums were arguably all classics, since Relentless (aka Pentagram), Day of Reckoning, and Be Forewarned all contained a shitload of great doom riffs, a surprisingly exuberant pace, and end of days prophesizing courtesy of Bobby Liebling. However, when half the lineup was shed for the following albums, something was lost, not to say the subsequent output has been poor. This means that Last Rites feels like a comeback album, following a mighty 7 year silence since Show 'Em How and heralding the return of Victor Griffin, wielder of huge riffs.\n\nThe band don't exactly revert to their classic 80s and 90s sound though, sticking with some of the hard rock style that had been used on the preceding album and mixing the broad, booming guitar back into some of the songs. In fact, the sound on Last Rites actually goes back to the 70s, as if Pentagram had looped back round to their earliest days with a heavy Sabbath influence as well as more relaxed rock style that makes the record sound nostalgic, even bluesy, particularly on the mellow likes of 'Windmills and Chimes'. Griffin is still playing some decent doom riffs, though not blasting out riff after riff as he did on Be Forewarned, while the drums are certainly less aggressive and bombastic than they were in the days of Joe Hasselvander, often content to move in accord with the guitars, or even more slowly on the likes of 'American Dream'. Liebling has also taken his vocals a notch down, mellowing and controlling his voice more than ever before (no mad shrieking here), which results in less personality in many of the songs. Thus, the question really is whether this is a step forward from Pentagram or a safe revisionist exercise in writing some decent tunes and making some money. Sadly, my compass needle is pointing to the latter, since this just doesn't have the necessary sense of adventure or thrill of conviction that one would hope for.\n\nWhat really shocks me is just how predictable most of the songs are. Having settled into writing more conventionally structured songs on everything since Show 'Em How, this album has nothing exceeding 5 minutes and only the expectedly attention-grabbing opener 'Treat Me Right' firing through its length faster than usual. We don't quite get verse-chorus-verse structure on everything, but the effect is much the same, most songs lacking surprising features. In general, Griffin churns out a riff to get started, Liebling introduces himself, Griffin counters him with a melody or short solo, Liebling repeats himself, then Griffin solos before the song brings itself to a close. Nothing terribly exciting happens, except for a few moments like Liebling's sudden authoritative \"Was it really you I saw in a dream last night? / I was always there to grab you / You didn't hold on very tight\" in the middle of 'Horseman', which is otherwise fairly average. Then there's 'Death in 1st Person', where a different problem occurs; namely, Griffin plays a great creepy riff but the vocals can't match up to it, sounding like Liebling is writing a shopping list while a horror film is playing in the background.\n\nThat kind of complaint colours a lot of the album, but that's not to say Last Rites is a complete failure. There is a comfortable, relaxed atmosphere to the grooves here, so that I don't feel gripped by the songs such as '8' or 'Everything's Turning to Night', but I can listen to them to calm down and enjoy the fat tones that the guitars tickle my brain with. The progress of most songs is unhurried (in fact more so than previous doomier albums) with only a few crushing down with power and heaviness, namely the opening pair and the concluding 'Nothing Left'. Those are among my favourite cuts, along with '8', which picks up its strength from a steady momentum and Liebling's passionate delivery, while those mellower numbers sometimes leave me cold depending on my mood.\n\nLast Rites is possibly Pentagram's weakest album, since it doesn't bring any fresh ideas to the sound, nor are all of the songs winners. However, it is worth a listen, especially for those hungering for the past and something to slowly grind their hippy dreams into dust.\n",
        "\nHaving listened to mainly 70's era Pentagram, it took me a while to warm up to the post Vincent McAllister (RIP) days, due to their rough shod and less bluesy Death Row releases. However, any doubts I had regarding this pioneering DC based band were shattered by the 2004 release Show 'Em How. \n\nUnder its current record label (Italy's Black Widow) and with all-new members, Bobby Liebling's Pentagram further establishes itself as a purveyor of lugubrious yet upbeat doom metal with this release, getting the blood pumping by way of its gritty and austere overtones. Old time favorites ranging from \"Catwalk\" to the hard-hitting \"Starlady\" return with a bang thanks to a refined make-over and an excellent production, greatly enhancing their appeal. As for previously unreleased material, there is the eclectic \"Elektra Glide\" and \"Prayer For An Exit Before The Dead End\" along with stand out piece \"City Romance\", all welcome additions to the Pentagram song vault. \n\nReplacing Victor Griffin this time around is equally competent Kelly Carmichael, formerly of Internal Void. Bassist Adam Heinzmann and Mike Smail (still active with Penance) complete the line-up. Bobby Liebling continues to wax poetic and philosophical on themes such as the peril of being irresistibly driven by a fatal temptress on \"Goddess\" or the lure of reckless urban living amidst \"City Romance\". The former is beautifully rendered with Liebling's outstanding prose and vocal delivery capped by Carmichael's rich and colorfully phrased guitar solo. The latter, my favorite track, gets right in there with a super chill bass line before being accompanied by a crushing guitar riff which kicks like a bad-tempered mule who just stepped on a rusty nail. Liebling is on fire with the following quirky exclamations:\n\n\"City noose 'round my neck but I knew I'd never break/I love to bay at the moon while all the other dogs barked.\" \n\nand\n\n\"Closer I step to the edge of the ledge\nwhere inferno meets ice my god! ow! It went to my head\nIf I ventured any further to the end of the board\nI like the \"thrill of the kill\" the \"shudder click\"\nI'd be a bull seein' red\".\n\nDeadly!\n\nAlong with \"Goddess\", a couple more songs from their 70s compilation Human Hurricane are found here as well. \"If The Winds Would Change\" features some more melancholic verses courtesy of our esteemed front man. Upon hearing it, you'd think it was a forgotten Nixon era AM radio staple. That's not saying it's a weak track at all; it simply provides a bit of levity to an otherwise raucous mix of doom laden chutzpah. It's quite a mournful song akin to \"Last Days Here\", also included on the album, and \"Windmills And Chimes\", from Last Rites. \"Show 'Em How\", the next to last as well as the title track, starts off with a romp but blends into a bluesy jam midway. With it's mellow drum work and laid back bass lines, it sounds like something from the first Black Sabbath album or Blues Obituary by the Groundhogs (a band that heavily inspired and influenced Bobby Liebling, along with Blue Cheer, Captain Beyond and Bang!, to name a few). Oh, lest I forget, as festive opener, you've the lewdly bashing, laid-back and wang-y, Ozzy-styled hand-clapper, \"Wheel of Fortune\", which, along with \"City Romance\" and \"Goddess\", is an all-time 'gram favorite. (Chuck Woolery approves!)\n\nShow 'Em How is one of Pentagram's stronger offerings, including their latest release Curious Volume and the First Daze Here vintage collection. It's a shame they didn't produce more albums with this line-up. Being the only remaining founding member, Bobby Lieblings's choice of musicians is consistently right on the mark and his performance here is top-notch. As far as his detractors are concerned, this record will surely \"show 'em how\".\n",
        "\nAs we wrap up the year and come around the bend into the next, I've decided to skip the champagne and all the hoopla and simply take the time to celebrate one of my preferred 2015 releases, Pentagram's tour-DE-force Curious Volume. Bobby Liebling, supported by a line-up as solid as ever, has pulled out his trump card with this one and proven that you can't keep a good man down! (or band for that matter). This is without a doubt Pentagram's strongest performance since Show 'Em How ('04), despite still having come a long way with Last Rites ('11). \n\nAside from the addition of a new drummer, Pete Campbell, the band remains comprised of Liebling on vocals as always, long time member Victor Griffin on the guitar, and Greg Turley on bass, once again filling Greg Mayne's shoes nicely. \n\nWhat really stands out this time around is the fact they only cover one 70s era track, Earth Flight, and present their faithful following with a cornucopia of fresh new songs, all winners from the opener \"Lay Down And Die\" to the closing \"Because I Made It\" in which Campbell cleverly displays some Bill Ward style drumming . As well, I can't help but notice how smoothly they pulled off blending the band's early 70s sound with the heaviness of its Death Row days. \n\nBobby Liebling's signature swagger is clearly discerned throughout the album and at times, replaced by his mellow and reflective side, such as during the bridge on \"Close The Casket\", right before the song really takes off as Griffin closes the deal with his trademark brand of fire & brimstone riffing. You've got to love the chorus too: \"The black passed away and now my night is day/ I close the casket on the old man's ways/ And now I see through the eyes that were blind/ And close the casket as the old man dies.\" I shall make this my funeral song.\n\nWith \"Misunderstood\", Liebling and company go for a rockabilly feel and succeed with its 50's style soloing and bass playing. As it is, there are no lackluster pieces on this release nor are the songs repetitive in any way. On the other hand, \"The Tempter Push\" dominates with the laid back doom & gloom stride Pentagram fans have grown to embrace and expect. \n\nThis is also Victor Griffin's strongest performance since his work on the first two Place Of Skulls albums. It is not enough to simply acquire this album; if you are new to Pentagram or a long-time follower, I highly recommend watching the \"Last Daze Here\" rock-u-mentary which follows Bobby Liebling's rise from the ashes of the sub-basement to his redemption and acclaimed return to the doom metal community. His outstanding recovery is graciously upheld by Curious Volume. Surely, it goes above and beyond to represent the Pentagram we've grown to love and respect.\n",
        "\nAs everyone knows by now, 2011's Last Rites and the accompanying Last Days Here documentary depicted Pentagram vocalist Bobby Liebling getting off the drugs, crawling out of his parents' basement, and restoring his band's relevancy in the modern doom community. Misfortune has plagued the man in the four years it's been since that album's release but the persisting exposure and return to Peaceville Records are enough to suggest that the band's fifteen minutes may not be up yet. Most miraculously, the lineup changes are minimal by Pentagram standards as drummer \"Minnesota\" Pete Campbell was brought on, guitarist Victor Griffin left but came back on in time to record the album, and bassist Greg Turley stayed on all the while.\n\nLike the last couple albums before it, the sound of Curious Volume draws more from the classic 70s style than the heavy doom of their first couple full-lengths. But while Show 'Em How tried its hand at energetic rock and Last Rites offered a more contemplative outlook, the album has a noticeably gritty style in comparison. The reflective nature can still be felt in spots, particularly on the closing \"Because I Made It,\" but most of the songs on here have a much more driving nature. This is best seen on \"Misunderstood\" as its upbeat protopunk riffs make it one of the band's fastest songs since \"Drive Me To The Grave.\"\n\nThis subtle shift in style is also reflected in the musicianship. While there aren't too many classic riff driven monsters on here, Griffin's guitar has a rough edge that has arguably not been seen since the days of Be Forewarned. The drums have the typical loose feel and Liebling's vocals don't stray too far from the haggard, lower pitched delivery of Last Rites. This may be the only sound that his voice can sound good with but I'm sure there's an alternate universe where he went down the Ozzy Osbourne route of vocal processing and overcompensation. I'm glad I don't live in that universe.\n\nAnd true to all Pentagram efforts, Curious Volume is packed with variety. While the start-stop riffing on \"Lay Down And Die\" starts things off on a slightly awkward note, things pick right back up with the \"Black Night\" style swing on \"The Tempter Push\" and \"Sufferin'\" utilizes the tempo later on to entertaining effect. First Daze Here fans should also be pleased by the inclusion of the bass heavy \"Earth Flight\" while doom fans will go for the downtrodden grooves on songs such as the title track and \"Close The Casket.\"\n\nAmidst the various lineup changes and tonal shifts that have plagued Pentagram through their forty year career, they've been on a solid plateau in terms of songwriting since Be Forewarned. The same could be said for Curious Volume. It doesn't rise too far above any of their previous efforts but it fits right in with them and may be their most authentic sounding effort since their heyday. Established fans will eat this up and listeners who missed the last couple wouldn't be discouraged from giving this a shot either. No one knows how much Pentagram has left but let's hope they can hang onto Victor Griffin for a while longer.\n\nHighlights:\n\"The Tempter Push\"\n\"Earth Flight\"\n\"Misunderstood\"\n\"Close The Casket\"\n",
        "\nPentagram, for me, is a great band with a couple of obvious problems. The first problem is that they didn't manage to put out their music at the time they were actually writing most of it. Call it what you will, be it luck, mismanagement, drugs, internal problems, or lack of interest, but the band that resurfaced in the 80s didn't resemble the band that went under in the 70s, nor would I be writing about them in the same way if they did. The second problem is that the same basic inconsistencies that lead a band to any of these problems have also dogged them since the reformation and release of the debut album. I don't believe that Pentagram would have been as big as Black Sabbath or as revered as Candlemass, since they don't sit at either end of the doom metal pantheon for enough time to achieve any particular niche. Always low-pitched and distorted, their sound is neither mired in the crawl of depressed doom, nor flung into the spine-tingling exultation of the more spiritual variety.\n\nThis album annoys me more than a little because of what so clearly could have been. Gone are the issues with sound and production on the debut, which was recorded in such a way that little finesse could be added to the songs and the slower numbers suffered in the lo-fi mix. Here, the sound is very close to what would emerge on 'Be Forewarned', except that the drum sound is slightly softer (i.e. the snare is regular rather than a whip crack) and Bobby Liebling's vocals sit just a tad further from the front of the action. Simply put, it's the production that Pentagram always needed and allows the four guys playing to include skill, excitement, and emotion with each of their instruments. They waste some of this potential though, by being slower (actually doomier than usual) than the preceding and following albums, relying on an atmosphere that isn't always there, and crafting songs without defined identities. This is my gripe: doesn't 'Evil Seed' remind you of 'Hand of Doom'? Haven't you heard 'When the Screams Come' somewhere before, and I don't mean on 'First Daze Here', where it's original version is remarkably similar to the 1987 version? There are some songs that just aren't that creative, which make the distinctive ones sound so much more exciting. If this album was long, like 'Be Forewarned', and those songs gave different moods and aspects to the album, I wouldn't complain nearly so much, but this album has seven songs and falls short of 35 minutes, so if we are forced to retread old ground for 10 minutes, there's clearly not much new material to digest. Rant over - on to the positives.\n\nVictor Griffin's guitar is a big feature on 'Day of Reckoning', more with the leads, melodies, and additional parts than with the riffs, which are often more hard rock-based than heavy metal. His approach is predominantly a simple one, over which he can add further simple layers of decoration and atmosphere, as evidenced by the echoey, dreamy solos that he indulges in on songs like 'When the Screams Come' and 'Madman'. He also uses a lot of effect in these parts, so they drift by, but the faster building sections of the title track and 'Burning Savior' produce a rush of adrenaline and a foreboding of something approaching that is un-doomlike yet very apt for the genre. Martin Swaney's bass thrusts and jabs like an old woman with a broomstick and keeps the sound powerful when Griffin is playing melodies by himself; the album sounds much better and livelier for his contribution. The drums are apparently provided mostly by Stuart Rose, but they sound similar to Joe Hasselvander's style that the band would rely on before long. Much busier and uptempo than most doom drumming, the snare's rhythm is key to the pace of the songs, while the march of 'Wartime' is perfectly regulated and turns an easy song and riff into a true pleasure, not to mention the chaos when the pace starts to pick up. Liebling is, as I mentioned, a little quiet, though this suits some of the lazier songs, where his defiant proclamations might spoil the atmosphere: in fact, he sounds like he is really singing with the band rather than on his own whim, which is a stark contrast to his rabid performance on some of the other 80s material.\n\nThe songs are where I decide whether or not I like this album, because, arguably, all of the performances exceed the quality of all Pentagram's other work, Griffin's merciless riffing on 'Be Forewarned' aside. There are three excellent songs: the first, the last, and the epic. The title track is swift, taking a moment to set up and then bouncing off on a James Bond/Mission Impossible riff (you'll understand when you hear it), before building up to a great breakdown - the whole thing is over before you realise it's begun. 'Wartime' is the best organised song on the album and it sprawls in a way that a five minute track really has no right to do, moving through many moods and includes the best riffs of the album. 'Burning Savior' takes its nine minutes to heart and begins acoustically before going through the satanic woods and out the other side on a remarkably overblown solo that does exactly what Griffin should have done on '20 Buck Spin' from the previous album. I also rate 'Madman' and 'Broken Vows' pretty highly; then there are the two more derivative songs which I think should have been given more care and thought.\n\nThese guys have been cursed for most of their existence and still managed to turn out several excellent releases. 'Day of Reckoning' rates highly among them, though it does feel like an opportunity squandered, with at least the potential to have rivaled 'Be Forewarned' (for me, their greatest achievement). It stands high and is probably the most classic slice of doom that they have ever delivered, with the inclusion of some superb songs. Peaceville have also been key in the band's recent resurrection and new publicity, so I will mention that their re-releases of Pentagram's work are the ones that I own and have been compiled and creative with the utmost care and love.\n",
        "\nThis was the first true doom metal record that I ever owned, and I've played it over and over again ever since. I am not sure what draws me to Relentless. Maybe it's the Ozzy like vocals. Maybe it's the wonderfully fuzzy guitar tone. Or possibly the eerie riffs and lyrics. One is for certain though: It's my favorite doom record of all time. With all of the odd other versions and the ominous cover featuring a Pentagram in the 1993 versions and on, you'll feel this album's sinister power too. \n\nThe first thing that comes to mind when I think of Relentless is its magnificent songwriting and arrangements. Songs like \"Sign of the Wolf (Pentagram),\" \"Death Row,\" \"The Ghoul,\" and \"Sinister\" although very different, all share the same characteristic: they have stupendous songwriting. The riffs that are used to fill space are played only as necessary, and those that are fantastic are repeated, usually with a nice solo over them.\n\nAnd speaking of solos, I can never get enough of Victor Griffin's melodic solos. They have an emotion that is attached to them that is very easy to feel. It's one of desperation and strife, but also power and might as well. They along, with Booby Liebling's haunting vocals make up the icing on this metal cake. There is something in the way that he phrases the lyrics in Pentagram lyrics that just gives me the chills. His range in this album is great. He hits high notes with force and the low ones with a evil quality to them. You can find both Liebling and Griffin's best playing/singing in \"Sinister\" and \"Sign of the Wolf (Pentagram).\" Bassist Martin Swaney can be heard in this record very well. He doesn't do anything too wacky, but he does his job of being the band's musical muscle very well. Joe Hasselvander was an interesting player on this record. He did his job as a metronome in songs where the guitar was focus, but also beat the tar out of his set in songs like \"Dying World\" and \"Relentless.\" Overall, this lineup was one that harnessed the power of this band's music.\n\nPentagram's production had a definite old-school vibe to it. when some say that it sounds dated, I say simply say back to them that they captured a sound of legendary bands like Black Sabbath. Considering that bands who released records in 1985 and the couple of years surrounding it were producing records of a more polished production (Metallica is an example), this was a complete success in reproducing the old-school sound. Also, I could hear every instrument on every track. Sometimes I would have to strain my ear, but at least it was possible. \n\n\"Sinister\" is in my opinion, the best track of Pentagram. Just listen to it. It reeks of evil and deviant debauchery. After listening to it, you can easily tell that the song is being sung from the perspective of Satan. It features some of the darkest riffs that Swaney and Griffin have to offer and Griffin throws in a melancholy solo to boot. Bobby Liebling and Hasselvander absolutely nailed it on this one. Along with \"Sinister\" all of this record's songs are original and different from each other. There isn't one bit of filler, which automatically puts my rating for an album in the ninety percent range.\n\nFor an album that is so perfect, there isn't much else to say, except listen to this thing. It's an essential for every doom metal fan and a very much recommended listen for those who like metal in general. Die on.\n",
        "\nPentagram are one of the most fucked up bands out there. They never got a break when they should have, then when they resurfaced 10 years after their time they decided to ignore everything that was going on around them and put out - in vastly altered form - the material that should have been so influential to begin with. Regardless of the time gap, Pentagram and Black Sabbath are often seen as revolutionary doom peers and I stake my support firmly with Pentagram's camp as the more interesting band. Notice, I don't say the better band, because I don't really believe that Pentagram are better than Sabbath and I think the right band got the attention. However, that's my preference.\n\nRelentless (I'm reviewing the second version of the release) plays almost like a live album. As soon as 'Death Row' booms abruptly out of the speakers, every note for the next 40 minutes sounds spontaneous, off-the-cuff, and gloriously unprepared. That's one of the best things about this album and it's also one of the worst. It's great because the songs themselves are actually quite simple and would fall flat with a generic performance or studio-rehearsed quality, plus it keeps the excitement high despite the relatively slow pace of the album. In fact, it sounds much faster than any other Pentagram album purely because of the next-room immediacy of the recording, which is a massive plus. However, the live sound also results in an occasionally unbalanced sound, usually in the vocals, which suddenly shriek across the whole band when Bobby Liebling goes for a climactic declaration. It's messy and unprofessional, especially considering that Liebling doesn't have the perfect singing voice, but I suppose it's acceptable given the circumstances.\n\nThe instruments individually get a good kick out of the album's sound. Everything is bathed in a grimy, cobwebby film that provides atmosphere at any pace, though doesn't suck the power from anything, except maybe the drums. They come across slightly quiet and boxy, although actually played with a good deal of attack on at least half the songs, with more notes per second than the majority of doom bands, as well as many many fills and variations. Listening to the drums alone, you wouldn't expect this to be a doom metal album at all, but the guitar tone (and tuning hahaha) are nothing but pure doom. Victor Griffin plays down at B and the sound is so wide and warm that the quartet never sound anything less than colossal, even if his style is more akin to hard rock on songs like 'Run My Course' and 'The Deist'. The riffing mostly remains simple, with emphasis on momentum or oppression, depending on the pace of the song; however, Griffin has an ear for a good riff regardless of technical ability and 90% of his contributions sound great, especially because the bass always deploys maximum power on keeping that wall of sound absolutely gigantic. The licks and phrasing of both instruments add a lot of joy and spontaneity to the album, which is its major asset.\n\nThe first 5 songs are all incredible doom classics. 'Death Row' just blasts riff after riff after riff at the listener and doesn't let up until it starts to fade out, while 'The Ghoul' is a churning, menacing number that completely lives up to its title. Perhaps the highlight, 'Sign of the Wolf' somehow manages to be a super-catchy 3 minute atmospheric epic with amazing lyrics and a gorgeous key-change in the solo. A few less impressive songs hang about Relentless, like the rather ponderous 'Sinister', which trades Griffin's riffs for menacing chords, plus the slightly plain 'You're Lost, I'm Free' and 'The Deist'. The closing track '20 Buck Spin' has a very lively first minute, but then loses its way, relying on an extended solo for excitement that should sound like Griffin's star moment though in fact is the worst on the album, with no atmosphere and repetitive shredding - a real turn-off to end a great album.\n\nRelentless is a massively flawed and patchy album which shouldn't be anywhere near as enjoyable as it is. Nevertheless, there is just so much character in the performances and such immense quality in the good songs that it weighs the album heavily with the \"classic\" tag. There are probably 6 classic songs here (the openers, plus 'Dying World') and those inspired performances win the album my love and admiration.\n",
        "\nLet's say you're listening to an hour-long album. The first questionable decision the band makes is 50 minutes in, and the slightly unnecessary 2 minute instrumental puts you into the most fragile state you've been in for months, right before the aching purgatory of 'Be Forewarned' crashes down on your soul. That's right, Pentagram fucking rule on this album. Review over, go home.\n\nIt's hard to describe what makes this album so great without going track by track, so I'll try not to be boring or start licking Bobby Liebling's balls (wouldn't you, just to say you had?). I actually came to doom metal the wrong way round, because I had albums by My Dying Bride and Cathedral and Paradise Lost before I found my way to Pentagram or even engaged properly with Black Sabbath. So the old school quality of Be Forewarned is what I'll start with. Some of these songs are carried over from the band's original incarnation in the '70s and there are lots of classic/retro features, like the fuzzed out riffs and mellow chords or Liebling's impassioned hard rock vocal delivery. He comes to heavy metal in the same way that Ozzy does - from somewhere completely different. It's become old hat to ape Ozzy, but the truth is that he didn't sound like anyone else at the time, nor does he sound like anyone else now, because his imitators aren't trying to change anything. Ozzy sounded unearthly, Liebling sounded ungodly, and, at a push, Lee Dorrian might join them by merit of him sounding unusual. None of those 3 singers are really that talented, but they all sound utterly unique, which is far better. Plus, you can't argue with someone as terrifying as Liebling when his voice tolls out \"I'll have no remorse for you my friend / When the light of the kingdom calls\" on 'The World Will Love Again'.\n\nLikewise, the talent of the other band members playing on this album is somewhat in question. Victor Griffin is a fucking hero for deciding that he could play in drop B tuning and he churns out memorable riff after memorable riff, but he isn't playing a lot of notes, he isn't expected to play fast, and he sticks to very limited patterns and range when he solos. However, he makes those limits seem more than sufficient, using rhythm, feel, and that ocean-dredging tone to create his impact; the crushing slower parts (check out the intro to 'Life Blood' for the dictionary definition of doom) make the uptempo parts so much more potent, so that 'Nightmare Gown' rushes along like the fever dream it is; he doesn't make a bad choice of note and nails the atmosphere absolutely, especially on that blissful quiet solo on the title track, or the exciting shrieks that pepper 'Frustration'. If you listen to his contribution to 'Vampyre Love', that song could have been written in the '60s and then heavied up a bit for the doom wave. The only song I think Griffin could have done better on is 'Petrified', which creeps about on the strength of one riff, with nary a solo in sight, but his generally excellent riffs and leads (melodies and solos) more than excuse a single disappointment.\n\nYou might question the involvement of a bassist at all in an album that includes Victor Griffin's signature guitar tuning, but Martin Swaney doesn't leave all the playing to the 6-stringer. His throbbing instrument (yup) is the motor of the band and the album would be pretty dud without it. Think about it - have St Vitus ever sounded as alive as Pentagram do on a song like 'Wolf's Blood'? Swaney's bass lets Griffin go on plunging and booming without losing the important energy from the band's sound, meaning that when things get fast (comparatively fast, that is) on a song like 'Live Free and Burn', the riffs still crush rather than sounding clumsy and weak. Joe Hasselvander plays an important counter-role to these two and actually displays the most ability here, cutting through the low end tar with a whip-crack of a snare and a sprightly, fill-heavy style. He's rarely just playing the beat and is the important factor in stopping this become \"too\" doomy - i.e. coma doom.\n\nThe great part about Be Forewarned is that it is quite clearly more than the sum of its parts. The details are all attended to with the utmost care. I own Peaceville's reissue of the album and it's absolutely gorgeous, a little bit off the wall, and totally appropriate. Some of the lyrics are stunning, such as the first verse from 'Ask No More':\n\n\"You're about to step up off the platform\nYou, the one who sold your soul away\nTo travel down my mind made moonlit passage\nA million miles exactly to the day\"\n\nThe musicians are all decent, but their performances are all impeccable. The songs are all heavy and doomy, but there is so much variety that you could easily pick a new favourite song of the album every month for a year. The whole album sounds timeless: some of these songs were written 20 years earlier than others, the influences are classic, and the sounds are modern, but the result is eternal. That's the point of doom metal. Doom metal isn't about the now, nor is it really about the past, even though that's what many bands turn to. It's about knowing that you have been doomed, that you are doomed, and that you always will be doomed, and there isn't a band who can explain that better than Pentagram.\n",
        "\nWhile thrash and death metal ruled in the mid 80s, there was an underground metal scene that went largely unnoticed in comparison: doom metal. In the UK, bands like Witchfinder General and Pagan Altar used the doomier aspects of Black Sabbath's music to create some very good NWOBHM. In the US, there were primarily two bands that would use the dark, heavy elements of Black Sabbath's music to create their very own brand of metal that would become known as doom metal. These bands were Saint Vitus and Pentagram. The latter one had been around for longer, but released their debut album around the same time Saint Vitus did.\n\nPentagram's self-titled debut album (sometimes known as 'Relentless') is some of the dirtiest and most ass-kicking heavy/doom metal you can find. This particular Pentagram line-up was by far the strongest. Bobby Liebling IS Pentagram. Throughout the years, he has written absurdly many songs; and many of these songs were recorded in their early days in the 70s and almost scored the band a good deal that would most likely had made them a big band a la Black Sabbath. But, Liebling's drug addiction and stubbornness sort of blew it for Pentagram and they would go on without any proper release until the mid 80s, when this gem was finally released.\n\nYou can compare Pentagram's debut with Saint Vitus' debut in many ways: it's definitely doom metal. The album artwork is very simple; black and white/grey, the riffs are a mixture of raw, dirty and groovy rockers and slower crawlers, both bands have a solid rhythm section; and certainly the bands have their very own madman singing in the most haunting ways possible. On top of that, the production is similar on these albums: highly unclean! This is a good thing, because it sets the dark and mysterious atmosphere for these obscure (at the time) bands.\n\nThe key difference between Pentagram and Saint Vitus are their musical backgrounds (influences). While Black Sabbath are obviously a huge influence on both bands, they borrowed from two different genres. While Saint Vitus' sound was punk-influenced doom metal (Black Flag + Black Sabbath), Pentagram relied more on actual heavy metal (Judas Priest, for instance), as well as the dirty, heavy and down-tuned guitar tone that is often associated with doom metal. Whether this was a sign of Pentagram's instrumentalists being better musicians than Saint Vitus' or if it was simply a matter of taste, I don't know, but Pentagram's axe-man Victor Griffin created some mean, heavy/doom metal riffs and had some great leads/solos, whereas Saint Vitus' Dave Chandler relied on simpler and wilder riffs and solos (like punks do). Joe Hasselvander's drumming is magnificent. It's solid, tight and yet loose, as he's not afraid in throwing in impressive fills and utilize his kit to its fullest. Martin Swaney's bass isn't that audible on this release, but certainly does its job well.\n\nThe music on 'Pentagram/Relentless' is varied. There are some traditional heavy metal-inspired doom rockers like \"Death Row\", \"Relentless\" and \"Dying World\" with some lively riffing and up-beat tempo. Other tracks are slow and heavy, and can be considered \"true doom\", such as \"All Your Sins\", \"The Ghoul\" and \"Sinister\". And then finally, there are some elements of Liebling's earliest influences (Blue Cheer, UFO etc.) on tracks such as \"Sign Of The Wolf (Pentagram)\" and \"20 Buck Spin\"; the latter one being a song written by Liebling in the 70s.\n\nThe dark, dirty, groovy and of course heavy music on Pentagram's debut is something that is and will continue to be revered among fans of doom metal and probably most heavy metal fans in general. Despite losing out on \"the big scene\", Pentagram's influence on heavy/doom metal is immense, and is second only to Black Sabbath. And for being such a dirty and evil/mad sounding record, Pentagram's debut is surprisingly accessible thanks to the very decent mix of spices in each song. This is a must-listen to fans of doom metal all over the world.\n",
        "\nPentagram's seventh full-length album was the most hyped release they ever put out. Released a long seven years after Show 'Em How, Last Rites is the group's first record distributed by Metal Blade Records and features another new lineup with their prodigal son Victor Griffin returning for guitar duties. The album also came out alongside the Last Days Here documentary, thus giving it the ultimate feeling of having been through hell and back.\n\nDespite the severe time lapse, Last Rites isn't too far removed from its predecessor in that it spends more time reaching back to 70s rock than any doom aspirations. However, it sets apart by using the psychedelic textures to create a more somber, reflective atmosphere. Even the heavier numbers like \"Into The Ground\" and \"Nothing Left\" have a more contemplative side that fits right in with the softer numbers.\n\nThe band dynamic also seems to have straightened out. The vocals haven't exactly improved but they haven't sounded this good since the 90s and really fit in with the album's melancholic feel. Griffin's tone isn't quite as blistering as before but his presence gives the material some weight and he even performs lead vocals on the wistful \"American Dream.\" No word on how they managed to pry the microphone away from Liebling long enough for them to pull that off...\n\nAnd once you get to the songs, you'll find this to be Pentagram's most varied album in quite some time. The one-two punch of \"Treat Me Right\" and \"Call The Man\" are the album's fastest tracks, \"8\" and \"Windmills and Chimes\" provide the most atmosphere, and songs like \"Everything's Turning to Night\" and \"Walk In The Blue Light\" have the best of both worlds. \"Horseman\" and \"Death in 1st Person\" are admittedly weaker than the others but they are balanced out by the best songs the band ever recorded.\n\nPentagram's albums never reached a quality in need of a traditional comeback, but Last Rites showcases a band that feels revitalized, reflective, and perhaps even a little ready for the future. It's probably on the same level as the post-Death Row material before it but it may be easier to get into for newer fans. We can only hope for a better balance between rock and doom in the future now that Victor Griffin's back in the fold; the \"All Your Sins\" reprisal has to be hinting at something...\n\nHighlights:\n\"Into The Ground\"\n\"8\"\n\"Everything's Turning to Night\"\n\"Walk In The Blue Light\"\n\"Nothing Left\" \n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nIt is easy to see why Pentagram's sixth album is considered to be their rock bottom release. It's certainly the most contradictory album; the band was basically just Internal Void backing Bobby Liebling instead of their normal frontman and the songs are almost all 70s tracks that the band hadn't gotten around to recording yet. The mainstream rock world was starting to catch onto the band's influence via the First Daze Here compilation yet didn't have the incentive to see what they had to offer this late in the game. And yet, Show 'Em How still ends up being another solid edition to their discography.\n\nWhile Review Your Choices and Sub-Basement were also quite reliant on old songs, Show 'Em How could be their antithesis in terms of presentation. The tone is still fairly heavy and the vocals are about the same as before, it's a stretch to call this a doom metal album. The songs chosen for it as among the most psychedelic in their repertoire and even the three new songs have more in common with Captain Beyond worship than anything Hasselvander or Griffin put together. In short, it is their lightest, most upbeat, and maybe even most accessible release to date.\n\nThe band also has some decent chemistry and fits the material well enough despite the disjointed pairing. The guitars and drums offer the usual Pentagram tricks and the bass puts on some surprisingly strong performances on songs like \"Starlady\" and the rocking \"City Romance.\" Elsewhere, the vocals retain their character but seem to be a little more energetic as Liebling whoops, hollers, and throws his voice around more than usual. He was stoned out of his mind and trying a little too hard, but the presentation sounds better than one might think.\n\nWith that said, one's opinion on Show 'Em How will likely depend on how you feel about First Daze Here and other compilations that have the original recordings of these songs. The actual compositions haven't been altered all that much over the years but there is a certain spontaneity lost that could be a deal-breaker. The ongoing vocal decay will also be a pretty big turnoff though there is a certain beauty to hearing the rendition of \"Last Days Here\" when you think about everything that's happened since the song was first recorded...\n\nLike Sub-Basement before it, Show 'Em How is surprisingly solid but not an immediate recommendation for first time listeners. The absence of doom makes a tricky sell for metalheads and 70s fans may find the performances inferior to the originals, but the songwriting still makes it worth checking out. I'd say to go for the First Daze Here collection and Interval Void's songs as you may find those to be more accessible ventures.\n\nHighlights:\n\"Starlady\"\n\"City Romance\"\n\"If These Winds Could Change\"\n\"Show 'Em How\"\n\"Last Days Here\"\n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nPentagram's fifth full-length album seems to parallel Day of Reckoning in some ways. The second of the two collaborations between Joe Hasselvander and Bobby Liebling, it was released just two years after Review Your Choices and shows the duo getting a little more comfortable with their circumstances. It's not quite a classic but it just might be the band's most underrated venture to date.\n\nPentagram's image and style haven't changed all that much but Sub-Basement is one of their most upbeat albums. They've certainly had faster songs before but \"Drive Me To The Grave\" has a borderline thrash execution previously unseen and the songs are much more chorus-oriented than before. These two factors are best demonstrated on the chugging verses and sing-along hooks on \"Bloodlust,\" but even the slower songs like \"Go In Circles (Reachin' For An End)\" will get stuck in your head before you know it.\n\nThis is further reinforced by the improved production and performances. The production is still pretty heavy but it is cleaner and gives the guitar a looser feel than the previous album. Of course, the vocals are still pretty worn out but they don't get as distracting this time around.\n\nIt also helps that the number of songs is the lowest it's been since the 80s, seemingly giving the duo more to work with on each one. There are still a bunch of old songs presented but they fit in better with the tone as the grooves on tracks like \"Tidal Wave\" and \"Target\" don't sound as forced. They also keep trying new things as \"Buzzsaw\" throws out a few quirky vocal effects and the title track invokes an odd ambient intro before the riffs kick in.\n\nSub-Basement isn't on the same level as their classic efforts but it is still a surprisingly good album. Some elements still make it tricky for new fans to get into this but there are solid songs for those who do seek it out. But in the Pentagram fashion, another dramatic shift kept its ambitions from being fully realized...\n\nHighlights:\n\"Bloodlust\"\n\"Buzzsaw\"\n\"Drive Me To The Grave\"\n\"Go In Circles (Reachin' For An End)\"\n\"Tidal Wave\"\n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nBobby Liebling may be his own worst enemy but you can't accuse him of giving up for too long. Having been coaxed out of a drug-induced retirement by drummer-turned-instrumentalist Joe Hasselvander, Review Your Choices is the band's fourth full-length studio album and the first of two to feature only two musicians as Hasselvander plays all the instruments that accompany Liebling's tortured warbling. It's a ballsy move for a group of their reputation though it still results one of their more unstable efforts.\n\nIn a way similar to Sabbath's Born Again, Review Your Choices is one of Pentagram's heaviest albums and also one of their most poorly produced. Like the debut before it, the sound is quite raw but it doesn't have the same balance. Hasselvander is a more than competent guitarist though his tone is rather stilted when you consider the more rhythmic approach combined with its overwhelming presence in the mix. Bobby's voice was also pretty shot at this point, resulting in an odd drawl that sounds less like a doomy Dickie Peterson and more like a really stoned Ian Anderson.\n\nThe band was also really starting to use the 70s material as a crutch at this point. While the tracks are pretty well written and always proved to be strong additions to previous efforts, they worked best when challenged by great songs written with the current lineup or when the production suited their inclusion. The title track fits in really well with its more laid back approach but classics like \"Forever My Queen\" and \"Living In A Ram's Head\" are given a big disservice by this production job.\n\nAnd like Be Forewarned before it, there may be a few too many tracks though most of them are pretty decently written. There is a little less variety than before as the songs are evenly divided between fast rockers and longer doom tracks. \"Burning Rays\" and \"Mow You Down\" are among the best entries though the oppressive riffs on \"Gorgon's Slave\" and \"Downhill Slope\" are also worth mentioning. A few songs like \"Change Of Heart\" and \"Megalania\" have some catchy riffs though the structures fall a little short of an essential status.\n\nPentagram has never made a less than solid album but this is where they really got tricky to recommend. You gotta give props to it and its successor for getting finished at all when you consider the absolute hell Hasselvander went through to make them, but it may be one of their weaker efforts. Whether you like this album or not will likely depend on your feelings on the production job. I can certainly get behind it but newcomers will need to review one of their earlier choices first.\n\nHighlights:\n\"Burning Rays\"\n\"Gorgon's Slave\"\n\"Review Your Choices\"\n\"Mow You Down\"\n\"Downhill Slope\" \n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nReleased seven years after Day of Reckoning, Be Forewarned is at an odd spot in Pentagram's discography. It still features the lineup that made their first two efforts so legendary but came too late to capitalize on their momentum. It isn't exactly obscure but it sets the band up for obscurity as Victor Griffin and Martin Swaney would immediately depart upon its release.\n\nLike Day of Reckoning before it, Be Forewarned bares a great influence from Black Sabbath. But while that album mostly channeled the Ozzy era, this effort has more in common with what Sabbath was making around the same time in the early 90s. The guitar tone reminds one of Dehumanizer, most notably on \"Bride of Evil,\" while the title track could've found a place on Dio's Strange Highways. Of course, the band's old school flair is still at full force with \"Too Late\" and \"Frustration\" serving as more light-hearted rock numbers and \"Vampyre Love\" riding an excellent Hendrix-style swagger.\n\nThe band dynamic also seems to have gone through some changes between albums. The vocals are more restrained than before and the chunky guitar tone seems a bit darker, but these factors aid the atmosphere rather than bring it down. Elsewhere, Joe Hasselvander's drums keep their jazzy feel and you can hear the bass a little better than before.\n\nBut with there being thirteen tracks on here comes the thought that there may be a bit too much. You've certainly got your classics and \"Nightmare Gown\" is the only song that is less than great, but songs like \"The World Will Love Again\" and \"Wolf's Blood\" don't quite have the same excitement as past anthems. Fortunately, you still can't accuse them of lacking variety as \"Live Free And Burn\" starts things off on a speedy note while \"A Timeless Heart\" is a lonely acoustic instrumental that builds up to the title track in a melancholic fashion.\n\nOverall, Pentagram's third album is rockier than past efforts but still has a lot that makes it worth checking out for doom fans. It would've been better if it had come out three or four years before it did, but it still gives the Death Row era a good send-off. Sadly, this is the last album that I would safely recommend to new fans as even the diehards found it hard to keep track of the ensuing decline...\n\nHighlights:\n\"Live Free and Burn\"\n\"Vampyre Love\"\n\"Frustration\"\n\"A Timeless Heart\"\n\"Be Forewarned\"\n\nOriginally published at http://psychicshorts.blogspot.com\n\"Be Forewarned\"\n",
        "\nIt has been said that you have your entire life to make your debut album but only a couple years to make your second. Pentagram is a leading example of this trope with their sophomore full-length album coming out a mere two years after their very long-awaited debut. Fortunately, one can't accuse them of rushing too much as Day Of Reckoning just might be their greatest release.\n\nThe guys in Pentagram have always stated that they were more inspired by the likes of Blue Cheer than Black Sabbath, but Day Of Reckoning is where they went all out with an album that the Birmingham giants should've released between Master of Reality and Volume 4. The groovy \"Broken Vows\" and \"When The Screams Come\" are uncanny counterparts to \"Supernaut\" and \"Snowblind\" right down to the Iommi-aping guitar tone. They even lift a couple lines from classic Sabbath with \"Evil Seed\" invoking the opening line from \"Sweet Leaf\" and the pulsating \"Wartime\" mirroring a cry from \"Sabbath Bloody Sabbath.\" The songwriting quality keeps things from being too derivative and the fact that Pentagram was one of their contemporaries certainly helps.\n\nThe diversity that encompasses the seven songs on here also adds to their enjoyment. While a good half of the album consists of groovy mid-tempo doom, the title track and \"Madman\" offer a more fuzzy, energetic approach. In contrast, \"Burning Saviour\" is one of the darkest Pentagram songs out there thanks to its shifts between foreboding acoustics and pounding outbursts all set to a nine minute dirge. On the flip side, \"Wartime\" may not be as gripping as the tracks before it and the bass still isn't that prominent, but these factors are easy to overlook.\n\nThus, Day of Reckoning is not only Pentagram's best album but one of the strongest that doom has to offer. The band retains the chemistry seen on Relentless but also trumps it by giving an improved production job to the perfect balance between their 70s heyday and the heavy Death Row sound. Sadly, the band folded before they could release a timely followup, leading one to wonder if they could've released something even better...\n\nHighlights:\n\"Day Of Reckoning,\" \"Evil Seed,\" \"Broken Vows,\" and \"When The Screams Come\"\n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nPentagram has had some terrible luck over the course of their forty year history. While their influence over doom metal may be second only to Black Sabbath, they will always be remembered as the 70s band who never got their due thanks to the antics of one Bobby Liebling. Hell, their 1985 debut wasn't even intended to be a Pentagram album, as the group of musicians had originally recorded it under the Death Row moniker. Either way, Relentless has become a true classic in the doom metal canon.\n\nSeeing how this was originally recorded as a demo in 1982, it isn't too surprising that this is one of Pentagram's rawest efforts to date. The sound could be compared to Venom's first couple albums in that it has a dirty tone while allowing a balance between instruments. Martin Swaney's bass can barely be heard but Victor Griffin's guitar and Joe Hasselvander's loose drumming set a grim foundation set for Liebling's macabre delivery.\n\nIn a strange bit of irony, this fixture of doom is actually one of the band's faster paced albums and largely lacks the 70s flair that they're otherwise famous for. You sure won't find any speed or thrash metal on here, but songs like \"The Deist\" and the title track seem to take more cues from Judas Priest than Captain Beyond or Blue Cheer. There is also a touch of classic metal influence as a band like Manowar could probably match the gallops on \"Death Row\" if they took enough downers.\n\nBut even if Relentless is one of the band's odd ducks stylistically, it does contain the best songs they ever put out. \"All Your Sins\" is the quintessential Pentagram anthem as a groovy drum roll gives way to a blistering set of mid-tempo riffs and catchy vocal lines. From there, \"Sign of the Wolf (Pentagram)\" is an infectious romp and \"The Ghoul\" offers a percussive yet gloomy taste. 70s diehards will also appreciate the inclusion of \"You're Lost, I'm Free\" and the classic \"20 Buck Spin\" though they don't quite the same power as the tracks before them.\n\nIt may have taken forever for Pentagram to get its first full-length album out there, but the result is worthy of its legendary status. It may not be the band's best album, but it is one of their strongest and truly showcases their lineup at its best as a unit. The albums Saint Vitus and Candlemass released around the time may be better examples of 80s doom as we know it, but this one is essential listening.\n\nHighlights:\n\"Death Row,\" \"All Your Sins,\" \"Sign of the Wolf (Pentagram),\" \"The Ghoul,\" and \"The Deist\" \n\nOriginally published at http://psychicshorts.blogspot.com\n",
        "\nIf you like Blue Cheer and early Black Sabbath, you'll love this. First Daze Here is a compilation album by doom titans Pentagram. On here, we are introduced to some of the earliest recordings by Pentagram, or Macabre, as they were called at the time (I think). In the 80s, many of the songs on this release had been re-recorded and made \"doomier\", so don't expect Pentagram's early recordings to sound anything like their \"proper records\", though, some of the songs are pretty much the same, just with a faster and thinner sound. This is pure bluesy hard rock!\n\nIf you're more into the slow, heavy doom metal in the vein of Saint Vitus and Candlemass, then you'd probably enjoy the later recordings of these songs better. I am one of those people, but I'll admit that \"Starlady\", for instance, is MUCH better on First Daze Here than on Show 'Em How. Another example can be the song \"Be Forewarned\". Both this and the later version of the song are good. The original recording of that song, that you'll find on here, is much shorter and bluesier with a thinner sound, while the later recording of the song, which appeared on the album named after the song, is much longer, slower and \"doomier\", but still has a bluesy touch to it.\n\nEven though the production isn't that good, you'll have no problem enjoying the songs on here. Bobby Liebling is as flamboyant as ever, the guitars are quite simple, but play catchy hard rock riffs much inspired by Blue Cheer and with a tinge of early Black Sabbath, the bass has its moments, and the drums are pretty standard.\n\nFirst Daze Here is a great release by Pentagram. It will introduce you to a very underground and original sound from a young, enthusiastic band. The songs are short and easy to listen to, so you if you're a fan of filthy heavy blues, you could get through this album without a problem.\n",
        "\nWhat would have been considered traditional heavy metal in 1985 was simply not cool. Black Sabbath at that point had been reduced to a solo project with Iommi politely trying to accommodate the more up tempo and cleanly landscape of the day. Those metal bands who played in the vein of albums like Vol. 4 or Sad Wings of Destiny were an unwanted few. The mighty Pentagram's Relentless is a fine slab of heavy metal played by some of the progenitors of the genre. And the title of the record is absolutely apropos, for relentless it is from top to bottom. It's not full blown doom, with the majority of the songs on the fast-ish side, but it is 100% heavy fuckin metal. \n\n\"Death Row\" sets the eerie and foreboding tone of Relentless with its stomping riffage and the demonic voice of the madman, Bobby Leibling. This record certainly has moments of bone-crushing doom, with the likes of \"Sinister,\" and the masterpiece that is \"All Your Sins.\" Goddamn, the drum fill that cracks that song into being is just fuckin bestial, and some of the undeniably heaviest riffs ever written can be found here. This is definitely one of the stand-out selections in all of Pentagram's vast catalogue, and a true gem of the doom metal genre. And let's not forget the moribund plodding of \"The Goul.\" Leibling's demented vocal delivery will make you believe that he is not among the living, for the ghoul he shall forever be.\n\nThe title track of this record is one of the fast songs that will stick in your brain. That riff is smokin' and one of Griffin's finest conceptions. They drop it to half time for the verses, with some of the Gram's best lyrics on offer:\n\n\"Now I don my electric axe\nI'm gonna lay you on your back\nAll psyched up and ready to go\nTake you to hell and won't say hello.\"\n\nWhat I like best about Relentless and Day Of Reckoning is the production. It sounds like they brought Rodger Bain out of retirement to get that compressed, crushed under the weight of the ocean Master of Reality guitar tone. The bass is clearly represented and Swaney's adventurous style definitely calls to mind a certain old Geezer. Joe Hasselvander's drums are bad ass. He's a very tasteful and creative player who knows exactly how to accent and color the songs by opening or closing the hi-hats when called for and he never wanks with his fills. Quite an underrated dude I must say.\n\nThough there are a couple of songs here that are a tad forgetable, it's forgiveable considering it took these guys like 15 years to do a proper LP. And when it finally arrived the most popular metal was pretty black and white: either thrash or glam; there was no margin for the Sabbathian except for the darkened lairs of the long haired stoned out weirdos who worshipped at the altar of the archaic. \n\nIn the words of Wino, \"Bobby was the first.\" What I'd like to think he means by that is Bobby Leibling was the first American to truly \"get it\" as far as concerns the heavy metal ethos that was spawned in England. Relentless is the first of a triumvirate of albums recorded by one of America's very first heavy metal bands. If the refrain of \"You can never win/pay for all your sins\" isn't scorched into your brain upon first listen, then I can't help you.\n",
        "\n'Relentless' is one of these records that you hardly find words for, yet at the same time the urge to express your feelings about it is uncontrollable, because it is just so damn special. For my biggest shame, I heard about it a lot later than other doom classics. I couldn't believe that I've missed such music by the second minute of the opener 'Death row'. Anyway, when I did hear it, my heart instantly started to beat with its frequency and I think it will for years on.\n\nTo start with, this release gathers in itself everything that heavy metal (being doom or not) should strive for. It is absolutely honest, angry, H E A V Y, dark and what is most important for me - it really makes you feel free. I know that many people compare it to Black Sabbath's debut - you can almost never read something about 'Relentless' without seeing the former name written at least a hundred times. Well, I can see where this comes from - both Sabbath and Pentagram are bands from the 70s and this type of songwriting was too heavy for their time. But while on the debut of Sabbath there are really slow-paced songs like 'Black Sabbath' almost doom metal as we see it these days, on 'Relentless' most songs are rather dynamic and don't vary so much in tempo. Also, while BS have this mythical, even folk feeling to some songs, I don't really hear this on 'Relentless' - in that sense Pentagram are heavier and angrier. I almost always feel as if the songs are sang by a werewolf. \n\nOn the part of the vocals - they are clear, very hetero sounding and at the right pitch at all times. I think that this is how a male doom vocalist should do it. There are some really great bands in this genre that produce excellent music, but quite often their vocalist sounds too power. As much as I like Candlemass's riffs and harmonies, there are some albums I can't really enjoy because of Messiah Marcolin. So, the whole theatrical thing with the singing is missing here, thankfully. On the contrary, I think that Bobby Liebling's screams are absolutely unmatched. And since I mentioned the feeling of freedom in the first paragraph, maybe I should say where it comes from - the vocals. And who might present it in a better way? The lyrics, of course:\n\n'A lone soul at night sits and bays at the moon\nThough sometimes he's a man it's a Pentagram\nShotgun blasts as he runs with the wind\nBut he just can't win it's the Pentagram'\n\nAt certain times I can picture myself walking across a desolete and empty road, surrounded only by trees and the full moon. I guess this is what makes me love 'Relentless' so - its atmosphere is totally haunting. \n\nThe riffs and the downtuned guitars is what makes this album so damn great and memorable. While these days most riffs are written in one way or another - in 'Relentless' you can hear diverse and remarkable riffing. Also, the fact that so many bands try to copy this sound is one more evidence that it was something innovative and revolutionary (the down tuning in particular). And what makes records more evil if not downtuning and HEAVY crusty bass. Hell yeah. About the soloes - there are so many great ones here. The crushing soloes in songs like \"Dying world\" and \"20 buck spin\" add for the excellence of this release. Because you can never have a high quality doom release without the harmonies which make you shake your head crazily in the end.\n\nWhoever has not yet listening to 'Relentless' yet, you should correct this mistake right now. For the others who are already enchanted by the magic - cheers, brothers!\n",
        "\nOnce walking through a street in Sweden, I saw in the distance a weird looking guy, around 2005. It was not, well, weird indeed, but something strange was about him. I said \"I know that motherfucker\" in my head and I got closer. He was sitting down in a kinda beer-bar outside, drinking and smoking a powerful American tobacco stuff which, for a dog, for example, could have been detected from miles away. The smell was indeed mighty strong tobacco.\n\nThe motherfucker was no one else but Bobby Liebling. Thrilled, I spoke to him. I said, \"The Ghoul\". He watched me and smiled. He knew I recognized him. Pentagram wasn't precisely touring around there, but he just wanted to drink in Sweden, according to his own words. Our chat lasted no more than 10 minutes and well, I asked him for a hand shake (I washed my hands, don't worry) and I claimed that, despite some albums by Pentagram are difficult to find, I got a couple of them, being for me the most important one \"Turn to Stone\" because it was the first one I bought from the band. I said that he would go to play with the dark dudes in Paraguay, my own country, someday soon (he was fucking lying, but anyway, I liked the gesture).\n\nYeah, I wanted to share that story of which I'm proud while writing my review of Turn to Stone. Pentagram is the greatest metal band of the United States, like it or not. They keep their reputation of a kvlt band while they are actually quite famous for their unique early doom style and whatnot. The thing is that, as I explained to Mr. Liebling, sometimes it gets very hard to find early Pentagram material. If you are lucky and you know a place where metal is top notch selling (I mean, a record store), perhaps you can order that early Pentagram stuff. But if you don't (and that was my case and I know many people are in it), \"Turn to Stone\" is a perfect way to replace the three original lps with enough of good songs, dark magic, doom, and things like that. The sound was a bit restored when compared to the originals and the pages inside the album are completely enjoyable. Here you can get around 5 tracks from the three initial albums by the group, so you can't complaint at all, but simply rock the thing away and blast it. Several songs are all-time favourites from the band, including \"Wartime\", \"Relentless\", \"Petrified\", \"The Ghoul\", \"When the Screams Come\", and many other classics. The polished sound and better production, as I said above, gives extra points to this release.\n\nAfter I met Bobby Liebling, I felt an internal change within my senses. I was like an evil-new-dude; I wanted to smoke a cigarette, I wanted to dress myself in black, I wanted to look like a freakin man-vampyre and stuff. No, I'm just kidding. I do smoke and I do like darkly things, but you know, it was Mr. Liebling, if you know what I mean.\n\nGo ahead, if you are both a newcomer or an ancient lover of Pentagram's dark and doomy grooves, this thing won't let you down. It will turn you to stone. It will cause the same effect on you as the effect which took place in me during those 10 minutes I chatted with Bobby. This is for both fanboys and new metalheads, Pentagram with its best stuff in the early days. Of course, nothing can replace the originals, so if you can find those, pick them up, but with \"Turn to Stone\" you shall get more than enough.\n",
        "\nThis fine compilation makes for a proper introduction to the evil and psychedelic heavy metal of a gang of downers known as Pentagram. These dark souls have been dwellers of chthonic depths for decades, and they were truly among the pioneering purveyors of American metal.\n\n\"Petrified,\" taken from the album Be Forewarned, is the perfect track to open with as its leaden riffage will at once plunge the listener into a chasm of desolation and gloom. This song is absolutley hypnotic and one of the heaviest offerings in their entire catalogue, so light up and listen without distraction, 'cause these guys are gonna turn you to stone. The drumming of Joe Hasselvander is pure brilliance, complete with eerily tribal auxillary percussion to compliment his doom dance behind the kit.\n\nAll of these songs are good and most of them are great. The material herein is representative of the morose and sinister music of the Pentagram we know and love today. You simply can't go wrong with the warm, Iommic distortion, masterful rhythm section, and creepy voice of Bobby Leibling. I used to listen to this often at a tiny liquor store I worked at in the shit part of my town. It was an appropriate underscore to the murmurings of the zombies stumbling in and out, begging me for change to get their next fix of rot gut vodka or wretched, flavorless beer from a tall can.\n\nIf you have ever dealt with depression or addiction this is highly recommended. Take, for instance, the mantra of \"All Your Sins,\" in which Leibling's condemnation of the damned will be seared into your brain: \"YOU CAN NEVER WIN. PAY FOR ALL YOUR SINS.\" Or the embittered indichtment at 1:32 of the beautiful \"When The Screams Come,\" which, by the way, features some of the sweetest riffing ever to be riffed. \n\nThe previous reviewer was right: buy the three albums that these songs were pulled from. But as for this collection, the 'gram weighs.\n",
        "\nIt seems that the original First Daze Here collection did pretty well for itself, because it was followed up by this subsequent selection of 1970s Pentagram material. First, the good news: unlike the previous collection, which only had one song from the band's 1976 demos, this has a substantially greater proportion of songs from that period, giving a bit more of a balanced view of the band's development during the era. And whilst the inclusion of two cover songs on here might suggest that the bottom of the rehearsal tape barrel had been hit, at least the version of the Rolling Stones' Under My Thumb is a fun, fast-paced metal reworking which manages to recapture the sneering leer of Mick and Keef's version.\n\nNow the bad news: first off, the set is bafflingly split into a two-CD collection for absolutely no good reason that I can see. Granted, some of the material on the second CD has a markedly worse production quality than the first CD - in fact, most of the tracks here are slightly rougher around the edges than the material on First Daze Here, which presumably represents the cream of the crop - but even then there's some nicely-produced tracks on there that are on a par with the material on CD1, so it can't be an attempt to partition tracks into one high-quality disc and one \"bonus disc\" of shoddier recordings. Equally, the recordings aren't presented in chronological order at all - or, indeed, any date order which makes any sense to me - so it's not a matter of separating early 1970s material from late 1970s material or anything like that. A simple blunder, or a blatant attempt to slap a 2CD price tag on a single CD's worth of material? You decide.\n\nSecondly, as I've already alluded to, the production quality of the demos here is - to my ears, at least - markedly more variable than on First Daze Here, which had a consistently decent sound. I'm not taking raw kvlt black metal demos recorded in a forest during a blizzard bad here - you can at least more or less pick out each individual instrument and hear what the musicians are doing - but it's distracting enough to make the listening experience markedly more of a chore than listening to the preceding collection.\n\nThose who are major Pentagram fans and want to collect as much of the band's early material as possible will probably find First Daze Here Too a decent enough collection, though I suspect even they will be bugged by the bizarre 2CD presentation. The rest of us, however, would be better off listening to the band's studio albums, on which most-to-all of the best tracks on here have been re-recorded at one point or another.\n",
        "\nUnlike many of the bands that spearheaded the development of doom metal in the 1980s, Pentagram had a key advantage in recapturing the spirit of the 1970s - they'd actually been there. The proof is on this nicely selected compilation from the very first phase of their career. Aside from Starlady, which dates from 1976, all the material here comes from demo and rehearsal tapes recorded between 1972 and 1974, but despite these humble origins the sound quality is quite acceptable.\n\nMusically speaking, Pentagram hadn't yet hit on the Sabbath-worshipping doom metal sound of the 1980s. In all honesty, the material here isn't necessarily all that original, with a lot of it being blues-influenced proto-metal - resembling Led Zeppelin playing Sabbath riffs. The sludgy, fuzzy guitar sound spices things up, and Bobby Liebling does a reasonable Robert Plant impersonation on vocals.\n\nMany songs first developed here would later get a doom metal workout on Pentagram's proper studio albums, and I can't put my hand on my heart and say I don't prefer them in that context, but for those who are already Pentagram fans this collection is a great way to explore the origins of the band.\n",
        "\nPentagram should have been huge. They should have been America’s answer to Black Sabbath, our very own harbingers of doom. But somewhere along the way, things went horribly awry. Vocalist/mastermind Bobby Liebling let his drug abuse take precedence over his music, and the band couldn’t even get their shit together long enough to get signed to a decent label or release an album until fourteen(!) years after forming. More often than not, Liebling and Pentagram have appeared destined for failure. Yet here he stands in 2011, holding a Metal Blade recording contract and being backed by arguably the strongest Pentagram lineup of all time. Having never been addicted to anything (well, maybe caffeine and heavy metal, but I’ve managed to kick the former), I suppose I’ll never understand what Liebling has been through over the past four decades, but whatever that personal hell might have been, I’m glad he managed to claw his way out of it, especially when an album as stellar as Last Rites is the result. Liebling isn’t here to be a another rock ‘n’ roll casualty. He’s here to kick your ass, and uh, to quote the man himself, “show ‘em how”.\n\nLooking like some kind of fucked up yet infinitely wise old wizard (possibly the same wizard that popped up in my review of Dawnbringer’s Nucleus), Liebling rocks harder and with more energy than a hundred men half his age can muster. The man is unstoppable, as his inimitable vocal performance on Last Rites attests. He’s one of metal’s last truly great, distinctive vocalists, sounding as vital and vibrant here as he did on the archival recordings featured on the First Daze Here collections. Like all the Pentagram full lengths, Last Rites is a collection of classic songs that never received the proper treatment as well as newer compositions, and Liebling attacks them all with equal vigor.\n\nThen there’s Victor Griffin, Liebling’s right hand man. He is an out-and-out master of ten ton doom riffage, wielding a guitar tone that is best described as an iron fist sheathed in a velvet glove. It’s warm fuzziness gently caresses your ears as it pummels them on tracks like “Treat Me Right”, “Into the Ground” and “Walk in Blue Light”. Anyone who’s listened to Griffin’s Place of Skulls knows that he’s all about the savior, but you’d swear that he’d had to have struck a deal with Lucifer himself in order to command this kind of fiery six-string righteousness.\n\nIt’s interesting to me that many of the older doom metal practitioners, such as Liebling and Griffin, are down with the good lord. So many modern doom bands embrace the dark side, and it seems they missed the entire point of Black Sabbath (both the song and the band). Ozzy and Co. weren’t happy to see Satan standing before them, they were fucking terrified (“Oh please God help me!”). That to me is what doom metal is about; coming to the grim realization that conjuring up the forces of darkness isn’t a good thing and struggling to attain some semblance of salvation, even if there is little or no hope of it. That might sound strange coming from an avowed atheist, but for whatever reason I’ve always seen doom as a some sort of biblical struggle between good and evil taking the form of debilitatingly heavy riffs. Liebling and Griffin understand this inherently. They’ve danced with the Devil longer than any mere mortal has a right to, and somehow managed to come out of the ordeal not only alive, but at the height of their powers. Now it’s their duty to deliver the warning, keeping all of us from suffering the same fate. These are the things I hear when I listen to Last Rites.\n\nRegardless of your stance on the spiritual matters of doom, you should have no problem appreciating Last Rights. This is timeless music played with conviction and craftsmanship, something all too rare in today’s flavor-of-the-minute fueled metal scene. Last Rites is one of my favorite things I’ve heard so far this year, and hopefully the support of a respectable label will wake more people up to the fact that Liebling and Pentagram are nothing short of a goddamn national treasure. Doom on, brothers and sisters.\n\nOriginally written for http://thatshowkidsdie.com\n",
        "\nPentagram has a mythical story going back four decades that would easily fit the mold of Greek tragedy. Mighty doom-bringers, they are said to be great enough to be America's answer to Black Sabbath. That is, but for the flawed character of vocalist/principal songwriter Bobby Liebling, whose attitude and drug abuse have thwarted them at every turn. But now he is supposedly sober, and reunited with born-again Christian Victor Griffin on the axe. Last Rites was anticipated and hailed as the band finally overcoming their problems to bring their full greatness to the world.\n\nIn reality, they're America's answer to Sabbath like Cactus is America's answer to Zeppelin. Who? Exactly. Like other semi-legendary bands of the underground, their influence on subsequent acts can't be denied. But as a listening prospect, they tend to be pretty hit-and-miss. That is definitely the case here.\n\nI initially came to this album with trepidation. I had doubts a 57-year-old recovering addict has-been/never-was could pull off anything worthwhile. Thankfully, most of the songs on here are old material that is, today, almost impossible to find. Liebling is said to have written an obscene number of songs during the 70's and 80's, which have never seen the light of day. Some of them featured here are excellent songs built on simple but powerful riffs. \"Into the Ground\", \"8\", and \"Nothing Left\" are clear standouts. The performances are up to the quality of the songs, with heavy guitars providing the foundation for Liebling's voice, which (expectedly) sounds like a man who's been through a lot.\n\nBut on the other hand, much of the album is forgettable or weak. \"Windmills and Chimes\" or \"Walk in the Blue Light\" are two songs I could have done without entirely. Sometimes the riff is good, but the song doesn't hold up (e.g. \"Death in 1st Person\"). Which bolsters my alternate theory, that the band was never quite as great as they're made out to be.\n\nThe Verdict: Maybe this will shatter the myth. Maybe not. There are some good moments, but there are certainly better doom albums to spend your money and time on this year.\n\noriginally written for http://fullmetalattorney.blogspot.com/\n",
        "\nBobby Liebling claimed to have written about 80 songs in the earliest incarnations of Pentagram and many of those gnarly 70's heavy rock songs have made up the bulk of each Pentagram album to date. \"Last Rites\" takes some of the best (previously unused) early demo/rehearsal tracks, polishes 'em up and tucks in a few weaker tracks to fill out the bunch. If you'd followed Pentagram over the years this is pretty standard for the group. This time, though, the filler tracks are some of the band's least interesting moments and a few detract from the albums overall appeal. \n\nThe past is still very much alive in these old, dusty stoner rock songs. If you've heard that sloppy Stone Bunny bootleg EP \"Nothing Left\" you'll be pleased to know that the two best tracks \"Nothing Left\" and \"Into the Ground\" have been turned into solid stomping doom songs that bookend the album (as they did the EP). Two of my personal favorite rehearsal tracks \"Call the Man\" and \"Walk in Blue Light\" are given a similar polishing, and are two of the albums finest moments with their buzzing-bluesy Black Sabbath guitar tone. Half the fun of listening to this album is comparing the new versions to the compositions as they were almost 40 years ago and seeing most of them remain structurally unchanged. \n\nFor the uninitiated, Pentagram's heavy stoner rock sound is easily digested and enjoyable. \"Last Rites\" is a strong showcase for some classic tunes and overall represents a slightly above average package from Pentagram. One song wasn't necessary to unearth \"Windmills and Chimes\" and another is boring garbage \"American Dream\" but, the rest of the album is top notch stoner-rockin' doom metal from one of the genre's strongest die-hard groups. At any rate, this will tide classic doom metal fans over before upcoming Argus and Pale Divine albums see light of day.\n",
        "\nSub-Basement is the second of the two “Hasselvander” albums. Joe once again lays down all instrument tracks, with Bobby on vocals. The album is arguably better than its predecessor, Review Your Choices. It’s basically the same formula but improved. There is a variety of different sounding songs that will keep listeners entertained and coming back. \n\nThe album starts with off with two faster, rocking songs with some great memorable, heavy riffs and some good leads and solos, and these are probably some of the best songs on the album. After those two, it’s time to get out the drugs again. Drive Me to the Grave is a remastered Pentagram classic. Upbeat drums and a catchy main riff. It’s a little repetitive overall but still but is such a badass sounding song that it never seems to drag for me. I love this track’s dark lyrics, too. Gives me really haunting images of a dark, morbid cemetery. \n\nThe next three tracks are all slow, depressing, and very heavy songs that describe the history of Bobby and Pentagram. Sub-Intro is just a bunch of creepy sounds and atmospheric noises, with some haunting guitar chords in the background. I think they could’ve reduced the song by a minute or two but is by all means an effective track that does its job, and summarizes the overall mood and feel of this album. I personally enjoy the track “Sub-Basement” more than Goin’ in Circles. Sub-Basement is a super heavy track with crushing guitar, and simple, slow, pounding drums. Goin’ in Circles is basically a song about Bobby and how the guy feels like he can never seem to get anywhere with Pentagram. A pretty decent, doomy song. \n\nMad Dog immediately steps things back up with a faster tempo, and some groovy, 70’s sounding riffs and rhythms. I won’t go into detail on the rest of the songs but they pretty much all kickass and are great fun. I believe most, if not all of these last 4 or 5 songs are remastered classics. \n\nProduction when compared to Review your Choices is a much clearer, concise sound, but it still retains the heaviness doom fans are looking for. In fact, the guitar even has a bit of that buzzsaw, death metal sound at times, it’s pretty damn heavy. This album can sound quite atmospheric at times too, especially with the slower songs. One thing needs to be said: On a good stereo set with the bass cranked up, this music sounds fantastic. It is truly meant to be played loud. Make sure to listen with good equipment for the full effect. \n\nAt first, Sub-Basement came off to me as a little boring, and didn’t interest me, particularly after hearing the classics like DoR and Relentless beforehand. But give this one a couple run throughs and it’s not bad at all for what it’s worth. I’ll give Sub-Basement a 90. I gave Review your Choices a 95 but now I think I’d probably give it a 80-something due to the fact that I think this release is more of the sound Joe was after than with RYC, and he did a great job. Also it’s a little less boring than RYC. Anyway, if you’re getting tired of the classic Pentagram lineup, give this album a listen for something new, that takes the doom metal aspect a little more to the extreme than previous works. I would probably recommend Be Forewarned over this one, but still, those are two different projects with the same name as far I’m concerned.\n",
        "\nPentagram are in many respects the real heavy metal underground band. I look back at when they formed. 1971. Wow. Nixon was still serving his first term up the road in D.C. when this Virginia band got together. And yet here they are still playing the same type of heavy metal alongside other underground bands with members that weren't even born when the band was already a veteran of the bar and club circuit. Nor are they much more well known than some of those bands they sometimes even support(and have sold less records too). They've gotten more recognition in the last dozen years, sure. But then again, many \"underground\" bands have because of the internet. Pentagram has played Wacken and Maryland Deathfest in recent years but they were not a main stage act in either event. Yep, they have more service time than you can shake a stick at. They're just so..Relentless. \n\nThese guys are a live band through and through. And 1985 was when they finally decided to go into the studio and record all that material they've been performing on the road. It's common knowledge in the metal world that Pentagram are one of the premier Black Sabbath \"rip-offs\". What was once a rip-off is now its own subgenre: doom metal. The Relentless album lives up to that doominess. There's a sobering angst and cynicism felt in the lyrics backed up by Victor Griffith's moody minor-key riffing. The guitar intonation is a constant breeze of malaise throughout from song one to the end. Pentagram knows their source material/inspiration well. Death Row(the first track) begins with that tried and true doom hook of having an upper tempo riff compared to many of the following songs. Yet compared to Born Too Late or Witchfinder General's Death Penalty, I realized that Pentagram are actually more uptempo on average. Bobby Liebling's singing is more elemental and less imitative of John \"Ozzy\" Osbourne compared to many of the others but the token impressionism of Ozzy's style is of course still there nevertheless. But anyone who has listened to enough early heavy music will pick up on the fact that Liebling also sounds a lot like Dickie Peterson from Blue Cheer. \n\nWhile I admire what is played on Relentless, the cavil with the album would be that it's not as good as Day of Reckoning. Relentless does have slowed down drifts of doom tracks and those-while good-seem too standard and lost in the shuffle. They're not as mixed in as well as the Day of Reckoning release. They also lack that drugged out flair that Saint Vitus has. So I guess Relentless is lacking only in comparison to other similar albums by themselves and other doom bands. That's not so bad but it does point out that there may be a couple more songs that are a tad redundant and the album may just be that much overlong. The guitar soloing on the record is done good if not very memorable. Griffith much of the time seems too comfortable with just the main fuzzy riffage filling out the doom trademarks. You're Lost I'm Free is a short song with him doing a nice electric blues type solo with mammoth opening riffs that reminded me most from Sabbath's debut. \n\nRelentless has no shortage of highlights and it's a high quality offering in all the other respects especially when I look for more classic elements of doom. Sign of the Wolf would be my first example. It has riffs reminiscent of the cranky tone that Tony Iommi brought out on Wheels of Confusion/The Straightener. 20 Buck Spin does too. I would say Black Sabbath Vol. 4 would be the album that Relentless is most like if you want to look at it from a recommendation angle. \n\nThat brings me back to the point about the \"niche\" that Pentagram filled when this album came out in '85 because it pertains to what I was telling about how underground this band was back then. Obviously, Black Sabbath at that point in time had reconfigured their heavy metal sound while this album by Pentagram was doing the retro Sabbath sound. The thing is, 1980's American entertainment and culture was defined by glitz and materialism. An album as Relentless is fastidiously stuck to the 70's; a decade characterized by dazed paranoia and cynicism. A 70's antiquity like this was anything but marketable in the 80's even in heavy metal circles. No one wanted anything to do with the prior decade. Fast, sharp and fresh(but still angry) was why Metallica came up famous in heavy metal back then. That's how Pentagram filled a niche for those who would not give up the ghost. Relentless is indeed an antique enduring the prior decades.\n",
        "\nSound: It is the year 1972 and Rock and Roll is the biggest form of music in the world. Bands like Black Sabbath, Led Zeppelin, Alice Cooper and Deep Purple are taking the world by storm. All of these bands have become legendary, but one band was overlooked. The band was called Pentagram, a band whose oldest songs were not released until 2002. Long before Pentagram would be reinvented and release the album \"Relentless\" in 1985, they were forging together some of the greatest Heavy Metal sounds in the world, which would later be the blueprint for so many bands to come. The sounds of such songs \"Forever My Queen,\" \"Review Your Choices,\" and \"Walk In The Blue Light\" were the very foundation that Doom Metal was built on. Other songs like \"Starlady,\" \"Hurricane,\" and \"20 Buck Spin\" had the high voltage rock and roll sound of many bands that would later sprout in the late 70's and early 80's. Such dark and doomy ballads like \"Be Forewarned\" and \"Last Days Here\" would be ripped off by many Melancholic Doom Metal bands later on. If any band was too be signed it would have been Pentagram, with Bobby Liebling's powerful, haunting vocals, Vincent McAllister's heavy, droned guitar riffs, Greg Mayne's catchy basslines (especially on \"Earth Flight\" I might add), and Geof O'Keefe's drum beats that you can feel beating you in the chest through your speakers, were all the elements you needed in 1972-73. The sound of Pentagram is everything a Metalhead could want from it's heavier than hell riffs, to it's blitzing guitar solos. // 100\n\nLyrics and Singing: With a name like Pentagram you would think they sing solely about satanism right? Actually none of the songs really deal with Old Scratch at all. A lot of the lyrics actually deal with love, while others deal with straight forward lyrics that point a middle finger in the direction of the mainstream. And ever songs like \"Review Your Choices\" deal with almost a Christian viewpoint to the afterlife. Bobby delivers his lyrics well, especially with a chilling voice like his. The lyrics can also be very metaphorical, which shows the creativity of the lyricist. // 100\n\nImpression: Overall this album gets a 100. I have no idea why this band was not signed in the 70's, they could have had a bigger impact on music. They could have even roamed with the giants known as Black Sabbath, Led Zeppelin, and Deep Purple. If you like those three bands I mentioned, along with bands like The Sword, Blue Cheer, Saint Vitus, and Trouble, you will love this album. While it is true this entire album is a collection of demos, the sound quality sounds like if it was recorded in a high quality studio (which 11 of the songs were recorded professionally). If you are fan of straight up Metal, check out the songs \"Forever My Queen,\" \"Earth Flight,\" \"Walk in the Blue Light,\" and \"Review Your Choices.\" I honestly think this is an essential Metal album, and hell even if you like classic rock, you'll love this. This album deserves the reputation of albums like Black Sabbath's \"Paranoid\" and \"Volume 4.\" Pentagram has actually begun to tour again with Bobby still fronting the band. If you live in Europe, go see them. // 100\n\noriginally posted at [ http://www.ultimate-guitar.com/reviews/compact_discs/pentagram/first_daze_here/index.html ]\n",
        "\nThis was one of the last Pentagram albums I listened to, and I never seemed to be able to enjoy the later releases as much as the classics for some reason. However, after a couple of listens it finally hit me, and this is now easily one of my favorite releases from the band. Opinions aside, let's get to the music.\n\nFirst off, the production is fantastic. The album art really does illustrate this album's sound very well. It has a \"hazy\", and SUPER heavy sound that fits with the music perfectly. It is definitely not a generic, over-produced production job by\nany means. There is really no other Pentagram album with this kind of\nproduction, and that gives Review Your Choices it's own unique charm. Also, this album was recorded around the time when Bobby was still recovering from his drug addiction problems, and you can practically hear the heroin abuse in every track.\n\nThere are many songs on the album that are remastered old classics, but whether you've heard them before or not, this album gives them a totally new, drugged-out sound. Every song is great, and the album flows well. It is also a good length, at around fifty minutes long. There are many songs that are five minutes or longer, and they tend to be some of the best songs as well. Change\nof Heart, Gorgon's Slave, Megolania, and I Am Vengeance are all crushingly heavy, epic songs that reek of hard drugs and depression (in a good way, of course).\n\nThis is definitely one of the most \"bizarre\" sounding Pentagram releases, and that is much in part because of Bobby's vocal performance. While his vocals are certainly not in top form here, they fit the songs well, although there are a couple songs where it's almost humorous how fried he sounds. The man was really in the middle of a crisis at this point in time, and a lot of emotion can be heard from his voice and the music. This is by no means a happy album, and several listens could very well drag the happiest man down to depression.\n\nThe drums aren't really anything special, but still contain plenty of creative fills and interesting patterns, often extremely slow to fit the music. Joe does a great and impressive job at laying down tracks for all instruments here, and keeps things fresh on the drums. It takes a pretty long time for this album to get stale, and it's always there for you, tempting you to come back and listen, like a syringe full of heroin to a drug addict. \n\nReview Your Choices is a very heavy and powerful album that all Pentagram fans need to listen to. It really is something special, and while it may be the \"black sheep\" of the Pentagram discography, that doesn't stop it from being one the craziest-sounding, unique Pentagram albums ever made.\n",
        "\nSub-Basement is probably Pentagram’s most over looked and under appreciated album. But if you can see past the dodgy cover and a band that’s well past it’s hey-day (the classic line up of Liebling/Griffin/Swaney/Hasselvander), you’ll get a fantastic album full of crushing riffs, demented vocals and atmosphere so thick, you could cut it with a knife. \n\nFeaturing a mix of newer and older songs, as is always the case with a Pentagram album, Sub-Basement starts with a bang and from there, rarely lets up from Joe Hasselvander’s heavy and groovy riffs. Bloodlust, Buzzsaw and Drive Me To The Grave kick off the album with three straight to the point heavy metal ragers. All feature ripping solos, memorable riffs and of course, Bobby Liebling’s trademark banshee screams. Drive Me To The Grave even takes lyrics from one of their 70s tracks, Virgin Death. It must be mentioned that Liebling really is on top form here, unlike their subsequent album Show ‘Em How, where the strain and abuse really is evident in his voice. \n\nFollowing the first three tracks is Sub-Intro, a noisy piece comprised of only guitars and effects. This is quite uncharacteristic for a Pentagram album, but it’s over soon and segues into one of the album’s highlights, the title track. Easily the doomiest piece on the album, it features lyrics that perfectly sum up Liebling and Pentagram’s long history.\n\n\nOut of step and time\nAin't worth a dime\nOr they told me so\n\nI’ll stay a wrong sided hit\nI don’t like what’s on the radio\nTorn down and been condemned\nLike a tenement row\n\nI've been called a dinosaur relic\nStuck in the twilight zone\nBut stickin' in the sub-basement\nKeeps me lit to the bone\n\n\nThe second half of the album contains a mix of up tempo and slower tracks, all delivered with that familiar, slightly off-kilter, maniacal edge. Two of these final songs, Mad Dog and Target, are re-recordings of songs written in the 1970s. Target was only previously available on the Human Hurricane compilation (and then again on First Daze Here Too) and to my knowledge, Mad Dog would only be officially available later as part of the Keg Full Of Dynamite live album, released in 2003. Neither of these re-recordings are a patch on the originals, but in the context of the album both are performed admirably and fit well with the other tracks.\n\nThe production is very heavy and fairly raw, but at the same time quite warm and listenable, exactly what you would expect from a Pentagram record. The guitars have a saw like quality to them and the riffs feel like they could tear strips off you! The bass is always there and adds a fullness to the sound, the drums are great and always deliver the right beat, whether driving the faster songs like Buzzsaw or providing the doom march to tracks like Sub-Basement or After The Last. Special mention must be given to Hasselvander’s performance on the album. Handling all the instrumentation, his work is flawless from to start to finish. \n\nSub-Basement definitely isn’t the band’s best, but it is a rock solid album. Whilst probably not the best place for a newcomer to start with, it is undoubtedly essential listening for all true fans of heavy and doom Metal. Highly recommended.\n",
        "\nForeword\n\nFirst of all, let me state that, before starting reviewing this, I didn't see any point in releasing this compilation on two CDs when it could perfectly fit into one. Other than it's the second part in the \"First Daze Here\" series, I saw absolutely no reasons. But my name isn't Bobby Liebling and I couldn't change anything, so I had to deal with the things the way they are and review each CD separately.\n\nThe first...\n\nThe production here is akin to that of the BSR demo: it's clean, clear and masterful. All instruments are perfectly audible, every single note is distinguishable, you can't confuse one thing for another even if you want to. This CD has got a rock'n'rollish vibe to it, not lastly due to The Rolling Stones cover. \"Smokescreen\" is a pure rock'n'roll tune, and a highly enjoyable one at that. It's just oozing out with energy. Even Bobby's voice is completely unrecognizable. But it's apparent the band's having fun, whole lotta mindless fun. \"Teaser\" is a logical continuation of \"Smokescreen\". It's calmer, shorter and slower a bit... still it's rock'n'roll, baby! \"Little Games\" is more of the same, but again calmer, shorter and slower. Now how do you like that?! I do. The remaining three are too famous the songs to describe them. I'd only say that \"Review Your Choices\" sounds rather weird and \"Much Too Young To Know\" is more rock'n'rollish than usually. The bass is prominent in all seven songs, and it really brings them together. I wonder, are you now seeing some sense in splitting \"First Daze Here Too\" on two CDs? I was, on the third listen.\n\nThe second...\n\nThe overall sound level here is a little lower than on the first CD, still everything said about the production of the first CD applies here. The songs here are very short for the most part; most of them sound unfinished and fragmented, like sketches of something greater and much more ambitious. So, twice as much music and twice as much material to ponder on. A few songs here continue the path of \"Smokescreen\" and \"Teaser\", prime examples being the opener \"Virgin Death\" and \"Ask No More\". Several others are slow and doomy, though not very heavy. Some of the rest resurfaced on later albums, for example, \"Catwalk\", \"Frustration\" and \"Nightmare Gown\". By the way, the solo on \"Catwalk\" is delicious.\n\nFinally, this CD features \"Be Forewarned\", \"Target\" and \"Show 'em How\", and all with almost perfect production! \"Be Forewarned\" is on par with the version found on \"First Daze Here\", it's as bluesy as that one, and the 'rippling water' guitar tone is still there. \"Target\" is much better than on \"Human Hurricane\": the sound is clearer, which makes it even trippier. Oh, and the solos are absolutely orgasmic, together with the bass work. Hell, even Mark Shelton can't come up with solos like these! Bobby's vocals are still blurred, but not as much as on \"Human Hurricane\". This is one of the best songs (if not the best one) they ever wrote. \"Show 'em How\" still has a muffled, muddy sound, but it's significantly better than that on \"Human Hurricane\". Also the bass is higher in the mix, adding to the pyschedelic aura of the song. Now see? There certainly is a point in splitting \"First Daze Here Too\" on two CDs.\n\nAfterword\n\nSo, is it worth buying? HELL YES!!! Everything with \"Target\" on it is worth buying. This is a great compilation showing the band's evolution over the years. Absolutely mandatory for Pentagram fanatics. Even despite containing many a crude and unfinished song, it's somehow better than \"Human Hurricane\". So don't take it too seriously and remember... it's all about rock'n'roll!\n",
        "\n...then traditional doom metal would have been completely different. It's just plain stupid to deny the influence of Pentagram on the shaping of doom metal; it is second only to that of Black Sabbath. Listening to such compilations of Pentagram's early material as \"Human Hurricane\" helps realize this greatly; you can literally trace some classic 80-ies bands/albums back to the roots. Some might say what the band played at that time is closer to heavy metal/hard rock, but then so is Black Sabbath! That's not the matter, of course, because as long as the music is sincere and the songs are kickass, I couldn't care less about the genre. The matter is that reviewing such compilations is often difficult because they're fragmented and uneven. This very one, \"Human Hurricane\" features a total of 17 songs from 6 different recording sessions. Of course, the constant change of sound throughout the album is inevitable.\n\nThe good thing is that it doesn't seriously affect the way instruments sound. The vocals are affected greatly, however. Sometimes they are very clear (not clean), like on the BSR demo; sometimes blurred, as if recorded under water (I absolutely love that effect, though); sometimes just muddy and low. The bass... well, the bass isn't particularly noticeable on this one, it just helps keep the rhythm, and that's about it. Same with the drums. But lead guitar is almost completely similar to the vocals in the way it's affected by production. Sometimes its tone is sharp and clear, sometimes very muffled, sometimes very trippy and psychedelic (this is the best case out of three). Rhythm guitar's tone just switches between a sharper and a muddier one; it doesn't matter which one you prefer - both are very cool. A good example of a sharper guitar tone would be \"Much Too Young To Know\", of a muddier one - \"Target\".\n\nSpeaking of actual songs, the material presented here is VERY heterogeneous. Be prepared for a rapid change of tempos: one second it could be slow as hell, and the other it goes into a full-on heavy rocking assault. So there is no dominating tempo on the album: some songs are generally slow, some - midpaced, some - fast. A lot of tempo changes can occur in one song, too. This compilation is also interesting because most songs here are quite obscure; there are only few classic tunes (\"Forever My Queen\", \"Livin' In A Ram's Head\" and a couple of others). Unfortunately, some of those obscure songs are either completely unmemorable or filler. Take, for example, \"The Bees\" and \"Goddess\". There's nothing special about these songs, nothing interesting going on. Luckily they're short (under three minutes), as are most songs here. \"Show 'em How\", in contrast, is an epic monster with a running time of 10 minutes. Blue Cheer's influence on it is overwhelming. The following \"Downhill Slope\" is much calmer and rather similar to \"Be Forewarned\" in its original form.\n\nAs mentioned before, sometimes the lead guitar's tone is psychedelic and trippy. \"Target\" and \"Rape\" are the best examples of this as lead guitar soloing occupies the majority of their running times. \"Target\" is one of the best songs on here - a bluesy, trippy, long and viscous psych rock tune, with an incredible solo. A general observation I have made is that about half of the songs with total length less than three minutes are sort of unmemorable. They're kind of sketches for the future works, a foundation for achieving greatness in days and years to come. \"Buzzsaw\" is quite an exception to this rule: the riffs are underdeveloped, but the solo... the solo is great. Maybe it's somehow influenced by the fact it's put between \"Livin' In A Ram's Head\" and \"Starlady\", though. The best songs on here (besides the obvious \"Forever My Queen\", \"Livin' In A Ram's Head\" and \"Starlady\") are \"Target\", \"Much Too Young To Know\", \"If The Winds Would Change\", \"Show 'em How\" (a monster of epic proportions - Behemoth/Leviathan, no less!), \"Burning Rays\".\n\nAll in all, this is an interesting CD documenting the early years of Pentagram. Not the best one, of course, as \"First Daze Here\" is undoubtedly better. Rather, this is the missing link between \"First Daze Here\" and \"First Daze Here Too\": not as finished and monolithic as the former, but also not as raw and dismantled as the latter. Worth investing money into on its own, and also because it's quite rare, if my memory serves me well. But please keep in mind that the sound is raw and unpolished (nowhere near the one found on the BSR demo), so as not to be bitterly disappointed.\n",
        "\nThis demo is the second of two missing links between \"Be Forewarned\" and \"Review Your Choices\". The production is still very raw, but not nearly as muddy. The drums are more focused this time. Funny thing: in the first song they sound quite similar to drum machine used by Celtic Frost on the demo recordings for \"Apollyon's Sun\". Bobby's voice is the one we're all used to, but it sounds as if from under water. And the bass is audible this time, despite being blurred. The best thing about the sound is that the guitar tone bears heavy resemblance to (rejoice, priests and bishops of doom!) Dave Chandler's. One more note before I go into the songs: my version of the demo has \"Nothing Left\" instead of \"Pistonhead\".\n\nMusic-wise, the demo is in the same vein as \"Human Hurricane\" and \"First Daze Here Too\". That is, raw and crude proto-doom occasionally veering into psych rock territory. The only exception is \"Thrill Of The Kill\", which is significantly slower and doomier than the rest, and Bobby's performance is very passionate. The rest, consisting of three songs, is really average and nothing memorable, even though it's got a couple of cool riffs. Well, \"Black Sky\" is quite slow too, but it isn't doomy. One very strange thing about all four songs is the absence of solos. There are absolutely no solos at all. In the end, this demo is neither more interesting nor more entertaining than the previous one. Only for the most die-hard fans of the band.\n\nThe best song on here: \"Thrill Of The Kill\"\n",
        "\nThis demo is the first of two missing links between \"Be Forewarned\" and \"Review Your Choices\". And the first thing one notices when listening to it is that Bobby's voice is higher than it usually is, but that's not the problem. The problem is that it sounds alienated, estranged from the music. It's like the band recorded a random instrumental piece, Bobby sang random lyrics and they threw it all together into a blender. Part of it lies in the production, which is very muddy. To give you a better idea, it's not unlike that which can be found on many a Swedish/Finnish death metal demo from the beginning of the decade (I mean 90-ies, obviously). The lead guitar is recorded clearly and loudly, though. Now I'm trying to find some words to describe the drumming... well, like every single cult band in existence, they prefer to record the drums in a room next to the one with the microphone. So the drums are far too muffled and blurred. Needless to say, the bass is completely inaudible.\n\nAs for the actual songs, they're heavy and doomy. Actually, this played a mean trick on the demo because the re-recorded versions of \"Forever My Queen\" and \"Review Your Choices\" are mostly devoid of the original atmosphere. Not lastly due to being partially altered, which is especially evident in the drum tracks on \"Forever My Queen' and the solo(s) on \"Review Your Choices\". I can't complain about the re-recorded solo(s), it's done well, but \"Forever My Queen\" loses much. Two new songs, \"Change Of Heart\" and \"Because I Made It\" are not bad at all, the former resembling Celtic Frost's slower tunes on \"To Mega Therion\" in some parts. Also, \"Change Of Heart\" has got a really cool intro and a nice solo at the very end. \"Because I Made It\" is unmemorable even though it's got that silly clean guitar part and a long and beautiful guitar solo. The overall impression this demo left is that of a raw, unpolished work; a blueprint. To the general public, it is interesting only through historical prism of view; but the most die-hard fans of Pentagram might find here something to ponder on.\n\nThe best song on here: \"Change Of Heart\"\n",
        "\n\"My peace of mind depends on you\"\n\nIn case with \"First Daze Here\", it depends on Blue Cheer. This is no secret that Blue Cheer's music was the main influence on Pentagram in early 70-ies, as is evident on here. This compilation features a dozen of songs from the early days of Pentagram, which are quite different from what the band is mostly known for, as they're much more garage rock/blues-oriented than the band's later opuses. And even though the blues influence sometimes shines through, it differs much from that of Black Sabbath.\n\nFirst three tracks are from the \"Bias Recordings Studio\" (henceforth referred to as BRS) demo, which I've already reviewed, so I'll just skip them. The only thing that needs to be said is that the sound is almost identical to the original - no complaints here. In case you're dying to learn more about these songs, just read the aforementioned review.\n\nThe fourth track is one of my favourite Pentagram songs - \"Starlady\". It starts with a fast to midpaced hardrockish riff - the main riff of the song, which is as effective as simplistic. It goes on for about two minutes, transforms into a bit slower riff (in essence, a well-crafted sequence of guitar chords with the bass work behind them) and then finally makes way for a slow, calm section with a spacey feel and a soothing, lulling (in a good sense!) atmosphere. The bass, accompanied by the drums, plays the leading part while occasional guitar chord is struck once in a while, and all this makes a great buildup to the guitar solo. The solo. Words fail to describe what it conveys, but I'll try anyway. It isn't mind-numbingly complex, nor is it relentlessly beautiful, nay; but it is extremely evocative, though-out, atmospheric and soulful. It feels like gazing into a deep dark-blue sky gilded with the last shades of the fading twilight, when the sun has just sunk behind the horizon and the first stars awake, glimmering shyly, as the breath of night, first manifested as a tender evening breeze, mends its pace and is about to seize the land with shapeless hands of dense milk-white fog lying in low places and covering the fields in torn lumps, where the crops, not fully ripened yet - in early August, were swaying the breeze and basking in the last rays of the sun just an hour before. The rest of the song is the main riff playing for a minute and a half, and then the first part of the solo until the end. The lyrics are on par with the music. Of course, it isn't the greatest poem ever, but nevertheless it's quite beautiful, and that's a merit of phrasing and wording, not verse and rhyme. \n\nNext we have a song about another lady - \"Lazy Lady\", which is interesting only as the song where the Blue Cheer influence is most evident. It's a bluesy psych rock tune with a laid-back atmosphere, so the guitar tone isn't very heavy, rather the opposite. Well, what else... it has a nice solo, well-crafted lyrics... the bassline really is the backbone of the song... and, when all is said and done, \"she's such a lovely lady!\". The next track is yet another one from the BSR demo, and there's nothing to say about it that hasn't been said before.\n\nThree subsequent tracks demonstrate a nice variety in sound and songwriting approach, where all the different influences manifest themselves. \"Hurricane\" has the softest and warmest guitar tone on the entire release, and for a good reason - it's just plain rockin' fun, giving the listener a break after the first six songs. \"Earth Flight\" looks like \"Hurricane\"'s close relative in terms of mood and sound, but differs in the songwriting department. It begins with a cool bass intro and continues with sort of a power chord riff: it isn't a power chord riff, but it sounds like one (if you get what I'm saying). The second half of \"Earth Flight\" kind of makes me remember old westerns, particularly scenes of shooting in the bars and riding on the horses in the desert under the merciless white-hot sun, which is strange because it's typically W.A.S.P.'s debut album that reminds me of such things, and even stranger considering the fact that Pentagram is an East coast band. But whatever. \"Livin' In A Ram's Head\" is a classic, and rightfully so - midpaced, groovy, rolling over your sorry ass like a 100 ton bulldozer and (gasp!) doomy. Not doomy like on later albums, but like an insane maniac ready to cut the throat of yet another victim - menacing, thrilling and laughing. \"I have no fear, the devil sets my course, livin' in a ram, said I'm livin' in a ram, yeah, alright!\". \n\nFinally, the fifth song from the BSR demo. And with this, the only thing about \"First Daze Here\" that really gets on my nerves is the way the demo was divided. There's really no sense in putting three songs one after another at the beginning, one in the middle and one at the end, because the atmosphere is completely lost. Either leave the demo intact or separate all the songs from each other. \n\nThe last two tracks, \"Be Forewarned\" and \"Last Days Here\" are also amid my favourite songs by the band. \"Be Forewarned\", presented in its original (three and a half minutes long) version, is the bluesiest song on here. When it gets close to the middle, it really starts to remind me \"House of the Rising Sun\" as performed by the Animals, although they're completely different in mood, instrumentation and performance. \"Be Forewarned\" sounds sort of cold and aloof, and the 'rippling water' guitar tone helps this greatly. Well, the whole song is kind of like rippling water in its flow. The lyrics are a bit obscure, but they might be somehow related to Charles Manson, I think. Anyway, Bobby does a hell of a job in this song, and his performance on \"Be Forewarned\" is the absolute highlight of the album. Now, on to \"Last Days Here\". It can be called the \"title track\", as \"First Daze Here\" is apparently a wordplay on \"Last Days Here\". The song starts rather calmly and then slowly but surely, gradually increasing tension, builds up to a climax... which never comes! Instead, the song seems to go on and on and on forever, but this neither bores nor disappoints the listener, because the flow is perfect and the ending, though abrupt, is logical. Overall, a great song with a \"freezing in the winter wind\" vibe to it.\n\nWhen all is said and done, there are two things (?) that shine gloriously: the bass work and Bobby's vocals. The bass brings the songs together and often play the leading part in conveying the mood, while Bobby gives out a stellar performance and adds much power and energy to the music. Production-wise, \"First Daze Here\" is (of course) uneven, but the sound is clear, all instruments are easily distinguishable and nothing stains the listener's experience. The selection of songs is very good; however, they could include a few more (\"Much Too Young To Know\", for example). From historical perspective, this is an essential compilation crucial for a better understanding of doom metal as a whole and providing much insight into what was going on in the undeground heavy rock scene in early 70-ies. Recommended for any metalhead; a musthave for the fans of Pentagram. If you see it somewhere, don't hesitate to buy it (for a reasonable price, of course).\n\nHighlights: \"Starlady\", \"Be Forewarned\", \"Last Days Here\"\n",
        "\n\"...The future looks only a sea of the troubled times ahead for you and me...\"\n\nProphetic words, don't you think so? What was on Bobby Liebling's mind as he penned down those words one will never know, but one thing is for sure: those words 'defined' Pentagram's future, as the band's career is one long, unending struggle for survival. But back in 1973 the future (most likely) seemed bright, although the stormclouds were starting to gather somewhere on the horizon. I say so because this demo shows a partial departure from Blue Cheer-influenced sound in favour of a darker, Black Sabbath-like one.\n\nThe mood is still quite relaxed, lighthearted and cheery. Songwriting is rather simplistic, but it does no harm to the songs. Three of them are short anyway, clocking in about three minutes each (these are \"Forever My Queen\", \"When The Screams Come\" and \"Review Your Choices\"). The other two (\"Walk In The Blue Light\" and \"20 Buck Spin\") are significantly longer - about five minutes. An interesting thing about all of them is that the riffs, despite not being heavy and dissonant, manage to create an uneasy, tense atmosphere. (I'm not implying that only heavy and dissonant riffs can create it, of course)\n\nThe opening track, \"Forever My Queen\" is kind of a white crow here. Unlike other four songs, it is midpaced, has little to no blues influence at all, contains two different solos and is the most Sabbath-y song on here. As you could have already guessed, all other songs are slow, heavy on blues influence and have only one solo. They also contain a lot of breakdowns (obviously not those shitty *core ones) and slight tempo changes. To be honest, \"When The Screams Come\" and \"20 Buck Spin\" pick up speed as they approach the end, and the latter song is pretty much one long solo broken down into several parts to make way for the vocals.\n\nConcerning musicianship: the basslines are prominent as always and bring the songs together, Bobby's voice is in good form and the drumming sets the steady pace for riffs, leads and solos. Speaking of which, Vince McAllister sure knows how to rock and shred. The lead guitar work in \"20 Buck Spin\" is pure bliss and brilliance, so it automatically makes this song the best on the demo. \"When The Screams Come\" and \"Review Your Choices\" look like cousins, but I like the latter a bit more because of the solo and a darker atmosphere. Production is rather good for a demo: the sound is clear from any interference and noises, all instruments are loud enough, finally, the mix is done properly so it helps keep the balance. In conclusion, this demo contains slightly less than 20 minutes of highly enjoyable and headbangable proto-doom from one of the genre's legends. Strongly recommended.\n\nAh, one more thing... you like Dave Chandler's guitar tone? Then let it be known that it is Vince McAllister who cleared the road and set the direction. Just listen to it, do you hear any similarities? I do. If Dave never used distortion, his guitar would sound like Vince's. Now, I'd like to finish the review as I started it - with a quotation from the lyrics, this time from \"Review Your Choices\":\n\n\"Review all of your choices now\nThere's no one 'round to show you how\"\n\nLuckily they didn't.\n",
        "\nIt was a dark day in Scotland when I re-discovered the vague and distant glories of ‘Day of Reckoning’, the Irn Bru had turned from a sickly ginger to a shade of crimson, the locals with their fish-like faces puckered up in the cold, adopted a solemn and foreboding mood – in stark contrast to their usual pissed-up joviality. I was alone again with the Pentagram… and Holy Sepulchre was it frightening!\n\nLong ago, I had neglected ‘Day of Reckoning’ for its sibling, ‘Be Forewarned’ (which to be frank is a thundering beast with sixteen hooves that will frankly slaughter any doom album outside of Sabbath’s first six). Although ‘Day of Reckoning’ is merely sulking amongst the tombstones rather than lifting up the caskets and fiddling with the dead, it’s still an immensely powerful doom album and certainly not one I should’ve avoided whilst twiddling around with darker arts. \n\nAs others have commented the production here is strange… distant almost. This is because the Pentagram cares not; it needn’t acknowledge your pitiful cries for the snare sound to be more refined. Pentagram is dark as space is deep… and dark (I’d like to thank Michael Moorcock for writing that for me). The guitar sound here is something very interesting – a murky, dreamy yet melodic tone emboldened by Victor’s use of frequent harmonisation. Notably the bass here really captures the essence of Geezer Butler’s early Sabbath style, the accenting of riffs and general use of some imagination in its craft harkens to the Butler-esque school of bass. \n\nIn short: if these guys were any closer to nailing the ‘Vol. 4’ sound they’d be setting Bill Ward on fire by the pool. \n\nIt is a source of some amusement for me that Pentagram use satanic imagery to great effect and generally has a very evil sound whilst much of their actual material is written from a staunchly Christian viewpoint. I suppose it’s the ultimate expression of Sabbath worship with its completely on-the-fence theological standpoint. But this very much appeals to me, as essentially I find religious views simply another way of annoying the hell out of people. Are the whiny Baptists about? I’ll fetch the inverted hot cross buns. Are the teen Satanists getting out of hand? Get me the book of Revelations and a pitcher of holy water! So once again, another clear reason why I’m starting to get a little obsessed by Pentagram. But whatever your standpoint is on the old God Vs Satan hootenanny, there is no denying – the old me would’ve put a “the cross?” related pun hear, but I’m a reformed man – that these lyrics are exceptional. \n\n‘Day of Reckoning’ contains within its smelly and mildewed tomb one of the most beautifully strange songs in the whole of heavy metal, ‘Broken Vows’, mournful gargantuan guitars twist and wail amongst each other and Bobby Liebling’s vocals give the sentiments of a man who’s been there, done that and probably regretted most of it. The emotion in his voice is not conveyed by wailing, starlet vocal acrobatics (that simply must always equate a great vocalist!) but through an austere, understated voice and a simple dark repose in his mood. As metal’s eternal underachiever you can sense that the storm clouds are never far from Bobby’s head. In fact this song shows the album’s production working in its favour; the tight cracking snare gives a nice contrast to the smothering guitar sound. \n\n‘Burning Saviour’ is the first Pentagram epic and quite a notable song with the smouldering combination of sparkly, spidery acoustic picking and the slow-burning crunchy guitar tones. This is really Victor’s time to shine and the pinnacle of his Sabbath worship in that it doesn’t just pick up on the more moribund aspects of Iommi either. For instance, see that massive riff at 4:27 could have been on a more rocky Sabbath song like ‘Sabbra Cadabra’ and at 5:21 there is a synthesiser (or possibly a heavily processed guitar) that recalls Geoff Nicholls’s work on ‘Die Young’. But there’s more! The guitar solo is combination of ‘Mob Rules’ era Iommi dynamic wah-wah and ‘Fast’ Eddie’s more earthy pentatonic ideas. There you go, now you can play spot the influence too, though I’ve done it for you… so this is like getting a colouring book that’s already been done as a present (damn you, Christmas 1994!). But strangely enough is that this is actually a Liebling composition, especially when we consider that he likes to downplay the Sabbath influence on Pentagram. Perhaps this was just a string of scarily accurate coincidences and Bobby was actually listening to ‘Summertime Blues’ the whole time.\n\nPerhaps one reason I find Pentagram far superior to their much-lauded contemporaries such as the at times excellent but often unimaginative, Candlemass is their ability to deliver far more cohesive albums. Never once do I feel that lesser songs are simply hidden behind the greatness of better ones. Pentagram made albums, Candlemass do pop singles… or not. But the point to get from this is that ‘Day of Reckoning’ is an unfailing album, it doesn’t assume that it can simply earn its keep by being doom for the sake of it. Songs like ‘Madman’ use strange brisk melodic guitars and 70s style middle eights that you wouldn’t normally associate with doom metal. Another issue of importance is the variation in these seven songs, if I were going to further stress my Pentagram-fanboy-holds-a-somewhat-unhealthy-prejudice-towards-Candlemass I’d compare this to ‘Epicus Doomicus Metallicus’ whose six songs achieve far less. But then again that paved the way for a whole spate of largely lifeless ‘epic’ doom bands whereas this probably just provided Pentagram with more drug money and maybe a tin of hot dogs, if they were lucky. But still, the variation between the title track’s speedy assault and the gloomy drive of ‘Wartime’ is very enjoyable. \n\nThough not quite as eternally doomed or desolate as ‘Be Forewarned’ (plug, plug, plug), ‘Day of Reckoning’ is not something to be sniffed at. All of the Death Row era ‘gram records are essential, magical records and this is the second and even as a literature student that’s maths even I can comprehend.\n",
        "\nSomething about ‘Be Forewarned’ has sunk itself into my spongy brain matter and haunted me in the depths of night, exacerbating the unfortunate visions I have – not too dissimilar to the artwork of ‘Sabbath Bloody Sabbath’ – of those nebulous and meddlesome nymphs cavorting around my bed… perhaps it was time to stop drinking, but I’d much rather blame ‘Be Forewarned’ for such damnable iniquity in my room.\n\n‘Be Forewarned’ is a punishing album, make no mistake about it. Some of what’s here can be considered incredibly accessible but still, it’s very much punishing. Sure, it’s not punishment in the blatant, brutal sense – this is perhaps best demonstrated by the fact that I thought it to be simply an excellent doom album, unaware of its sepulchral menace – but ‘Be Forewarned’ waits until it’s too late, ahem, before it reveals its more entrancing and macabre side. By this time you’re probably too far gone, the supremely dark yet melodic craft has probably already had you scrawling one last note about some horrid vision you saw, before you take one last hit of opium and then throw yourself towards the welcoming grey of the pavement below. \n\nBut, the punishment is incredibly welcoming; it’s a temptation almost as great as the apple was to Eve or the lure of the Scarlet Whore’s lips were (but I was promptly unaware of the reincarnation of Aleister Crowley who promptly took me from behind… the ‘Filthiness of her fornication’, indeed). But yes, ‘Be Forewarned’ and its evil is not an inaccessible one, far from it, with their school in the 70’s craft; Bobby Liebling, Victor Griffin and Joe Hassevander make this album a very easy one to be mesmerized by. This isn’t ‘Under the Sign of the Black Mark’, this is that 70’s sort of evil, the most dangerous kind that everyone can access (even your own children!) Though the aforementioned black metal classic has probably shifted more units than this… but such is the curse of the Pentagram. \n\nIt also goes without saying, what with all my musings on evil, that this album is an immensely atmospheric one. After years of unrelenting listens, I have come to the conclusion that ‘Be Forewarned’ is the product of two things:\n1.Spending a lot of time in graveyards.\n2.Taking hard drugs.\nOf course, this morbid curiosity has spilt over into other areas; lyrical themes deal with more horror movie fare at times. Which are of course delivered with vivid ghoulishness, this should be the case for a band that has clearly spent a long time at the funerals of complete strangers. The production enhances this atmosphere; the drum production is fantastic unlike its predecessors (‘Day of Reckoning’ suffered from a snare sound that was a little too tight and the debut was quite muffled). Joe Hassevander emerges as an absolutely phenomenal drummer here, with some awe-inspiring hard-hitting fills. Better still though, is his brilliant accenting of the riffs, see the sparse rolling toms and percussion in the verses of ‘The World Will Learn to Love Again’ for a marvellous example. The drums are so good however that despite accenting other players at times they always retain my attention. Victor Griffin’s guitar sound, too, has come to its perfect fruition. In a way his tone here is quite trebly in comparison to what went before it, but it’s perfect. Any more treble and it would be fizzy, more bass and it would be overbearing and less mid-range would result in too much of a hollow sound. This isn’t the lifeless solid-state buzz of Dimebag Darrell, nor is it the scooped-out stupidity of mid-era Hetfield; this is a characteristic and warm tone, perfect for conveying such emotion as displayed here…and lest we forget that’s what great guitarists deal with. \n\nIt is of note that a fair proportion of Mr. Liebling’s compositions here date back to the 1970s. One could point a critical finger at his wonderfully moustached person accusing him of artistic stagnation, however, when considering any this one must remember that these songs had not been previously available on any major release and generally these songs occupied a few boxes of stuffy and mislabelled vinyl. So the re-working of these songs is immensely functional and, in light of actually hearing the earlier versions, a great listen for the Pentagram fan and let’s face it, I was still probably learning how to wet my bed in 1994 so there wasn’t a cat in hell’s chance I would have been able to hear these songs in any other way prior to the release of ‘First Daze Here Too’. Also any criticism of Bobby can be stifled because of his phenomenal vocal display, that ranges from the lobotomised deathly moans on ‘Life Blood’ (which have an uncanny similar to Lee Dorian’s on ‘Forest of Equilibrium’), to the cooler-than-thou drawl on ‘Vampyre Love’ and the more familiar territory of the title track which vocally harkens back to vintage 70’s Liebling. Perhaps Bobby’s writing input has lessened to an extent… but you’d expect twenty-four years of drugs and Satan to take their toll, wouldn’t you?\n\nIgnoring traditional folkloric wisdom the boys don’t ‘keep the wolf far thence’ and as such once again delve into the familiar theme of Werewolves on ‘Wolf’s Blood’, which turns out to be the most bounding and energetic track here. The riffs are still mournful but somewhat invigorated by the full moon and Victor’s lead guitar is effortlessly memorable, once again sinking into my spongy brain (perhaps it’s that meningitis that the student council were so keen on?) with some really racy melodic touches. Unlike its lyrical predecessor ‘Sign of the Wolf’ which was more a tale (tail?) or a doomed man in a perplexed state over his more hairy moments, ‘Wolf’s Blood’ is more curious with its refrain of ‘I gotta find out’. \n\n‘Live Free and Burn’ is a wonderful opener and features riffs so malevolent and brisk (for a doom album at least) that they sound as if they spend their days donning hoods and nicking the purses of old ladies. Notably and thankfully, Victor has toned down the 4th harmonies he relied on greatly on ‘Day of Reckoning’ and they only make an appearance on this one song. They were fun, but you get the sense that if he’d continued doing them at the rate he had on ‘Day of Reckoning’ it would have been a bit gimmicky and Chuck Schuldiner he is not. A nice bit of technical editing from Mr. Griffin! Now if only he’d tone down the God rock that plagues Place of Skulls! Though this song itself has lyrics warning of evil and dates back to the early 80s… so perhaps the God rock has always been part of Victor’s persona. But more importantly this shows that ‘Be Forewarned’ achieves the ‘Psalm 9’ syndrome, in which an at times near Christian record out evils most of the inverted crucifix crowd. Fantastic!\n\n‘Vampyre Love’ shows once again that Pentagram simply refuses to fall into the trappings of the sub-genre. Whereas Candlemass or Reverend Bizarre filled their albums up with a pleasant but at times uneventful approach to doom metal, Pentagram write gloomy, effortlessly cool and almost poppy songs. Riffs are truly an occulted affair in the swirling blissful tremolo effect the opening guitar features. From this onwards the song takes on a confident strident feel, reflecting its subject matter perfectly. If the Cradle of Filth vampire themes are say ‘Queen of the Damned’ or some other tacky modern day nu metal vampire flick, then this is Christopher Lee covered in strangely raspberried blood in the bottom of a quarry… but sexier. Again, it’s atmospherically heavy if you listen closely you can just about smell the acrid smoke rising from the tombs of those Romanian long-in-the-tooth counts. In short: don’t play this song in that old abandoned church you found, unless you’re clutching the holy rood and three Frenchman’s worth of garlic lest you end up like the unfortunate dame on the album cover. It is of interest in the pacing of this album that after such a strange gothic pop song we have ‘Life Blood’, the band’s take on the more modern approach to doom metal. So Pentagram are one gear Sabbath clones, right? \n\nAt the end of this stunning record (both in terms of strength and its bizarre lack of recognition) we have ‘Be Forewarned’ itself. More dark and macabre than its 1972 predecessor. The brisk death-like jangle of the original (no really) is replaced with statuesque slabs of creeping doom. To reference vampires again, it’s less Nosferatu bumbling about in a creepy if somewhat quirky manner but rather the sonic equivalent, once again, of a lone soul baying at the moon. The backing vocals in the chorus are strange and out of place, but I like the effect it has. They give a strange banshee-like quality and strengthen the ghastly quality of the song. It’s a harrowing way to end the album and a fantastic musical journey into the depths of moustachioed depravity. Haunting, harrowing and unmistakably doomed – you’ve been forewarned – and it’s the final sound you hear as you realise the night has come down once again, you’re alone now and it’ll never let you go. One more night awaiting the mob of angry villagers with their torches firmly in hand, black dogs on the sea front and storm clouds above the abbey. \n\n‘I have loved heroin and dabbled with iniquity, therefore I have no cash’ B. Liebling, 1994.\n",
        "\n“…y'know you got big talk, but you're still sitting down…”\n\nWell, if you thought 1000 copies weren’t much (though usual for an indie 45 with no real distribution), this one only had 200 called up from the vinyl maternity ward, a small stack you can bet went mostly to record labels and publications in hopes of a few dedicated words. Well, it’s pretty obvious how that fared. \n\nCome ’73, Leibling and company are fully Pentagrammed in name after the Mac(a)bre debacle and are now on Boffo Socko Records with a single that’s said to have been pressed by their manager Skip Groff, yet still they stir a style that doesn’t quite seep from the Sabbath cauldron as most like to think/assume. Along with their ’72 short-player, these singles are cases in point that the wee-hour days of Pentagram really weren’t born inside a crumbling Birmingham factory. In fact, the A-side bounces along hippity hop happy, the tempo buoyant on a heavy air-swept current that’s rather unanticipated for a band named as devious as this (then again, we can dwell on the hobbled Lucifers and Black Widows of the time), meanwhile the other marries some cool garage riffs with what could be the theme to a ‘60s cop show. \n\n“Hurricane” is as warmly recorded as it is warmly executed, cozy as it snuggles next to the rhythmic fireplace of old while reacting with the turbulence held within its title (and isn’t a Bob Dylan cover). “Be Forewarned”, the band’s previous A-side, spells out ‘doom’ more in ominous letters than ominous riffs, but this one’s scripture throws any menace the band may have frightened into people right out the window, yet it’s still a cool track that takes me back to an obscure, bubbly place a tune like Tear Gas’s “Mirrors of Sorrow” had gone three years before. It’s also a song we could’ve seen Trouble cover around ’90. \n\nMore frill-less and serious is “Earth Flight”. It’s a garage-rummaged number of darker yet conventional energy with distortion that tends to bury the vocals a bit. As mentioned earlier, the fragments of a theme song haunt, like a less surfy but heavier and leisurely version of ‘60s Batman, a deviation of Get Smart, or even Spy Hunter. Luckily, the description sounds cornier than what’ll pump out of your speakers. \n\nSo by this time in ’73, we’re 0 and 2 as the Sabbath comparisons fly around mostly weightless in the outfield. But this Sabbath innuendo that’s quite clandestine up to now won’t last, and Iommi-ish thought patterns form blacker clouds over the band in the form of “When the Screams Come” and “Review Your Choices”, to name a few. \n\nBy the way, the terms ‘boffo’ and ‘socko’ are media slang for when something does commercially well, which this thing didn’t. If this 45 really took off, the label could’ve renamed itself Boffo Whammo, whammo being a more sensationalized socko. \n\nOh, and by hippity hop, I mean the toy I used to ride across my backyard when I was a tyke. \n\n“…and although times have to change, in you there's nothing new…”\n",
        "\nI often use the word \"slow\" or \"slowed down\" in reviews and expect the reader to derive positive connotations from it. I realize that in metal it typically goes the faster the better; or rather that was the stamp that NWOBHM and the subsequent thrash bands put on the genre. Sometimes this is the case sometimes it isn't. We tend to criticize bands who go from one extreme to a lesser extreme: Blind Guardian drew criticism- along with praise- by falling from speed metal to a more mid paced progressive/power metal. \n\nIt's misperception amongst some circles- not all mind- that slower songs are easier to play. And, essentially, that's true: slower songs are easier to play. They are not, however, easier to create. It takes a certain ear for sound to be able to put together a slower piece of metal and still captivate the listener. Sabbath flirted with the lines between up tempo and down tempo. It's the down tempo songs that fans most remember because of Iommi's particular ability to create entrancing riffs (helped by Butler's bass playing certaibly): Iron Man, Black Sabbath, War Pigs, The Wizard, etc. Wino (St Vitus, Hidden Hand, The Obsessed) is a veritable master of that exact same ideal. Plus he could sing which Iommi couldn't do to well.\n\nPentagram is inherently different from the two while portraying the same ideas. Their riffs are more melodically driven than Sabbath's. They play with harmony akin to Iron Maiden. Vocally Liebling is better than Ozzy, though not as good as Wino, and lyrically he dances between silly and passable. Certain lines from When the Screams Come are laughable which somehow doesn't detract from how absolutely spectacular that song is. Even given the production on the release I find the drum playing to be quite good, almost alike to how Dio used drums in his earlier records. \n\nThe production on the release isn't the greatest though I'm not sure what one expected from a not-so-mainstream band from the 70-80s to sound like. Fans of Iron Maiden, Black Sabbath, St Vitus, and Mercyful Fate will probably find things they can like in this release; Candlemass fans could come to see their roots and New Wave fans can have some fun.\n",
        "\nThis is a recording of a live show back from 1978, played in some obscure Washington DC club. Being a huge fan of Pentagram, I might commit a fanboyism when saying it, but I consider this release to be an essential and unique experience in doom metal. Please note! If your looking at this, you should be pretty well through with Pentagram's material already. If not, go back for the studio recordings first. \n\nA Keg Full Of Dynamite entertains a line-up where there were two guitarists in Pentagram. It was the cross-over period from Vince McAllister to Victor Griffin, but no qualms whatsoever. Richard Kueht and Paul Trowbridge do the job on the axes very well. Their riffage on some of the songs that would appear on the studio records is actually more groovy and very entertaining as such. \n\nThe set list showcased by the album contains a good deal of songs that would become highlights of Penta's studio records, namely Living In A Ram's Head, When The Screams Come, Day Of Reckoning and 20 Buck Spin. The way these songs are played is quite different, as is the atmosphere on the whole release. Pentagram was back then a groovy hard rock band with strong shades of doom and gloom. \n\nWith this record, as well as with the First Daze Here -compilations it is very interesting to see how same or different the have been ages ago. Or how they become a completely different song altogether over the years. A song that goes by the name Much Too Young To Know is included on this records but also on FDH2. The main riff on this rendition is without lying amongst the catchiest I've heard, where as the other version has none of it. \n\nThe sound quality is pretty close to what you have on the FDH -compilations. That means raw, unpolished and muddy. It yet gives the authentic, raw feeling to the music, and that is just perfectly fitting for a Pentagram record. What Keg has compared to those widely available compilations is exactly the energy of a live performance. Most of us will probably never see Pentagram or Bobby live. This being the closest to their gig I can get, there's no reason to be disappointed. As said, this is not the album with which to start listening to Pentagram. However, for any Penta-fan simply craving for more, this is an essential part of your collection.\n",
        "\n\"Review Your Choices\" is simply the heaviest and meanest record in the Pentagram catalog. Total doom, a descent into the pit! This is not the \"classic\" Pentagram lineup (which I consider the \"Death Row\"-era lineup), but the album was recorded as a two-piece with drummer Joe Hasselvander handling all instrumental duties. And Bobby Liebling is present as always, to give doom metal heads one of the best ablums of the genre, period. \n\n\"Burning Rays\" is an excellent album opener, but my favorite track is \"Gorgon's Slave,\" which starts out with some doomy riffing and creepy vocals. But when it breaks into the fast part, if your aren't headbanging madly, then you must be dead already. This IS heaviness! The album is comprised of new tracks and re-recordings of old tracks from the 70's (as is usually the case with Pentagram albums)such as the almighty \"Review Your Choices,\" another kickass track. The album ends with \"Gilla?\" which is just a bunch of odd noises. \n\n\n\"Review Your Choices\" stands alongside the best of the Pentagram albums, and is essential Doom Metal listening. I also recommend \"Relentless,\" \"Day of Reckoning\" and then everything else the band has ever recorded during its long and legendary career. DOOM ON, muthaf*kka!\n",
        "\nBe forewarned, because this album is great. It is Doom Metal at its finest. Right at the top up there with Candlemass as the masters of Doom Metal, ‘Pentagram’ are a HIGHLY overlooked classic.\n\nIf you’ve never heard Pentagram’s stuff, you probably have heard Black Sabbath. (I don’t know what you’d be doing on this site if you haven’t…) Well, Pentagram are, in many ways, similar to the great Sabbath. Same heavy, catchy riffs. Highly distorted downtuned guitars creating memorable riffs. We’re all familiar with Sabbath’s unforgettable tunes like ‘Iron Man.’ Although perhaps Pentagram don’t offer such classics as ‘Iron Man,’ they do come close. For example… there’s the song ‘Wolf’s Blood.’ For a long time it has been my favorite Doom Metal song because it is simply amazing. Dare I say that this album is worth getting for that song alone? It is THAT good. All of the ‘Be Forewarned’ album, ‘Wolf’s Blood’ especially, demonstrates incredibly accomplished songwriting skills.\n\nThe guitarwork is, as I said, unforgettable and very well done, both riffs and solos. But then there is the drumwork as well… Another great plus to the album. It is complex and original, and actually sounds sophisticated. That is the problem with many metal bands, in my opinion. The drums sound like something a ten-year-old could play. This is definitely not the case here. Nice rhythms, good patterns, adds a great eerie atmosphere throughout the album (as is essential in doom metal releases.) No complains on my part.\n\nThere is not much more to say, except for the fact that it is a shame how little recognition this band has received. Do yourself a favor and pick up a copy of ‘Be Forewarned.’ Recommended highly for fans of doom and traditional metal alike.\n\n-Marcin C.\n",
        "\nA funny thing happened to Pentagram on their way to becoming a legendary doom metal icon. They managed to exist in various forms for nearly 15 years before managing to record a debut album. From roughly 1970 until 1985, the band record seven-inch singles, demos, recorded live shows and seemed to forever have a tape machine running. Still, no record deal. The good news is that during that period of time the band wrote and recorded material every bit as good as their later “official” output. The bad news for the band is that said recordings were bootlegged mercilessly, and often sold at ludicrous prices. \n\n\nFortunately Relapse records has stepped in and dedicated themselves to providing quality issues of the band’s early work. This is the first volume we’re gabbing about here, and damn strong it is. First a quick warning: for those of you into traditional doom metal, be aware. Pentagram’s sound a this point had as much to do with seventies metal norms as it did with the doom style they were helping to invent. Having said that, “Forever My Queen,” “Livin’ In A Ram’s Head,” “When The Screams Come,” and “Review Your Choices” are all heavy as a sack of hammers, on par with any retro doom being produced by scene leaders like Witchcraft or Spiritual Beggars. Equally impressive are the loping riffs of “Lazy Lady,” the slow burn of “Be Forewarned” and the nearly R&B tinged “Last Days Here,” presented in a raw but sweet live recording. \n\n\nImportant for the historical preservation of the band’s music and a friggin’ great record in and of itself, First Daze Here is the kind of archival work we need much more of in metal. Think about it: If we don’t preserve and take care our own music, then who will?\n",
        "\nHard to believe but the brilliance of this band’s 1985 debut was largely ignored in it’s day, which was surely bad news for Pentagram at the time. However when albums that good go unnoticed initially, they often become legendary over time, which is what has deservedly become of much of Pentagram’s work. It’s all the more true of Day of Reckoning, their sophomore text of doom, and perhaps the finest collection of songs these cats would ever offer our ears. \n\nWhereas the debut clearly had Sabbath on its morbid mind, this number saw Pentagram shaking off that omnipresent influence and forging a more signature style. Said style arrives as the needle (or laser… needle in my case) hits the groove of the sinister title cut, an up tempo but foreboding cut which drips of Bobby Liebling’s sterling vocals and Victor Griffin’s truly demonic guitar work. An absolute classic, it may be Pentagram’s single best tune ever, which for this band is truly saying something.\n\nAnother awesome number is “Evil Seed”, which manages to acknowledge its psychic debt to Sabbath, and remain an absolute Pentagram classic all the same (the point where Liebling cries forth “all right now… won’t you listen?” ala “Sweet Leaf” is a great moment). Two absolute epics appear as well, those being “Burning Savior” and “Wartime”, both of which demonstrate what skillful writers and players this band had become. The whole affair is blessed by clearer production than the fuzzy sounding debut, and if I had to pick one Pentagram disc to take to a desert island, it would have to be this. \n\nAgain largely unheralded in its day, this is one of doom metal’s finest children, and truly is worthy of its current essential status. Again, as the debut, look to Peaceville Records for a CD reissue. Damn rare on vinyl it be, and (chuckle) I’m lucky to have one. (No! It’s not for sale, fan boy!)\n",
        "\nAfter 15 or so years knocking around the underground, Virginia’s doom godfathers finally got around to making a debut album. Not to sound judging in that comment, the band had recorded (a lot, chiefly demo stuff and some seven inch singles) and gone under a host of aliases (Deathrow, Bedemon, etc.) before settling on Pentagram as a nome de plume. Tons of said recordings are available in bootleg form, but in far better form on two collections from Relapse Records (see reviews somewhere else in the book you’re holding). By around ’81 however, the former flirtations with psychedelia and even hard R&B had condensed into a formidable doom approach, informed but not openly imitative of that influence of influences, Black Sabbath. The pairing of singer Bobby Liebling and guitarist Victor Griffin was a very fruitful one, resulting in some molten, yet well-crafted material that has really stood the all too debilitating march of time. \n\nSonically this album is only slightly less unbaked than a demo tape, but that’s a good thing, as the raw underbelly of the band is a powerful organ indeed. Truly though, the proof of this album’s brilliance is in the songs, which are like stone tablets of divine law in the (as yet unpublished) Bible of Doom Metal. “All Your Sins” creeps with a sinister riff and tormented lyrics as Liebling informs a sinful soul that judgment is nigh and it will not be pretty. “Sign of the Wolf (Pentagram)” is a chugging, head wrecking monster that is (no exaggeration) one of the best heavy metal HM songs ever written. Liebling’s tale of possession by evil, in spite of heavenly guidance, matches the molten punch of the riffs perfectly, and DAMN that’s a killer guitar solo!! “The Ghoul” creeps back into semi-doom tempo, whilst “Relentless” is a speedy but weighty cut with more killer riffs. The remainder is good at worst, awesome at best, and would you believe that this band’s next album was actually better than this? \n\nIssued in ’85 with very little fanfare, it was re-issued under the moniker Relentless by Peaceville Records in the mid-90’s. Bottom line – a must have with no excuses allowed. Non-compliance with this policy is punishable by death or a Nickelback listening marathon. God, oh God, which is worse?!\n",
        "\nPentagram, the perpetually forgotten 70's American Metal band. Hailing from Alexandria VA, they toiled in obscurity for the better part of two decades before releasing an LP. Along the way, they released a handful of singles and recorded some demos as well. These tracks are culled from those various locations and given a good treatment to form what should be a mandatory disc for every Black Sabbath Fan. While comparisons to Black Sabbath are quite appropriate, I can almost imagine a straight line being drawn to this from the works of Blue Cheer (who these guys idolized) and other early stoner/psychedelic bands. Perhaps it's just my American patriotism or something. While this certainly is very heavy music, it’s not in the same league as Sabbath, and as much as I like the guitar tone on here, it’s really quite different from that of Tony Iommi. You might even call it a bit of an acquired taste.\n\nFirst, I’ll tackle the straight up metal stuff: Forever My Queen is supposedly the most well-known song from the band. Anyway it explodes right out of the gate with a simple yet crushing riff and an awesome solo to boot. When the Screams Come is my personal favorite song on here. The main riff just drips with evil and there's a bit of thrash in the middle. Certainly we have here one of the greatest ever forgotten metal anthems, and it's a tragedy that this is only know by a small circle of devoted fans. Earth Flight, B-Side of the band’s second single starts with a bass intro and builds to a heavy rocker with Sab riffs. In fact, the one in the middle reminds me a bit of Sabbath Bloody Sabbath. Review Your Choices is similar to the aforementioned When The Screams come, but here the guitar is toned down a bit. That doesn’t mean it’s any less evil, however. \n\nNow, as I mentioned the band literally worshipped Blue Cheer, and it shows on some of these tunes. Walk in the Blue Light hearkens back to the band's earlier material, which leans more toward Blue Cheer than Black Sabbath. Not bad, but there were much better things to come from the band. The song Starlady has become notorious, since Gene Simmons had offered the band $10,000 for this song but they famously refused. Incidentally, this may have resulted in Simmons ditching the band and signing Angel instead. In my opinion, this sounds much better than what KISS would have done with it. It’s a pretty straightforward 70’s rocker, and yes that’s rock not metal. Be Forewarned was the band’s first ever single in 1972, and it’s trippy with its waves of tremolo guitar. Lazy Lady, the B-Side to Be Forewarned, is another Blue Cheer-ish song here with a sliding bass intro and just some hints of doom throughout. An auspicious start for an auspicious band.\n\nThe remaining songs are a mixed lot. These strike me as works in progress, or something that could have used more development. For example, Hurricane, the band’s second single, begins with a rightly marching riff and then half-way through, goes speed metal for about 30 seconds. It sounds very awesome and quite innovative, but at the same time under focused. And Livin' in a Ram's Head, a VERY roughly recorded tune cut in a club in DC, has some sort of “stoner-punk” sound but feels a little incomplete as a song. I can only imagine that, given proper studio time and treatment, this could have been blaring out of every FM radio.\n\n20 Buck Spin reminds me of some of those old heavy jam bands like Truth and Janey or JPT Scare Band. It’s a tale of a hooker and life on the street, and at the end it just takes off into an extended jam. Vince McAllister gets a little self-indulgent, but that’s okay, he’s actually a good player. Then finally, Last Days Here, the “quiet” song, but not emotionally light, as it deals with death and the afterlife in a heavy-handed fashion. I like Bobby Liebling’s vocals on this one.\n\nThe band personally oversaw the remastery of the CD and the creation of the included booklet, with full lyrics and a few photos. Very good job on that as well.\n\nSo to summarize, if you are any kind of a fan of stoner or doom metal check this out. You won't be disappointed. Also be sure to check out First Daze II, coming March 2006, and the related band Bedemon, whose Child of Darkness CD will be out very shortly.\n",
        "\nSpanning roughly a decade, and consisting of tracks from three killer releases, this is a good collection of Pentagrams best. This holds a great old school doom/stoner Metal feel, with obvious hard rock leanings, and a creative strength bore from great musicianship. A vision with great continuity (in relation to the musical vision of the band), purity, and power. This is one thick slab of awesomeness. And, it goes with out saying, I'd recomend picking up the three albums (on LP) which this material is from instead of this, but if your just looking to check out the band then this is a good choice as far as variety goes.\n\nA great mix, as the tracks aren't in any sorted order (well there is a weird order by threes, but it doesnt really mean much), revealing a highly ecclectic, and competent band creating some of the best Stoner tunes you'll ever find. Holding a dark satanic image, and capturing a sickly morbid vibe through singer Bobby Liebling's oddly catchy, and powerfully hypnotic voice (very Rock'n feel), and the bassy, hard hitting, psychodelic rythms of guitarist Victor Griffen (wailing solos by the way). I'd suffice to say [type] that this is accessible to most any fan of true metal. A bit short as far as amazing production, its essentially tinged nicely with a warm doomy crunch thats a bit more Rock than anything else, and a time stamped feel thats worth more sentimentally than any big budget production could offer. \n\nTrying to pick stand out tracks off here is kinda hard cause theres just so much good material...but if I had to, I'd say my favorites on here are:\nFrustration\nWhen The Screams Come\nEvil Seed\nDeath Row\n\nSo, yeah, get this as it contains essential music for any true fan of Doom Metal, Stoner Rock, and just Metal in general.\n",
        "\nI can't find anything wrong with this album. Every doom-laden riff is heavier than an elephant's ass (as Solitude Aeturnus's Rob Lowe once described Dio's Shame on the Night) and absolute headbanging material. Beautifully harmonized soloing without ever being flashy, and haunting (& vaguely AiC-ish) vocals. Or maybe it's the other way around, I'm no expert on chronology, just providing a point of reference here, y'know? Anyway, the drummer has some mean chops too, double bass and all which shine through occasionally without ever being overbearing, and, lest I should forget, the album has one of the greatest songs ever written-Wolf's Blood. Every single riff and solo and everything in this song is perfection, it rocks so hard it hurts. The album's lyrics even range from relevant issues of mortality to the obligatory mystique-shrouded verses about wolf's blood and all that fun stuff. If you have any interest in melancholic doom metal that isn't operatic and pretentious bullshit which is flooding shelves these days, you need to own this fucking album, enough said. Also recommended for fans of Victor Griffin's work with Place of Skulls.\n",
        "\nPentagram's second album saw a refinement of the doom metal approach the band took on their first album. The trademark 'lackidaisical' vocals of Bobby \"Plugie\" Liebling are still in place, and sound-wise not a lot has changed, but this album definitely does not sound like just a 'part two' of their debut. Overall the feel of the album is more oppressive and sinister than the debut; the band forays more into the slower tempos and the riffs themselves are a lot more 'doomy' sounding. The high point is definitely the track \"Burning Saviour,\" the nine-minute-plus centerpiece of the album. It starts with dirge-like clean electric arpeggios which explode into a 'heavy' version of the same progression - and even though the song builds and changes, it still manages to re-incorporate different versions of this main riff several times later in the song. \n\nJust like the first album, the 1993 Peaceville issue is a reissue - this album originally came out in 1987 on Napalm/Dutch East India. Definitely a worthy purchase if you're into Sabbath-inspired 'vintage' doom. \n\n(Originally published at LARM (c) 1999)\n",
        "\nThough issued by Peaceville in 1993, this album originally was released by \"Pentagram Records\" (i.e. independently) back in 1985. Pentagram were a DC-based doom band which had actually existed since the late 70s (and even earlier, to hear the story from the band's vocalist/founder Bobby \"Plugie\" Liebling), and though they always called themselves influenced by stoner-rock band Blue Cheer, their sound actually landed VERY close to Black Sabbath - Thick slabs of power-chord sludge. Plugie's vocals were rather unique - not very forceful (he never really 'lets loose'), but he concentrates on weaving a good vocal melody into the songs - sort of like other 'sloth-doom' bands like, say, St. Vitus or the Obsessed. The rest of the band is also similarly competent: guitarist Victor Griffin just lays down the riffs and rarely indulges in solos, but when he does they're quite slow and melodic rather than 'noodly', and they fit well. Bassist Martin Swaney also basically sticks with the groove of the songs, throwing in the occasional well-placed fill. And finally, drummer Joe Hasselvander (who went on to play with Raven) sticks to the song's groove, choosing his fills well. The playing is understated, but in a good way, because each member simply plays to the song rather than using the songs to show off. It's rather hard to pick out a standout track, because the album is quite good overall, but the first track \"Death Row\" has some of everything that made Pentagram such a great band. \n\nThe music probably sounds dated to those used to the extremities of modern metal, but for fans of doom metal, Black Sabbath, or just that old 'vintage' crunch, Pentagram's first album is one album to check out. \n\n(Originally published at LARM (c) 1999)\n"
    ]
}