{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "San Francisco, California",
        "Status:": "Active",
        "Formed in:": "1983",
        "Genre:": "Death/Thrash Metal",
        "Lyrical themes:": "Satanism, Occultism, Anti-Christianity, Murder, Death",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n1983-1987,\n1990-1993,\n2007-present ",
        "Number of Reviews": 59
    },
    "Band Reviews": [
        "\nFollowing the seminal Seven Churches, Possessed underwent a sort of identity transition where instead of toeing the line between thrash and death metal they fully committed to thrash. Beyond the Gates was a solid thrash record where some of the cuts had elements of their debut, but by 1987, the band was solely putting out thrash. The Eyes of Horror, despite only being five songs, is one of the best thrash releases of the 'eighties!\n\nEvery song, and furthermore, every riff is excellent here. The band makes sure to put out only the best of the best from their recording sessions, and this translates into a slew of catchy tracks that don't run too long. The opening \"Confessions\" is fast and to the point, while \"My Belief\" masquerades as a proto-death metal song for the first twenty seconds or so before the energy revs up and a brilliant thrash riff takes center stage. Vocalist Jeff Becerra is at the peak of his powers here, with memorable and frightening vocal performances all over this release, though as usual he lets the music take the spotlight.\n\nThe solos on this album are pretty interesting, though that is probably the one drawback (if you can even call it that). They could have been flashier and it wouldn't have hurt, but none of them are bad. The soaring riffs that build the hooks are generally pretty inspiring, and the rapid time changes as the band shifts from verse to hook are well-written and perfectly executed. Longtime fans will remember \"Swing of the Axe\" from their demo days, but the version that makes it onto this EP is simply outstanding and has easily the best guitar performance from Mike Torrao, although the closing \"Storm in My Mind\" comes extremely close with the opening lick. In its entirety, this EP is a fantastic exhibition of Slayer-style thrash with more precise playing and methodical song structures. It isn't as unhinged, for better or worse, but it certainly kicks ass.\n",
        "\nI was surprised to see nobody had reviewed this demo yet, given that Possessed is one of the most popular extreme metal bands out there. But alas, here I am as the first.\n\nThis demo is very short, and understandably so. After the Death Metal demo, Possessed had to come through with another collection to prove they had more than just four songs in their repertoire, but they wanted to save their best stuff for Seven Churches. Thankfully they did, and I'm okay with this demo being lackluster since it gave us that classic album. The 1985 demo is solid at some points, like on the solo of the \"Fallen Angel\" cut, but there are also moments where the band clearly is still working out the kinks, like on the lost track \"Swing of the Axe.\" This song sounds pretty thrashy, aside from the vocals, which unfortunately aren't enough to salvage it.\n\nThis demo is recorded with very poor quality and although the guitar work is sound, it's very hard to hear the bass and a lot of the drum fills go unnoticed (even though that's one of the most appealing things about Possessed). This demo is considerably worse than the Death Metal demo, but for hardcore death metal fans or Possessed fans (like myself), it's worth checking out to understand the totality of the lore. Death metal had never been done when this demo was recorded, so even the hints of death metal that we receive on this tape are something novel. The songwriting is there, a talent Possessed always has in their back pocket, but the performances could be a little sharper, especially on this demo's rendition of \"Death Metal.\" Of the three, this version is the worst.\n",
        "\nAh yes, Possessed, a band that's a subject on ongoing all over the metal subcultre debate, \"Who was first death metal band, Death or Possessed?\". I mean, let's forget Sepultura was also there, but okay.\n\nAt any rate, anyone who hears the name \"Possessed\" can, without shadow of a doubt, instantly hear 'The Exorcist' main theme in their heads, and prepare for some whoopin' from the song going by the same name. Possessed is not to be fucked with, and Jeff Becerra, despite having his legs paralyzed, still keeps going and being a badass frontman. However, I'm certain no fan of this band expected to be hit with a new studio album. But 2019 brought us quite a suprise.\n\n'Revelation of Oblivion' is packed with 10 songs, intro and outro. After introduction our ears are fed with single 'No More Room in Hell', which is all sort of perfect beginning. It's fast, filled with all tremolo riffing we loved Possessed for (despite the fact NONE of original members are in the band, aside from Becerra), simple yet fitting drumming from Sadistic Intent's veteran Emilio Marquez. It's not just 'No More Room in Hell' that kicks all the asses present, we have all the other \"catchy\" tunes like 'Shadowcult', finisher 'Graven' with a music video featuring motherfucking Peter Stormare, 'Ritual', 'Damned', etc., you get the idea. We also receive some slower cuts, namely very Exodus-like 'Demon' (seriously, this one is straight-up sequel to 'Deliver Us to Evil') or 'Omen', which, sadly, isn't based on iconic Richard Donner movie. They fulfil their role pretty well, considering this album is around 54 mintues.\n\nWhich, as you probably guessed by my previous reviews, is not necessary. Okay, I'll say this - I am astounded that Possessed manage to not to fuck up their comeback after 30 years, with Jeff Becerra's voice aging NOT A BIT! And that 9 of 10 full songs are still capturing the magic of Possessed's music, despite the fact that most of the guys in current line-up haven't been around when Possessed was a hot thing in world of metal. I say \"9\", cause 'The World' could easily be thrown away. Why? It's not a Possessed song, or at least it tried to be. But it shouldn't have the blueprint of fucking Running Wild song, and that band used to kick ass. It's like, you're listening to this obvious throwback to days of 'Seven Churches' glory and all of a sudden you find yourself on a Tortuga Bay wondering \"How did I ended up with 'Death or Glory' in my player?\". Which is weird, cause after that we come back to our regular scheduled violence called 'Graven'. I'm fine with tributes (intentional or not), but at least make it less jarring or put it on the bonus section.\n\nAlso, sound of CD release is not great. It feels a bit too high-end, drums are a bit too clean and too overproduced. All of this disappear in vinyl version, because of course it does, God forbids CD fans will get a decent sounding music! Also, I'm not sure about tracklist. It's decent overall, but even without 'The World' I'm don't think 'Graven is a good way to finish off such a great comeback album. Maybe if we replace it with duo 'Damned' and 'Demon' or change the places with 'Shadowcult'. Keep the outro if you need (it's still kinda pointless), but keep the impact going.\n\nStill, if I was a big Possessed fan, 'Revelations of Oblivion' would be a dream comes true. It doesn't dissapoint, delivering the excellent thrash/death metal Possessed was known for and even with a little misstep it gives you enough to be satisfied from a 2019 metal record. Is it the best album of that year? Hard to say. But without a doubt it's fucking amazing. Of course there's no more room in hell - 'cause Jeff Becerra came back on his throne, suckers! Hopefully, it won't take another 3 decades to get a new one from this absolute beast of a man.\n",
        "\nPossessed's history is odd, yet interesting to look at. The San Franciscan band released their debut album \"Seven Churches\" in 1985, then released \"Beyond the Gates\" the next year, and didn't release another full-length LP until last year with \"Revelations of Oblivion\". Despite the band's changes throughout the years, \"Seven Churches\" remains one of Possessed's most famous releases, as it still holds up as an amazing thrash/death metal album.\n\nSpeaking of which, let's get to the debate. To this day, people still can't decide on whether this or Death's \"Scream Bloody Gore\" is the first death metal album. In my opinion, this album has a mix of both. \"Seven Churches\" has plenty of thrash-sounding guitar riffs, like the ones in the song \"Pentagram\", and some have more of a thrash atmosphere. However, there are also plenty of characteristics that I would put in the death metal category. The self-titled track \"Seven Churches\" is a lot more chaotic than many of the songs here, where all the instruments clash together to make a noisy sound, and Jeff Becerra's vocals have more shouts to them, making him sound more crazed than in other songs. If you were to tell me what was the first true death metal album, I would say \"Scream Bloody Gore\" since that has a lot more death metal characteristics. However, \"Seven Churches\" does a great job in combining the two genres to make one fast, violent album overall.\n\nGoing into more details in the songs, \"The Exorcist\" is a fantastic opening to the album. The song starts off with synths that play the theme to the movie \"The Exorcist\". It brings in a calm, yet sinister atmosphere. We then cut to the rest of the instruments, and they sound superb. The guitar's sound is heavy and distorted, and adds in an evil sound. The drums also bang hard, and have that fast-paced beat that death metal is known for. Becerra's vocals are also great, as his voice brings dramatic emotions in the sound. The overall atmosphere in the song is chaotic, and serves as an excellent intro to the album.\n\nAnother great song I enjoyed is \"Fallen Angel\". We start off with a bell, followed by a great guitar and drum performance that have a sharp sound to them, along with the bells that flows through them well. The vocals have more of a melodic tone, having more diversity in vocal range. It is one of Jeff's strongest vocal performances on the album. The lyrics are also pretty good, with descriptions of angels falling to become Satan's slave. The overall performance of the song is excellent, and is one of the many highlights of the album.\n\nWhile I generally enjoyed the album, it does have its flaws. I found the song \"Burning in Hell\" a bit mediocre. The drums are great, with a fast-paced beat in them, but the guitar riff sounds like generic thrash. Jeff's vocal performance also sounds a bit weak, with some mumbling in them, so it kinda sounds drowsy. And while the lyrics in \"Fallen Angel\" were good, the rest of the lyrics on the album sound bland and at times childish with exaggerations of Satanism and hell. \"Satan's Curse\" is a good example of this, where the execution of Satan cursing people is just as dark as a 13 year old's \"edgy\" OC. Then again, the band members were still young, so I wouldn't expect them to be Robert Frost from the get-go.\n\nDespite these issues, \"Seven Churches\" remains an amazing album for those who are looking for a more extreme sound. The guitar riffs are harsh, the drum beats are extremely fast, and the vocal performance of Becerra is amazing. Death metal or not, I would still recommend this album to anyone.\n",
        "\nWell folks, an album that many people have reviewed on this web site, a classic, a corner stone, an untouchable milestone in the history of extreme metal that few dares to criticize and many prefer praising. Controversial schisms have been witnessed on heavy metal and extreme metal. For instance, Ozzy or Dio, Sammy Hagar or David Lee Roth and a more recent one; Krzystof´s Batushka or Bart´s Batushka. Stupid discussions that lead nowhere but a pointless argument.\n\nPossessed “Seven Churches” seem to fall into the same abyss of this dichotomy where one group of people acclaimed it as the best metal album ever, the first “death” metal album, the sacred cow of extreme metal. On the other side, the naysayers, the ones who claim the album is over rated, is just trash metal on steroids. At the end, nobody is right, yes face it! This album is heavy as fuck, is an untamed beast that was kind of ahead of its time but in my opinion did not invent death metal per se. I Perceive the band as an igniting force, the primordial precursor of something that later bands perfected into something that now we call death metal. \n\nSeven Churches is packed with the best of both worlds, the most primitive and raw features of trash and the barbaric aggression of early death acts. For instance, vocal wise, the album can be seen as a thrasher; Jeff´s vocals are just placed on a higher range for your average classical trash metal band. His screams incorporate a certain rawness that surpasses singers like Hetfield, Mustaine and Belladonna. The vocals in the album are some of the reasons why people label Seven Churches as a death metal record. Not quite in my opinion, vocals are aggressive and stuff but lack the cavernous and deep guttural approach that later will become trade mark of the sub-genre. \n\nOk, let´s move to the structure of this banger. The record itself is relentless as fuck, no place for ballads or slow songs or mid-tempo. The foot of Mike Sus is on the full gas through out the album, there are some intros in the songs like “The exorcist” (Tubular bells, very ad hoc, I have to say), “Fallen Angel” (Evil key-boards to set the mood) and demonic spoken words before the track “pentagram” begins. Apart from the very short intros mentioned, there is no place to hide during the whole experience, I must say the album is all killer no filler. Back on percussions, the kit is literally destroyed by Sus; my only complain is that the drumming is very repetitive and follows a predictable formula of the tupa tupa kind that was also very common back on the day. However, a bunch of bands still replicate and homage this old school type of drumming calling themselves retro or even summoning a sub sub-genre called trash/death metal. \n\nLet´s move to the guitar department in charge of Mike Torrao and Larry Lalonde. At this point, we are standing in front of a riff machine, the shredding demonstration is flawless jet clueless at some times. I mean, no doubt we are witnessing one of the finest guitar players on metal history but at the same time I got the feeling of confusion and a sort of organized chaos that falls in the middle between trash and death metal guitar trademark style. The shredding screams trash metal but the ominous intent of the riffing plants the first seeds on the morbid soil that will later germinate the rotting corpses of death metal. No mystery that coming bands will drink from this fountain of primitive brutality to create their own shit. The guitar duo demonstrates in every song how to shred the strings to the point of make the guitar cry. \n\nThe concept of Seven Churches is blurry yet pioneers and detaches trash metal from its political/environmental criticism. Possessed is loyal to its name and adopts an ad hoc concept for this record, darkness, hell, Satan, blasphemy and all things that are evil. In this case, the record approaches the realm of early death metal in a more specific way. The band logo, the name of the record, the minimalist art work and the track titles pioneered the many clichés yet to come in the future. I have to say that these guys were quite young when recording Seven Churches, so, that´s why lyrics are not my cup of tea due to their narrowness and lack of perspective that will be shaped better by bands like Death and Morbid Angel. \n\nAll in all, no matter what your opinion is, love it or hate it, you can´t ignore the greatness of the record and how influential has been in the extreme metal scene. Ahead of its time and associated only with similar brutal records of the time like Dark Angel´s “Darkness Descend”, Slayer´s “Hell Awaits” and Death´s “Scream Bloody Gore”; Seven Churches is a jewel lost in the useless schism of whether it is the first “death” metal album ever or it is just extreme trash metal. The fact that a song in this record was named “death metal” doesn´t mean it sis death metal. It is the same as saying that Venom is black metal because they named their second album black metal or they have a song with the same name. This argument is very weak and does not contribute to the discussion. Possessed ignited the fire of curiosity and set the bar high for other bands to play heavier songs and also pushed the boundaries of genre classification. We can argue whether it was the first one but I think is better to hold this classic piece as a precursor of extreme music. \n\nFavorite songs:\n-Holy Hell\n-Fallen Angel\n-The exorcist\n",
        "\nReturning after a long hiatus is difficult. Half of the potential audience will be wondering why you're not rehashing your classics, and the other half will wonder who the hell you are in the first place. For a band as legendary as Possessed this was a near impossible task. Their recorded legacy really boils down to one album, \"Seven Churches\". That album is ground zero for death metal, such an undeniable classic that their other releases barely warrant a footnote in extreme metal history. Nonetheless, I had high hopes for \"Revelations of Oblivion\". Many people said it was good, and Mike Browning (with Nocturnus AD) proved that classic death metal bands could release great comeback records. \n\nFor a comeback album, \"Revelations of Oblivion\" is above average. At least it sounds like Possessed, Jeff Becerra sounds like how he did on \"Beyond the Gates\". His vocals are powerful, and he has some good lines to spit out. The guitar playing is excellent (better than on previous Possessed records), the soloing is melodic but there are still some tough, old school moments (\"Shadowcult\" has some nice \"Holy Hell\"-type riffs, for instance). The production isn't bad for a modern metal album. The drums are a little over-processed and it has that 'big' sound which flattens everything out, but it sounds OK. Musically, Possessed follow the thrashier path of \"Beyond the Gates\" rather than the death metal of their debut. This makes sense as Possessed were always heading in that direction, but the songs sound a bit safe and conventional in comparison to the chaos of \"Seven Churches\" (there is a lot of ‘verse-chorus-verse’ song structure on here). \n\nSpeaking objectively, this record is quite good, but then I realise how little I care about objectivity in music. When I listen to extreme metal, I want to feel unnerved. I want to hear energy bursting from the seams. An album like \"Revelations of Oblivion\" doesn't do that. Instead it provides a bunch of medium-paced, heavy thrash metal songs with some nice soloing. So do a million other records. A song like \"Damned\" sounds like a re-tread of Exodus (\"Fabulous Disaster\"-era). The guitar workout on \"The Word\" reminds me of Forbidden's \"Twisted into Form\". I like both those albums as much as the next person, but I don't have much interest in listening to a modern version in 2019. This kind of technical, aggressive thrash sound was done and dusted by 1991 (being generous). \n\nThere are a couple of highlights, \"Ritual\" is easily the best song. This is the Possessed at their most complex, aggressive and chaotic. Subsequently it is the most 'death metal' sounding song on here. \"Graven\" has some of the dizzying passages that remind me of prime Possessed, though it also has a stodgy, mechanical sounding intro. Overall, \"Revelations of Oblivion\" is a likeable album and most of the songs are listenable (apart from \"Omen\" which is a bit shit). Truthfully, I would never choose to listen to this album over a classic thrash record, and I wouldn't have listened at all if it didn't have the Possessed logo on the cover. I was never expecting \"Seven Churches Part II\", but I would have liked something a little nastier and more chaotic. This is a decent comeback album by a legendary band, but don't expect the earth to shake.\n",
        "\nI'm ageist as fuck when it comes to metal. It's true! I really wish the legacy bands would just go the hell away and make room for the young bands with fresh ideas to actually take a fucking foothold in the scene before all of the old fogeys die and metal as a genre goes the way of doo-wop because metalloids are terrified of change. This current age of nostalgia is fucking poison to me because this is the exact correct time to be finding the future vanguard of the genre we all love, and instead we're too busy slipping off our chairs in excitement because fucking Hydra Vein is reuiniting for some reason.\n\nSo Possessed was kind of an easy choice for me when I wanted to make this argument. It's been 33 years since their last LP, and in the interim they've either been broken up or busy releasing meaningless singles. And exactly as I suspected, it was hailed as pretty uniformly great by critics and fans in the corners of the internet I hang out in. I've seen this movie before, it happens every fucking time Overkill or Judas Priest release something. Classic band releases a mediocre album and gets showered in accolades because they were great thirty years ago and didn't release Illud Divinum Insanus, and apparently that's all that's necessary to wind up sweeping Album of the Year lists across the net. Fuck this shit, move over and let Xoth shine or something.\n\nAnd that's why this is such a humbling experience for me, because against all prejudice, Revelations of Oblivion is actually pretty fucking excellent in many ways. I think between this and the new Nocturnus album this year, I'm starting to question my long-held stance outlined above. Maybe the issue isn't that old bands need to go away and stop hogging all the limelight, maybe they just need to write albums as great as Revelations of Oblivion in order to justify the instant praise they get.\n\nFor a band that's been more or less dormant for longer than I've been alive, this is pretty much the best album I could've expected out of them. Despite most of the band being a few heartbeats away from being able to order off the senior menu at Denny's (barring guitarist Daniel Gonzalez, who is only in his late thirties) there is a hell of a lot of youth in the sound here. The adrenaline is off the charts, and the pace stays consistently high. The overall feeling of this album is just fuckin' ferocious, with razor sharp riffs tearing through at nearly all times and drumming that feels like a tommy gun. There's definitely a feeling of aged professionalism in how tight the riffs and songs are, but that youthful energy that keeps things sounding wild and dangerous actually never left the band. This is no replacement for Seven Churches, mind you, but it is worthy of the legacy, which is something I never thought I'd say. Tracks like \"Ritual\", \"The Word\" and \"No More Room in Hell\" rip like motherfuckers. This is that perfect nexus point between thrash and death metal that Possessed pretty much nailed all by themselves way back in 1985, and for once being timelocked in such an era is a huge boon to the album since they're clearly really fucking good at it. Also worth noting that the solos are fucking incredible. Every time these two guys let loose they melt face, and they're the clear highlight of the album to me.\n\nThis isn't perfect, however. There are a few flaws that keep this album from being truly exceptional. The biggest problem is easily the length. Death metal almost never needs to be nearly an hour long, and twelve tracks of such a non stop assault just feels like overkill. Yeah I know two of them are instrumental intro/outro tracks, but it certainly doesn't make the album feel any less daunting. The songs themselves tend to feel longer than they actually are and I feel like that's merely the fault of the songwriting getting kinda repetitive at times (I swear the chorus of \"Demon\" loops like fifty times throughout the song). The mix is pretty overwhelming as well, with Jeff's surprisingly clean thrash-like vocals absolutely dominating the space, with the rest of the band taking a distant-yet-still-crazy-loud second place. So it's not particularly dynamic, but in fairness this is death metal so that'd be a crazy thing to expect this to be super varied or something. Really the complaint is just that the vocals are stupid loud.\n\nSo overall I gotta eat my foot a little bit. Legacy bands definitely still have a place in the current zeitgeist of metal music, and I wouldn't complain one bit if they were all as good as Revelations of Oblivion. This doesn't bring anything new to the table and Jeff Becerra certainly hasn't spent the past few decades evolving much as an artist or vocalist, but when \"Abandoned\" is on, I just find myself looking in the mirror and saying \"Ya know what, BH? Who fucking cares?\" This is what Possessed is good at, and if they can keep this momentum while trimming some of the needless fat and repetition, they really and honestly could reclaim the death metal crown that they invented all those years ago.\n\n\nOriginally written for Lair of the Bastard\n",
        "\nI remember flicking through some old metal magazine when I was a kid, it was probably 'Kerrang!'. It had a feature where some stalwart death metal musicians discussed their favourite albums. One of them said something like “anyone who doesn’t own a copy of ‘Seven Churches’ does not understand death metal”. I was deep into thrash at the time and was starting to dip my toes into death metal, my first flirtations with the genre were probably Entombed, Obituary, My Dying Bride and Bolt Thrower. Hearing these bands, death metal obviously seemed pretty distinct from thrash to me: deep vocals and an ultra heavy guitar tone which was beyond anything I'd encountered before. I hadn’t heard Possessed at this point but I was keen to know more. \n\nA few years later bought a reissue of “Seven Churches” and soon realised that the person in the magazine was right. This record is key to understanding death metal. It’s the one that connects the dots back to the Bay Area thrash scene but also marks a line in the sand. I’ve heard a few people (perhaps younger people) complain about Possessed’s status as death metal godfathers, commenting that this is “badly played, badly produced thrash with growled vocals” or something like that. Really? This isn’t a matter for debate. You don’t have to listen hard to see how “Seven Churches” differs from everything up until that point. Compare this to other debut albums that came out in 1985, maybe “Bonded By Blood” or “Endless Pain”. These are face-melting records in their own right, but the best moments on both of them are the relatively straightforward speed riffs which are obviously influenced by hardcore punk. Think about how much more extreme and complex “Seven Churches” sounds in comparison. \n\nThe most obvious precedent to this album is Slayer (of course), and “Hell Awaits” in particular. It has the same non-linear song structure and demonic atmosphere. The biggest difference between Possessed and Slayer is the extremity of Jeff Becerra's vocals, which are barked out in a way that would soon be adopted by some great death metal vocalists (Chuck Schuldiner, John Tardy, Martin Van Drunen). Musically this is as raucous as it gets. The production is sparse but also clear and powerful, leaving nowhere for the musicians to hide. The songs are complex and overambitious with wild soloing and loads of riff changes. The drumming is frenetic, unpredictable and falls out of time occasionally (which just adds to the madness). You can see that Possessed are pushing things to the edge here, the wheels are about to fall off at any moment but somehow the vehicle stays on the road. Remember that “Reign in Blood” (the most important record in extreme metal history) came out the following year, so \"Seven Churches\" was born at the frontier of intensity and extremity. \n\nSo yeah, this is the first death metal album. Only death metal has guttural vocals, swirling riffs, uncontrolled solos, unpredictable time changes and a claustrophobic atmosphere. Only death metal aims to both suffocate and disorientate the listener into tight, ever-decreasing spirals of musical space, before pulling them out of the vortex and beating them round the head. The most extreme thrash never does this. “Seven Churches” does it constantly, paving the way for Morbid Angel, Death, Obituary, Deicide and the rest. I know Possessed weren’t alone in 1985 (Terminal Death from Chicago released a demo that year which is arguably even more ‘death metal’ than this), but the Bay Area was the hotbed and Possessed were best positioned to make the definitive statement. \n\nYou want some examples? There are too many to count. How about the all-time classic “Pentagram”, with its ungodly harmonised vocal intro followed by the lurching main riff feeding into some weird twiddling (the kind later perfected by Trey Azagthoth). How about the crazy riff at 1:08 of the title track which sounds like the conjuring of a seance? What about the one at 1:38 of “Holy Hell” leading into the most demonic solo you've ever heard? Maybe the slow section and reverb-drenched solo from around 2:35 of “Twisted Minds” (again, Morbid Angel’s whole sound right there). Or maybe my personal favourite, the tolling of the bells during the mid-section of “Fallen Angel” (Obituary's first album owes everything to this). Ironically, the final track is called “Death Metal” and its the least death metal song on the album (it is a speed-first album closer, performing a similar function to “Metal Militia” on Metallica's debut). \n\nTo summarise, you can draw a straight line from “Seven Churches” through “Altars of Madness” into “Dawn of Possession”, all the way towards a modern-day classic like “Starspawn”. Rating an album like this is like rating DNA. It’s just an absolute fucking necessity. Indeed, anyone who doesn’t know this record cannot understand the musical madness known as death metal.\n",
        "\nI like the two 80’s Possessed albums. I didn’t love them, but like what they made possible for countless other bands. They were trailblazers in the genre that offered two groundbreaking releases, then 33 consecutive years of random Eps, splits, compilations, singles, then finally a new release! They’ve been active again for a couple years now and just got to releasing new material. In so many ways it’s exactly what you’d want from a band with a history like this.\n\nThe vocals are so loud in the mix, and when they’re this unique and aggressive, it’s a little distracting. I like them but they drown out some of the more subtle elements. Listen to the first track and you will know immediately if you like them or not. You can definitely hear his age in his voice. I don't normally like this kind of singing, but here I'm really digging it. If you do, you're in for a treat! There are plenty of vocal hooks to be found and some that will stay with you for a few days.\n\nThe guitars in the rhythm section don’t impress too much. There’s a few stand-out points, but it’s the leads that make the guitar section worth listening to. They do remind us that the classic patterns are still effective, like on \"Graven\". The intro quadruplet chugs have been done a million times but still gets you so amped by the time the whole song is underway. The leads are classic 80’s/90’s death solos. On said songs solo, \"Graven\", it's probably the most obvious. There's a little Trey Azagthoth and Kerry King flair in that one.\n\n\nThe drummer has a few tricks up his sleeve. In the tom play I can't hear anything but the tom play on Morbid Angel's Abominations of Desolation. Specifically the song \"Azagthoth\". You know, THAT part. Other than being too high in the mix, they're a nice effort. The bass rumbles along well. Doesn't really go out of its bounds. Sometimes it's good when a bassist knows their place in the piece.\n\nOverall this is just what you'd want from a band at this age and this far into their career. You can tell they're not pushing themselves to reinvent themselves or to get on the bandwagon to what's trendy. There's no way it could sound exactly like Seven Churches or Beyond the Gates, but that's just fine because they've already made those albums. They're doing what they know best and doing it well for having so much time passed. I mean, the only lackluster song is \"Dominion\". There's something to glean off each song. It's not always my cup of tea, but if it's yours then this is a stellar release and will go down in history in one of the bigger in-between LP breaks (that didn't suck). I hate to say it, but if they didn't release another album, I'd be okay with ending it on this high note... Unless the next one's even better!\n\nFavorite tracks:\n-Damned\n-Omen\n-The Word\n-Graven\n\nTechnical Skill: 85% Originality: 82% Song writing: 91% Accessibility: 87% Production: 79%\n",
        "\nWhen Possessed had its final spasm of life with a pair of demos in the early 90’s, I don’t think anyone really expected to see them to pop up again. When Jeff Becerra (who wasn’t involved in the 1990-1993 incarnation of the band) began reactivating Possessed as the sole original member in 2007, there was an understandable level of skepticism, although the fact that most members of cult death legends Sadistic Intent were his backing band lent the reanimation some level of credibility. Flash forward another 12 years and here we are, Possessed have unleashed their third album, a whopping 33 years after their last LP “Beyond the Gates.” I went into “Revelations of Oblivion” ready to hate it; not due to any desire to do so, but by simple expectation. Rare is the band that can come back after so long and do justice to their legacy albums and, based on the mathematics of probability, I expected Possessed to just be part of that majority. I was wrong.\n\nJeff sounds like he hasn’t aged a day since their 80’s output. Sounding every bit as gruff while remaining intelligible, it’s easy to pick out the lyrics. And honestly, the simplicity of the lyrics is refreshing. In this day and age of increasingly obscure occult references in extreme metal (are some of these even real anymore?), it’s nice to have straightforward lyrics that are easy to remember and shout along to. Go ahead, I dare you not to scream “shadooooooowcult.” The vocals are right up front and a bit of reverb might’ve been nice to give them a bit more depth, but that’s a minor qualm.\n\nThe similarities don’t end there. I understand Jeff was the principal songwriter for “Revelations of Oblivion,” and it completely echoes Possessed’s 80’s output in every way. It’s easy to hear the same style of riffing and drumming that peppered those early classics, the style and even vocal patterns that heavily influenced Death’s “Scream Bloody Gore” (those who believe otherwise are deluding themselves). I’ll be damned if tracks like ‘Abandoned’ don’t sound like they were ripped right out of “Seven Churches,” that opening riff made me an instant believer. The sound is clean and heavy and keeps a nice mix of old school roughness with modern clarity, while the performances are exact and frenetic. But over and above the sound and style being there, the quality is there, and that’s what we really wanted.\n\nCan I just mention I love that cover artwork? It’s fantastic; an intricate and ominous cranium-esque structure whose details are easy to get lost in. We even have a guest appearance by Pazuzu at the bottom doorway, a great little Easter egg reference to the opening track from “Seven Churches.”\n\nMuch like the sequel to a revolutionary movie will almost always pale in comparison to the original simply due to the fact that a radical concept can only be introduced once, “Revelations of Oblivion” will always be destined to dwell in the shadow of “Seven Churches” and “Beyond the Gates” no matter how good it is because it’s not a creator. So I ask you to do yourself a favor and be fair to “Revelations of Oblivion” by checking your expectations of a genre-defining album so you can enjoy the fantastic cuts created in the very style Possessed helped define.\n\nOriginally written for https://cultmetalflix.wordpress.com/\n",
        "\nIn recent years it seems to be the fashionable thing to jump on the reunion bandwagon and reform a band long-thought dead (and in some cases, the corpses should have been left on the side of the road where they dropped, but I digress). The list is endless with bands that are reforming, putting aside old grievances, and wearily trekking back into the studio to get some “lost” and invariably useless steam out of their collective systems. Granted, there are exceptions to this rule, but as a whole the reunions are sterile cash-grabs that reek of opportunism and boredom. \n\nPossessed is the happy exception to this typical sterility flaw. \n\nAfter 30-plus years or relative silence from the Possessed camp, the latest album, Revelations of Oblivion, marks what can only be described as a tumultuous shot in the arm for death metal (yes, Possessed is death metal, whine and proselytize all you like). I understand Possessed had been somewhat active in the early 90's, but without frontman Jeff Becerra, quite frankly, it doesn't count. It's the old adage of, better late than never that rings deep within the wells of the ear canals with this release. \n\nThe opening single that was leaked some weeks back, “No More Room in Hell” immediately took me back to my bedroom in 1985, where my 14-year-old self was so enveloped by what this album spinning on my turntable was doing to my entire being. I was forever, irrevocably changed. Seven Churches is, by all accounts, a death metal masterpiece that has not only stood the test of time but managed to change the face of metal music so perfectly. I'll admit to going into Revelations of Oblivion with some initial trepidation; it's one thing to shoot your proverbial wad in one or two singles, but can Jeff and crew actually pull off a full album's worth of equally tangible music after so long? Would it be a welcome addition to the band's seemingly small, yet important lineage? The answer to both of these questions is a resounding yes; Possessed hasn't missed a single step in all of these years. Granted, the core line-up of Becerra, Mike Sus, Larry Lalonde and Mike Torrao is long gone, but the fold is filled out nicely with Emilio Marquez (drums), Daniel Gonzalez (guitars), Robert Cardenas (bass) and Claudeous Creamer (guitars). This new and improved Possessed is proving to be one hell of a resurrection. \n\nJeff Becerra's vocals, quite literally, haven't changed one single iota in nearly 35-years, and that in itself is pretty amazing. It's one thing to growl and grunt into a microphone, as one doesn't really need to assimilate within a certain tone or recognizable quality with such vocals, but Jeff's discernible tone has set him apart from all others in the field. Jeff, Kam Lee, Paul Speckmann and Chuck Schuldiner set a high bar in terms of early death metal vocals, and the fact that you can hear this new record and immediately ascertain its validity and historical context is leaps and bounds over almost anything else released these days. The band is as tight today as a unit can possibly get, and with all pistons firing on an even field like this, how can the album possibly be faulted? I've already heard ridiculous notions of the album being “over-produced” and the vocals being too high in the mix, and to this I can humbly claim that one seemingly doesn't seem to get it, but you're entitled to your own opinion within the confines of your personal enjoyment. I fully understand the charm and essence of Seven Churches and how the album sounded muddy and thin, despite the demo Death Metal being even more deadly and raw than the actual release. That said, why fault a band for finally having some passable production values? At no point does this record sound “thick” or unnecessarily crunchy; the sound has the right amount of punch and clarity without giving way to a stifling bass, over-accentuated drums, or buried-in-the-mix vocals. Lords help us all – Possessed managed to afford better production! Better throw up the spikes and dismiss them all as ne'er do-wells! \n\nThe songs on Revelations are top-notch satanic hymns akin to the aforementioned Seven Churches, and not a single one of them causes repetitious eye-rolling or involuntary yawning if you're a true study of death metal and its early influence on modern metal music. These new tracks would have been a very worthy successor to Churches. Granted, I still enjoy the band's follow-up releases in Eyes of Horror and Beyond the Gates, but, in my humble opinion, there was a slight loss of even-flow magic in those worthy, albeit innocuous releases. Revelations spills no blood when you hear these songs; they could have well been written in 1985, and that summarily touts the new and improved Possessed as a worthy addition to today's bevy of bands cultivating and keeping true this precious medium of death metal. Lyrically, the songs are as base as they need to be in that they don't raise deep philosophical questions or leave you running for a thesaurus, and this simplicity is what made and makes Possessed the legend it is. Jeff's lyrics have always touched a nerve with me, and forever will, especially on the track “Ritual,” which is about as evil a song as you can possibly ask for today. Jeff hasn't lost a single step; I can't say enough about his triumphant return to death metal greatness. \n\nWhile the entire album is virtually flawless for me, I've actually sat here and tired to limit my obvious and disgusting fanboy moments to critical thinking and honest dissection when taking on this review. In all honesty I can't find a single thing wrong with this record. With Possessed you don't ever expect a Cradle of Filth-type venture into some long, poetic ramblings that have you running for ancient texts of poetic soliloquies in your local libraries (do people even know those lovely buildings still exist?) What you get is a pattern of familiarity and resonance that can guide you into a 53-minute jaunt into the various levels of Hell, and you will find yourself all the better for such a trip. It's the return of Possessed, man - just enjoy it! \n\nPossessed is a band that takes me all the way back to my youth. When I think of the band from past days forward, I always recall that album with the fiery logo and huge inverted cross staring out at my young, impressionable self in a Chicago bedroom. I was searching for something back then. I think we all were, no matter your personal time frame or era. We find connections with bands and musical journeys. Mine started with the Beatles, found Black Sabbath, ingested Judas Priest, Iron Maiden, Saxon, Venom, Mercyful Fate, Hellhammer, Slayer and Possessed and I haven't been able to look back. I've never sat with any forced introspection as to if I took to right musical path in my 47-years. There is no looking back with questions for a real heavy metal fan. \n\nNone of us ever can or should. \n\n(Originally written for www.metalbite.com)\n",
        "\nModern trustees of death metal based brutality may not be familiar the early exploits of its forerunner, San Francisco’s twisted, thrash-steeped purveyors of all things horrific Possessed. It is an understandable situation, as despite having arguably the first example of death metal on the market as early as 1985, they are often overshadowed by Slayer in terms of prominent bands from the likes of Cannibal Corpse to Deicide citing the more prolific extreme thrash metal icons as a principle influence. Likewise, apart from their ground-breaking debut Seven Churches, they did tend towards more of a mainline Bay Area thrash sound and hadn’t put out an album since the mid-1980s, living on largely through the accomplishments of Death in the late 80s. Chuck Schuldiner himself cited them as the reason he changed his flagship project’s name from Mantas to its better known moniker and pursued a similarly death thrashing style on Scream Bloody Gore and Leprosy, upping the ante in the brutality department a bit and providing inspiration to other early figures in the nascent Florida scene.\n\nThis lacking in familiarity among the younger generation of death crazed metal heads finds far less excuse at present, as following an excessive period of studio silence and re-orientation; Possessed has crashed into the current market with a vengeance with their third studio LP Revelations Of Oblivion. With a modernized production sound forceful enough to rival any recent offerings out of the likes of Malevolent Creation or Monstrosity, this band’s primordial version of death/thrash that a brand new thing in the mid-1980s has been translated into a present day context, demonstrating that the old school approach to macabre shock value can trade blows with the current trend of mindless brutality and hold its own for the whole 15 rounds. Armed with a guitar sound massive enough to kill a skyscraper and some occasional cinematic orchestral moments to further establish a horrific atmosphere in a manner comparable to recent Kreator output, this is a collection of songs to be reckoned with, even to those post-Defeated Sanity death metal heads who live and die by the blast beat.\n\nAll things considered, this is nevertheless an album based in the same mode of old school thrash with a hyper-dissonant sense of tonality that likewise typified Slayer’s Reign In Blood, Sepultura’s Morbid Visions and the early offerings of Death and Master. There is a strong affinity with the speed metal roots of Motorhead, which is further amplified by vocalist and founder Jeff Beccera, who’s gravely shouts are a bit less guttural than the typical death metal voice even if the basis of comparison is Chuck Schuldiner or John Tardy and almost sound like Lemmy himself rose from the grave to do session vocals. Likewise, while the riff work showcases how ahead of the curve this outfit was in laying out frenzied, tremolo picked chromatic melodies and morbidly heavy grooves, the twin guitar assault of Gonzalez and Creamer mirrors that of Mike Torrao and Larry LaLonde, who were flashy and chaotic in their soloing approach, but in more of a idiomatic thrashing sense rather than the overtly frenzied, noise-driven feats of King vs. Hanneman that paved the way for Trey Azagthoth and the Hoffmann brothers.\n\nFrom start to finish, this album is a raging colossus of an opus that runs the gambit of every extreme idea that was novel when death metal was in its thrash-based infancy, beginning on a highly dramatic cinematic intro in “Chant Of Oblivion” that conjures up images of an early 80s occult-infused horror flick and closing on a haunting acoustic outro dubbed “Temple Of Samael” that leaves thing on an unsettling note. Between the atmospheric instrumentals is a ten chapter collection of high octane terror as only death thrash can deliver, largely cooking at high speeds with intermitted fits of machine gun double bass drumming and blinding guitar madness, yet avoiding the arrhythmic chaos of early 90s grinding death a la Cannibal Corpse and Morbid Angel. Stand out offerings include such fits of raging fury as “No More Room In Hell”, “Abandoned” and the somewhat longer winded and occasionally symphonic epic “Omen”, while the slower bludgeoning of “Demon” sees occasional sunlight for Robert Cardenas’ bass work amid the unrelenting barrage of guitars and drums, while the more tuneful cruiser “The Word” shows occasional melodic death leanings that are nevertheless wholly rooted in primitive death/thrash.\n\nThough this album may ultimately prove to be the biggest boon to old school minded listeners who remember a time when death metal was largely bereft of the grindcore influences that were imported from bands like Napalm Death and Repulsion, there is definitely enough of a current character of this album to make it equally appealing to any metal head who was little more than a twinkle in their parents’ eyes when Seven Churches first hit the underground thrash metal circuit in California. It’s a far more consistent and faithful rendition of the old ways in a modern context than the sadly overlooked comeback Massacre attempted in 2014 via Back From Beyond, and if this reviewer may be permitted a moment of shameless fan boy pandering, it utterly destroys everything that Slayer has put out since the close of the 80s. But above all else, it’s a masterful demonstration of how haunting dissonant riff work, precision-based speed and the right blend of atmospheric elements can kick the listener’s ass as hard as mindless brutality and a choir of 8-string guitars could hope to accomplish.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nAny time a band that has been long dead and hasn’t really put anything out since the ‘80s is obviously gonna gain my attention with a new record in 2019. Naturally, that meant that spinning the new Possessed record Revelations Of Oblivion dawned over-hype on my part, and I thought it was absolutely incredible. Well, that’s partially still true, but it does lose some value after a few replays.\n\nTaking one good look at the album cover, it’s not difficult to tell what the music is going to sound like. Imagine the aesthetic of early Possessed records and gloss it over with today’s production resources and an aged voice. “Damned” showcases some of the best work present, thanks to the weight the chorus pulls. The lyrics and vocal delivery have a fluid flow that’s carried rapidly by blistering beats behind the kit. There’s also without a doubt a hefty supply of riffs, which is pretty obvious in the single “No More Room In Hell.” “Abandoned” throws back to old writing tactics with the fret-ascending breaks between extremely fast riffs, which reminds me of “Pentagram.”\n\nHowever, too much of a good thing isn’t always a good thing, because the only real downfall here is exactly that. Revelations Of Oblivion could easily stand to drop a few tracks, as it’s a bit long. Tune’s like “Demon” lack much structure, sounding like a rampant cluster of kicks and licks that aren’t bad but go nowhere. Plus, it isn’t difficult to see that some of the Satanic shtick is a bit forced and tries too hard. It’s always been what Possessed have been about, but you can tell when it’s natural and when it isn’t.\n\nI definitely like this record, and I’m glad they decided to put out a new one. The fact that they can still craft music that invokes high levels of fear and fire says something; it just would have been a lot tighter if about a quarter of the songs were dropped. And I get it, tightness isn’t always the key with this brand of death/thrash, so perhaps loosening some bolts would have done wonders too. Anyone who likes the early albums should give this a spin.\n\nOriginally written for Indy Metal Vault\n",
        "\nThe death metal pioneers Possessed release their first album in over 30 years, completely out of nowhere. I don't think anybody was expecting it to be this amazing, but it's very amazing indeed. The singles they put out to tease this album were decent, but they didn't fully capture the whole greatness of the album. When I heard a small snippet of one of the singles I wasn't really all that pleased much yet, but now that I've heard the album in it's entirety, I can say that I'm definitely pleased indeed. Now that I've heard all of the album, the singles they released before the whole album sound amazing now! \n\nMy god, its crazy how they've maintained their goodness for 30 years. With this album they recaptured Seven Churches in a modern form. Keeping the vocals the same style, songwriting is similar, the drums sound great, and its heavy as needed. And yet again, they mixed death and thrash metal perfectly! I swear, this is Seven Churches reborn. Everything about this album is just like Seven Churches; just as great, just as similar, just as good. Nothing dissapoints.\n\nAlso, new lineup. The only original remaining member is vocalist Jeff Becerra, and holy crap, he did such a great job on this record. His vocals are just as loud, rough, and deep as death metal, while keeping that thrash style vox in there as well. Just like the vocals on Sodom's Tapping The Vein, which is a death/thrash album as well, they both perfectly balance the vocals just as they should be; half death metal vocals, half thrash. Comes together to create such amazingness that fits the music perfectly. This new lineup is insane, they're all greatly talented musicians and they're keeping Possessed alive and present. Like I said before, I was positive most people weren't expecting much from this album, but now its out, and its one of THE BEST of 2019. This just proves that metal is nowhere near dead, think about it, Possessed randomly decided to release an album after 30 years of being inactive in the studio and it turned out amazing. What are the odds?\n\nThe guitar playing is magnificent. Just like with the vocals, the guitar has the perfectly balanced death/thrash sound. Not too heavy, not too thrashy, a great mix which perfectly resembles the style of Seven Churches, and Possessed's style in general. None of the songs here are boring, every track is equally as great as the last, and the talent and speed of the guitar playing keeps you energized and focused. The drums are also magnificent, the sound of the drums fits with the guitars perfectly, and the bass guitar backs up the drums great as well, too. The drums help create the songs and develop their structures. In the song \"No More Room In Hell\", there's an energetic and catchy riff, the drumming backs it up greatly. That's one of the most awesomest things about this album, everything goes hand in hand. When all the instruments are on time, balanced in sound and tempo, present, and relentless, there's no doubt that nothing but a kickass album will come out of that. \n\nAgain about the vocals, Jeff is doing such a great job, especially since hes paralyzed and in a wheelchair, he keeps going. In some songs he can get melodic with his vocals, like in the track \"Demon\", he sings away with the melody of the guitar and follows it perfectly. SO GOOD. His vocals are easily my favorite aspect of this entire album. To recap the vocals, they're greatly balanced, persistent, heavy, and talented. One of the greatest and most talented vocalists in the entire death metal genre.\n\nRevelations of Oblivion is a bone-crushing, mind-shocking album. Possessed put out their 3rd album in over 30 years, it turns out amazing, and it's just as great as Seven Churches. 54 minutes of complete satanic triumph that doesn't disappoint at all. We all knew Possessed was gonna release another album eventually, this is what we've all been waiting for. There can't be another comeback album just as great as this one.\n\nSole original member is in a wheelchair still doing vocals getting active again after a long time; reguardless of disability, he gathered an entire new lineup, the new complete lineup spent time writing such great music that replicates the band's root style and presents it in a newer powerful form, the album ends up being perfect. This band isn't taking any bullshit when they make all this happen! Such talent and pure ass commitment, that's for sure.\n\nSeven Churches + Modern metal style/production = Revelations of Oblivion!!!!!\n\nThis band has definitely made one of the most kickass comebacks in death metal, and the biggest comeback of the decade. Again, they unexpectedly put out an album and baffled the fans, but then turned out being amazing. It's crazy how this band maintained their old sound and created it in a newer form. Bands that create new music while maintaining that old school sound are pure gold. Possessed is one of those bands. If you're looking for some good modern death metal, go turn this on right now, there's no disappointment here at all.\n",
        "\nPossessed-the proclaimed inventors of the death metal genre had solidified their place in metal history with “Seven Churches”. Whether or not Possessed were solely responsible for death metal: partially responsible, or not at all is beside the point. What can be said without question, is the band made a mark that is still felt today. It was only a matter of time before the band would take its second plunge into the firestorm of critics. Enter-Beyond the Gates.\n\nWhat must be understood about this album is that it is not an attempt to recreate “Seven Churches”. The band had taken a separate musical direction into the realm of more traditional thrash. While hints of the band’s style can still be found, Beyond the Gates is not meant to sound like “Seven Churches.” If a person is judging Beyond the Gates by the same standards as its predecessor, they will likely end up feeling disappointed, or betrayed. Instead, this album is to be compared to the likes of Exodus or Slayer. Truthfully, it stacks up quite well, though it does not reach the classic level of “Bonded by Blood” or “Reign in Blood.”\n\nPossessed took a step up in the vocal department with Beyond the Gates. Jeff is much more controlled-a methodical approach that adds menace, where previously only chaotic evil was present. Likewise, the lyrics can actually be understood. Sometimes this is a bad thing, for some of the content is pedestrian, or downright funny (“in love with Satan”). Other times, the listener can actually sing along and appreciate the rebellious lyrical content. And this is very important-the ability to sing along. \n\nWhy? Possessed have not lost the ability for underlying melody. Their previous album made such an impact, partly because of the melodic overtones. Beyond the Gates follows the pattern, though slightly less efficiently. A gentle intro gives rise to “The Heretic,” a straightforward thrasher, with blistering riffs. It become obvious that Possessed has changed, but the catchy chorus makes clear that the band still has a melodic approach that a majority of thrash metal musicians lack. \n\nThough different than “Seven Churches,” the same, basic concept remains on this album-aggression through melody. From “Tribulation” to “No Will to Live,” Possessed never lost the important skill. “Phantasm” is downright groovy in the beginning, followed by a hook-laden display of violent glee. Many bands can play heavy-many bands can play in a melodic fashion; however, very few bands can do both effectively. \n\nIt also should be noted that Possessed’s new style proves more flattering to Mike Sus. On “Seven Churches,” Sus always seemed on the edge of being outclassed by the music he was playing. With a greater variety of tempos, and some experimental drum patterns, Mike has found new life on Beyond the Gates. It is possible he simply improved as a drummer; but whatever the case may be, the drumming on this album fits better with Mike’s skill level. LaLonde remains the better of the two guitarists on the level of technical soloing, though Torrao wrote most of the riffs-all good riffs at that. The bass is again hard to distinguish, but Jeff’s vocals are top notch for the style of music. \n\nOne factor that clearly went downhill from the previous effort is the production. What a shame it is this album was produced so poorly, especially when you consider how much of the aggression was stifled by the muddy sound quality. Had this album been better produced, it is possible more people would have appreciated the new musical direction of the band. History cannot be altered; however, thus we can only appreciate the album for what it is-a melody infused thrash metal onslaught, that proved different than its predecessor, but nearly as good.\n",
        "\nEvery once in a while an album comes along, in which the world is ill prepared. Such albums touch on aspects of metal that one formally thought impossible. Previously established boundaries are eroded away, leaving behind expectations that are often left unfulfilled by future generations of classics. Like an astronaut who has ventured to the moon, we are left asking: “what can possibly be next?” Seven Churches defines the concept.\n\nIn the glorious nineteen eighties, the line between death metal and thrash was skewed. Future generations would term such a musical style “death thrash,” but at the time, the world was ill prepared to describe the genre defying albums that would later become essentials. Albums like “Pleasure to Kill,” or “Ritually Abused” can be considered thrash, yet something was “different” about the sonic experience. Thrash metal was taken to the outer extremes-definitions required further analysis. While Seven Churches does travel into the realm of genre bending, there are some aspects of the album described by others, that might be seen as misnomers under close examination. \n\nThe question of brutality must be addressed. Is Seven Churches brutal? Yes; however, it is not brutal to the point many people make it out to be. There is nothing exceptionally brutal that sets the album apart from contemporary albums. “Torment in Fire” or “Hell Awaits” match Seven Churches is ferocity, and “Bonded by Blood” hits nearly as hard. What makes Seven Churches special is the ever-present sense of melody, found on the verge of total anarchy. At the same time the listener is appreciating the almost catchy song structure, they are left pondering the point in which barely controlled chaos will fall victim to complete disarray.\n\nThe first track “The Exorcist” is the prime example. Despite being perhaps the weakest song on the album, it perfectly captures the concept of chaotic melody. After a rather disturbing rendition of the classic tune found in the song’s movie namesake, the track explodes with the fury of an atom bomb. The classic thrash metal drum pattern relentlessly pounds alongside a barrage of riffs that signify the unveiling of hell. Abrasive, gurgling vocals leave even the keenest ear unable to distinguish the lyrics. All the while, however, an underlying melody keeps the listener engaged, enthralled and hypnotized by the fact such chaos tickles the same senses as a catchy jingle found on daytime TV. The main riff on “Pentagram” induces a state of rhythmic head banging, before slamming into full gear. \n\nIt must be noted that there is no lack of straightforward, thrash metal bliss. “Death Metal” hits like a sonic wave of euphoric pain. The neck-snapping thrash break that is found within the song “Burning in Hell” leaves no doubt to whether Seven Churches satisfies the same crowd that worships a band like Sodom or Dark Angel. Despite the inherent, aggressive force displayed by any track on the album, Possessed never lost sight of effective song craft. Seven Churches transcends more than the boundaries between thrash and death metal. Instead, the album can be considered the missing link between thrash metal and radio rock, though you will find no mainstream anthems-worry not. Seven Churches much be explored, not simply heard. \n\nThe musicianship on the album is anywhere from passable to moderate. Jeff’s vocals are fitting to the music-both torturous and vicious, though it is hard to distinguish the bass. Of the two guitar players, LaLonde is the better player. In terms of solos, LaLonde displays greater technical skill. Mike Sus sounds as if he is slightly out of his league; however and always seems to be just on the edge of screwing the pooch. None of these aspects matter in the big picture, for Possessed simply wrote great songs. \n\nPerhaps the most intriguing factor about Seven Churches is the unique quality the album holds. Nothing that I have ever heard sounds close. The chainsaw guitar tone has never quite been replicated, though Infernal Majesty’s “None Shall Defy” is in the same realm. People often compare Seven Churches to “Show No Mercy”-which is somewhat apt; but again, not exact. Seven Churches may not be death metal in the modern sense, but it certainly helped lay the foundation. Likewise, the album proved that heavy could also be melodic.\n",
        "\nIf you are any death metal fan, you should thank Possessed for basically creating the genre of death metal. It has all the characteristics of a good death metal band, which includes fucking brutal guitar riffs, chaotic guitar solos, fast as hell drumming, and demonic vocals.\n\nThis was really the first album to have a genuine death growl. Slayer may have created the death growl in songs like the title track of Hell Awaits, but Possessed was the first to use it as a regular form of vocals. Jeff Becerra is fucking screaming his lungs out and creating a hellish demonic sound, spitting out lyrics about Satan and death. The drums are also fucking amazing. The drumming on this album is better than \"Hell Awaits\", which is a legendary album with amazing drumming from the master, Dave Lombardo. The best part of this album is the riffs. Mike Torrao is a great guitarist, and wrote a lot of the riffs on the album, which are fucking heavy, and totally brutal, that could compare with the riffs on \"Hell Awaits\" by Slayer and \"Bonded by Blood\" by Exodus. Seven Churches has fucking chaotic solos, shredding any traces of melody and focusing on all sorts of whammy effects and mindless shredding.\n\nThe highlights of the album? All of them! The best song on this album is \"Burning in Hell\", because it's fucking fast as hell, and the riffs are totally brutal, and the slow break in the middle shoves you into a fucking grinder, and rapes your corpse. This may be the best song in all death metal. Other highlights include Holy Hell, which has a ripping intro, that comes into a fucking heavy riff and some lyrics that come from Hell! The riff at the end of the song is also kickass. \"Pentagram\" is another highlight, which is a mid tempo crusher with unusual time signatures, and legendary riffs that kick multiple levels of ass, and the intro having a fucking brutal death growl. The intro to \"Fallen Angel\" is fucking amazing, with the bell setting the doomy atmosphere of the song. \"Twisted Minds\" has crushing riffs, chaotic growling, and a ripping solo that sounds like a serial killer tormenting his victims. There are also the straightforward thrashers, like \"The Exorcist\" and \"Death Metal\", the former based on a legendary horror film of the same name, with a solo section that predates black metal, and the latter being a fucking powerhouse, destroying all in its path, with its brutal riffage, and some nice lyrics about killing everybody with their hellish music.\n\nI recommend this album to all metal fans. Anyone who doesn't know this album doesn't know metal.\n",
        "\nIt’s not that it went from thrash to death, its that it’s not very good. Possessed a legendary band? No. Seven Churches is a legendary album no question, but this simply reveals Possessed to have only enough spark for one album (and to be fair, one EP). Those do not great bands make. I do feel awful for the horrible series of events all the other members went through in 1989, but that doesn't change this album from suffering the sophomore slump\n\nThe biggest problem with this album is that a lot of the songs are just really under-developed. Like Seven Churches, as great as it was, didn't perform to the commercial expectations of Combat Records so Possessed were rushed to the studio for a follow-up or to strike while the iron is hot. Lyrically, I will give the band credit for sticking to themes and not becoming too conventional, but in metal, extreme metal especially, the music matters first and foremost. The thing is though, that's the story with just about every band. Your whole life to write the first album, only 2 weeks to write the second album. But that was just the old way that bands did things back then, and the great ones, they flourished under those conditions, and would go onto make legendary releases under that kind of pressure. But Possessed? Not so much. \n\nWhile there's nothing inherently wrong with switching from one style of metal to another, going from death metal, -a brand, bright new sub-genre- to thrash, which by 1986 was reaching critical mass, made the band look like followers instead of leaders. Rather than keep up with the style that threw middle fingers up to thrash and challenged them, they chose to follow the trend of thrash. It actually wouldn't shock me to learn that Combat records pressured them into making a thrash record, going with the times, rather than being ahead of the times. Another problem is even as a thrash record this doesn't doesn't stand up on its own, let alone take on the giants that came out this year like Reign In Blood, Pleasure To Kill, Peace Sells, etc. etc. When a German thrash with seemingly no ties to death metal whatsoever sounds more death metal than you while still managing to be thrash, that's a problem.\n\nSpeaking of sterilizing, there's the matter of the production and guitar tones as well. Say what you will about Rick Rubin's removal of Slayer's reverb on Reign In Blood, but that thing sounded brutal. It made you want to hear Crionics, Necrophiliac, Die By The Sword, Chemical Warfare etc. recorded with that production. Beyond The Gates' production takes you from the torture pit of the seventh layer of hell to merely the gallows pole. The sound would have been fine for say....Destruction's Eternal Devastation (maybe even preferred in that case) but coming hot off Seven Churches, they just sonically lose ground.\n\nThe weak songwriting is apparent in songs like the title track and the frustratingly repetitive March To Die. There is such a thing as lame thrash riffs, and these two songs are full of them. The latter in particular just seems to ride that below average riff the entire song with little difference between the verse and chorus. Not to mention that chorus is extremely clunky to begin with. Four \"March To Dies\" with five seconds of that average riff awkwardly spacing it out. Not to mention the phrase \"march to die\" is incredibly dumb (not to mention counter-intuitive to Satan's battle tactics). There's nothing worse than a stupidly phrased chorus repeated ad nauseam (see also: Dio's Sunset Superman). Eventually your casual listener starts to wonder \"why the hell am I singing this?\"\n\nThe album has a couple of decent moments. Tribulation was better than I remembered it, and No Will To Live was a solid epic. But if these were on Seven Churches, they would still fall second place to true classics like Fallen Angel and Holy Hell. Opener The Heretic is also enjoyable and properly sets the tone for what's to come, for better or worse. It's an average thrash album for 1986. Unfortunately, 1986 was NOT the year to be an average thrash band, satanic or otherwise. What's worse, in order to get the improved Eyes of Horror EP, you'll probably have to buy this. See if you can get it used.\n\nRecommended tracks:\nNo Will To Live\n",
        "\nMy appreciated metal fellow is six (!) days older than I am. Moreover, he is born on the sixth (!!) of July, but I am sorry: I cannot offer a third six in this context. Thus, I am not able to say that we form a truly satanic unit. The same goes for Possessed, because in their case, flirting with an affinity for Satanism was nothing else but good promotion. However, this slightly unauthentic attitude, which became obvious to everyone in view of the further engagements of Larry LaLonde at the latest (bands like Primus should be banned), did not hurt the hellish force of \"Seven Churches\". Without batting an eyelid, the band combined precision with brutality and sharpness with dedication in a previously unknown manner. The result was that nobody really knew how to label their style. Bad luck for those collectors who sorted their records according to style.\n\nThere were different indications. The debut offered a track called \"Death Metal\", while the logo, the name of the album and song titles such as \"Pentagram\" or \"Holy Hell\" indicated that they played black metal. The music itself was, in my humble opinion, thrash metal, because the lacerating, piercing guitars seemed to originate from the neighbourhood of Exodus or Slayer. The RockHard Magazine took the view that Possessed played hardcore. These guys are really ready for a joke at any time. At the end of the day, the quest for the correct sub-genre appeared completely superfluous as soon as the first tones of \"Seven Churches\" filled the room. Admittedly, I still do not know why the band selected exactly \"Tubular Bells\" of Mike Oldfield for the intro. Maybe his first name tipped the scales, at least from the perspective of Mike Torrao and Mike Sus. It doesn't matter, because directly after the intro, the technically talented group unleashed its power in the most efficient manner. The incredibly exact guitars constituted the outstanding feature. Their whirring lines that showed up in songs like \"The Exorcist\" were unique and drew the listener into their spell.\n\nEach and every tune appeared as a meticulously planned explosion, but this well thought-out strategy did not mean that the compositions of \"Seven Churches\" lacked of emotions. The anger, the desperation and the fury of giants such as \"Fallen Angel\" illustrated the enormous, absolutely fascinating grandeur of Possessed's songs. Especially the aforementioned track also impressed in view of its tremendously effective melody line which was accompanied by a bell. The highly accentuated beginning led more and more into sheer fury and thus the song turned out to be one of the highlights of this album - and of the entire year 1985 as well. And believe me, 1985 was a very wealthy year in terms of extreme metal. \n\nWhile benefitting from the transparent, well-balanced and powerful production, the songs shined in full glory. Any form of rumbling parts did not occur, although a small number of sections, for example the verses of the title track, revealed a very dense, nearly impenetrable aura. Possessed loved to celebrate an almost clinical style, but they did it with uttermost brilliance. Yet one component of the band's sound must not go unmentioned in this context. Jeff Beccera's vocals delivered an adequate portion of inhumanity. He reached eight of ten points on the Paul Baloff scale of perfidy. In view of the clean mix, his expressive performance stood out as a sort of corrective. Beccera was not interested in providing any form of melodic approach, but this did not mean that his vocals were boring, because he articulated evilness, fury and vileness in an enthusiastic manner. Better still, the whole gang seemed to be imbued with an untameable joy of playing. Killer tracks like \"Satan's Curse\", \"Burning in Hell\" or the aforementioned \"Fallen Angel\" were just the tip of the iceberg. You will not identify a number which fails to develop its own unmistakable design. Naturally, very critical assholes and egocentric busybodies might be of the opinion that \"Holy Hell\" and \"Twisted Minds\" are standing in the shadow of the other tracks, because they show first indications of wear marks after roughly 100 listening sessions. Yet this is absolutely negligible (and the aforementioned groups of unpleasant contemporaries suck).\n\nWhat is left to say? Despite the negative and annihilating messages of the lyrics, the complete debut seemed to be recorded with great ease. \"Seven Churches\" impressed with its excellent flow and it was always a great challenge to stop the listening session before the last tones of the glorious closer \"Death Metal\" had faded away. Don't get me wrong, nobody wanted to master this challenge. Thus, their debut catapulted Possessed at the top of the movement and their status was underlined by the fact that \"Pentagram\" was featured on the first part of the semi-legendary \"Speed Kills\" compilation. \"The new gods - total thrash mayhem - INTENSE\"; these were the words that were printed on the back of the album in order to describe Possessed's sound. By the way, the third part of this compilation series also contained a song of the guys (\"Seance\" from \"Beyond the Gates\"), but now the description sounded a little bit ambivalent: \"the original toy boy thrash band\". Anyway, as mentioned above, \"Seven Churches\" probably does not belong to the most authentic albums. Nevertheless, it is a fiery masterpiece for all eternity. Let's face the facts, my rating is rather too low than too high.\n",
        "\nNow I know this album is legendary and its follow up, Beyond the Gates is meant to be shit, but I love Beyond the Gates and hate this. I would suggest that that's because ...Gates is a straight up thrash album whereas this tries to straddle two genres, neither particularly successfully. Jeff Becerra sounds unique, actually, but not in a good way. He isn't Mr. Schuldiner, Mr. Souza, Mr. Araya or Mr. Hetfield on vocals, but something completely new. Let me first of all say that this ISN'T DEATH METAL. I don't give a fuck what the song's called, this is dissonant, iconoclastic thrash. This works for them on their sophomore, but not here. This is the purest sound of a band who are recording something, just not anything particular.\n\nBut before we discuss the content, we must first consider the then-current musical landscape. The first \"extreme\" band on the scene, Exodus formed in mid-'79, and ushered in a new wave of extreme. Thrash bands sprung up in droves, with seminal thrashers Metallica and Slayer issuing their debuts in 1983. However, from the mid-80s onward, a new genre of bands arrived, based on this opus and other thrash works, called \"death metal\" (some say it was named after the song from this very album). Pioneering band Death formed in Florida in '83, but didn't issue their debut until four years later. Morbid Angel were the first pure death metal band to form but they didn't release an album until 1989. The first pure releases didn't even come until the year before that.\n\nHowever, in the same year Death formed, this group came together in California, with a lineup consisting of vocalist Barry Fisk, guitarists Mike Torrao and Brian Montana, bassist Geoff Andrews, the band rounded out their lineup with drummer Mike Sus. After a few months of jamming it seemed the band was done when first singer Fisk committed suicide then Andrews departed to join Exodus (he would appear on a demo but was out by 1984, replaced by Rob McKillop before the recording sessions for their debut). As it turned out, the band was far from done, with Jeff Becerra coming into the fold and taking over both roles. The band recorded a highly regarded demo Death Metal, before Montana quit and was replaced by Larry LaLonde, later of Primus. They recorded most of their output with this lineup before disbanding in 1987. They eventually reformed twice, and today only Becerra remains from the classic lineup.\n\nTo sum everything up, this is a brutal 40 minute assault of noise. The production is so poor that it gives the sound the band were just unleashed in the studio, and this album happened. It's hard to define because of this noisiness, but it does have precious few moments of brightness. A killer solo here and there, and track highlights \"Evil Warriors\" and \"Holy Hell\". \"Evil Warriors\", I must concede, is an awesome tune, but there are none like it on the record unfortunately. I had high hopes for this at the beginning because of the creepy-ass intro but everything is soon ruined, an approach the band would modify for their second record. It doesn't even win back points in the way the demo does: being unique and having that raw feel. This, however, doesn't sound raw, it sounds dissonant and noisy. Of course, I'm not expecting bubblegum pop production here, but even a decent mix would feel way better, and mine is the REMASTER, for Christ's sake.\n\nThe musical elements individually, well. The guitars are the most defined thing here, maybe this was the intention but even then they still aren't as sharp as they could be. Riffs are strong mostly though, and the bass is competently played, but fuzzy in the mix to the point of a low buzz across a song. At least in Entombed it's a low buzz with the feel of a bass. The drumming is energetic, but poor, and in my opinion Sus was always holding the band back in terms of potential. Vocals really are in a league of their own here, delivered in a register never previously discovered or seen since, somewhere between standard thrash vocalizations and a growl, totally indecipherable (as was the intention). The best way I can sum them up is as if a thrash singer has performed to the point that their cords are shredded, and then stepped into a vocal booth and recorded for this album. Two simple ways to improve musically: get a better mix (although they probably couldn't afford a good one in 1985), and bring in a decent session guy on drums.\n\nOverall, I'd have been satisfied of progress if this was a demo, but as a full-length it doesn't cut it. I have a hypothesis that people find this legendary because it was the first full album or EP release that the guys who'd earnestly been bridging the gap between death and thrash for a while now. Maybe that's the overall reason for these guys' everlasting popularity in the extreme scene. Regarding this struggle-to-listen-to pile of shit I have nothing else to say.\n",
        "\nOf the 20 or so notable US thrash debut albums in the '80s, this is among the most unique and timeless. Right up there with Kill 'Em All and Speak English Or Die in its pioneering status, Seven Churches not only stands as among the most cutting edge, forward thinking and beautifully primitive of pretty much any '80s thrash album, it is also amongst the most hellish, twisted and fucking heavy of those albums too (possibly barring only Hell Awaits.) The sheer magnitude of this release is needless to say; though this isn't a fully fledged death metal album, you will be hard pressed to name any other point at which the death splintered from the thrash. Possibly Haunting the Chapel and Hell Awaits, but even they feel like thrash, just fucking evil thrash. This is kinda different.\n\nDon't get me wrong here, this is still thrash, just fucking weird and intense thrash; and the most critical aspect to all of this weirdness is the frankly terrible and really stilted song construction. Every last track on here has about 3 or 4 sections, but their transitions are very awkward, as though they hadn't worked out fully how to change things up. Often a short fill is a transition, and it just moves on having completely changed direction, as though nothing happened. This is possibly the main thing that separates this from practically any other thrash album of the day; it hits you over the head with a brick rather than settling into a groove, flowing from one part to the next like Hell Awaits did. \n\nAdd onto all of that a highly technical, frantic but also jarring drum performance, one which utilises many strange snare patterns, oddly placed fills and rolls and being stitched together haphazardly like the songs themselves, and this leads to music that doesn't feel like thrash. It lacks the inherent 'bounciness' and groove, rather coming across as not only intense, but also frantic. These aren't smooth, progressive songs, and nor do they dwell on one or two riffs. They are unpredictable, frenetic and jarring in nature. This type of non-flowing song construction can be seen today in the more brutal side of the death metal spectrum, and can be traced right back to here. The one thing to note about the songs is this: they still feel like fully formed songs, not random bits rammed together in a spastic and random fashion. The songs don't flow, but they do feel like a unified whole and don't come across as fragmented.\n\nAnother critical aspect to this album's weirdness is the riffs, as well as the guitar tone itself. The riffs are of the thrash variety, but also eschew pretty much all melody in favour of an atonal variety that separates it from the NWOBHM and speed metal influences upon which thrash was built. The riffs are pushed even further in this direction than what Slayer were writing at the time - they aren't all that removed from the more orthodox thrash-oriented death metal riffs of Scream Bloody Gore or Altars Of Madness, and it is clear to see where that variety of death metal (and many others besides) got their riffs from. The guitar production is something else that would be carried over too - a really heavy, thick and deep guitar tone which I have now dubbed the 'sledgehammer' tone; one which all deathrash and thrash-oriented death metal acts would imitate. The riffs take on a lethal quality because of it, and become pummeling and driving in a way no album was at the time.\n\nIt is a pretty similar story with the vocals. They aren't fully fledged death growls, just a really distorted and harsh thrash shout. They sound twisted and just fuckin' possessed. They are an instrument in their own right, one which just lays on more atonal mayhem to the churning riffs and frantic drumming. Jeff here actually does a better job of death metal vocals than actual death metal vocalists; primarily because his growls have a more expressive quality to them (i.e: they aren't monotone), and take a leaf out of the first wave book by being really fast ranting, preventing any monotony at all. The line between this performance and David Vincent's earlier work is all too apparent, though Jeff Becerra is arguably the better vocalist.\n\nNow, lets ditch all that. Lets just look at this album for what it is, never mind the influence it clearly had on death metal. Then it is still a fucked up, cacophonous and evil thrash metal album, one which made Possessed the most lethal band of the Bay Area, even more so than Slayer. Every last song on here is from start to finish, a mass of twisted riffs, hellish vocals, curiously NWOBHM inspired melodic solos, and thumping bass lines. The tempo hardly ever drops, barring something like the first 2 minutes of 'Pentagram'. The production on the whole is loud and raw as hell, lacking any of the (relative) polish that several of their contemporaries had. The drums are an ambient hiss in the background, something taken from Discharge. Meanwhile, its aesthetic, vocals and riffs are taken directly from the first wave acts Venom, Bathory, and Hellhammer/Celtic Frost, just turned up to '11'. Everything is sloppy as hell and loose, whether it be the songwriting, vocals, drums or cover art. This couldn't be any more primal if it tried, and rarely did it get more primal than this around this time.\n\nThere isn't much variation here, with all the riffs being cut from the same cloth. One vocal style is used throughout, and the album on the whole flip-flops between near-death metal and Slayer-esque thrash, with 'Death Metal' probably being the most thrashy song on here. Pretty much every song is 3-5 minutes of morbid, twisted thrash that never lets up in its heaviness. There is practically no places where it all drops off for atmosphere (barring a few of the intros, like the synth intro to 'The Exorcist'.), and the album is just intense as fuck, balls to the wall deathrash. Absolutely amazing, pioneering and essential stuff. Any and all death metal fans must have this, as should pretty much every thrasher and first-wave black metal fan. Pretty much no album of the time was like this, and even now, nothing since has been so weird and contorted for its day. Something like this only comes once in a blue moon people, so enjoy it as much as you can.\n",
        "\nWhat we've got here is....failure to communicate to each other which genre this is, so you'll get what we had here last week... a bunch of thrash and black metal breaking out. No, but in all seriousness, this record is like combining early thrash and black metal elements to give us an output close to what we know as death metal. After all, those are the main ingredients to the start of death metal, in my eyes, as many view Seven Churches as the first death metal record, even though the sound was not complete. Possessed certainly gave a good start with this. It's basically a combination of four earlier records that come to mind: Venom's Black Metal, Slayer's Show No Mercy, Celtic Frost's Morbid Tales, and Kreator's Endless Pain. So it took one band to put all of these chemicals together and get what we know as one of the pioneers of death metal.\n\nSo, first off, we are given a big combination of different riffing styles here. Some of them aren't as speedy, rather dark, heavy, and thick sounding, such as the mighty \"Pentagram\". No, it certainly isn't slow by any means, but listen to the main riff in that song. It is not fast at all compared to some of the other tracks on here. It's played at a very moderate speed, with rather simple power chords for a lot of it. Here we can certainly hear more of an early black metal approach, especially because of the content of a lot of these songs, I mean holy hell man! (pun definitely intended). On the flip side, however, we get some more thrashy speed driven songs, such as \"Evil Warriors\", as it starts off right off the bat with a shredding solo and intense aggression in the riffage that follows this up. It's a crushing kind of speed you could find right out of a Slayer album given a dark and evil tone that Celtic Frost would use, and together this gives us a dark and crushing guitar piece that just sounded so significant at the time, taking heavy guitars to a whole new level. But there is no denying where this came from. Even listen to the bridge that connects the solo and verse about two thirds of the way through \"Fallen Angel\". Look me in the eye and tell me that isn't a spitting image of the intro to Slayer's \"Black Magic\". Nothing is significant about the solos, other than the fact that they are great, but they don't stand out in any way from anything else that was released around the time. So good work there, I just prefer the riffage on here over them.\n\nJeff Becerra's vocals are definitely something new as well, as we are given crushing aggression and anger in his delivery, much like Mille Petrozza from really early Kreator. He gives off such an angry vibe, and sounds like he's about to devour the next person to cross his path. It's not far off from stereotypical thrash vocals at the time, but he really stresses that growl element that was not used too much before this release, as a lot of extreme metal at the time used high pitched screams and shouted vocals. However Kreator would certainly be the closest match, as both records were released in the same month of the same year. So I can't really say that they were influenced by this band directly, but it still sounds super close in sound and style. What we get on Seven Churches is just a bit more intensified. Honestly, it is sometimes what I would picture a demon to sound like (or what about that demon growl in the opening to \"Pentagram\"?) These harsher vocal outputs and intensified guitar shrieks make for a new sound, and I absolutely love all of it. I think it was purely experimentation at its best, and although it may not be completely death metal, it doesn't distinguish the fact that it is great metal from the time, and would allow future bands to expand upon this sound.\n\nAlong with this, I love a lot of the effects that are done here. First off, the bell at the beginning of \"Fallen Angel\" to make it sound even more evil, as if I'm standing outside in a graveyard full of demons, as well as the demon growl I mentioned earlier. But what I really love is the keyboard at the beginning taken right from The Exorcist film was an ingenious idea and made for a very creepy intro to such a dark album. Plus, that transition going from that to the malicious riff that it dives right into is quite mind blowing, and one of the greatest starts to an album ever. Although that first track is very messy (as well as some others on here), I still very much like it. It gives it the darker atmosphere, with rather poor production helps with that blackened atmosphere, much like something that Venom would do, and that effect certainly worked in their favor.\n\nDrum work on here, much like the solo work, isn't anything new. Blast beats were toyed with before, but in this case, it's like that old saying \"if the shoe fits, wear it\". These worked very well with the sound that we were given from these new experiments. Especially that beautiful intro to the beginning of the closing track \"Death Metal\". It basically topped everything off. So tying this all together, it's a lot of mixtures from black metal and thrash metal, and making both elements more harsh. With such a combo, we get rather messy song structure, but there's nothing wrong with that in my eyes. It was a great start to a genre that would be loved by many, and expanded upon in years to come.\n",
        "\nIn terms of extreme metal, \"Seven Churches\" is one of the few indisputable cult classics. Just have a look at the outstanding average rating for this album on a website called Metal Archives. (I guess, you know this page...) The here described successor failed to achieve a comparable status. If one looks for the reasons, the answer is easy. Producer Carl Canedy was obviously deaf. Aggravating this situation, everybody who was involved in the recording also seemed to suffer from a hearing damage. The mix was nothing else but a violation of the song material. Even attributes such as dull, muddy, powerless and dilettante describe the so-called production only in an insufficient way. It´s just completely incomprehensible, why nobody noticed this sound disaster during the recording process. And the horror goes on. Thousands of more or less well produced albums have been remastered in the past. But no one dared to give this full-length a second chance to reveal its full power. It´s a shame. Therefore, sound fetishists should ignore my rating and stay away from this record.\n\nThe tracks themselves were beyond doubt. Let me remind you that well-known bands like Marduk or tradition-conscious newcomers such as Hellbringer have covered songs of this album while neglecting the fantastic material of \"Seven Churches\". In view of the here presented collection of outstanding pieces, these bands took a comprehensible decision. Possessed once again had done everything right. The new song material was slightly more heterogeneous than that of the debut. But this was a natural development. In terms of quality, explosive bombs such as the fast-paced \"March to Die\" with its very intensive instrumental part after the first chorus or the sinister \"The Beasts of the Apocalypse\" were worthy successors of the debut´s highlights. Due to their wrathful guitar lines, they followed more or less the direction of \"Seven Churches\". What was new was that \"No Will to Live\" appeared as an epic thrasher, while the dark \"Phantasm\" had a trance-like aura. It taught us that Possessed were also able to perform a leisurely paced tune. Instead of setting the focus exclusively on aggression, the band also had an eye on creating a gloomy atmosphere. Apart from this broader range, each and every band member delivered a formidable performance. Since the release of the debut, we knew that they were technically competent. Nevertheless, the drum fills of Mark Sus at \"The Heretic\" were surprisingly impressive. The same went for the excellent guitar solos.\n\nJeff Beccera´s demonic voice made the classification of the band´s style difficult. From today´s perspective, you will identify elements of death, thrash and black metal. But do not let us waste time with that kind of pigeonhole thinking. You can enjoy highlights like \"Tribulation\" everywhere and anytime without taking care of their correct categorization. And one thing is certain, the cleverly elaborated songs did not lack of aggression and destructiveness, freshness and enthusiasm. Of course, this statement is subject to the proviso of the catastrophic recording quality. But due to the fact that there was no alternative, I got used to Carl Canedy´s foggy anti-sound throughout the years. However, the better is the enemy of the good. Based on this assumption, \"Beyond the Gates\" was fighting a losing battle against its almighty predecessor. But despite all adversities, what is crucial in this context is that this second full-length also left its mark while impressing with the fantastic compositions. If you want to feel the magic of Possessed´s early works, you have to know more than just their debut.\n",
        "\nAllow me to welcome to you to this masterpiece of metal. It starts with a throaty cry of Jeff Beccera that leads to the fantastic verse of \"Confessions\". While leaving the seven churches behind and dwelling beyond the gates, the band lets you take a look through \"The Eyes of Horror\". The opener is a straight up-tempo thrasher, equipped with the power of a pretty horrifying melody. It shows the best side of Possessed, that already offered a perfect and surprisingly mature performance on their unbelievable debut. How good it is to hear that the musicians had not yet forgotten how to create a malicious and absolutely stirring record. Thanks to the fact that they skillfully mixed up-tempo tunes and heavy sequences, this EP shines with an immaculate flow. It´s definitely not just a question of its brevity that I want to hear it again as soon as its last tones have faded. There are other good reasons for this.\n\nFor example, the guitar work is excellent. The riffs immediately take possession of the listener while having a long-term effect. No, I must correct myself; it is an ever lasting effect. I am not exaggerating when I say that the solos and the guitar lines represent the benchmark in terms of early thrash metal. The guitars combine the slightly technical approach of albums such as Toxik´s debut \"World Circus\" with the unbridled energy of angry adolescents. The songs themselves are always the main thing, the guitar wizardry does never appear as an act of musical masturbation. Drums and bass guitar do their job in a technically flawless manner, too. The production of Joe Satriani is more or less perfect for that time. Honestly, this was a matter of urgency after the shocking sound disaster of \"Beyond the Gates\". Carl Canedy, I still hate you for that! \n\nThe five songs offer a great variety of metal. Only the ingenious title track follows a similar concept as the opener. \"The Eyes of Horror\" features inter alia thrilling solos (at the beginning as well as during the middle part) and a very intensive ending. Apart from these tunes, Possessed also offer slower parts and almost melancholic melodies. Just listen to the first tones of \"Storm in My Mind\", it surprises with a different atmosphere without hurting the homogeneous overall impression. Finally, \"Swing of the Axe\" delivers the most bulky riffs of the album. Possessed manage them well. Despite the fact that the track was well known because of its first release on \"Metal Massacre VI\", it added value to this EP. The same can be said about the stereotyped yet phenomenal cover artwork. Therefore, do yourself a favour and listen to this outstanding output, it is much more than the short reverberation of the first two albums of the band.\n",
        "\nIt was 1985. Many fledgling bands were releasing their debut albums and metal music kept growing and evolving. Releases such as Megadeth's \"Killing Is My Business\" and Exodus' \"Bonded By Blood\" were pushing the boundaries of metal music. Out of all these amazing releases, the most legendary one, the one that revolutionized metal, was the most overlooked and underrated. Seven Churches. \n\nThis album gave birth to death metal. Period. This album was the heaviest, fastest, and most brutal thing that the world had ever heard at this time. In my humble opinion, it beats almost any other metal album of its time in terms of speed and aggression. It was also much more technical than much of the other albums around its time. This album is an absolute benchmark in metal history, yet it is one of the most underrated in metal history. \n\nOnto the music itself: fantastic. The musicianship is top notch. It's even more impressive that they wrote this album and recorded it during a spring break, and also consider the fact that they were still in high school! The intro to \"The Exorcist\" is probably one of the best intros I've ever heard. I know it's from the actual movie of the same title, but they seriously put it to better use here. The majority of the album is fast and brutal. Just in-your-face killer, but at the same time there is a very technical edge to it. \n\nNow onto the instrumental and vocal sections. The drums are extremely jazzy for a death metal record and set this album apart from a lot of other death bands. The riffs are crunchy, heavy, and melodic. They combine melody and heaviness very effectively. The vocals aren't meant to be pleasant. They sound like a mad, barking dog. They are gritty and angry as they should be. The bass for the most part isn't too audible, but the bass lines are killer if you listen closely.\n\nThe production is surprisingly good. It is a little fuzzy in some parts, especially the guitar tone, but for the most part, considering the low budget and time span this album was recorded in, it's a sharply-produced album. \n\nIn the end, \"Seven Churches\" is a landmark in metal music, one of the most underrated albums in metal, and most of all, this is the father of death metal. Without this album, death metal wouldn't be where it is today.\n",
        "\nSince this is a compilation composed of eighties-era video footage and early demo/rehearsal/live audio, you probably will realize going in that sound and picture quality aren't going to be particularly high. The audio quality varies a good bit, most of it being pretty listenable, but some of it being pretty noisy and less enjoyable. \n\nOne of the best parts of the release is the inclusion of Possessed's legendary demo, with the extra track \"Fallen Angel\". Whether you are an early fan wanting to replace an old cassette copy, you're like me and were only a kid at the time so missed out, or you are even younger and hadn't been born yet, this is a great way to get that demo. The sound quality is pretty good, considering this is a demo from the '80s, when bands had a much more difficult time getting any kind of studio recording made. These were the days of saving enough money to just get a few hours in a studio, so you took what you could get. It is rough sounding, but the songs are coherent and recognizable, although it does sound like the source tape is damaged in a few places. \n\nThe rehearsal tracks are interesting to hear and don't sound as good as the demo, but again, are still listenable and rather enjoyable once you crank the volume. It gives you a pretty good idea of what the band sounded like live at the time without having to sift through a bunch of crowd noise to hear the songs. \n\nIf you really want to hear Possessed live, there's some of that too. There are eight live tracks on the CD side and the DVD side is all live footage from 1984. Just don't expect top-notch professional quality. None of it is so bad that it is unbearable, but it is pretty cheaply recorded material for the most part, which is to be expected for the time and it is pretty good considering this fact.\n\nAlso included are two alternative mixes, which I believe were on the Ashes from Hell release. Two of the live tracks also seem to be from that release.\n\nNone of the later reformed Possessed demos are included in this release. It is only the classic era, with the exception of the re-recording of \"The Exorcist\" done by Sadistic Intent featuring Jeff Becerra on vocals. Since this became the new Possessed, the song is included. \n\nThe biggest problem I have with this release is the format itself. It is pressed as one of those CD/DVDs. This format can really be a problem since there is a DVD on one side and a CD on the other. First off, it is difficult to tell which side is which. Then the chances of one side or the other getting damaged are much higher than a regular CD or DVD, which is especially problematic with a release that is pretty limited. This format also seems to be tricky to play on some players and some may not even recognize the disc at all. My CD player sometimes will just scan through the tracks and not actually play them. I am also not sure if it would be a good idea to play this on a player that requires the disc to be slid in rather than placed on a tray that retracts, as the side facing up may get scratched. So if you get this one, you may end up being limited on which players it will play on, but there is certainly plenty on it to justify getting it.\n",
        "\nWhen a band's first LP is a record like Seven Churches, it will have a lot to live up to with a second LP. Possessed will always be known for Seven Churches first and foremost. It was a record that was raw and savage. This was a band that set the bar high with its first record. Most would say the band missed the mark with its second.\n\nI must disagree. Unfortunately, Beyond the Gates seems to be mostly known for two things: a weak production and the rather elaborate sleeve design. That is generally all anybody mentions in an article about Possessed, which is selling this record short.\n\nIt seems to me that with the second record, Possessed was trying to be more mature perhaps, maybe even a bit more accessible. As such, a production like the raw, abrasive guitars of Seven Churches and Jeff's unique vocal style would not work all that well. \n\nOn Beyond the Gates, it seems the band wanted a cleaner guitar sound and more melodic vocals. One thing to remember is that a lot of metal during this time was not produced particularly well, mainly because I don't think anybody really knew how to record this kind of music, opting for a trial-and-error approach. Sometimes this worked to the band's advantage (early Venom and Bathory for example), but sometimes it didn't have the right intensity and if there is a real problem with the production of Beyond the Gates, this would be it. The guitars are not as aggressive as they were on Seven Churches and perhaps that takes something away from the final product, but after so many years of listening to this record, I can honestly say that it doesn't bother me. There are a few albums with productions so horrible that they are ruined, but I would say this is not one of them. Given time, I think the sound of this one grows on the listener and the songs on this one certainly warrant multiple listens.\n\nI will say that the songs this time around aren't as consistent as Seven Churches, perhaps, but there's not a song on here that I think is bad. It all kicks off with the intro instrumental that goes straight into \"The Heretic\", being reminiscent of the first track off Seven Churches, \"The Exorcist\". The songs don't sound alike, just the instrumental flowing into the first proper song. \"The Heretic\" is every bit as memorable as anything on Seven Churches. It's aggressive and pretty fast and I find it sticks in my mind after listening to the record. Continuing on with \"Tribulation\", the album keeps hitting hard. At the same time, this album shows the band trying to have more layers to the songs, sometimes adopting a more straight-up thrash vibe and at other times going a bit more in the early death metal sound of Seven Churches.\n\nThe absolute high point for me on this one would have to be \"No Will to Live\". Jeff's more melodic vocal approach on Beyond the Gates works particularly well on this track, adding to mood of the song. It's pretty long by Possessed standards, but it doesn't feel like it and that, to me at least, is a sign of a great song. Just as Mercyful Fate's \"Satan's Fall\" doesn't feel like a 12-minute song, \"No Will to Live\" feels like it is half the length it actually is. \n\nThe last few songs on the album hit in fairly rapid succession, ending in another instrumental, \"Dog Fight\". These are not the most memorable songs on the album, but they work quite well as they are. If the band had stretched these out to be longer, they would have dragged the album down at the end. Instead, Possessed opted for a more \"get in and get out\" approach for the ending. These songs are not boring or uninspired, but they didn't need to be any longer they are on the record. \n\nPut simply, if all you know of Possessed is Seven Churches, you should give Beyond the Gates a try. Keep in mind that if the band kept trying to make Seven Churches over and over, it would have been both boring and waste of talent. Remember this is not Seven Churches, but Beyond the Gates. If all what you want is more Seven Churches, this one won't really fit the bill that well, but if you want to see where the band went after Seven Churches, I think you may be able to appreciate the excellence of this record that is so frequently overlooked.\n",
        "\nThe infatuated trilogy of Possessed's classic releases is closed with a 20 minute short MLP “The Eyes of Horror”. Well, the previous album – “Beyond the Gates” – was for me personally a slight disappointment, if I can be honest with you. OK, I will never say it was a complete shite or something like that, because it is a decent thrash metal album, but the problem I have with it is that: 1. It is not as good as “Seven Churches” and 2. The quality of songwriting on this album is fine, but not outstanding and personally I would expect something more from the masters of death / thrash metal. I have a feeling like this album hasn’t aged that well and when I listen to it nowadays I just don’t feel as thrilled as when I listen to any my top thrash metal releases of all times. But another thing is “The Eyes of Horror”… this album is 26 years old now and I think that music wise is it a better effort than the earlier Possessed release.\n\nI simply like these songs more. The riffing is better and more arse kicking, there are more memorable parts on the MLP and the whole material is more straight forward affair rather than a dull guitar masturbating. Already the opening song is crazy – “Confessions” sounds incredibly well, the fast pace, at which it was played, is great and literally this track will force the listener to bang the head otherwise something wrong will happen to him. And “Confessions” isn’t even my personal favourite from “The Eyes of Horror”! That would I think be “My Belief”, which has that killer opening riff and as a whole I think it would be perfect on some early Destruction records. And those riffs in the title track? They’re just excellent, especially with that galloping tempo, which definitely will never let the fans stand like stones, when they’ll hear this song played live. And finally there’s also “Storm In My Mind” – oh, how sweet bad ass thrash metal devastation. \n\nSo what I will say for the end of this short review is that I definitely like “The Eyes of Horror” more than “Beyond the Gates” and for me personally it is one of the most classic and obligatory thrash metal releases of all times. Check it out, especially on LP, so you can look at this excellent front artwork of this album.\nStandout tracks: “The Eyes of Horror”, “My Belief”\nFinal rate: 88/100\n",
        "\nYou know what? When I listen to “Beyond the Gates” by Possessed I keep telling myself that I like the album, but I always find one main problem with it – it just isn’t as good as “Seven Churches”. Whatever Possessed have done after their debut album, whatever they recorded, my reaction is always the same; none of their future recordings managed to surpass the excellence of the debut LP. Pity, but that’s how I feel about it. It actually is something I call “debut LP syndrome” and it’s something I think many bands from the '80s or '90s have suffered for, especially thrash metal bands, as quite many of them, after a relentless and merciless debut, went into more commercial and friendly stuff. I guess you know the story. Band X debuted with a savage, raw, and aggressive album, then they just went into softer and more easily listenable stuff with nicer vocals, (too) clean production, etc. I’m not even going to mention any names as there’s no point, besides in this review I meant to write about Possessed. \n\nSo okay, “Beyond the Gates” is not a bad album and I do enjoy listening to it and surely I won’t say it is not aggressive enough or it is too commercial, as definitely they didn’t start to play like Metallica, for instance. But when I compare “Beyond the Gates” to their legendary debut “Seven Churches”, I miss two things: the (Satanic) atmosphere and that brutality of “Seven Churches” that put out the fundamentals for the death metal genre. When comparing both albums, one can clearly say that “Beyond the Gates” is just a pure thrash metal album basically deprived of any death metal influences. At that time (1986), there was no “Scream Bloody Gore” yet (only Mantas demos, etc), but thrash metal was really enjoying its most successful time, so I can see why Possessed went into that direction more instead of trying to brutalize their music and make it even darker and more vicious than “Seven Churches”. \n\nAlready that annoying intro from “Beyond the Gates” will tell you that it is not exactly the same band anymore. Just listen to the creepy, Satanic, and sinister intro for “Exorcist” and then this happy and joyful, completely out of place intro for “Beyond the Gates\". That can already say a lot and you know straight away that this won’t exactly be the same kind of album like the previous LP, and atmosphere-wise you can expect something just more… hmm, easily listenable? That feeling may not go really hand in hand with the actual lyrics, which are still pretty Satanic and full of dark themes of horror. Just read the “Tribulation” text with such sentence as “Tribulation, in love with Satan. Desecration, come to Salem…” or in “Beyond the Gates”: “Lucifer, hear me, I pray to the altar…I hear the sounds of insanity, Master, I drink the unholy water…”. But musically that atmosphere is not there anymore.\n\nOne can still say that “Beyond the Gates” is a good classic thrash metal record. Sure, I agree, but for me, even if it is solid and good LP, it still lacks a bit of truly killer songwriting and fantastic, memorable songs, as unfortunately this album hasn’t got its own “Black Magic”, “Evil Has No Boundaries“, “Flag of Hate”, or “Merciless Death\". Of course, there are some really good songs, but just not as memorable as those tracks which I mentioned or not as historical as “Death Metal”. There are some absolutely great riffs, like in “March to Die”, but that guitar tone the band achieved on the album sometimes makes them slightly less aggressive. Besides, I just have a feeling like the music is not straightforward enough; there are too many useless guitar solos and other showing off of the guitarists instead of just plain and simple thrash metal. They did manage maybe to get everything right in songs like “Seance”, but in some others I feel kinda bored, to be honest.\n\nThe vocals of Jeff Becerra are another thing that makes me think how the band has put some of their aggression away. The vocals on the debut were truly demonic, great, raspy, and vicious that came right from hell. On “Beyond the Gates”, Becerra kept his weird and a bit annoying tone, but somehow it really irritates me when he sounds like a suffering crow instead of just screaming his guts out with passion and energy. And in “The Beasts of the Apocalypse” he sometimes I think tried to sound like Lemmy from Motorhead, which is just unexpected. The problem starts when I hear quite mediocre, almost boring music and it is accompanied with some annoying vocal parts (take “Phantasm” as an example).\n\nSo I did moan a lot on “Beyond the Gates”, but at the same time I wrote a couple of times that I do like this album. How is this possible? Well, first of all it is Possessed, but to be honest, even if it isn’t as classy a thrash metal album as “Darkness Descends”, “Hell Awaits”, or “Kill 'em All”, and even if it isn’t just as good as “Seven Churches”, at the same time it is just good enough to give it a few spins a few times over the period of a decade. It’s one of those LPs that may not be blowing your mind out to the moon, but once you start to play it fuckin' loud, then you just enjoy it a lot anyway! This is the only real and effective way to listen to “Beyond the Gates”. Then it appears that even such more mediocre material can shred, and tracks such as “Tribulation”, “The Beasts of the Apocalypse”, “March to Die”, and “Seance” will make you bang your head until you feel a terrible neck ache. \n\nIt’s a pity that it isn’t darker and with more lethal material. More so, I hate that it contains that shitty intro and this completely useless closing song, “Dog Fight”. I have no idea what the purpose in adding them to the tracklist was? Anyway, if you’re interested, I must recommend you getting the vinyl version of this album (what else, ha?!) in the first pressing, as it just looks absolutely killer. This foldout cover is very, very effective.\n\nFinal rating: 70/100\n",
        "\nRecently I’ve listened to many absolutely killer new death metal bands that try to resurrect the traditional, classic sound and style of this music, and many really did succeed in this, recording absolutely crushing demos and albums. But once in a while I just feel a strong need to go back to some cult and original releases of the forefathers of the genre… and why not do this today with Possessed’s classic release “Seven Churches”? Definitely this album is a great introduction to thrashing death metal for everyone who wants to check where the origins of this music are, because as much as Venom and Bathory have been creating what we think black metal is, Possessed did the same with death metal. All in all, “Seven Churches” does include the song titled “Death Metal” and this is also the title of their debut demo from 1984, right? This San Francisco-based outfit, formed back in 1983 by guitarist Mike Torrao and drummer Mike Sus who soon were joined by legendary guitarist/vocalist Jeff Becerra, are surely pioneers of death metal and they took something of what bands like Slayer and Dark Angel did into even more evil, dark, obscure, and aggressive territories. \n\nOf course I doubt people who listened to “Seven Churches” back in 1985 or '87 were calling it death metal though…for them it was more aggressive thrash metal band and when I listen to “Seven Churches” nowadays I can understand why and to be honest if I was bothering to give it any tags, then it would probably just be a thrash/death metal, as clearly “Seven Churches” is not as raw, obscure, and brutal as the first pure death metal lp “Scream Bloody Gore” and music-wise Possessed was leaning into the technical thrash metal quite much. There’s a clear “Slayerism” noticeable in many parts of the album, but not just that, luckily, as I feel like Possessed had also quite much in common with their Teutonic rivals Kreator. When you’ll listen to the opening song “The Exorcist”, then you may get quite put off at first by its almost chaotic and messy character, especially if you listen to the drum parts, then the vocals, which are almost out of tune at few times…it is pure madness what happens in this track and clearly Possessed must have been possessed (haha) when composing it! After something like this, “Pentagram” may seem much easier to listen to, with a catchier main riff and with the overall more straight forward attitude. Ha, this is thrash/death metal in its perfection – eerie atmosphere, dark and satanic! “Burning in Hell” starts like good old Sodom, and I definitely don’t mind that as it is a real headbanger. I especially like that part that follows the guitar solos. It is just killer stuff. But then “Evil Warriors” comes in and I must consider this track as one of the weakest parts of “Seven Churches”. The riffing in it is quite boring to be honest, and its “Show No Mercy” influence is very audible here, but really “Evil Warriors” is not as classy. The title song is way better with a really awesome main riff and generally killer feeling, one which could even be close to not only Slayer, but also to “Kill ’em All”, only Possessed made it way more cruel and violent, plus it shreds with many chaotic, cacophonous guitar solos that are equally fast as they were a mad race on the scales.\n\nSide B of the vinyl definitely is more killer for me as it included a couple of my favourite tracks from Possessed. The first one is the cult “Death Metal”, of course – and I cannot imagine a better culmination of such a great record. It is a real bombardment of thundering drums and razor-sharp riffs, plus very memorable choruses, etc. That main riff belongs to those riffs, which has its place in the metal history among the most perfect accords ever put together by a man and the beast (as obviously dark forces must have helped Possessed creating something like this). “Death Metal” is an absolutely amazing song and I do consider it to be one of my favourite tracks from the '80s along with… eeeehhh, no, too many to mention, hehe. But if you don’t know this song, then you must learn your metal history, man! “Satan’s Curse” is so wonderfully fast and so relentless that it just makes me bang my head all the time through and I can hardly stop doing so - really good song indeed. And finally another highly-esteemed song is “Fallen Angel”. Just listen to the opening theme of it, that slow and epic riff and bells that accompany it – what a great result and something that will stick with you for ages. Afterwards this song turns into quite fast and merciless motherfucker, quite chaotic for few moments again, but this is just pure death/thrashing metal slaughter. I’m afraid, though, that again a couple of tracks from side B may seem nowadays to be more filler than something that can stand on the same level of excitement and thrashing death extravaganza as those that I just mentioned. I mean, a song like “Twisted Minds” is just hmm… dull? I’m not saying it is terribly bad or whatever, and I like few parts from it, mainly this riff that accompanies the guitar solos and overall it basically is a classic thrash metal song, but is just not as utterly aggressive and memorable as one would expect from an album that supposedly opened the gates of hell for a new genre called death metal.\n\nStandout tracks: “Death Metal”, “Fallen Angel”, “Pentagram”, “Satan’s Curse”.\n",
        "\nIt's a fool's errand to point to a single person or band and attribute the birth of an entire genre to him/them, as there are always multiple players involved in such macro-evolutionary events. Nevertheless, it isn't out of line to credit the pioneering San Francisco act Possessed with beginning the putrid beast that is death metal, and not merely for putting forth a song title that became the genre's name. There is a certain threshold that is crossed when the intensity and vileness of thrash gives way to something even more evil, and while Slayer was definitely hinting at this eventuality, the first LP that truly captured all the essential elements was \"Seven Churches\", an album that has rightly earned its place as one of the sickest and most formidable offerings of the entire 80s decade. While some have taken a revisionist approach to this album and simply pass it off as a unique thrash offering due to the wide gap that exists between it and the brutality-obsessed character that Suffocation and Cannibal Corpse ushered in during the 90s, it's pretty difficult to miss the heavy similarities that this album shares with the early offerings of Death, Morbid Angel and Deicide, bands whose death metal credentials have never been questioned.\n\nAs with any lofty claim of historical significance, there comes an obvious necessity for something truly groundbreaking to be present in such an album, and \"Seven Churches\" clearly listens like an album years ahead of its time. The atmospheric aesthetic in play here is far darker and more morbid than anything that Slayer had put together on \"Show No Mercy\" or \"Haunting The Chapel\", and hints pretty heavily at the deep, haunting deluge of chaotic rage that typified Morbid Angel's \"Altars Of Madness\", missing only the signature blast beats that were a staple of said album. But while blasting is not in the drumming repertoire, this album more than makes up with it by offering up a rapid shifting array of beats and fills that actually appears to be predicting techniques that would be employed heavily on Cannibal Corpse's more technical works in the early to mid 90s. Similarly, the vocal work found on here is the first really distinctive example of the guttural barking sound that would come to dominate the late 80s Florida scene, though Jeff Becerra's David Vincent-like shout is still a far cry from the unintelligible frog-groans that took over in the 90s and has since been considered a requirement for a qualified death metal sound.\n\nYet while the guitar tone is definitely darker and less percussive, the drum work far more chaotic and wandering, and the vocals clearly on the road toward something far removed from the orthodox thrash shout of Hetfield and Araya, this album still maintains an essential thrash metal quality to it that makes identification with a number of early extreme progenitors of the redder variety of thrash very easy. The mixture of palm muted stops and starts, along with the introduction of the tremolo based melodic line still see a strong affinity with the mid 80s Slayer sound, and definitely shares a high amount of commonality with contemporary international thrashers such as Kreator and Sepultura, though their respective LP offerings that warrant the strongest comparisons wouldn't come to be for another year. In the same essence, the guitar soloing style is heavily informed by the Kerry/Hanneman approach to dueling leads, though restrained a bit more and having a stronger melodic sensibility rather than a continuous bombardment of scale runs and whammy bar noise. And ultimately the songwriting mostly conforms itself to a standard high octane thrash effort, one that is maybe a little bit more muddied and crushing that \"Hell Awaits\", but operating on a very similar wavelength.\n\nIf nothing else, the distance that Possessed put between itself and the Big 4 warrants an equal if not completely separate level of recognition in shaping the overall tone and character of extreme metal in the years that followed 1985. The eerie atmospherics that are accomplished in the haunting keyboard intro of \"The Exorcist\" and the doomsday bell with a hint of dissonant turbulence of the melodic character of \"Fallen Angel\", alone put this in very different territory from anything that Slayer or Metallica had delved into by this point. Likewise, while the riffs are still largely based in the speed metal repertoire and tonality that was borrowed from the NWOBHM acts to help birth thrash metal a few years prior, the manner in which they are implemented is quite more involved and complex than the formulaic repetition heard on \"Hell Awaits\" and the rigid, heavy metal-like structure of \"Ride The Lightning\" (not to downplay either of these very consequential albums). Even the aforementioned song \"Death Metal\", which was first head on Possessed's 1984 demo and is one of their more simple offerings, touches upon far darker territory than the most messed up moments on \"Haunting The Chapel\".\n\nThere is literally no way to downplay the significance of this album without engaging in some really outlandish leaps in revisionist history, which would obviously involve downplaying Chuck Schuldiner's impact on death metal's formation since this band inspired him to move beyond conventional thrash metal. For someone who doesn't listen to 80s extreme metal and thinks that true brutality only exists when the lyrics of an album are as gore obsessed as a raving lunatic suffering from surgical addiction, dismissing the entire 1st generation of death metal albums that were still tied, in some respects, to the thrash style is somewhat logical, but it also involved severing the tree from its life-giving roots. While it may be possible to dislike this album musically because of its dated and low-fidelity production, denying its significance shouldn't be. Anyone who enjoys any brand of extreme metal, be it death or black in persuasion, should hear this album at least once, and all self-respecting death thrashers should multiply that number by a much larger one.\n",
        "\nBeing a long-time fan of Possessed, I could not resist picking up this box set. Just reading the sticker on the outside of the package was enough to convince me. Contained within this forboding black box are all three of their releases: \"Seven Churches\", \"Beyond the Gates\", and \"The Eyes of Horror\". This fact alone is reason enough to aquire this gem. The added features include a turntable slipmat, three posters of the corresponding covers, and a lyrics booklet. For the collectors who care about such things, it is limted to only 500 copies and comes with a hand-numbered certificate to prove thusly...\n\nThe first LP, \"Seven Churches\", is essential in any death metal collection. From the first notes of the haunting intro for \"The Exorcist\" to the last gasps of \"Death Metal\", this album is a thrill ride like no other. Jam-packed with classic songs like \"Burning in Hell\", \"Satan's Curse\", and \"Fallen Angel\", which have undeniably influenced numerous death metal bands - even to this day. From the dark and catchy riffs to the frantic drumming and demonic vocals, this album is nothing short of a masterpiece. The music threatens to leap out of the speakers at any moment and drag the listener to Hell. If you somehow have not heard this record, then I strongly recommend obtaining a copy.\n\nThe second LP, \"Beyond the Gates\", is a bit different from the first album. After starting with another eerie-sounding intro, it becomes quite evident that this album is a bit more thrashy and not quite as chaotic. The production also seems to be a bit more polished, which tends to smooth out some of the rough edges that made the first album so menacing. Aside from that, there are still a good number of great tunes such as \"No Will to Live\", \"March to Die\", and the aptly-titled \"Dog Fight\". The box set does not replicate the fancy fold-out cover of the original LP, but the cover treatment still looks great regardless.\n\nThe third and final release, \"The Eyes of Horror\" EP, takes the thrash aspect even further this time around. An observation which makes me look at their musical progression as somewhat backwards, as they appear to regress further into thrash with each release. Nonetheless, this is still a quality effort, with songs like \"Confessions\" and \"Storm in My Mind\" having the same break-neck riffage, but with a squeaky-clean production. My only real complaint is that there are simply not enough songs - perhaps a third full-length would have given me the proper closure with this band.\n\nIn addition to the records, this set contains three posters which are large prints of the covers and a 'booklet' which is simply a four-page insert with the lyrics and a minimum amount of credits (seriously, they do not have the band members' names listed even once). However, the biggest lure exclusive to this box set may be viewed as the biggest trap, because the graphic is merely the white inverted cross from the first album and nothing more. No logo, no artwork - just a white cross that may or may not be inverted depending on where your turntable stops. For me, this was the only complaint I had in this otherwise killer box set (and the only reason in not giving a 100% rating) - what a way to drop the ball...\n\nAs stated earlier, having these three releases available in one all-inclusive package is enough to warrant a purchase. For fans who have had some difficulty tracking down the original vinyl versions, this is a great way to get them all in one fell swoop. Sure, the slipmat is nothing to get excited about, but it hardly matters in the grand scheme of things. The music lurking within this box set is worth every penny of the retail price (beware of the over-inflated auction prices that are out there already). Get it, play it, burn in Hell...\n",
        "\nHow I wish many of the so called extreme metal bands of today would look back at this album and realize what heritage it is they're pissing on. If there is such a thing as \"true death metal\", Possessed's masterpiece Seven Churches is by far the best.\n\nI have been looking for the origin of death metal's identity for a long time, and now I have most definitely found it. Seven Churches is as evil, raw, and qualitative as death metal will ever be in my opinion. Let me tell you why my love for this album is so God damned strong!\n\nFirst of all, this album contains what many modern extreme acts lack: a strong, well written structure that accompanies the sheer rawness of the sound. While many other extreme bands out there emphases the extreme part way to much, they tend to forget what is most important while making music: the song itself. This is what makes Seven Churches my very favorite death metal album, if not my very favorite metal album altogether. The sound is fast, extreme and raw yes, but behind all that reverb, distortion and speed you find some seriously good music, with chord progressions and vocals that create that very evil sound we all love! \n\nI hear people complaining about the extreme amount of reverb. Perhaps you do not know the history behind this album. It was written and recorded during a spring break! Jeff, Larry, Mike and the rest of the guys had neither time nor funds to create the most polished album out there. And thank God for that! This album was never intent to sooth you. It's not easy listening. This is pure fucking death metal! Hadn't it been for it's raw charm, I, and many many others, wouldn't have loved it just as much as we do. The reverb is painful at high volumes yes, but that is the way it's supposed to be. As the French Foreign Legion says: You haven't trained hard unless you puke afterwards. Well, you haven't really listened to Seven Churches unless you have a weird tone in your ears afterwards. \n\nNow for the musicians! Mike Sus is truly a good drummer. If I had to explain his drumming, and the overall structure of the album, with one word, it would be \"unpredictable\". You never know when the tempo will change in the middle of a song. You think you just got into the tempo of a song, and suddenly a far more complex version of the tempo starts of, usually with Mike marking the change. What is amazing is that none of the young musicians ever get lost in the tempo changes. \nSome find this hard to adapt to, I say it's a matter of getting used to it. Like i previously said, this is not an easy listening album. This is for die hard metalheads who love complexity. \n\nLarry LaLonde created the death metal way of playing with his guitar work. Think Venom and Exodus on speed! Complicated riffing and perfect chord progressions set the tone of the album. Although the sound is raw, you always hear Larry and Mike Torrao's guitars bringing you closer and closer to the chaos of hell as the album keeps going.\n\nJeff Berecca's inhuman proto-growling is very fitting. Since most of the lyrics is about how you will end up in hell for doing evil things, they really need a voice that tells you \"this is not a joke, you really will burn in hell\". Even though Possessed never really were \"real\" satanists, you can understand why many people feared this album back in the 80's. \n\nThe lyrics, vocals, low production value and imagery (consisting of inverted crosses, studs and blood) really created something special back in the days. I can only hope this album will forever be remembered by the generations of metalheads to come.\n\nSeven Churches will always be the album I compare other extreme albums to.\n\nThis is as good as it gets.\n",
        "\nI've often pondered why Possessed would never develop into the powerhouse popularity of their Californian peers Exodus, Slayer or Metallica through the 80s and beyond, but the answer might very well lie in their sophomore outing, Beyond the Gates. Don't get me wrong, I like this record quite a bit, but I can't help but feel that the band had toned their sound down ever so slightly, and much of the raw, ripping appeal of the debut is lost in translation. In 1986, albums like Reign in Blood or Darkness Descends were flirting with faster, more aggressive aesthetics while Master of Puppets was stealing the spotlight with its impeccable songwriting, so it was the wrong time to put on the breaks, and in the long term, it might have cost Becerra and company the race (even if they retain their cult icon status).\n\nThat said, Beyond the Gates is still worth hearing and probably owning, if you've got any predilection for occult or horror fueled death/thrash. It's no surprise that Possessed are considered one of the forebears of the 'death metal' genre. Not only did their debut have a song by that title, but Jeff's vocals were ghoulish, a massive inspiration for Florida luminaries like Chuck Schuldiner of Death. The guitars here are pretty straight thrash/speed metal though, with a bit of Slayer-like construction similar to Hell Awaits or Reign in Blood, and the ruddy, muddy tonal constitution that the lesser known Maryland band Indestroy would cop for their s/t debut the following year. Larry Lalonde is nowhere near as eclectic as he'd become for the bands Blind Illusion and Primus, but he and Mike Torrao deliver a firm barrage of dirty speed licks and knifing lead sequences which, while unmemorable on their own, thread a natural counterbalance against the hammering backdrop.\n\nThe vocals are not quite so grisly as Seven Churches, and the guitars never so belligerent and bloodied as on a \"Burning in Hell\" or \"Satan's Curse\", but it's nonetheless a consistent album which revels in its subject matter. The intro is beautiful, almost like an 80s horror b-movie theme before it cedes to the bludgeoning of \"The Heretic\", but \"Tribulation\" is the first real track of note with its faster paced guitars which had a similar momentum to what Metallica were doing at this time. This is even more the case with \"March to Die\", which charges straight into the great, mid-paced \"Phantasm\" with its solid verses and mystical, Eygptian breakdowns. Other killers include the bristling \"No Will to Live\", the writhing leads of \"The Beasts of the Apocalypse\", and the choppy, mudslinging brigade of \"Restless Dead\".\n\nThere are a few tracks that seem less interesting, like the sloppy \"Beyond the Gates\" itself or the chugging footnote \"Dog Fight\", but in general this is a highly satisfying experience with a lot of reverb on the vocals and guitars that place it straight into its mid-80s era. Personally, I'm a huge fan of that sound, but I can understand how some might be turned off that it exhibits less of the brash and repulsive hostility of its precursor. The lyrics are all fairly simplistic dissertations on the typical themes that were also being explored by Slayer, Dark Angel, Venom, and so forth, but they do the trick, and there weren't a hell of a lot of bands doing more than that in the period. Ultimately, Beyond the Gates doesn't earn the Gold medal for Possessed, and would easily be subjugated in any throwdown with Bonded by Blood, Ride the Lightning, Darkness Descends and so forth, but it's a reliable enough ride into Hell.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nSeven Churches and Beyond the Gates have both earned Possessed a fanatical cult following, considered seminal works of 80s occult thrash metal and pioneering releases that led the genre into its next evolution (death metal). But The Eyes of Horror EP, which followed, is often left out of the conversation. Boasting a tighter coordination and cleaner production than their full-lengths, the five tracks on this release exhibit what Possessed might have become had their career forged on, solid thrash with some similarities to then-albums by Hallows Eve (in particular, Monument's guitar tone sounds a lot like this recording). The EP was recorded by guitar guru Joe Satriani.\n\n\"Confessions\" begins with a forceful, grinding thrash rhythm swathed in Jeff Becera's charnel vocal tone. It's pretty memorable and vile, but you'll notice right away it's a bit polished up from the band's origins. \"Eyes of Horror\" is a slower groove with some nice rhythm work beneath the leads, and an unforgettable first verse (though the lyrics are admittably pretty weak):\n\n'I believe only the real\nWalk through life on what I feel\nLiving my life from day to day\nWhat's wrong, what's right, who's to say'\n\nHideous. The title track is the creepiest and best on the album, with a death metal visage implied among its churning guitars and quite a few catchy riffs. I really enjoy the chorus vocals, with the sinister echo. \"Swing of the Axe\" is a vicious track that recalls Slayer's Show No Mercy, and the final \"Storm In My Mind\" opens with some nice leadwork and busts out a nice mid-paced thrashing rhythm later on. The material here might feel more focused, but that steals away nothing from its dark nature. The lyrics seemed to be moving in a more personal direction, but the ability to write memorable, ominous rhythms is untouched. Most probably have this EP tacked on to their copy of Beyond the Gates, but it's worth hearing to any fan of evil 80s thrash metal, even those rare souls who don't care for the band's legendary full-lengths.\n\nHighlights: Confessions, Eyes of Horror, Swing of the Axe\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nWhat a shame Possessed broke up again after the release of this killer demo!\nThe three songs featured on this tape plus the seven other songs composed by Mike \"Hell Hick\" Torrao from 1990 to 1993 would have been an excellent album close to the first album, a sort of \"Seven Churches Part Two\" in a more darker, modern death metal form.\nThe first song \"The Seventh Sign\" is a blast from hell indeed. Very fast (drummer Walter Ryan tops Mike Sus in any respect except the latter's remarkable martial snare rolls) and vicious with great riffing and great leads and great vocals of Mr. Torrao himself that are darker and deeper than Mr. Becerra's were (and that means a lot!)! Lyrically the band has returned to its roots - songs about Satan and horror flicks.\nThe second song \"Last Ritual\" is even faster and more brutal than the first one with a tremendous chorus. It is without any doubt the fastest song Possessed have ever done. Welcome to my home!\nThe third and last song is called \"Human Extermination\" and is a blaster of its own. Not so fast as the predecessors are its qualities in a very gloomy chorus and brilliant leads combined with a horror intro and a riff that is very easy to remember. Its sole manko is its length. The song starts to get boring after a while.\nAs I said in the beginning, it's a pity Torrao didn't move on with Possessed after this divine offering and the other songs like \"The Martyr's Wake\", \"Re-Possessed\", \"Blood For Blood\" or \"Over Reality\" to mention a few that never made it onto any recording.\nI'm sure the third full-length-album of Possessed would have been the absolute killer if released in 1993 or 1994 and today this band would be in the position to which she should belong. Torrao, just record these songs anew please and put them out on a full-length-effort! Thanx.\n",
        "\nThis demo was created in 1993 as Mike Torrao tried to re-unite Possessed once again. This was the only artefact from the sessions, a 3 song demo, which has never been commercially released.\n\nFirst Impression? Well, the first song, The Seventh Sign, is an utter fucking beast of a song, one of my favourite songs ever written by Possessed. The solos are awesome and it's a real blast of a song. Last Ritual follows in more of the same vein, it doesn't let up either. These songs are classic Possessed, and by far match anything on Seven Churches or Beyond The Gates. There is no experimentation or progressive thinking on this one, and it's better for it.\n\nHuman Extermination is more of a mid-paced number, and can grate as the verse riff can get very annoying boring, very quickly. However, the more technical/progressive riffs near the end redeem this song a bit, reminding me of Ungentle Exhumation-era Cryptopsy or Contradictions Collapse-era Meshuggah, however, I do think this song outstays it's welcome a bit too much, and the solo isn't as up to scratch as the other two songs. Nonetheless, it's not a bad song, by any stretch of the imagination, it's just a bit boring compared to the other two.\n\nTorrao is on top form on this demo, his vocals are unbelievable, a mixture of Chuck Schuldiner and a faster John Tardy, and the riffs on this record are some of his best, by far, only beaten by the astonishing solos. Another mention has to go to Walter Ryan, the drummer, who puts in the performance of his life on this demo. He blasts along with a ferocity easily bypassing anything by Mike Sus, with some of the fastest beats Possessed have ever had. He really has ramped up the speed factor on here, and some of the fills are just unbelievable. Mike Hollman and Paul Perry give respectable, workmanlike performances on their respective instruments and must be commended for their performance. But this is Torrao's show, he rules the roost and he kicks arse.\n\nOne notable aspect has to be the production. When you compare it the the 91' Demo, you can see a notable difference in sound quality. Although the 91 Demos are raw, they are also a bit muddy. However, the sound on this demo is unbelievable. It far surpasses the other demos and even Seven Churches, and the sounds is crystal clear. There's no hiss or crackle or annoying clipping. It's a modern production (For 1993) and isn't too polished, like the Cryptopsys and Decapitateds of today, who sound sterilised and neutered. It actually reminds me of the sound of Cannibal Corpse around the time of this demo, on TOTM and The Bleeding. It's all crystal clear, yet retains the essential warmth which all good Death Metal bands should have. To hear a sound so good on a demo is quite a revelation?\n\n\nOverall, this demo is unbelievable. I actually prefer it to Beyond the Gates and The Eyes of Horror, and it's on equal level with Seven Churches. It could possibly be the best thing Possessed have ever done. Possessed should bundle this with the 2 demos from the ill-fated 1991 reunion as a compilation, because this needs an official release. I still do not see why this hasn't been re-released yet, because it's unbelievably good, and more people need to hear it. Another thing I can't fathom is why this reunion didn't work because the material they were writing was some of the best they had ever done and the live shows were apparently very good. Perhaps Torrao got cold feet all of a sudden about continuing the Possessed name, despite being the only original member.\n\nWhatever reason, this demo will remain a time capsule of Possessed's tumultuous 90s history. Whether the latest line-up of Possessed with Jeff Becerra and the guys from Sadistic Intent are as worthy of the Possessed name as this line-up is unclear, as they haven't released any new material yet. But all I know is that Possessed can have no qualms or regrets about this demo, as it is certainly true Possessed, and not a mere shadow of it's old self. It is a true and accurate representation of the genre Possessed spawned, Death Metal and shows that the old dogs are more than perfectly capable of keeping up with the new breed.\n",
        "\nUsually when you hear someone talking about a band refining and streamlining their style for a new album, warning flags go up; clouds of crows augur SELLING OUT. However, in this case, it's actually quite respectable. Not the missing link between thrash and death that Seven Churches was, Beyond the Gates is like the cro-magnon finally standing fully upright, looking around, scratching his prominent forehead, and deciding he had more fun as a neanderthal after all. Some may view this regression in a negative light, but after all, sharks haven't evolved much in millions of years and they're still just as deadly as ever. Sometimes old models are best, and I find influence and proximity to a cutting edge decades old to be pretty sorry gauges of quality. It's confusing symptoms with causes, and if this album were released today and I the only one who heard it, it would still be just as good. \n\nInfluences aren't too identifiable, but some early Exodus headbanging sensibility and a healthy dose of morbidity courtesy of Slayer and Celtic Frost/Hellhammer can be heard in Possessed's sound here, as well as what I can only call a bit of a proto-black metal feel. Certainly not enough to merit a full-blown genre tag, but in the same ballpark as Sodom's In the Sign of Cruelty, maybe Venom, and at times comparisons to a sped-up early Samael could be made. Contributing to this is Jeff Becerra's decidedly more relaxed delivery when compared to Seven Churches. Here Becerra instead reminds me of a postmortem Paul Baloff giving a monotone delivery; rather than an all-out feral vocal assault, he goes for a laid-back, moodier approach. As he moans, groans, and grates his way through deliciously blasphemous odes to the Dark Lord, it becomes clear the result is much more charismatic. \n\nThe production here also deserves mention; the guitars are sharp and vicious, like a chainsaw of razorblades. Though such a tone can often turn out thin, they thankfully don't forgo the heaviness here. This allows the riffs to run the gamut (such as it is) from speedily frantic to slow and mosh-choppy without favoring one or the other too heavily. The only real drawback is that even with its short length, Beyond the Gates can grow a bit monotonous, but despite their simplicity Possessed usually do a good job of changing things up in a timely fashion. That doesn't just mean \"yet another riff\", as thrash so often does; for example, \"Phantasm\" begins right off the bat with a great thrash break, while in the title track a keyboard plays some eerie chords in the background, like from an evil carnival. Some quite evocative solos and leads also make a positive impression, for example towards the end of \"Seance\". Rather than brutalizing with a flurry of Slayer-style shredding and whammy-bar abuse, they often favor a more measured approach much as with the vocals, on \"Seance\" genuinely conjuring up images of the Satanic ritual. Can you tell if sweet Satan will rise from Hell? The lyrics are unusually good, too, just as good as the debut's; bleak, evil, unabashedly Satanic. Not just \"BOO, SATAN!\" granny-scaring crap, but actually pretty edifying, again more reminiscent of something to come out of black metal than thrash.\n\nWhile not the violent bloodbath the debut was, the follow-up has a chilling quality all its own; the calm, matter-of-fact tone of the songs that rarely get much above mid-paced brings to mind the serial killer who, having finally been brought to justice, shows no remorse for his crimes, no sympathy for his victims or their families, no fear for his future fate, nothing but self-satisfaction and contentment with the evil he has wrought.\n",
        "\n\"Seven Churches\" is no doubt the evillest thing to come out of 1985. Whilst the rest of the western world were prancing around in pink shell suits and high heels whilst wielding mobile phones larger than my house, Possessed were instead playing a dark, evil and chaotic brand of thrash metal that was absolutely key in laying the foundations for the next wave of extreme music - death metal. \n\nPossessed for the most part go about their thrash business as normal; fast paced drums, thick, rapid, aggressive riffs and rough, torturous vocals that definitely lean towards the soon-to-arrive death metal sound. The band itself are skilful, but have a loose and sloppy way of playing that serves to highlight the violence of \"Seven Churches\" most excellently. Mike Sus's drumming is full of fills and martial-style snare rolls, Jeff Becerra growls reasonably (though he is sometimes hard to focus on over the guitars) and plays some thoroughly decent bass, and Mike Torrao and Larry LaLonde riff and solo away like their lives depend upon it. Torrao's style is basically Kerry King style whammy bar abuse (nothing to write home about), whilst the superior LaLonde actually sounds like Kirk Hammet does on \"Kill 'em All\" in many places, though more uncontrolled and with moments of startling creativity. Overall, Possessed are chaotic in a way that most thrash doesn't come close to. A favourite tactic of theirs on \"Seven Churches\" is to proceed with what at first appears to be a standard thrash riff - only to throw the entire thing into disarray by injecting a bizarre, out of time, high-pitched lick into the end of it. This kind of behaviour gives the album a unique and deranged character which I must say is rather enjoyable. Not only that, but there are some truly spine-chilling moments on here which really help this album to stand out. \n\nOn \"The Exorcist\", the band desists in attempting to beat your ears into a bloody pulp for just a few moments, and allows an eerie melodic tremolo-picked section to soar free, bulls-eyeing the 'dark and evil' feel with perfect precision. On \"Burn in Hell\", a ferociously fast and furious song that would definitely give Slayer pause for thought, the end of Larry LaLonde's unearthly solo collapses into a freakish, atonal and deliberately paced arpeggiated spasm that appears to grab the music by the scruff of the neck and shake it to a standstill - before the band let rip with a churning, hellish slow/midpaced riff that seems to shake the very foundations of reality to its core. At the end of \"Holy Hell\", Possessed conjure up a riff that literally sounds like the call of a hunting horn - \"TADALA DA DA DAAAA!\" If you know what I'm driving at - and channelled through their cacophony of battering drums, crunching guitars and sinister vocals, the effect is of a Hell hunt bearing down on you; hideous, pitchfork-wielding demons riding over screaming sinners on giant black steeds, while the foaming Hell Hounds bay and rend. Fantastic stuff. \n\nElsewhere they pull off other fine moments, like the demented arpeggios in the title track, or the powerfully dark, bell-chiming intro and intricate riffage of \"Fallen Angel\", or the subtle but absolutely killer rhythmic cymbal-work pulled off by Sus during the bridge riff of \"Death Metal\", or the impossibly thick and devastating ending riff to \"The Exorcist\", or the basswork during the solo riff on \"Twisted Minds\", or Torrao's strange and disconcerting solo on \"Pentagram\" - about the only place in the album he succeeds in outshining LaLonde. The album is peppered liberally with several more classic and pitch black thrash riffs; always a recommended feature to include on your death/thrash album.\n\nWhilst all this a veritable feast for the ears of the discerning listener, in a sense it's also frustrating. This is because some of these songs are slightly padded out with 'filler' - it's not bad filler in any sense whatsoever, but Possessed occasionally slip into the trap of just bashing away with any old riff whilst Becerra growls over the top (mostly during the verses of the songs). Part of the problem with this is that Becerra's voice is not as engaging or dynamic as, say, Kam Lee's or Chuck Schuldiner's - so where you're supposed to be focusing on the vocals, they often don't hold the attention as well as they could. If only Possessed could kick as much arse as they are capable of, all the time, \"Seven Churches\" would have been completely untouchable. Still, as it is, it's 'merely' extremely cool, raw and atmospheric death/thrash played with zeal, and infused with moments of genius. Sounds dreadful, doesn't it? I don't know why I even like this shit.\n",
        "\nThis is Possessed's second full-length album. Now, Seven Churches kicked so much ass that I knew Possessed would have trouble topping it. Well, did they? Let's check it out.\n\n\nNow, the first thing you notice when you pop this album in, aside from the obvious slower part of The Heretic, is that a number of things have changed... But at the same time, they haven't... A little weird... Let me explain.\n\n\nThe first thing I noticed about the guitar is that it's not really Death Metal! It's very, very thrashy, melodic, even, in some parts. Heavier this time around, clearer and louder. Now that is a plus for me. Again, the solos of the album are perfectly placed, and not over-used to the point where you don't want to hear them anymore, but actually are well paced out that you want one, you need one, you know? And then when the time comes, outcomes the fucking air guitar, because the solos are awesome. There are parts where the album slows down a bit, and allows more variety, as well. Variation that is well used, but not over-used. It's a perfect fucking blend. It's great, truly an awesome album.\n\n\nThe bass for me has the same problems as it did with Seven Churches. It's not loud enough. Simple problem with a simple solution. A song where the bass stands out the most would have to be in the song \"Seance\". It's awesome, and it serves the best possible purpose: ripping the shit, and making the song sound as kick ass as possible. It's hard of hearing in some songs, but when it does show it's ugly mug, it's fuckin' awesome.\n\n\nThe drums on this album are the biggest turn around. There is a ton of variety and great use of all toms and cymbals alike. Again, it CAN get repetitive, but if you pick your battles, it's not nearly as monotonous as it CAN be played and heard out to be. There is one problem though... Remember how I said that they have changed, but at the same time, they haven't? Well here's the cake taker... The drums and vocals are too loud still... They drown out the guitar and the bass way too much. Now this is made better by the fact that the guitar and vocals are clearer and cleaner, but it still has an effect that I would rather it not have.\n\n\nThe vocals are, well, what can I say... Perfect. They are perfect. Except for the little problem above, they are fucking awesome. I can't say anything more about them. I've said all that could possibly be said.\n\n\nNow, this album is awesome. I implore you, get this album and listen to it right now, whether you have or haven't heard it yet. Listen to it, now. It's incredible, and you won't be disappointed.\n",
        "\nPossessed, is, as most of us know, one of the founders of the glorious genre that is Death Metal, and often considered to be THE creators of it all. If so, it started with this album, released in 1985. This is Possessed, \"Seven Churches\".\n\n\nThe opener, \"The Exorcist\" is the perfect way to open this album. Starts off with a slower, softer tune, and right then you know that your in for something fucking awesome. You hear the little clinks of the cymbal and it just blasts off. Now this is classic Death Metal at it's finest. You gotta love it. Heavily distorted dual guitar riffs, insanely fast, and even though the it's lacking in technicality a little bit, it's glaring. I mean, imagine hearing this in 1985. \n\n\nThe solos are great as well, well placed, well paced, neat, and not wretchedly overused. This is pump music. It's the type of music that makes you wanna down a keg of beer and jump off buildings. It's party music. If there was a metal-head party in town, this is what would be on the stereo. A perfect example of this is the song \"Holy Hell\". It just has that beat that makes you wanna go crazy.\n\n\nThe drums on the album are like any classic Death Metal: lacking in the variety department. It's mostly bass and snare, maybe an occasional cymbal, you know, nothing overly impressive, nothing special. Just classic Death Metal drumming. While they're lacking in variety, the beats, and use of beats varies, which is a good thing too. It's not the same beats with the same drums over and over, so there is a little variation, but not enough to save it from sounding repetitive. I also feel like the drums are a little bit too loud in some parts, and the guitars not loud enough. I get the feeling that the guitar and bass are being drowned out by the vocals and drums, which is understandably a little disappointing.\n\n\nThe bass for the album, from what I can hear of it, is fair and follows on it's own according, and not with the guitar much, if you know what I mean. It does stand out fairly far in some songs. Referring back to \"Holy Hell\" again, the bass is really audible in this song, and can give you an idea of what it's like. \n\n\nThe vocals are awesome. The vocals for me, are the best part, along with the speed and aggression of the guitars and the song's themes. Now, Jeff Becerra is a god. His vocals are incredible. Every thing you'd come to expect and even more, in an awesome Death Metal band. Harsh, crude, perfect. Not much else to say about them.\n\n\nWith all this said, this album is awesome. I shouldn't have to tell you that Possessed is awesome if you're already a Death Metal fan, because chances are, you already know full well that they kick ass. A great first full-length album, by possibly, it is debatable, the first Death Metal band ever. With this said, it's my job to tell you the undersides. The problems I have with the album are nothing really serious. The guitar and bass are very unclean, and are drowned out by the drums and vocals. The drums are very repetitive as well. More variety would make the album way more pleasurable.\n",
        "\nUnfortunately, this is the last considerable (for the length) release by the thrash/death demons, Possessed. If in its precursor, that Beyond The Gates, we already noticed a big change of direction by this great band, here we have the natural continuation with more thrash metal oriented riffage. The production here is less clean that in Beyond The Gates and “Confessions” immediately shows its death/thrash metal load with great riffs and awesome, more melodic solos.\n\nTo continue we have the mid paced beginning to “My Believe”, suddenly transformed in up tempo with great galloping guitars parts and tapping solos. The technique level has increased since Beyond The Gates and the music quality is always high, even if the direction has changed. Becerra’s vocals here are less screamed but lower in the tonality, with the raw component always in the first place. \n\nThe beginning to the title track is pure thrash, made of lots of palm muting parts and gloom atmosphere. The solos here are really great and more melodic. The main riff is repeated ‘till the end, creating a really compact wall of sound to sustain the long lead guitars parts. The riff at the beginning to “Swing The Axe” always reminded me the one on “Antichrist” song by Sepultura. Anyway, this is another great thrash metal song, excellent to damage your neck. \n\nWith the last “Storm In My Mind” you can easily forget the death metal influences. This one is pure thrash, either on the solos or during the fast restart. The tempo is in Hellhammer style in some points and that’s great to me! All in all, this is a very good piece of thrash metal by a band that disappeared in a premature way, leaving us the memory of three great releases. I can only hope in something new from them as soon as possible.\n",
        "\nThe second album after a masterpiece is always a difficult goal to achieve, especially when that masterpiece is called Seven Churches. After two years from that monstrous birth, Possessed are back with another full length and something has changed. The thrash metal component is preponderant with more thrash galloping guitars parts, like in “The Heretic”. The sound is clearer than in the past with less hellish atmospheres that branded their debut.\n\nThe vocals by Becerra are always evil as fuck and they didn’t change from Seven Churches. “Tribulation” is another classic with the good refrain, some excellent mid paced parts and superb solos, that this time are more melodic and speed metal oriented. The guitars sound is less death/black metal oriented, evolving into a quite pure thrash one. The technique by the members has improved a lot in the solos and in the rhythmic session. The main riff on “March To Die” has something technical thrash metal in the galloping rhythmic session. \n\nAnyway, the fucking gloom atmosphere didn’t disappear at all, so we can find again riffs that can come easily out of Seven Churches with a different production, but always an evil one. If you want to check out clearly the guitars new thrash distortion, listen to the beginning of “Phantasm”. This song is mostly mid paced with riffs that reminded me early Exodus for the mid paced progression and the almost progressive soloing! The 7 minutes of intensity and violence of “No Will To Live” could easily turn pale anyone who found in Seven Churches some of the most violent songs ever. \n\nThe title track is remarkable for some strange sounds on the background and the truly twisted atmosphere. “The Beast Of Apocalypse” deserves a continue headbanging during its 3 minutes of primordial thrash/death. “Séance”, “Restless Dead” are two unbelievable vicious blows to the back of my head and the instrumental “Dog Fight” puts an end to this great album. As I said, it was so difficult for them after Seven Churches and even if this one is more thrash oriented, the group’s intensity and malevolence is always on the top and difficult to match.\n\nOverall, an excellent follow up, mandatory for any death/thrash lover. This is a real bloodbath.\n",
        "\nSeven Churches is one of the most sick, twisted and brutal albums ever. Those guys at the time where exceptional. Recorded during the Easter holidays (hell yeah!), we can easily say that these 10 songs invented a new form of doing metal, opening the gates to new genres like black and death. Ok, let’s take a look at the musical panorama at the time (1985): Slayer put out the dark, violent “Hell Awaits”, Kreator were at the beginning with their first album “Endless Pain”, Sodom had just released the mini “In The Sign Of Evil” in 1984 and Sepultura the “Bestial Devastation” EP. Wow, what a year for the growing extreme scene. \n\nDespite the bands I mentioned before, Possessed were even more obscure and “black metal” in the way of dressing and acting, keeping alive the Satanic spirit presented few years before by groups like Venom and Slayer…it’s a sort of prosecution by these young fellows. Their main influences were exactly the thrash metal and the very first extreme thrash metal bands with a death touch. So, if Becerra was to come an idol for the future generation of deathsters (Chuck Schuldiner), it’s good to know that he wanted to sing like Cronos and his vocals went into too extreme direction, contributing in creating a new thing.\n\nTheir influences from the horror films would have become a classic stuff in the lyrics by the very first death metal groups and the Satanic hymns for the future black metal groups. The sound is unmistakable, unique and truly evil. The guitars sound like mad chainsaws and a song like “The Exorcist” is a classic amongst the classics. The furious, raw up tempo parts with fast rolls on the snare drum and the tempo changes are well mixed with the evil single note riffs made on a single chord, like it would have been for the black metal bands in the near future.\n\nThe growls at the beginning of “Pentagram” are truly scary and innovative for that period. This song is great for the lead guitars riffage during the tempo changes and the sulphurous aura. “Burning In Hell” is awesome with the malignant riffs and vocals beyond human comprehension. No one at the time could play faster, harder and so evil. The solos are in pure Slayer direction with shredded parts and whistles. The bass drum work on “Evil Warriors” seems endless, with great march rolls, and the wall of sound from the guitars on “Holy Hell” is pure madness. \n\n“Satan’s Curse” is great for the drums stomps on the hi-hat, creating a really catchy, but dark as hell, sound. It’s really hard to describe the atmosphere these guys can create on this album because they seem like coming directly from hell for malignance and evilness. “Fallen Angel” is truly creepy for the bells sounds in some parts during the song and the final “Death Metal” is the very first hymn to this genre, embracing all the characteristics a band should have to play this kind of infernal music. An ever shining album.\n",
        "\nUnfortunately, this is the last release from the “classic” Possessed. Soon after this, the band demised and the members parted ways. Even so, this little EP is very good and features a different and more mature style of Possessed. As stated by the band itself, the trademark Satanism is almost ditched (except on “Swing of the axe”, an old re-recorder classic) and the main lyrical theme is now Becerra’s inner feelings. \n\nThe music itself is different too, as the other user said this is basically a thrash EP loosing the Death Metal characteristics from earlier albums. We can tell that from the clean (and impeccable) production and from Jeff’s voice that is now cleaner and not so aggressive. \n\nThe riffing is very good and the drumming is very consistent but nothing outstanding. All the songs are good but my favourite is the title track. That song creeps me out and that chorus is pure headbanging material! \n\nDespite a short change of direction of the band’s musical style this will not disappoint older Possessed fans. Highly recommended!\n\nHighlights: “The Eyes of Horror”, “Swing of the Axe”\n",
        "\nI never got QUITE as into this album as a lot of other people have; I don't know, maybe it's just me, but I have difficult relating with a lot of music from half a decade before I was born. I'm not going to fawn over it because it's 'oldschool' and 'legendary' when there's no way I'll ever be able to TRULY connect with stuff from an era in metal that's so radically different from the one I'm currently involved in. I've always thought it's kind of silly when teenagers go on about how incredible Iron Maiden or old Metallica is. While those artists both might have amassed a collection of truly great music, it just feels sort of disingenuous to me to hear people fawn over an album that was produced before their particular sperm cell was even close to being spawned. That being said, I like 'Seven Churches' a pretty good amount. It's not amazing as a whole (though there are a few moments that are), but it is a very respectable album, and, of course, an incredibly important one.\n\nMuch like Venom's 'Black Metal', 'Seven Churches' is an honorary death metal album more than a sonic one. A lot of people waffle around and try to imply that there's something truly yet abstractly different about this release which separates it from 'mere' thrash metal, but the fact is that it's really just a weird and unique thrash album. It's a very good one though, and you can clearly see how this influenced early death metal greatly: numerous riffs sound like they're out of the early Morbid Angel book, and the overall feel does approach early Death pretty frequently. It doesn't sound like pure thrash, admittedly; the riffing is very twisted, hellish, and more atonal than usual, and the rougher vocal performance, though still somewhat theatrical in a Nuclear Assault sense, is obviously a step forward from thrash convention. The drumming is a strange element; think the drumming of mid-era Slayer, but more tentative and uneven, like Mike Sus was really, really afraid of screwing up at any moment, and there's a lot of weird beat decisions with snare/bass/snare rhythms bleeding into awkward skank beats and strange snare rolls. It's thrash without the bounce or feeling particularly 'thrashy'. It's more directly hellish, the closest approximation being, again, Slayer.\n\nAll in all, a lot of these songs feel very raw and unformed, like this album is really one big demo without all the kinks worked out quite yet. Or any of the kinks, for that matter. The songs are designed very awkwardly, and most sections transition into each other just by stopping and switching riffs or with an abrupt tom fill and immediate, stilted shift to the next movement. That being said, there are points that are more clearly developed than others. 'Burning In Hell' is the best track by a mile, with the most sinister riffs and vocal performance on the record and an overall structure that feels very organic; hell, it almost sounds like Morbid Angel's 'Bleed For The Devil' with its too-fast pace and evil delivery. The title track also sounds like an old Morbid Angel track with particularly Azagthoth-esque solos and riffing style. And then, finally, there's 'Death Metal', which is ironically probably the thrashiest track on here along with being the most strange and awkward; however, it has a sort of innocent charm about it that's fun to listen to.\n\nThere's little that's professional about this album, from the uneven playing to the thin production and even to the minimal, slapped-together cover art. But it is an important, worthwhile listen that greatly influenced early death metal. Should you get it? Of course! It's a weird, fascinating classic of early extreme metal that everyone should hear at least once to gain some proper perspective, even if you don't really like it very much in the traditional sense. After all, what could be more important to listen to than the very first death metal album?\n",
        "\nAll those bedroom black metal projects and brutal technical grind death bands could learn something from this. Possessed doesn't need much of an introduction, but they were a good old thrash band that took their sound to the extreme, a daring move which ended up leaving them with this album. Seven Churches is pretty much the antithesis of politically correct-ness by its name and thematic alone, with such charming and classic song titles as \"Satan's Curse\" and \"Pentagram.\" I wasn't around when it was first released, but I imagine it, along with the cover, did not make Possessed many friends in groups like the PMRC back in those days, even when such people had not even heard one note of the music contained inside. And the music on here definitely lives up to the band's crazy, unheard-of-in-1985 Satanic imagery, being a whirling cacophony of hard hitting, devilishly catchy thrash riffs, twisted, evil solos, drums that were faster than speeding bullets, and a vocalist in Jeff Becerra that literally sounded like he was coming from Hell to drag you down to the Devil himself, to be tortured for all eternity.\n\nThe songs on Seven Churches are simple and they all sound quite alike, but hell, in a case where sounding alike means that your album just consistently applies a steel-toed boot to your ass, as it does here, I'm not complaining. Every song here ranges from 3 to 5 minutes, as on a lot of older thrash albums, and every song is pretty much equally good, with standouts being exceptionally difficult to choose. Things start off with a calming, rather haunting synth intro, when suddenly the floor drops, and you're plunged into an orgy of jugular-tearing riffage, pierced by Becerra's netherworldly rasping, and if you can't get into \"The Exorcist\" after that, then you're a lost cause. \"Pentagram\" has some absurdly cool guitar trills running about it's hellish exterior, a meaty and healthy thrash appetizer that doesn't fail to please. \"Fallen Angels\" is another killer track, starting off with some somber, hypnotic church bells and then leaping head first into the aural equivalent of a machine gun fight, with the fastest riffs on here, only to drop out towards the end with the church bells again, before going back to the throat-cutting, too-fast-for-the-speed-limit riffage and a winding, demented solo that will send chills up your back as it ascends from the pits of Hell. Holy fuck. Every other song here kills too, there are no duds whatsoever.\n\nIf you're a fan of extreme metal, this is more than mandatory. If you dislike extreme metal, then you should still at least try to enjoy this one. It might be short and it might be repetitive at times, but that's why it's so damn cool. This is a burst of Hellish fun that you'd be hard pressed to find an equal to anywhere these days. Go get it.\n",
        "\nMy gods, I remember buying this at a used record store in my home town because I liked the cover--simple and effective--and I was a big fan of what was on both Combat Records and Metal Blade Recrods at the time (early 80s). This was when Metal Blade were the best in the field and Combat was right up there with them, mind you.\n\nThen I got home and threw it on the turntable and was amazed at the rush of fury and power that bellowed from my speakers after the haunting intro of Mike Oldfield's \"Tubular Bells\" (better known as the theme from William Friedkin's classic horror epic, \"The Exorcist\") . And the song of that same title follows it with razor-sharp riffing and Jeff Becerra's glass-gargling screams and growls over Mike Sus' chaotic drumming. Sus' coming from a jazz background accounted for his off-kilter style that was atypical of drummers in those days. \n\nMike Torrao and Larry LaLonde (who'd have thought he would go on to Primus after this?) scatter, spray, and shred shards of screaming metal madness in the form of lead guitar breaks that took what Slayer laid down and ran with it. And twisted it into a whole new mutation of extremity that was at the time unprecedented. Torrao's style was the more predictable of the two, as he tended to play a lot of the same licks and patterns, whereas LaLonde was slightly more inventive--as a student of the great Joe Satriani I expect no less. Their riffing was bizarre and weird, and it was utterly their own sound as they went for the throat. Larry simply shrugs this off as \"a bunch of drunken kids from El Sobrante trying to be heavy\" these days, but I don't know if he realizes just how much influence these early recordings of his hold in the underground. On the title track, bludgeoning beast that it is, they are at their most deranged and manic and it is a wonderful sound indeed. \n\nJeff Becerra was the first vocalist I was aware of to do this sort of thing, the glass-gargling growl/scream approach, and he sounds really sick on this album. He sounds as though he wants to break into your house and massacre your entire family before your eyes! as he pukes out what at the time were shockingly Satanic lyrics Of course, some would argue that his vocals are over the top, but what do they know? His bass work for the most part stays in the background anchoring the low end, but he gets in some tricky unison bits on \"Pentagram\" after each chorus. It's all about his vocals on this album and he sounds frightening, which is what matters. And vibe and feeling are what this is about.\n\nThe production is one of the few Carl Candey production jobs I like, as it has a nicely cavernous ambience that conveys the otherworldly feel Possessed had at their best, that feeling of madness sent by the Lovecraftian Elder Gods that Morbid Angel later on harnessed to such deadly effect. WIthout this band, it can be argued that MA would've sounded far different were it not for their inspiration. The guitars are crunchy and evil, the drums boom out at you like artillery fire, and the vocals are just right in the mix, muddy though it comes off as at times. \n\nThis is a perfect intro to the roots of modern death metal and you need it for purposes of context and history as well as incredible shredding power. Look to the title track (one of the best death metal songs ever, IMO), \"Pentagram\", and \"Burning In Hell\" for standouts to illustrate the scope of their sound, as well as \"Fallen Angel\" with its tricky verse riffing. Just get this already. You need it.\n",
        "\nThe first ever death metal demo? Nah, it gets close to it but it still stays thrash metal. Anyway, this demo is a real brutal thrash with a shitload of aggressive riffs and straightforward lyrics. It's a short demo which contains only 3 tracks within 10 minutes, and it's good like that because I prefer short demos which goes straight to the point instead of overlong demos with one killer side, and one filler side.\n\nThe drumming is primitive and brutal like a wild beast but it isn't loud enough for me and even blends a bit in the mix. It keeps on whipping and sounds pretty solid, but it really feels like something missing there with the drums...but it still sounds energetic. The leading guitar also sounds fragile and too much improvised. It sounds like it kinda there only for the presence, to cover a bit the riffs and add kind of variation, but it doesn't make sense at all and sounds like plenty of sudden notes without any bond.\n\nIs it got at least some decent riffs? Geez, it got a PLENTY OF killer riffs on high speed in a furious mode which sounds like unstoppable buzz saw on 500 mph cutting some posers heads and splashing their blood all around and blowing their nasty minds for a ten thousand pieces!! Yeah, it's that killer! The riffs are the best thing here and they are very mad so don't piss them off!\n\nAlright, all these 3 songs are pretty killers due to the overwhelming riffs assault, but they are interrupted by some unnecessary solos which drag it down a bit. \nIf the lead guitar was average and the drumming was a bit louder, it could be a great demo. But guess what? it isn't...\n\nWell anyway, get this demo for the beastly vocals and outstanding riffs. If you like thrash you won't regret about this stuff because it's a really good demo with some weak spots, but if you can rise above it, you'll eventually gonna have some pretty enjoyable listenings!\n",
        "\nThere are only few classic bands, that today sound as good as they sounded back in the mid-80’s. Possessed is one of these bands. It sounds like thrash metal put in a blender with rawness and a bit of brutality. Nowadays, we’re living in a world of drum machines and stuff that make music faster and faster(and more brutal?). Still, Possessed’s sound is something hard to explain. It’s unique, it’s raw and it’s fast. It’s clear, that Possessed was something never heard before in the early and mid-80’s. To me, this album sounds like early Slayer with a bit more aggression. And that can’t be bad, can it? Well, enough of this worshipping-crap.\n\nSeven Churches starts with a true classic song, ‘’The Exorcist’’. The first time I listened to this song, it sounded like total chaos. After some closer listening, it all started to take form. There is this simple riff, but somehow Possessed managed to make it sound great. The guitars sound very raw and evil, and are played low. And then Jeff Becerra’s vocals kick in. And oh boy, what a singing style! He shouts, he growls, and it’s great! I can only imagine how sore his throat must’ve been after the recording session. You just wait for the moment when his voice starts to loose it’s power, but it doesn’t happend.\n\nPossessed almost manage to keep their line troughout the album. After ‘’The Exorcist’’, a song called ‘’Pentagram’’ kicks in with an evil growling from probably Satan himself. Another great song with a bit slower start, but in the half-way the drums start the thrash-beat again and Lalonde’s and Torrao’s solos come in. Even though all the songs sound a bit the same with lyrics about Satan and death and thrash-beats and insane solos, there’s still something interesting in each song. You just don’t want to stop listening (and headbanging!) to this album. And you can even have some good laughs by reading the lyrics. Or how does the phrase ‘’Hell evil Satan’s curse’’ sound to you?\n\nBy saying ‘’almost’’ I mean the two songs, ‘’Holy Hell’’ and ‘’Twisted Minds’’. They are the weakest links in this album, but still they are not ‘’non-listenable’’-bad. But, you don’t have to wait long for a song to repair this gap. It’s the final track, ‘’Death Metal’’, and it’s the best song in this album, no argues in this. Yet again, a simple riff played over and over again with rage. Simple verse-chorus-solo-pattern works great. The chorus is very catchy even though it has only two words in it. Then, in the middle, the band kind of slows down to recharge their batteries, but what the hell, the batteries are full! Becerra starts another of Mike Torrao’s insane solos with his ‘’Kill them pigs!’’-scream and the headbanging starts again. This is a song you have to listen again and again and again... Brilliant.\n\nOnly one question lies ahead; will this album last for another two decades? I think it will. This is something remarkable in the history of metal, this is one of the starting signals of death metal, this was, is and will be death metal. The only reason why I didn’t give full points is that this isn’t a perfect album and I haven’t yet found one. So throw away your melodic death metal-albums and get Seven Churches. Be possessed.\n",
        "\nThe first release from the death metal pioneers is actually not really death metal. This is pretty much thrash, it's heavy as fuck, but it's not quite death metal. The brutality in the production and vocals that were so inflential on Seven Churches are not present here. The production is actually alot cleaner sounding and the vocals are not a gutteral. \n\nDeath Metal is of course the highlight, and although it's not nearly as awsomely brutal as it is on Seven Churches this song still kicks ass. A faster, thrashier version is found here. Could easily have been on Hell Awaits in this form. \n\nEvil Warriors is next and kind of worthless. I always thought this was the weakest song on Seven Churches. It is so much less brutal than the rest of Possessed songs from this era. \n\nBurning In Hell is slow on here compared to Seven Churches. It is otherwise identical to that version. \n\nI have a bootleg with Fallen Angel. I actually prefer that version over the Seven Churches version, it feels less forced. So this demo is definiely worth getting. It's worth it even to see the progression of extreme thrash that would become death metal.\n",
        "\n\"Not much on the recording.\nIt was recorded 01/26/87 in Parma Ohio\nThe Clubs in this are made it a policy ro record\nalot of their shows for legal purposes\"\n\nNot even these words can break the joy of me owning Possessed live material. And to be honest, I really prefer this classic 80's live sound.\n\nIt starts off with the announcers presentation of the band and Sus's warmup drumming. Already chills in my spine starts to appear.\n\"PO...!? PO...!? FUCKING POSSESSED!!!\"\n\n\"March to Die\" is not the best opening track if you ask me, but it immediatly takes you back to the old 80's clubs and makes you want to shoot yourself for not being born 15 years earlier. \n\nNow, the most important thing on reviewing a live album is the sound. The sound is like I mentioned \"bootleggy\", but it is almost ideal for Possessed. You can hear the riffs perfectly (maybe it´s becuase I know how they go) and the vocals are really hearable! \n\nAlong comes some cool pictures of old flyers with Exodus, Dark Angel, Cryptic Slaughter and the classic pictures of Possessed. The layout however is quite ugly. blurry cover with just inverted member pics from the \"Seven Churches\" album. \nBut it´s still worth the money, I strongly recommend all death metal heads to buy this great live album!\n",
        "\nThis is the one album that has SO much controversy; nobody is exactly sure what to call it. Seven Churches is believed to be the “first death metal” album ever made. To a certain degree, I can agree with that. I believe that the term Death Metal in that era was really just a nickname for such brutal thrash metal, also considering the facts that many also consider Kreator’s pleasure to kill to also be Death Metal, AND how Death Metal itself as a genre did not take place till Death’s Scream Bloody Gore was released. Sure, for it’s time, it could have been Death Metal for what it was, but really, since Death Metal didn’t take place till S.B.G. I am therefore going to call this a Thrash metal album. \n\nSeven Churches is a classic without a doubt, and since I LOVE thrash metal, especially 80’s Thrash, really makes me love this one a lot more. Unfortunately, and I am sure that it has been thought by many, this is a VERY over-hyped/over-rated album. To compare this to S.B.G., I like Death’s album much more, because I really think that this is MUCH too sloppy and unstructured. I love it either way, but that really makes me wonder if I should give it a 90. Originally, I was gonna give it am 95 at the most, but I really thought about it, and felt it should get a 90. NOT a 100 percent worthy album or a 95, but a 90 isn’t too damn shabby. Some of the reasons for me giving it a lower rating than everybody else is because as was said earlier, it’s over-rated, WAY too much reverb on ALL the instruments, sometimes you hear the same guitar solo in a few of the songs, and most importantly the songs are TOO short. \n\nTo start the album off, we have The Exorcist. It starts off with the tubular bells intro, and if you listen to it carefully, it is played a little wrong by I believe ONE note. It’s funny how ONE note can make a BIG difference, but still. Once the song kicks in, we get introduced to one of the heaviest songs EVER! The lyrics are piercing, the vocals are crucifying, and the music is insanely brutal. Need I also mention a POSSIBLE influence to the ALBUM (not exactly an influence to the band) This album has a similar sound the Speed Metal group Exorcist, particularly in the vocals, even though Possessed has been around longer, but it seems like they could be a possible influence. Maybe even a somewhat tribute to them with this song? One of the highlight tracks. 10/10\n\nPentagram is up next, which starts off with a very demonic growl for about a few seconds, THEN it kicks in. I personally do not like the intro riff, but after that passes, the rest of the song kicks ass. HELLA HEAVY! Not much to say other than that. 8/10 \n\nBurning In Hell is a REAL headbanger. Instead of starting it off with little crazy intro’s to accent the songs, they cut right to the chase and deliver a HEAVY ass tune here. VERY Brutal sounding and a MAJOY headbanging tune. I bet back in the day, this song was probably considered to be a real Wall of sound because of how heavy this one is. DEFINITELY one of the highlights. 9/10\n\nEvil Warriors is not bad. I love this one, and it’s hell-a heavy, brutal, and crazy. This one sounds like it was written for the purpose of headbanging, because it’s NON STOP Heavy. Cool guitar solo, and Jeff gives off a real evil scream on this one. Almost never heard a vocalist sound so horrifying on a CD before. SIX SIX SIX!!!!! 9/10\n\nThis next one is the self titled track Seven Churches. The intro riff to this one is really crucifying, but it’s played a little too fast for the drums because it goes off beat with this one, which I think makes this song not very great. Even though the funny thing is, this one is one of my favorite songs on here, and probably my top 3 favorite tracks. 9/10. \n\nSatan’s Curse is not that great of a song. Actually, I find this song to kinda fail to have the same amount of horror and shock that the other songs bring. But also, it’s very different from the other songs that this album has all because it’s less brutal (at least in my eyes). Not really one of the best, but good because it’s not like the others. 7/10\n\nHoly Hell is a crazy song. This one kinda reminds me of songs that have been played by Macabre (who was also considered to be one of the first Death Metal bands). This one is a real headbanger as well, BUT also does lack some. Not really a track I would like to listen to ALL the time, but also, it’s NOT too bad. Tolerable but not loved. 7/10. \n\nTwisted Minds – this one is finally a track with length to it. Actually this one is the longest album on the record. Starts off slow, then as it continues, it gets faster, BUT it doesn’t get that much faster. Not exactly a head banger, but the Jeff gives off some real good yells/screams with this song. 8/10\n\nFallen Angel goes back to the routes of the first 2 tracks with the sound effect intros before the song gets heavy. This one is a PURE Thrash song, and really delivers. A REAL Headbanger, BUT also somewhat lacks as Holy Hell and Satan’s Curse. However, I do enjoy this one because of the bells at the intro which give it a more chilling sound. 8/10\n\nNow, my favorite Possessed song and the BEST and MOST different song on the album DEATH METAL! The lyrics are VERY appealing. The double kicks at the intro help make the song different from some of the others. Definitely the MOST brutal song on the album and is very intimidating. So intimidating that bands who have covered it have not even made a good enough attempt to make it as the same league as these guy’s version. If Possessed was to make a music video, this would be the song to make it, and in the concerts, this is the song that would probably get the crowd going violent. Definitely an innovator and a true classic. \n\nBOTTOMLINE: Though this album is very overrated, and many have made it seem SO great that Scream Bloody Gore does not live up to it’s own hype. I still prefer Scream Bloody Gore by Death over this album BUT that doesn’t mean this album isn’t great. It’s a classic and like most people who have heard it, it is highly recommended. Especially since it is not only an innovator, but it HELPED Death metal come into play (it did NOT create it like many say, because this is just Thrash Metal played to a more extreme demeanor.) If you find it, do NOT Hesitate, and buy it IMMEDIATELY!\n",
        "\nThis is by far the thrashiest album I've heard put out by Possessed. It's a pity it's only five songs. There isn't one song where you listen and just go, \"Eh..Next track.\" That's just not a possible reaction to this CD.\n\nThe guitar work on this EP is just amazing and I think that's mostly due to Joe Santriani producing it and I've heard he also gave the guitarist lessons. Every song is cocked-full of catchy, timely riffs. Never a dull moment riff-wise. The drumming is your typical thrash drumming and it done well. Nothing too special, but it matches the music perfectly. The vocals sound pretty similar Lemmy at time. They go in nice with the music. They sound so tortured and full of agony which is perfect for Possessed's style of thrash. Nothing special about the bass. It does it part and nothing more.\n\nIf you have not heard this EP and are a fan of Possessed, or just a fan of thrash for that matter, I highly recommend you pick this EP up. You will not regret it.\n\nChoice tracks: All.\n\nThrowaway tracks: None.\n",
        "\nThis is no Seven Churches. That is a basic fact, and is not meant as a knock against the album, as there are very few albums that are Seven Churches, or at least of comparable levels of quality, influence, and downright awesomeness.\n\nThis one does not have the influence, or quite as much compositional quality. However, it does have the downright awesomeness. This is not the seminal death-metal release that the one before it was; instead, this is pretty much a standard thrash LP. The previous was a hallmark for 1985, the year of Hell Awaits and Bonded by Blood. This one is a thrash LP for a year of oh-so-many thrash albums, where the genre started to splinter horribly - Kreator, Slayer, Dark Angel being the vanguard that exploded the genre further and further away from the Piranhas and the Chemical Warfares of the world... newer levels of brutality that echoed the previous Possessed, and also the works of Sepultura, Bathory, Hellhammer, Slaughter, and other extreme metal.\n\nOn the other end, thrash was starting to come up lame, as everyone and his grandmother decided that they too could write simple basher riffs and get away with it. I can't really think offhand of an also-ran thrash LP from '85, but I can think of plenty from '86... Cyclone, anyone? I won't even get into the bastardisation of the genre, and of metal as a whole, that arrived with Metallica - I'll just note that by 1986, thrash was done as an artform with three releases, and anything that came out during or after that year was at best a real fucking banger.\n\nThis one is a real FUCKING banger!! And thus, I will stop comparing it to its predecessor, and evaluate it as it is. A vicious, completely out-there guitar tone, reminiscent of the first Coroner demo at times, combined with extremely crisp and tight riffage... these guys have taken palm-muting to levels even Anthrax could only dream about, throwing together single-note midpaced mosh riffs to rival any other band out there for sheer headbangability. \n\nHighlights... the Heretic starts with the little opener, and then goes into a riff-set that is fundamentally based on one five-note riff, with the other instrument providing the occasional expansion to this one theme. A simple and effective song. No Will to Live starts off as the fastest song, reminiscent most of Venom for sheer speed, but Slayer for tightness of riffage, before turning in the middle into an excellent top-speed \"bang your head against the stage\" single-note all-downstroke brutal onslaught. Seance contains a classic thrash middle break, as does Tribulation, which also has a very nifty solo. Possessed's solos are a bit cleaner on here than on the previous album, though both have that subtle melodic sensibility to them. It's more the tone that differentiates better between lead and rhythm, as opposed to the blurring of the two so prevalent on the previous LP. Becerra still sounds evil, though maybe a bit less overtly demonic, and returning a bit more to his Cronos roots. Phantasm has probably the most memorable intro riff here. \n\nThis album is overall more catchy than the first one, and certainly more easily accessible. Is this album to be framed on the wall as the be-all end-all of extreme music? Nope. But is it to be purchased and enjoyed repeatedly? FUCK YES. The only thing I can hold against this album is the shadow of its predecessor - you'd expect Possessed to not take such a step back, but even as they do, they are still within the second-ranks, right behind the big three extreme thrash LPs of the year, and far the fuck ahead of your average Living Death or whatnot.\n",
        "\nI'd like to quote Chorazaim (from Megiddo fame), from his review of this very same album: \"if you've never heard this, forget everything you think you know about death/black metal, as you don't know shit\". That could leave the review right there. From everywhere I go and see, so called \"death metalheads\" \"proudly\" stand from \"the rest\", even if they never heard the Possessed name, and how vital they and their music are to the birth of the genre.\n\nFuck them.\n\nThe album begins with 'frightening intro' and then kicks off with \"The Exorcist\". Pure fucking mayhem, as the incredibly well done production on this album preserved all the sheer malignant viciousness that was the soul of this band. Drumming is a bit unusual in the verses, and some brickheads would have a hard time trying to appreciate the whole spectrum of the songs because of this, but less power to them, I guess. \"Pentagram\" starts a bit \"dancey\", but it is still malignant as hell. This album doesn't have the best lyrics on the genre, but these are strictly to-the-point and have the passion that most of by-the-book death metal bands seem to lack these days. \n\n\"Burning in Hell\" starts off fast, but waste no time and after a short good-old-fashioned lead guitar interchange, here comes this riff!!! Fucking evil and mercilessly crushing, it takes your head and apply enough pressure to have your brain come out of your nose. Awesome vocals to complement (you can never have enough of those animal-like vocals, courtesy of Jeff Becerra, the man that, to me, INVENTED the classic death metal vocal style). \n\nMore highlights: \"Evil Warriors\", great lead guitar, amazing riffs, nice breakdown somewhere in the middle (the \"aaaaaaaarrrghh\" and \"six six six!!\" parts). \"Twisted Minds\", great alternation between fast and midpaced riffing. And no, it doesn't let go, quit being a pussy and headbang, dammit! \"Death Metal\" ends the album in a great straightforward fashion as it is the simplest (but among the best) song here.\n\nI could have done a song-by-song revision, but we all know how boring those are. Just a few more words, in case mine or the other reviews haven't convinced you to pick this up: 0% filler, non-pussy material, headed directly to your throat, death METAL!!!!! Still not convinced? Take your chances and get this. Waste no time, chances are that you'll like it. Of course, if you're a true metalhead, if you're not....well, you know what I think of you.\n",
        "\nOr thrash, or even speed metal! This demo is what started it all, in 1984... though at times it sounds more like a tight-as-fuck Venom (Becerra does a wicked Cronos at times!), and it's interesting to note how much thrashier this is than the Seven Churches LP.\n\nExhibit one: the title track, riff at 1.30 - that is a pure fucking thrash riff, and it's gone in the final version, replaced by a faster, higher-pitched, less overtly bludgeoning thrash riff. But here, it's a raging thrasher not unlike Chemical Warfare. The drum flurry kicks in and the slightly faster, more chaotic riff, and then the solo - though it's kind of interesting that it sounds like there's only one guitar during the solo sections... apparently Brian Montana was completely asleep on the job! Oh yeah and how about that closing shriek before the final solo. Mark Osegueda, eat your heart out. And take Tom Araya with you while you're there. Becerra's vox are fucking awesome.\n\nEvil Warriors: SCREAM OUT IN FRIGHT!! Little silly vocal intro, then the song is roughly similar to the Seven Churches version. As I said, the demo is superficially identical to the LP, including the total fucking ruleage of \"Burning in Hell\"... it's only if you're a Possessed fucking freak like me that you'll notice the little things like \"hey wait a minute, that riff is slightly different\". One more example... the melodic counterpoint riff in Burning in Hell is more overt, though under this solo there are definitely two guitars and the solo a lot sloppier and Hanneman-ish and directionless, so let's blame Brian Montana, but after that, the wicked thrash break (you know which one!) is more overt than on the LP.\n\nThus, to recap... it's thrashier, with the riffs a bit more accented. The vocals aren't quite as out-there... I hear Black Metal on Death Metal, and also a little bit of \"blasting our way through the boundaries of Hell...\". The solos aren't as cool sometimes, and at times the riff under the solo is missing (Death Metal), oh and Fallen Angel doesn't have any bells.\n\nWait, Fallen Angel isn't even on this demo!! There's 2 versions or something - I have no idea what the story is but some bootlegs have Fallen Angel, others do not... in any case, it was recorded at the same time. \n\nSo is it any good? Of course it's good!!! It's fucking awesome!! What it lacks in sheer must-kill, it makes up for in thrashing goodness. This one definitely qualifies as death metal, just like the album that succeeded it... and just like that one, it's a good solid slab of thrash. Worth getting - historical value: unbelievably high. Musical value: just about as high. The only complaint is that Montana's solos are goofy and not nearly as focused as those of Lalonde, and the guitar tone is far more ordinary... but enough of my bitching... there's only one Seven Churches, but this is damn close.\n",
        "\nDeath metal just should've kinda stopped right here. I mean Possessed had it all figured it out, that you are really not supposed to take out the thrash riffs and replace them with entrails and cunts. \n\nThis album seems to be the next logical step after Slayer's \"Chemical Warfare\" in the vein of extreme music. Similar thrash ideals to \"Hell Awaits\" are combined with insane fucking vocals, and a guitar tone that will rip your arms in half and shove them into your gallbladder. The death-metal sense of chaos is definitely evident, without resorting to the self-mockery of many later albums that just can't figure out where the riffs went.\n\nThere is also a very well-defined sense of melody to be found here. Slayer's \"Show no Mercy\" is approximately the best analogy for how the guitar solos sound, though Judas Priest \"Stained Class\" may be even more appropriate. Not overall shredding, and the solos don't sound \"pretty\" in the classical sense, but they avoid Slayer's \"cat in a blender\" wankery in the name of general memorability. The opening to \"The Exorcist\" manages to be both frightening and catchy at the same time, as does most everything else here. The lead work also tends to worm its way into the rhythm guitar at times, with riffs resembling those of Whiplash abundant on this album - think of the intro to \"Power Thrashing Death\" and you've got a decent idea of some of the riffs here. This idea of course would be completely bastardised by later death metal bands who needed a quick counterpoint to the wall of noise, but here it is used to its full potential.\n\nGreat songs? All of them! Especially \"Burning in Hell\" - my absolute favourite, and maybe the greatest death metal song ever. Also, \"Death Metal\", \"The Exorcist\"... Hell, they're all, at the very least, excellent. SATAN SAYS THIS ALBUM OWNS YOU!!!\n\nYep, the first death metal album. And it hasn't been topped. Nocturnus had some good stuff in \"The Key\", as did Atheist in \"Piece of Time\". \"Scream Bloody Gore\" and the related demos were also pretty nice, and has a lot of similar ideals, but this is just fucking awesome to the N+3rd power!!\n",
        "\nWhen POSSESSED hit the scene in 1984 with their Death Metal demo, they generated an underground buzz the likes of which had rarely been seen before - here were some San Francisco kids more on a first-name basis with Satan than the VENOM guys, yet playing metal that, though faster and heavier than anything of the time, still retained a very refined sense of musicianship. People were going nuts to hear them, and when Combat finally signed them and released their debut album Seven Churches, less than a year after their formation, they were not disappointed in the least. (And neither was Combat - Seven Churches was the label's biggest-selling album.) After an eerie intro lifted from MIKE OLDFIELD's Tubular Bells, the album explodes into the heavier-than-hell opener \"The Exorcist\", and for ten songs the band doesn't let up one little bit. It is to producer Randy Burns' credit that the album sounds as raw as it does, but he focuses the chaos perfectly, getting great sounds and mixing them expertly to generate one of the best sounding metal albums ever. (He went on to produce MEGADETH's debut and DARK ANGEL's Darkness Descends, but that's another review . . . ) The drums are crisp. The bass is full and round. The guitars are HUGE, crunchy on the rhythms and screaming on the leads. And the vocals sound straight out of hell. \n\nOf course, as METALLICA proved with \"the black album\" and Load, garbage in, garbage out, but fortunately Randy had some great stuff to work with. Except for detuning, Possessed epitomized death metal just as it founded it: superfast riffs, machine-gun drums, crazy solos, and the guttural growl of Jeff Becerra's vocals. But there is so much more there too: \"The Exorcist\" isn't just fast - it's all over the damn place. So is the stellar title track \"Seven Churches\". And then there are the riffs in \"Pentagram\" and \"Burning In Hell\" - so fast they sound like blurs. And then there's the constantly- morphing compositional masterpiece \"Twisted Minds\" - visiting more musical feels in one song than some modern death bands visit on entire albums. But, of course, there's also plenty of just 'crush-your-head' brutality, like \"Satan's Curse\", \"Evil Warriors\" and of course, \"Death Metal.\" \n\nMike Sus amazingly not only keeps up with Possessed's breakneck tempos, he stays ahead of them, sounding like a percussion whirlwind with four feet for kick-drums. The twin-guitar attack of Mike Torrao and Larry Lalonde (yes, THAT Larry Lalonde) is relentless. They shred rhythms like there's no tomorrow, and then take off on leads that are at once chaotic and perfectly appropriate. Torrao tended more to going nuts on the whammy bar while Lalonde leaned towards shredding modes and scales, but they frequently crossed into each other's territory. And finally, Jeff Becerra, the bassist, vocalist, and frontman, played all duties admirably - the basslines support the riffs and fill them out, while his vocals draw the line between metal and death, and have surely inspired thousands of fans to raw throats: a death-edged shout that everyone from Chuck [Schuldiner] and Co. on down has tried to copy, with ear-piercing screams thrown in for good measure. \n\n(Originally published at LARM and Eternal Frost Webzine #1, (c) 1998)\n"
    ]
}