{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Los Angeles, California; Connecticut; New York",
        "Status:": "Active",
        "Formed in:": "1975",
        "Genre:": "Hard Rock/Heavy Metal",
        "Lyrical themes:": "Fantasy, Rock (early); Relationships, Love",
        "Current label:": "Eagle Rock Entertainment",
        "Years active:": "\n1975-1984,\n1994-1997,\n2015-present ",
        "Number of Reviews": 77
    },
    "Band Reviews": [
        "\nFollowing the hiring of a new rhythm section and keyboardist in 1975, Rainbow’s second album had marked the band’s evolution into one of the most fearsome hard rock groups of the 70s. ‘Rising’ showed a marked progression from the debut album in terms of musicianship, songwriting complexity and arrangements, particularly in the epic and orchestral ‘Stargazer’. Most notable of all, however, was the increase in the speed and intensity of the playing on the record, especially from drummer Cozy Powell, showing how tightly knit and musically adventurous the new line up was. In the dramatic singing and showmanship of Ronnie James Dio guitarist and band leader Ritchie Blackmore seemed to have found his new foil to succeed Ian Gillan, although again just like the initial period of Mk2 Deep Purple the musical achievements would soon be undermined by intra-band acrimony. \n\n‘Rising’ had laid down a serious marker, but tensions in the band were already mounting by the time they headed out on a European tour in the summer and autumn of 1976. Blackmore’s perfectionism had already resulted in keyboardist Tony Carey being fired and then reinstated after a concert in Newcastle, marking the start of what would be an ever-fluid situation in the band’s line up. By the next year, Carey and bassist Jimmy Bain would no longer be in the group. However the unease in the Rainbow camp did not seem to affect their emerging force and majesty in the live arena. As with Deep Purple at the start of the decade, Rainbow had quickly gained a reputation for intense and epic live shows, and again as with Deep Purple the focus was on Blackmore’s playing, and the man on the microphone. \n\nIt is interesting how some locations seem to energise an artist’s performances more than others, and Blackmore has always seemed throughout his career to play particularly well in Germany. Perhaps it was with this in mind that the tapes were rolling when Rainbow started the West German leg of their tour in September, with a view to releasing a live album. However, while ‘On Stage’ (released the following year) would partially draw on the German shows for its source material, the full tapes lay in the vaults for some years before the best performances were finally selected and compiled for this archival release in 1990.\n\nQuite why it took so long to eventually release these performances is a mystery, because this album is excellent from start to finish. First off, the energy level displayed by the band here is insane. The record kicks off with ‘Kill The King’ (a song still unreleased at that point) at a tempo which can best be described as “barnstorming”, and doesn’t let up… um… EVER. The group as a whole are very, very tightly knit onstage indeed, performing with a seemingly effortless mix of improvisational brilliance and the total discipline required to play such long and intricate songs. You know side 2 of ‘Rising’? The complete interweaving of guitars and keyboards, the vocals soaring operatically over the music, the sheer pummelling of the bass and drums, their grounding underpinning the guitars and keyboards to go totally off the chain on wild, free-running scales and melodies? This entire album is like that, except MORE so. \n\nIt’s very clear from the word go that this is Blackmore’s record, as he conducts and leads the band onstage in the manner of a classical composer. In complete and total control of his musical vision and stage performance, he pushes his playing to what is arguably his absolute peak, outdoing even his Deep Purple highs. There is almost nothing he doesn’t do with his guitar on here – wildly aggressive metal riffage, insanely over the top soloing, Hendrix-style pyrotechnics, holding and pushing individual notes to the point where his instrument is outright wailing…. Two years later Eddie Van Halen would turn the guitar hero scene on its head, but practically everything he did is already being done by Ritchie here, and about a thousand times wilder. Appropriately (given the location of the performances) Blackmore’s playing has a Baroque grandeur and intricacy to it, emphasised by the flourishes put into the music – the quiet repeating motifs or passages that serve as the introduction to a few of the songs, the fast and speedy guitar runs, the intensive use of scales and arpeggios in the solos (many complemented by the keyboards), the little classical snippets and shout outs dropped into the playing here and there, all done with such ease and fluidity, seamlessly integrating into the overall onstage sound. The playing on this record alone underlines Blackmore’s legendary status and firmly cements his reputation as one of the top two or three guitarists of his era, if not all time.\n\nThe rest of the band, though, are not exactly slouches either – Dio is in rampaging voice throughout (this might be one of the best examples of his own live prowess), Bain and Powell are a formidable rhythm section, and Carey’s intricate keyboard playing perfectly interweaves with and plays off from Blackmore’s guitar lines, the two trading complementing solos throughout the entire album. On nearly every song, the musicianship and performances are taken to their nth degree and pushed further and further until you think the band can’t possibly go higher, then they do. The version of ‘Sixteenth Century Greensleeves’ on here completely annihilates the original studio recording, pitching the intensity up further all the time until by the end of the song the band and Dio just keep pushing themselves on and on and on until the listener feels like they’re riding a Saturn V to the Moon.\n\nAnd that’s just ONE song. Almost every rendition on here goes miles beyond the studio versions in terms of tempo, intensity, ferocity, length… everything. The old Deep Purple standard ‘Mistreated’ is given a new life by Dio’s grandiose and full-blooded approach and the extended Blackmore intro, plus the call and response bit between the two at the end. ‘Catch The Rainbow’ here is extended into fifteen minutes of ferocious Blackmore soloing that surpasses anything he’d laid down on tape previously, turning the song into a complete epic. The old Yardbirds song ‘Still I’m Sad’ is turned upside down and spun around until the audience is reeling, becoming a vehicle for Powell’s drum solo, and it’s then followed by ‘Do You Close Your Eyes’, extended to several times its original length, with duelling guitar and keyboard antics closing the show in some style.\n\nThen there’s ‘Stargazer’. Oh yes, this is probably one of the main selling points of the record – other Rainbow live albums from the 70s don’t have the band’s signature epic on them, and to some extent you can see why – the orchestral ambience and approach of the studio version is hard to fully recapture live in quite the same mysterious and atmospheric way. But that’s more than made up for by this particular live rendition being a seventeen minute long cosmic trip. Five minutes of that is the atmospheric and intricate Carey keyboard solo that introduces it. Another six minutes is taken up by Blackmore’s guitar solo which is not really possible to describe adequately in words, save that it basically takes the listener on a magic carpet ride. You really do feel that you’re flying through the cosmos when it’s going on. It's a bit of a shame that the band conclude the song relatively abruptly when things come back down to earth, instead of extending the coda even further like the studio version does, but you can't really fault this rendition otherwise - it's epic in every sense of the word.\n\nThe only slight let down in the performances is ‘Man On The Silver Mountain’, which is (like everything else) extended and improvised upon and played about with, but in the process loses much of the conciseness and punch of the studio original, not helped by the fact that Dio doesn’t go for the soaring high notes in the chorus but stays at a lower level instead. It’s still quite a fun rendition, but seems rather lacking by contrast to everything else on here. Another slight issue is that the tracks are taken from different gigs, so there are fade outs between each song, which rather disrupts the momentum of the album as a whole. (It is worth noting, however, that the individual shows from which these performances were taken from were also released on CD in the mid 2000s, so if you really want to dive into the German tour and listen to a single show then it is now possible to do so). Finally, the actual recordings are pretty good quality, but there is a slight over-emphasis on the vocals in the mix at times (though it’s liveable with), and the mastering of the CD version is pretty quiet – this needs to have the amp cranked a fair way up for full effect. \n\nBut that isn’t too much of an issue, because you will be cranking the SHIT out of this, time and time again. It is an absolute titan of a live album, wild and in the raw (no overdubs or splicing here) no quarter given and no holds barred, a band in full flight and reaching for the stars and remains to this day possibly the fullest realisation of Blackmore and Rainbow's creative and technical prowess. It is also an essential part of the interweaved and complex Rainbow/Deep Purple saga which is one of the cornerstones of heavy metal – anyone with an interest in the epic and fantastical side of the genre would do well to listen to this and ‘Rising’ and take notes.\n\nMost of all, though, this album shows just how far the hard rock genre was being pushed in the mid-70s, both in terms of song writing and live spectacle, and how much sheer invention, musicianship and abundant creativity flourished during that era. The performances here are the Baroque style taken to the ultimate extreme, amped up and played at mind bending speed, intensity and intricacy. Rainbow on stage during this period seemed if anything closer to full on progressive rock or maybe even rock/classical fusion, and it would have been interesting to see where they might have gone with this idea had Blackmore wished to push it further. However, it wasn’t to be, and after Dio’s departure a few years later the band would shift in a much more commercially oriented and less thrilling direction, gearing themselves towards US radio and an era as arena headliners that, while commercially successful, very much paled in comparison to the lightning in a bottle majesty and power that is captured on this album.\n\nIn the pantheon of classic live albums there are many well-loved and renowned records - Made In Japan, Live After Death, Live And Dangerous - that will feature on many a critic’s list or fan’s top ten, year after year. This album deserves to be among them as possibly the finest example of live 70s hard rock ever released. Very, very highly recommended for all fans of hard rock, heavy metal and epic music as a whole. If you want to understand why Ritchie Blackmore is one of the greatest guitarists of the past half-century, start here.\n",
        "\nThis album was the beginning of my journey into the world of metal, thus, this will be my first album review I write. Ritchie Blackmore picked up musicians from Ronnie James Dio's band Elf, and formed a solo project. This stemmed from Purple's rejection of Blackmore's suggestion of covering the song 'Black Sheep of the Family,' but I am sure you all know the background so I will jump into this album.\n\nRitchie Blackmore's Rainbow is an instant classic, as they say. The opener 'Man on the Silver Mountain,' is an amazing song with a crunching Blackmore riff reminiscent of 'Smoke on the Water.' This song will always be a favorite of mine. Even near the beginning of Dio's career, his voice is so strong, developed, and articulate. You can tell Blackmore is having fun with this album because it's just so enjoyable. The union of Dio's voice and Blackmore's riffs and neoclassical style is just magical. The next track, 'Self Portrait,' is another great song. The way Dio shouts, \"DOWN!\" and leads into the guitar solo is amazing. Next comes the cover, 'Black Sheep of the Family.' It's a shame Blackmore's idea was rejected, I can totally picture Coverdale and Hughes harmonizing the lyrics to this song. However, I am ever grateful for the Rainbow project, and the Blackmore-Dio union. This is a great song, and Rainbow does it justice. \n\nNext comes, 'Catch the Rainbow.\" This song is the softest on the album, but it's one of the best, maybe the best. Nope the best. Especially listening to this song more than a decade since Dio's passing... almost brings a tear to my eye. \n\nAnd sail away on ships of wonder\nBut life's not a wheel\nWith chains made of steel\nSo bless me, oh, bless me, bless me\nCome the dawn... \n\nSuch a beautiful song. Just pure bliss for me. Slow and melodic guitar parts, and Dio matches it well. Some may think it goes on a little too long towards the end and kind of peters out, but I love that part. It just adds to the song's beauty. Moving on to 'Snake Charmer.' This song is a great example of Blackmore's eastern playing style. This would fit right in on the 'Long Live Rock 'N' Roll' album that would come three years later. Very upbeat song, similar to 'Black Sheep of the Family,' but I don't like this one as much. Still a great song in my opinion. The next song 'The Temple of the King,' seems to appeal to a lot of fans. I tend to agree, but a bit overrated I'd say. It's another slow song, and it's acoustic. Very stripped down, and displays the fantasy/medieval lyrics of Dio, which will continue to be ever present in Dio's career. The song builds up very nicely, and is well crafted overall. \n\nThen comes 'If You Don't Like Rock N Roll.\" This is a very short piano rock tune, that seems like they pulled from an Elf album, but they didn't. I'd prefer a lot of Elf's music over this song. This hurts the album slightly as it's the only song that isn't up to snuff. It can still be enjoyable, but it kind of goes against the mood of the album. 'Sixteenth Century Greensleeves' is the last song before the instrumental. This is definitely one of my favorites in their discography. So much emotion on Dio's voice, the guitars riffs are haunting, and the solo is magical and fits the mood of the song so well. This songs builds up so well, however, I wish it didn't fade out. It deserves a proper ending. \n\nNo more night\nWe have seen the light\nLet it shine on bright\nHang him HIGHER, HIGHER\nPut a man on the fire\n\nDrawbridge down\nCut it to the ground\nWe're going to dance around the fire\nThe FIRE, FIRE\n\nThe last song, an instrumental, 'Still I'm Sad' is a Yardbirds cover. It's a great tune. Not much to say, but Blackmore does a great job of making it very epic with his playing. When Blackmore revived the project in 1995 and released 'Stranger in Us All,' he rereleased the song, but with lyrics. I recommend that version. \n\nWell that's it, a review of one of my favorite albums of one of my favorite bands. The Blackmore-Dio combo is truly amazing, and the other musicians from Elf did an adequate job of supporting, but they are no Cozy Powell or JImmy Bain. Just listen to their next album Rising. Truly a masterpiece. The artwork is very cool and fitting for the music, but it's so vintage, it hurts my eyes. The album marks the birth of Dio's career. I don't quite count Elf or his previous bands, though I do enjoy the three albums they did, particularly the first. What an amazing start. \n\nR.I.P. Ronnie James Dio (1942-2010) \n",
        "\nMotivated by the radio success of \"Down to the Earth\", Ritchie Blackmore renewed his line-up with the incorporations of Joe Lynn Turner (vocals) and Bob Rondinelli (drums) with the intention of polishing the new Rainbow's sound. Altough the band kept the envisioned musical direction, differences are still noticeable in comparison with the album's predecessor. At a first glance, one can be able to identify here a softer sound somehow inspired by Head East and Foreigner whereas the aforementioned predecessor displays a harder and more rocking sound, with some small traces from the earlier works. Furthermore, Turner clean high-pitched vocals allowed additional focus on melody, so as a result, the songs in this release are more emotional and pretty much identified with the cloying formulas used by the AOR bands at that time and characterizing the studio recording styles at the beginning of the 80s.\n\nThe opening track (a Head East cover), is one of the few shining moments here. Injected with a more hard rocking feeling in the vein Blackmore is used to do so, this number is one of the most Head East-inspired and a brilliant moment. As much brilliant is the next speedish number, with the interesting guitar-keyboards duel proposal. However, these songs do not seem to properly stick together, and to make things worse, the promise is vanished thereinafter when the band start to drink from the jar of \"what the fuck\".\n\nOne can't question Blackmore's abilities with the instrument, but when it comes to make certain songwriting choices, he proves to be erratic in some passages. Perhaps, this should be due to his intentions of simplifying his style and avoid overwhelming the listeners with complex riffs. Consequently, his guitar playing became unmemorable at all and the songs result boring. For instance, it is hard to stand for a long time listening to \"No Release\" given that the riffs are not interesting enough for a mid-paced number, especially, taking into account how silly the middle part of this number sounds like.\n\nOn the other hand, the last number is disappointing at the best, as it is criminally synth-drunk (even more than a Stratovarius instrumental), not to mention how foolish are the tone choices for that instrument. It is weird and makes no sense in this album, and if Blackmore insisted on mandatorily including this number, then, he should have given more weight to his guitar playing to make it more attractive. Therefore, based on what is listed here, it seems that the Blackmore-Turner formula was wasted and their abilities were not properly capitalized. The lesson that Ritche should have learnt from here is that the idea of picking 4 songs like a single damages the essence of an album, unless the songs stick together with the rest, and are as good as the rest.\n\nYou can also read this review in: https://antichristmagazine.com/review-rainbow-difficult-to-cure-polydor/\n",
        "\nRainbow's third and final album with Ronnie James Dio gets a bad rap. I think a ton of people walk into it expecting it to be an epic like \"Rising\" was when it just isn't. It doesn't mean the quality has dropped any, though. In fact, I even prefer \"Long Live Rock 'n' Roll\" just a touch more. The album is undoubtedly a bit of a messy one, unfortunately. Since it's very hard to tell who played bass and keyboards for what specific points of the album's recording, I won't give any one bassist or keyboardist credit. It's unknown if the final recordings are Blackmore or Bob Daisley on bass, and unknown if it's Tony Carey or David Stone on keys. Blackmore, Dio, and Powell are the only sure things on this record. What \"Long Live Rock 'n' Roll\" might be lacking in epicness, it makes up for in groove, strength, and catchiness\n\nYou need look no further than \"Kill the King\" as proof of this. It's as much of a kick ass headbanging metal track as you can possibly ask for. Blackmore delivers an explosive intro to set the full speed ahead mood that the songs retains the whole way through. Powell and the bass are perfectly enhancing the opening, and Powell is throwing amazing fill after amazing fill on the song. The main verse is high energy, and Dio comes in to increase it. On this track, Dio gives vocals that are an incredible blend of theatrical and purely powerful. He has an almost rushed pace to his delivery, as if the song is in a frenzied panic. His vocals on this song are dramatic in the best way possible. The chorus is an addicting one, and Blackmore's solo doubles down on addicting. With Powell's double bass work kicking the groove into the solo, it's a work of art. The ending is an adrenaline rush that compliments the rest of the song, but also gives it a neat change of pace. \"Kill the King\" isn't an epic, but it's just as good as any. That's not to say the album is without any grandiose songs, either. \"Gates of Babylon\" is right up there with \"Stargazer\" for me. I think I may even prefer it just a bit. The keyboard intro is a cold but beautiful piece that sets a great tone. The main melody of the song has a fantastic middle eastern feel, and the orchestration along the entire track takes it to the next level. Even Blackmore's solo stays faithful to that mood. Dio is set up to tell another fantastic story during the track, and his voice promises us both riches and ruin during it. The way he sings the song is like he's a tour guide to us, and he's warning us not to take the journey, but accepts our choice regardless. His high note on the chorus is one of his best performances ever. Cozy Powell has a brilliant and absolutely underrated shuffle pattern as his main drum beat that gives the song an almost slithering snake-like flow to it. The ending is magical. Dio closes the gates with a vocal strength that lets us know we were too late to heed his warnings, and then a little orchestration plays alone at the end as if to mourn the listener. It's a mystical and unique experience. I can name you about ten songs by other metal bands from the top of my head that have direct and clear influence from \"Gates of Babylon.\" I'm sure it wasn't the first song to made middle eastern flares, but I guarantee it was one of the first in the metal scene.\n\n\"Lady of the Lake\" is the song on the record that I'd call the most underrated. It's definitely not the fanciest song; Blackmore's riffs on the song are very, very simplistic and pretty boring, quite honestly. This one really rides on Dio's majestic voice, and the keyboard choir that rests behind him. His sword and sorcery themes return; fittingly so considering I'm sure the song was based off the King Arthur legend. The chorus is so beautiful, and very, very catchy. Blackmore's solo is also one of his more fantastic ones, and he really nails it in the sense of making a solo that is perfect for the atmosphere of the song. Dio brings the final verse of the song to a boil with even stronger notes than previously in the song. \"Lady of the Lake\" is really about his voice, and the magical aura he is able to craft around it. You can't talk about how great Dio's voice was in reference to this album without nodding to the closer \"Rainbow Eyes.\" It's probably the most beautiful ballad Dio ever sung in his entire career. Everyone talks about \"This Is Your Life\" from his solo career when talking about ballads he's done, but I think \"Rainbow Eyes\" is even better. His voice is about as melodic and beautiful as it ever was in his whole career, and the orchestration behind the whole song just gives it a sad atmosphere as well. It's both a unique and very special feeling song that Dio claims his throne with. I do think it's just a bit too long, and could have cut about a minute off, but it's a minor nitpick for a brilliant song.\n\nThe album has another underrated tune in the form of \"The Shed.\" It doesn't start off too promising, considering the first minute or so is Blackmore giving a very generic and stereotypical noodling solo, but when he decides he's done, he starts the core song with a really heavy and grooving riff. It's a very subtly catchy one. Powell's strong snare hits on every beat give the song a feeling of a train going out of control down the track. Dio's vocals are sly and slick, and his almost sassy and defiant rhythms are a great compliment to Blackmore's dominating riffing. The bass work keeps a nice backbone and pace going the entire way, too. Yet again, \"The Shed\" isn't exactly a fancy track, but it's just awesome pounding traditional metal. Of course, the title track is an absolute anthem of a song, and a catchy, punchy addition to the album on top of it. However, just like \"Rising,\" \"Long Live Rock 'n' Roll\" has one big flaw to it as well. \"Sensitive to Light\" is the album's dumb, unfitting blues snooze of the album. Dio's vocal melodies on the song are so insanely annoying. They are just brimming with that old 60's rock feeling that is so dated and bland for a band that has been so ahead of their time for the most part. Blackmore's riff is another basic and boring one, and the chorus really adds nothing at all. The song really has no variation or interesting transitions to it, so it stays as a one note bore the whole way through. It's baffling to me that the same band could come up with a song like \"Gates of Babylon,\" but then also throw in something like \"Sensitive to Light\" on the very same record.\n\n\"Long Live Rock 'n' Roll\" would pretty much be the end of Rainbow, and, baring a brief but great comeback with Deep Purple a few years later, the end for Blackmore's success too. I pride myself on doing reviews for band's entire discographies rather than just cherry picking them, but at the same time, I don't review albums that I feel I can't give a fair opinion on, and the later is definitely the case with all of Rainbow's future works. I've listened to them all at least once, but they're all pretty basic pop rock albums after this one, so I absolutely would be treating them unfairly if I were to review more Rainbow after this. While this record was pretty much the start of a descent for Blackmore, Dio'd quickly ascend higher himself by joining Black Sabbath, who was in desperate need of his assistance. The once colorful rainbow soon faded to black, but the quality only got better for the man with the magic voice.\n",
        "\nAfter a good start with their debut release, Blackmore and Dio figured out exactly what they needed to do when creating their second album \"Rising.\" Gone were Dio's Elf bandmates, who, while not bad musicians at all, just couldn't live up to the new additions of Cozy Powell on drums, Jimmy Bain on bass, and Tony Carey on keyboards. Where the debut was an intensely bluesy hard rock album with folk influences, and traces of metal on the side, \"Rising\" is a full on progressive metal experience. The album was incredibly ahead of its time, and I honestly think that's one of the main reasons Rainbow wasn't put on the same pedestal as some of the other bigger names in 70's hard rock.\n\nSomeone unfamiliar with Rainbow or the musicians associated with it might see that the second half of the album is just two eight minute songs, and get spooked that they'd be bloated filler. Rest assured that both \"Stargazer\" and \"A Light in the Black\" are masterpieces that are well worth their run times. \"Stargazer\" specifically is an absolute magnum opus of a song. It's a crown jewel of both song writing and instrumentation. Cozy Powell opens the song with an absolutely incredible drum fill, and across the entire track he's giving great beats, and also perfectly matching the playing of Blackmore with precise fills to accent certain notes. Blackmore himself gives the song the foundation, but at the same time, much of his playing is layered by the keyboards and orchestra on the track, which at some points are louder and more noticeable than he is. This was an incredibly wise decision for a guitarist who is known as an ego maniac, because the three together create nothing short of an epic grand feel to the whole track. It's a feeling that he himself would have never been able to accomplish compared to the spectacle that the final product gives us. Dio is, of course, on FIRE across \"Stargazer.\" His vocals are soaring with passion, but he is able to put the emotion required to perfectly convey the epic fantasy story the song absolutely needed. He does a lot of ad libbing on this song, especially at the end. However, nothing about the ad libbing seems rushed, and none of it falls out of place. \"Stargazer\" is a song that just builds and builds and builds all the way until the fade out. When the song starts to wrap it up, the orchestra starts to swell triumphantly, and continues to do so behind Dio until the eventual fade out. Calling \"Stargazer\" an epic is a gross understatement. Yet, it is an epic naturally. Not a song that just had a million guitar solos crammed in to pad the run time and make it FEEL epic. It's a truly once in a lifetime song.\n\n\"A Light in the Black,\" while still fantastic, is definitely more of a showcase for the band, and focused on solos much more than \"Stargazer\" is. It's almost like Ritchie agreed to take the backseat on \"Stargazer\" only under the condition that he take the wheel on the equally grand \"A Light in the Black.\" Dio himself remains as powerful and melodic, with some very impressive held high notes, but this is one that just isn't about him. Cozy Powell POWERS through most of this song. Not only does he pave the way during the main verse sections, but during the huge solo in the middle of the track, he adds double bass work that just takes the solos over the top. This track might also be Bain's best work on the album, as his bass work on the song is often understated. As just stated, the entire middle of the song is a monster solo from both Blackmore and Carey. Even though this solo section is minutes long, the two of them walk the tightrope by transitioning melodies and segments during the solo so it doesn't become one giant boring slog. They've really kept the whole thing very tasty, even if I think it'd be a fair argument to say some of it could have been cut down. The opener \"Tarot Woman\" is a criminally underrated song. It proves that you don't need an eight minute run time to be an epic. Tony Carey's keyboard intro here is just perfect. Beautiful and spacey, while setting up the song's core and mood with grace. Dio's vocals are also absolutely essential to \"Tarot Woman.\" His vocal melodies during the chorus are both strong, but also incredibly ominous. Despite being ominous, they still wind up feeling uplifting during the chorus as well. It's a tough feat to accomplish for any singer, yet Dio is able to magically do it with ease. Although Blackmore's riff on the track isn't his best, his solo is fantastic in a much more contained setting than \"A Light in the Black\" was. Cozy Powell is once again adding brilliantly accented crash cymbal work, and well crafted beats across every moment of the song. To close, Carey gives another small keyboard solo before the fade out. Everyone just brings it for \"Tarot Woman\" in a way that's more humble and not pretentious at all.\n\n\"Run with the Wolf\" has a really terrific groove going for it. Blackmore gives a great riff with the perfect amount of breathing room to it to let both his playing and Dio's vocals shine. Dio is able to downplay his vocal strength during the verses which makes his insanely powerful chorus notes sound twice as impressive. He lets the chorus be a shining moment of the song, when he could have soared on the verses too. It lets the song have depth and special moments rather than just being par for the course for the whole way through. The chorus is amazingly catchy and stupendously strong. My favorite element of the song is Blackmore's lead work, though. Not his main guitar solo (although it is a great one), but at the end of the song, all of the little lead parts and flourishes he adds underneath Dio give the song a bit more epicness and weight. Powell is still once again delivering beautiful and powerful fills every step of the way. \"Rising's\" one true weak spot is \"Do You Close Your Eyes.\" I don't really think \"Do You Close Your Eyes\" is a bad song as much as I think it's incredibly unfitting for the album. Pretty much every song on the record is a masterclass of instrumentation, and has a high fantasy feel, but this song is suddenly grounded in reality with much more basic playing. It adds deeply unfitting hand claps, and the chorus is sappy and pathetic enough with a weak melody to detract quite a lot. It's a mediocre song with no one really doing anything impressive. This was a song that seems more like a leftover from the debut rather than a song written specifically for \"Rising.\" It has absolutely no place on this record.\n\n\"Rising\" is a fantastic record that deserves every bit of praise it receives. I do think I give the slight edge to this album's sequel, but they're both show stoppers. It's such a shame that Rainbow didn't have longevity, as they only really had one more metal album left in them after this one, and after that, it'd be all pop rock from there. If they stayed the course longer than they did, they might be held in even greater esteem. Of course, if they did, Dio might not have left to join Sabbath, which would have been a greater shame than Rainbow's downfall, so I guess we can't have everything. If you haven't listened to \"Rising,\" you owe it to yourself to drop what you're doing and pick it up. It's an absolutely influential album in metal's history. A classic for a reason.\n",
        "\nEvery journey has a start, and although both Ronnie James Dio and Ritchie Blackmore had both been making music for over a decade before this record came out, Rainbow's debut \"Ritchie Blackmore's Rainbow\" was really the start of Dio's rocket ride to becoming the legendary singer he is. Now, this debut is more of a blues based hard rock album with smatterings of folk influences than it is a metal album, but the seeds were planted here. Blackmore, wanting to get away from David Coverdale in Deep Purple, recruited Ronnie James Dio and the rest of his bandmates from Elf to create the album. Even though none of his Elf bandmates would ever achieve the fame Dio did, and even though future Rainbow lineups outclass them, they still all put on very solid and respectable performances here. Just because this isn't a full on metal record doesn't mean its bad by default, but Rainbow's debut also can't hold a candle compared to the next two records that come after it. Colors are just missing from this rainbow.\n\nI couldn't possibly start without talking about \"Man on the Silver Mountain.\" To the day he died it remained one of Dio's favorite songs of his entire career. On top of that, it's EASILY the best song on the album. Ritchie delivers a really catchy riff, and the slight distortion that goes over his guitar as he loops it during the intro gives a very interesting feeling. He does almost a mini solo underneath the pre chorus section of the song that's pretty unique to him. Dio comes in strong (dare I say...with fire..?), showing exactly what a great voice he had, but the voice also shows his youth. The chorus is fantastic, and Dio is able to capture every note of it perfectly to build it up. Blackmore's solo on the song is also a classic one. \"Sixteenth Century Greensleeves\" is absolute trademark Dio. Blackmore's intro riffs along with that swirling light keyboard behind him really give an immediate feel to take you back to the middle ages. After the verse sections, a lot of his riffs are miming Dio's vocal melodies, which give them both a lot of weight. Dio himself shows measured brilliance. He starts out almost calmly singing to start the story off, but turns up the passion for certain lines as if to add punctuation and exclamation to certain passages of the story. His double tracked chorus is pure beauty, too. The song's sword and sorcery theme was one that Dio'd touch upon much more later in his career.\n\nDio leads us on another magical journey with \"The Temple of the King,\" too. Blackmore's opening acoustic guitar part sounds like an anthem that'd herald in a bright and sunny morning. He keeps beautiful acoustic melodies going the entire track, even doing lead parts with it. The occasional keyboard parts that accent him do so perfectly, and after the chorus, when Dio hums a matching harmony, it's pure bliss. His solo with his electric guitar is also amazingly blended to not detract from the lighter nature of the track. Dio himself is once again telling a mystical story, and his pre chorus melodies have an incredibly unique speed and flow to them. They're definitely one of the most unique moments of the song. The strength to match his beauty on the chorus is also a brilliant addition to the song. Drummer Gary Driscoll is providing subtle tom fills and hi-hat work that really goes unappreciated when talking about enhancing the mood of the song. Craig Gruber on bass is adding equally unique and isolated parts all over the song. \"Catch the Rainbow\" is a fitting ballad for the album, and is another real showcase for Dio. The entire band essentially takes a backseat to him. While Blackmore is still adding beautiful guitar parts behind him, and Driscoll adds very tasty fills with great restraint, it's the magical quality of Dio's voice that make the entire song. The rest of the band gives him all the space he needs to carry a song almost entirely on his own. While I do definitely enjoy \"Catch the Rainbow\" a lot, I do think it's too long. The song makes its point perfectly during the first four to four and a half minutes, so the last two minutes just kind of drag on a little too much for my liking.\n\n\"Self Portrait\" is a bit of a subpar track on the record. Fortunately, it's only three minutes, and it's not bad, but it's a bit dull. Blackmore's riff is an average one, and Dio's vocal melodies on the song are pretty bored sounding. I think the more serious, matter of fact quality in which they're sung is supposed to enhance the mood of the story, but I just find them to be very repetitive and lacking in passion. Everyone else's parts are equally repetitive, so the song's short length really is the major factor in preventing this track from being a stain on the album as a whole. It just doesn't have much life to it. The album's closer \"Still I'm Sad\" is an instrumental track that is absolute nonsense and filler. The entire four minute instrumental is nothing but an insanely repetitive jam session. Driscoll has a cool cowbell pattern at first, but the problem is...it NEVER changes or stops. It just keeps going and going and going. The other members of the band are also just looping the same parts over and over. The only one doing anything else is Blackmore, who is giving a very stock noodling guitar solo that, while not bad, has very little substance behind it. This 'song' should have been a solo or a transitional piece within another song on the album, because that's about all it has life for.\n\nOf course, there is no song worse on this debut than \"If You Don't Like Rock n Roll.\" It's the shortest track on the record, and very short in general, and it's STILL absolutely abysmal. Now, if you like blues rock more than I do, I'm sure you'd appreciate this tune more than me, but it's hard for me to stomach the track. The way the song flows with the cheesy piano and the pathetically sappy chorus sound to me like something that'd play in a bar in a crappy western movie. If it wasn't already bad enough, the band adds handclaps about halfway in, and it makes a cheesy pathetically sappy song even more so. It has absolutely no depth, no progression, and very little that is musically interesting about it. If I never heard the song again, I'd be very happy.\n\nRainbow's debut is without a doubt a solid record with good playing and enjoyable songwriting. It's a record that is refreshingly focused. Maybe even too focused for its own good. The magic was unquestionably on the group's fingertips here, but perhaps not studied enough to really make the bang they wanted. They didn't realize that you need more colors than blue(s) to paint a real rainbow. What you get on \"Ritchie Blackmore's Rainbow\" is the obvious shape and patterns of a rainbow, but with only the one color. It'd take the dismissal of everyone but Dio and Blackmore and another go around for them to assemble all the colors they needed to paint a masterpiece.\n",
        "\nAs of writing, Rising has a mere three reviews beneath the 90% mark on the Metal Archives (one of those is 89%) and the accumulated average of 93% is entirely understandable. Rainbow’s sophomore full length is one of the most iconic albums in the history of metal, and a work of beauty, art and magic.\n\nBlack Sabbath might have given birth to heavy metal as we know it, but everything symphonic and powerful goes back to this album and the epic soundscape it paints with Ritchie Blackmore’s best guitar licks to date and Tony Carey’s massive keyboards to fill out the skies. Taking all the rock n’ roll influences and elevating them with an electric touch that never stops, Rising climbs to all the skies so many would try to reach years later.\n\nA ‘mere’ 33 minutes long it’s got all the elements exactly right to make a classic, and one of the most highly regarded metal albums ever. The magic, epic vocals of the legendary Dio soar on starlight throughout the album, highlighting Blackmore’s electrical, melodic riffing and sweet soloing.\n\nAll throughout, the feel is electrifying and mystic, thanks to the swirling keyboards adding that wizardly sound atop the rollicking guitars which are every bit as technically proficient as anything Blackmore’s done elsewhere, but heaps more atmospheric thanks to the magnificent production surrounding him. All this makes for an album and experience entirely unmatched by anything any of the members would continue to do in other avenues, save perhaps for the equally strong Heaven and Hell (1980), where Dio would reinvigorate and take Black Sabbath to new heights.\n\nThe A side is good enough; four delicious rockers with lots of groove and melodic punch to go around, but the B side is where the magic really sends shockwaves. All time classic Stargazer opens the side up, one of the greatest songs ever written; an epic symphonic rocker that’s got all the trademark Blackmore twists and riffing, classic keyboards and Dio poetry.\n\nA Light in the Black is no less epic; a faster number it continues the tale of the stargazer, and packs some of the most driving, rollicking guitars ever. The second, instrumental half of the song is just Blackmore goodness all through and through and some truly magnificent drumming from the legendary Cozy Powell. A collection isn’t really complete without this album, one of the finest and the bridge between classic ‘70s hard rock and symphonic metal, pumping the epic scope up to eleven throughout its short runtime. Thrilling, epic and magic; Rainbow Rising.\n\nStandout tracks: Tarot Woman, Stargazer, A Light in the Black\n",
        "\nWith the exception of Black Sabbath, metal from the 1970s has never interested me that much. A lot of it tends to veer a little much towards bluesy hard rock, and not enough like the heavier riffing and bombast that were more prominent in the 1980s. But Rainbow bucked this trend a little bit, and took on a bit more of a fantastical air to their music that is displayed wonderfully on their 1976 album \"Rising.\"\n\nFrom the opening of the first track, \"Tarot Woman,\" it's apparent that there's something mystical about this record. Swirly synths set the stage for some galloping riffage that's reminiscent of Ritchie Blackmore's days in Deep Purple, but with a bit more of a metal edge. As with the rest of the album, Ronnie James Dio's vocal performance is superb; his voice is powerful and commanding, and his ability to write a good vocal melody is a great asset to the album's catchiness. \n\nOf course, the album is best known for it's tremendous b-side, consisting of the two 8 and a half minute long tracks \"Stargazer\" and \"A Light In The Black.\" Every ounce of praise that these songs have received is completely deserved. \"Stargazer\" is engrossing musically and lyrically, as Dio spins his tale of the wizard, the music swells and crescendos in the chorus, almost orchestral in its execution. When the guitar solo comes, it serves as a fantastic climax to the song, as the tale winds down and the song finishes up. \"A Light In The Black\" picks up where \"Stargazer\" left off, continuing the story from the previous song, while being just as musically interesting, with more uplifting music to fit the song's theme of hope. It's rare that I could stay interested in a song that spends several minutes on guitar and keyboard solos and harmonies, but goddamnit it works. \n\nA few songs on here lean more towards the hard rock side of early metal. \"Starstruck\" has a very bluesy vibe, but it works quite well, and is a good addition to the album. \"Do You Close Your Eyes\" is probably the weakest song on the album. It's not bad, but it's a bit too simple and straightforward, and sounds more like an AC/DC song than something Dio should be singing.\n\nIf you want an example of some early metal that represents the move towards a more epic, fantastic sound, \"Rising\" is the album for you.\n",
        "\nRitchie Blackmore admittedly wanted his songs played on the radio. While the first three Rainbow albums with Ronnie James Dio brought the band critical acclaim and a cult following, they weren't being played right beside Foreigner and Journey on AOR radio. Ronnie balked at the idea of this music (he later referred to rainbow as Foreigner Jr) and left the band.\n\nAfter a failed attempt to get Ian Gillan to join Rainbow, Ritchie reunited with Roger Glover and brought in Graham Bonnet for Down To Earth. Graham didn't last, but the album had brought Ritchie the commercial success he wanted, mainly with the Russ Ballard penned \"Since You Been Gone\".\n\nIn 1980, Ritchie hired Joe Lynn Turner. Joe has a powerful voice, but one lacking in a distinct personality, and basically indistinguishable from other AOR vocalists from the period. Then again, this is exactly what Ritchie was looking for. This wouldn't matter if Turner was a great songwriter, but unfortunately the blandness extends to his lyrics. The two tracks penned by him, \"Freedom Fighter\" and \"Midtown Tunnel Vision\" are both so generic it's difficult to remember a word of them after they finish. Not that the other guys were doing much better, \"Can't Happen Here\" tries to make a political statement about the naivety of those who believed the US was safe from the disasters that affect the rest of the world, but it lacks any real depth.\n\nThe biggest hit was another Russ Ballard penned tune, \"I Surrender\", an absolutely embarrassing number. \"Since You Been Gone\" worked because it didn't' take itself too seriously, with it's tongue in cheek lyrics and inserted clapping. I Surrender has none of that, it's completely serious in its melodrama, and Turner's way over the top and exaggerated vocals don't do it any favors.\n\nAs for the music, Ritchie seems uninspired. His riffs and solos lack any distinct feeling or memorable moments. Even on \"Spotlight Kid\", easily the best track here due to it's frantic pace and strong lyrics, Ritchie's blistering riffs feel more like a retread of past glories rather than an inspired piece.\n\nThis is easily the worst Rainbow album, not only does it never distinguish itself from the other generic AOR of the day, it doesn't even contain catchy riffs or vocal melodies, and without that it actually sinks below what other bands like Survivor and Night Ranger were putting out at the time. But it wasn't meant to be a great album, it was meant to get Rainbow on the radio, therefore I suppose it was more a success than a failure, quality notwithstanding.\n",
        "\nThis review is the first I've written in nearly a decade, and the reason I'm leading with that is to emphasize how much this album has affected me. I feel a brief background on why this is being written is important to re-assert the power this record has, centered heavily on the sheer surprise I was obliterated by after finally hearing it. The songs collected here will be mentioned later, but if you've found yourself at this point reading one of few reviews for a criminally forgotten and underrated rock album from 1979 then you don't need me to break down the pros and cons of each track in exhaustive detail. You've either already heard them and are looking for validation one way or the other, or you're seconds away from pulling up a playlist on Youtube or Spotify, so I'll let you decide. I've always found it more interesting to hear the journey any given listener has taken toward loving/hating an artist's work, so here's mine....\n\nI've been a very big fan of Dio in every way for over a decade, and he was my gateway to Rainbow like many others. I've played the first 3 Rainbow records over these many years ad nauseam, and marveled at the vocal acrobatics countless times. It led me to a natural frustration that he, Ritchie and the others (not least of all Cozy Powell) couldn't get past petty differences to create more music. Because of this, I exclusively followed the Dio camp because I had already been inundated by the glory that was Holy Diver, and it did not take me long to appreciate the brilliance of his work with Sabbath. I never got into Deep Purple, so I brushed off the path that Ritchie took after this split. I just wasn't interested.... what a mistake. \n\nThe moment it began to hit me was when I saw the video for \"Since You Been Gone.\" There was something about the power and raw intensity oozing from Graham Bonnet's delivery and the way he carried himself that came through so well. I realize this was the commercial hit from the record, and not even one that Rainbow had written, but after re-visiting this many times I finally decided to play the album in full. Unfairly, I had very low expectations as I began it for the first time. The opening riff in \"All Night Long\" is very reminiscent of \"Man On the Silver Mountain,\" which made me feel comfortable and a bit frustrated at the same time. On one hand it hearkens to a sound I've loved and am very familiar with, but part of it felt lazy. As I kept listening over and over again, it seemed fitting that this new era kicked off as if Ritchie was saying \"See everybody, Rainbow was more about me the whole time!\" Don't misunderstand me, I never had any delusions that Ritchie wasn't primarily at the helm with this band, but there's something about the overwhelming power of Dio that carries a lot of weight. And then we're treated to Bonnet's voice. Holy shit. It's even better on this track than on the hit single. And the song is pretty killer altogether, and I wouldn't even say it's on the stronger half of this album. \n\nNext up is the track that seems to pull in most of the classic Rainbow fans, due to drawing the most comparisons to the \"Rising\" era sound, \"Eyes of the World.\" It's rad like anything compared to \"Rising\" should be, but honestly I found myself more impressed as the album continued and it seemed to find it's own voice the further it went along. It became increasingly clear with each song that \"Rising Part 2\" this was not (a wise choice not to chase Dio's sound, and to instead find a different path). \"No Time to Lose\" and \"Makin' Love\" are probably the weakest efforts on here, and what you could fairly call filler, and yet they're still quite solid. Then the second half of the record hits....\n\nKicking off with the aforementioned \"Since You Been Gone\" it's a very strong start. From there, the album finishes stronger than damn near any I can think of. From \"Love's No Friend\" to \"Danger Zone\" to \"Lost in Hollywood,\" it gets better with each tune. The anchor of this entire side is what makes this album so special. It's impossible to turn off. There's no chance of losing interest in the 30th minute here, which is something that few other records can claim with this kind of intensity. All four songs get a 10/10 from me. I'll say no more, go listen to them and don't say you weren't warned. \n\nThis record takes a bit of time to achieve full steam, and for that it must endure the few hits I've thrown at it, but they pale in comparison to the goods it has to offer. I don't wanna blab on much longer here, but I just can't reiterate enough times how surprising the continuing experience of listening to this album has been. I've been heavily involved in listening to metal and rock for most of my life in one form or another, and I've NEVER heard ONE WORD about this album from anyone. Nothing online, nothing from the radio, nothing from a friend. The waters weren't muddied with what I should see coming, which by default seemed to say \"Stay away from this one, nothing memorable here.\" This is an absolute contender for best Rainbow album, and that is not something I ever expected to say, nor do I say it lightly. The fact of the matter is, no matter how legendary tracks like \"Stargazer,\" \"A Light in the Black\" and \"Gates of Babylon\" are, in my perfect world they could have all been tighter by removing 2 minutes of Ritchie's overzealous wankery before the big finish (sacrilege!). The only song that comes close to that here is \"Eyes of the World,\" but it still shows more restraint than previous offerings, and the rest are air-tight throughout. I'm not saying Bonnet is better than Dio, but all the Rainbow purists will have to get over themselves and accept that this shit kills. There's more than enough room for one heavenly voice atop the Silver Mountain.\n",
        "\nMaybe it seems like the wrong thing to say at the start of a largely positive review, but I never felt like Rainbow were a cool band. Of course the early line-up was pretty special, but they called themselves Rainbow for god's sake, so I'm thinking of unicorns and children's cartoons instead of the rock and roll and medieval fantasy that informed the band's lyrics. Following on from that, I always had the idea that these guys somehow weren't heavy despite frequently crossing the divide from hard rock into heavy metal. This album kind of exemplifies my attitude, especially since I feel nonplussed about the meeting of themes, lurching to pure imagination in 'Gates of Babylon' straight from the humdrum topic of taking a plane in 'L.A. Connection'. It's all held together with strong musicianship and feeling execution, but still comes as somewhat of a surprise.\n\nThe different themes are also accompanied by a shift in the style of music, though it isn't too dramatic, mostly cutting between striding rock shapes and more forward-thinking metal riots. As was par for the course with Ritchie Blackmore in the '70s, some of the guitar playing is masterful and progressive, while some simply attempts to do the same as everyone else, but better. The high energy that he puts into the rocking tunes is welcome and fun, with the rest of the band following him until the transition into leads arrives or a drum fill is necessary; however, it's his contribution to 'Gates of Babylon' and 'Kill the King' that seems most remarkable, as he first plays through grandiose Eastern scales and licks then leads the following song in a masterclass of style.\n\nDio was on his last Rainbow outing and balances the two types of song pretty well. What seems strange is that he manages to sound fairly standard in a kind of Brian Johnson way on 'L.A. Connection' yet really steps up a gear for the more dramatic and experimental songs. His pipes are strong at all moments, though you can't help but be caught up by him screaming out lines like \"Sleep with the devil and then you must pay\" or \"Danger, danger, the queen's about to kill\" like his life depends on it. Not only in terms of the vocals, it seems a shame to me that the band couldn't have taken more risks on the songs here, since everything they try that is even slightly different comes off wonderfully, whereas there is a distinct underwhelming feeling about the straightahead numbers, which just smack of playing it safe. Especially considering the calibre of the two aforementioned musicians, I kind of hope for more than a half measure.\n\nWithout having a look at several songs, it's perfectly possible that one could make the wrong judgment about Long Live Rock 'n' Roll. I've already mentioned the grandiosity of 'Gates of Babylon', which probably made more significant contributions to power metal than most acknowledge, while 'Kill the King' fits in somewhere between more traditional heavy metal, speed metal, and the kind of song Scorpions might have written around the same time, with Blackmore playing one long string of lead riffs and solos throughout the song. The pick of the conventional hard rock songs is surely the title track, though you might not kick 'Sensitive to Light' out of bed either. 'Rainbow Eyes' is an intimate closer that comes expectedly on this album, shutting off the excess of the other songs to whisper and drift through a languid ballad before slightly medieval sounding flutes lead us out of the album. While there are moments of genius scattered around, it's also frustrating how plain 'L.A. Connection' and 'The Shed (Subtle)' sound at times, while 'Rainbow Eyes' drags at an absurd seven minutes with the vocals failing to strike me in any sensitive spot. Also, the balance between adventurous and commercial exploits seems rather artificial at times, which seems to result in the divide between intriguing and banal.\n\nHow I feel about this album is thus quite divided, because I recognize the true greatness of some of the songs and contributions, yet can't help feeling disappointed that there was a lot more potential to be explored. It ends up as one of those '70s albums that risks a lot and also plays it safe, offering some \"singles material\" and more thoughtful compositions, making it seem like a short record with filler, which is certainly not a good sentence to be writing. Nevertheless, the great outweighs the annoying and there's no way I would recommend any fan of music to avoid 'Kill the King'.\n",
        "\nShortly before the release of Long Live Rock 'N Roll, Blackmore and co. would put out a live effort containing drawn out and spiced up tracks from the debut record, as well as a few other treats. \n\nGoing without saying, one should be sure going into this that there's gonna be a lot of ingenious guitar licks being composed, adding a lot of life to tracks like \"Catch The Rainbow\" and \"Sixteenth Century Greensleeves\". Those tracks in particular are both on the slower side in comparison to many on the debut, but have an excellent delivery when performed live. Dio's untouched live vocal performance crossed with the unstoppable Ritchie Blackmore showcase some of the greatest moments in \"live record\" history. While they probably aren't tracks that I would have picked for the release, they leave no room for disappointment. The help of Jimmy Bain on bass and Cozy Powell on drums, although less famous at the time, assist driving home and backing many of Blackmore's tangents. This would set the stage for what we should expect from those musicians on future releases.\n\nThe covers performed on here are pretty great; while \"Mistreated\" may seem redundant due to being taken from Blackmore's previous band, it's a nice touch hearing Dio sing it instead. Toney Carey on the keyboards obviously isn't too different from Jon Lord, but still pretty great. \"Still I'm Sad\" stands out as a unique one here, as it was originally just an instrumental cover on the studio album. But on this, we are given vocals and more intensity, in turn churning out a track that has more suspense, and you can't really hear it anywhere else. My only issue with this record? They could have done more with Rising, as there is so much to be offered from that, yet it's only slightly sprinkled in here as part of the medley, which includes a short portion of \"Starstruck\". \"Stargazer\" is one of the greatest songs ever written, and to not be on here is a tragedy. More room for more tracks could have been available had they cut back on some of the embellishment. While that is usually a good thing, it doesn't work for all of the tracks, and it takes up too much space here. Otherwise, a great release, with some unique output that you won't hear anywhere else.\n",
        "\nRainbow's sophomore effort not only represented a huge leap forward for the band, but a pretty significant opportunity for a musically burgeoning genre that needed to reinvent itself to make it more solid in terms of songwriting. Further, given the too simplistic formula the band used in their debut, Blackmore replaced the drummer and bassist with two incredible musicians: the bassist Jimmy Bain and the gifted drummer Cozzy Powell. The results are more than astonishing. At that point, the band became more open to more complex compositions and stepped into higher scales of musicianship that otherwise, they would not reach. That was precisely the ingredient their debut album lacked of. In other words, Blackmore capitalized on what he had already composed for Deep Purple, so what you can find is a sort of Deep Purple-inspired numbers with a certain dose of madness injected by Cozzy.\n\nOpening the album, their classic number \"Tarot Woman\", is a clear example of the usage Blackmore gave to such inspirations. From the very beginning, Tony Carey hit his notes on the keyboards in the same way Jon Lord did for Deep Purple, though Carey's style was a little bit more acid. A pinball game intro would be a closer reference. Afterward, the song started growing, keeping that trend until its closing. Anyway, the album's highest point is reached in \"Stargazer\", which is the first power metal song ever released. Indeed, it has all the necessary merits to be tagged as such, since it reaches an epic length of more than 8 minutes and it's a pure melodic attack applied in an acceptable fashion. Further, even though it is not one of your double-bass-drunk flower metal numbers, Cozzy Powell exploded with his drums. But if you think Cozzy Powell was at his maximum, then, you should give a listen to the closing speed metal number \"A Light in the Black\", which besides other stuff from Deep Purple, it is part of the background behind the famous guitar-keyboard duel Malmsteen made famous during the 80s. Needless to mention, but Ronnie James Dio played an essential role on account of his powerful vocals. Definitely, this album put him into Iommi's radar some years later and became what pushed forward his career.\n\nEven though the remaining numbers are not as remarkable as those mentioned above, they are acceptable at least. Nothing different from what you will find in a Deep Purple album (check \"Never Before\"), but the fact of featuring Dio and Blackmore at the same time makes them reach such status. With that said, reasons abound to explain why this album is quintessential and legendary. Unfortunately, Blackmore and Dio would begin experiencing relevant creative differences and said conflicts impacted the next album, which would be the last with Dio on vocals. If by any chance you find it, then buy it. You will never see something similar and as innovative as Rainbow's sophomore effort.\n",
        "\nAfter the very successful \"Rising\", Ritchie Blackmore decided to make a change in the musical direction of the band, since he was tired of the dungeons & dragons lyrics that Dio used in every single song of their previous albums. Furthermore, he wanted to use a more accessible sound for band's music in order to reach a higher number of sales. Obviously, Ronnie James Dio did not agree with him. He wanted to keep the style of their previous albums, and this change was such an issue since he decided to leave the band after the release of this album, and at that point the band was deadly injured.\n\nThis background can explain why the album is not as glorious as the previous, but not as bad as the further efforts with the new vocalists. Like in previous albums, the sound is basically inspired by 70's Deep Purple, mainly noticeable in guitar playing and some keyboards passages; however, due to their creative differences, the album contains songs inspired by Dio and songs inspired by Blackmore. Both types of songs seem to be good, but Blackmore is not exactly a good composer, and his stubbornness was not helpful for this album as none of his compositions were close to Dio's composing ability.\n\nThere are many heavy metal songs with an epic vibe which clearly represent the Dio standard. \"Kill the King\" is a brilliant speed metal number which was part of \"On Stage\" and is one of the best Blackmore's moments in the album, but the best song is \"Gates of Babylon\" which is a slower-paced piece, and besides Dio's epic vocals, guitar riffs give to the song an interesting arabic background which goes well with its pace. Then you have the closing song \"Rainbow Eyes\" which is a beautiful long-lenght ballad with a very emotive vibe.\n\nOn the other hand, there are also many bluesy songs which are an omen of the things to come after Dio's departure (except for \"Long Live Rock 'n' Roll\" which is a pretty decent number), since they are exactly what Blackmore wanted even though Dio did some work on their lyrics. Although they are the weakest numbers of the album, they are rescued by the good musical ability of the band's members. Actually, these songs make of this album a step-down from its previous.\n\nIn general terms, the album has a very impressive musicianship. Powell did a great work at drums, and his ability to create interesting rhythms and tempos for the songs along with Blackmore's virtuous playing, make of this album a great and outstanding album. However, Blackmore's whims are a weakness for this album and actually for the rest of band's career. He made a bad decision when he tried to make his own version of Deep Purple in further releases. At this point, Rainbow became an influence for power metal bands on the beginning of the 80's, but Blackmore made everything to wreck-up this band. It is advisable to enjoy this one because this is the last good album of the band.\n",
        "\nThe band Rainbow itself has an interesting history itself. What I and many others would consider a super group consisting of Deep Purple guitarist Richie Blackmore who was looking to experiment around a little and vocalist Ronnie James Dio from the rock band Elf and future Black Sabbath drummer Cozy Powell, they all created what I would consider metal's most underrated album. With only six songs featured, it is 33 minutes of jaw dropping material that gives you an unknown magical feeling in your heart. Just as the band would want you to have. \n\nInstrumentally, the sounds of the guitars and synths are beyond its time. You know the album is going to blow you away when the first 30 seconds of the album has a killer space synth intro that sounds nothing like what most bands in the mid 1970s were doing. The production on the album is fantastic and sounds better than most albums that come out in 2015 do. It's crisp, heavy, and colorful that paints the colors of the rainbow (no pun intended). The riffs on this album are catchy and very bright and fun, from the very first song Tarot Woman that makes you want to tap your feet and bang your head, to the very last song; A Light in the Black and everything in between. \n\nThe songs themselves are either very fun or very powerful. Even if not every song is as technical such as songs as Do You Close Your Eyes and Run With The Wolves. They are still catchy and make you want to sing your soul out. Starstruck is another fun headbanger with colorful instrumentals. However, it's the last two songs on the album where it things start to rise. Stargazer is a massive song that often gets compared to Led Zeppelin's Kashmir. However, this song makes Led Zeppelin look like a local bar band. Dio's vocals on here are beyond passionate and the first line he sings starts giving me chills. The guitar solo towards the last half on this song is legendary and probably one of Blackmore's best. The backing instruments and synths fill in the sound perfectly too. A Light In The Black features probably one of the first metal songs with a double bass. However, it does not sound like most double basses. Instead, it sounds much rawer and I wish most bands nowadays had a double bass that sounded like that and not a machine gun. This song itself is just as powerful as Stargazer with a killer synth solo that makes you lose your mind and a fun southwestern honky tonk sounding guitar lick towards the back of the track. Overall, this song is overwhelming (in a good way) and very progressive. \n\nCould this be one of the first speed metal albums ever recorded? It is often argued so. Rainbow Rising is also argued as one of the first power metal albums to be made. How can this album be so unknown to many people? It's a shame that this album didn't do as much rising to the top as it should have. Then again, blame it on punk rock.\n",
        "\nThere were some personal differences that caused guitarist Ritchie Blackmore to leave Deep Purple and form Rainbow: a band that for obvious reasons had a lot of similarities to Deep Purple. Blackmore's guitar-work was as flamboyant, catchy and memorable as always and are ultimately what Rainbow is all about. But he wasn't the sole reason that Rainbow managed to conjure up some of hard rock's/heavy metal's finest (and often over-looked) albums. Blackmore joined forces with the now legendary metal singer Ronnie James Dio and his bandmates from Elf, and together they created an awe-inspiring debut album simply called 'Ritchie Blackmore's Rainbow' in 1975; a year where metal had really taken off and was on the rise.\n\nIf you've been listening to Deep Purple albums featuring Ritchie Blackmore, you know that he's a very good guitarist and can do some serious virtuoso stuff on the axe combining raw skill, technicality and possibly some magic to create some very memorable riffs and amazing leads/solos. Even though he's always come across as a miserable, arrogant, egoistical sod, you could say that he's a slightly merrier version of Black Sabbath's Tony Iommi in terms of guitar-playing and style. Take a look at album opener \"Man on the Silver Mountain\". The intro-riff and main-riff are insanely memorable a la Deep Purple's world-famous \"Smoke on the Water\". \"Man on the Silver Mountain\" has also got some amazing guitar-leads working around the chorus and additionally there's a fairly good solo thrown in, too. The Quatermass cover \"Black Sheep of the Family\" has also got some nice guitar-wrangling, and on the mellower tracks: the spacey \"Catch the Rainbow\" and the beautiful \"The Temple of the King\" are also worth a mention.\n\nI mentioned magic earlier regarding Blackmore's guitar. That's true and all, but the real magic are the pipes of Ronnie James Dio and his very fitting fantasy-based lyrics that seem to further compliment the whole album and making it a complete package of magical metal music. Dio's vocal delivery on every song is astounding, but they truly shine (out-shine the guitar) on tracks like \"Self-Portrait\" and \"Sixteenth Century Greensleeves\"; both whom I consider to be some of the band's best songs.\n\n'Ritchie Blackmore's Rainbow' isn't a perfect album, though. \"Snake Charmer\" and \"If You Don't Like Rock 'n' Roll\" are of much lower quality than the rest of the tracks, when you consider that the bar was already set with songs like \"Man on the Silver Mountain\" and \"Catch the Rainbow\", but since the album closes with \"Sixteenth Century Greensleeves\" and finally an instrumental cover of The Yardbirds' \"Still I'm Sad\", the album isn't greatly affected by these below-par tracks.\n\nThis album is over-looked if you think about the time it was released. Blackmore's original band Deep Purple was in full-swing, Black Sabbath were in their best shape, too, Led Zeppelin were doing their thing and bands such as Judas Priest and Motörhead were emerging in the metal scene. Outside it, Pink Floyd still ruled. So, it's not that strange that Rainbow were suffocating under this great time of music, but this album, as well as the two later albums with Ronnie James Dio as the band's singer, were early influences on the more medieval, operatic and mysterious (magical) metal albums (including Dio-fronted Black Sabbath and Dio's Holy Diver etc.) that would be conceived in the 80s.\n",
        "\nRonnie James Dio may not have gotten the attention he deserved in the 70's if it hadn't been for Rainbow. The band was also meant to be a solo project for Deep Purple's ex-guitarist, Ritchie Blackmore, but Dio seemed to be getting more attention, and this displeased Blackmore to no end. As a result, \"Long Live Rock 'n' Roll\" would be the final album made with the two musicians in the Rainbow lineup, and it's a perfect swan song for said lineup. Every Rainbow album after this would either be mediocre (\"Straight Through the Eyes\") or just downright bad (\"Down to Earth\").\n\nBlackmore's and Dio's contributions to the music are clearly evident, as there are songs in two completely different styles. One is Dio's, with more mystical lyrics and classical influences. The other is Blackmore's, with songs that are more hard rock/blues based, much like when he was in Deep Purple. You can easily tell that \"Sensitive to Light\" is one of Blackmore's, cos it's got a bright, rowdy vibe to it. My favorite one of his, is \"The Shed (Subtle)\", cos it's got a hard, thumping drumbeat, thanks to the legendary Cozy Powell, and a hard rocking hook. That combination makes for a pretty meaty song, and to top it all off, it's got Dio singing in harsh, rough tone of voice, punctuating the song's mood. It also begins with Blackmore showing off some of his soloing skills. Personally, though, I think he does a better solo in \"Kill the King\", where he not only shreds like a maniac, but he also plays a sweet interlude before the third verse. His influence can also be heard in \"L.A. Connection\", which also has a hard rock-based riff. \n\nDio's influence is clearly evident in the songs that are not so bluesy and hard rock-like. His songs carry more variety, ranging from the haunting and somber \"Rainbow Eyes\" to the fast and aggressive \"Kill the King\". The former, in particular, closes the album, and all the hard rocking grinds to a halt in favor of a chillingly gloomy serenade featuring an entire string ensemble and a flute playing a more classical-based melody. Probably with a sigh, Blackmore plays a riff with a light guitar as well. The fact that the song is played in the key of F minor only adds to the fact that I get goosebumps every time I listen. Yeah, yeah, I get it, it's a love song, but they lyrics speak not of literal broken hearts, but of metaphors of fairs being taken down. That's another real talent of Dio; writing the perfect lyrics that add more flavor to the song. When all of this is put together, it creates an excellent and powerful, if not depressing, song that may or may not get you to reach for the nearest Kleenex box. \n\nOne of my favorites on this album, though is the mysterious \"Gates of Babylon\". The song is heavy with synthesizers, but they're used in the way they were intended to be used; to set the tone of the song rather than making the next \"Mr. Roboto\". In this case, the synthesizers add to the song's Middle-Eastern atmosphere by playing a haunting melody along with the guitar, and during the chorus, it plays a mysterious-sounding hook. They also play a bit of a solo in the beginning, bringing us a vibrant, eerie sound that has never been heard before (bear in mind that this is the 70's, when the mellotron technology still in its embryonic stages and before the days of the horrendous auto-tune). It seems that Blackmore had to adapt to the song's mystical nature by playing his solo using harmonic minor arpeggios, which give it a fresh and exotic feel as opposed to the stuff he's used to playing. He does a good job in doing it too, so it's a shame that he wanted Rainbow to be a more Deep Purple-like band rather than something fresh and new, like \"Gates of Babylon\".\n\nIt must be said that \"Long Live Rock 'n' Roll\" is the last great Rainbow album, at least the last great one with Dio's voice. He and Blackmore would get fed up with each other, thus leading the former to pack his bags and leave. Everything would crumble into pieces after that, for Blackmore made Rainbow into a completely different band, one that would be born with Def Leppard's Disease. The two might not have agreed with each other, but man, when they did work together, they sure did manage to crank out some amazing stuff! Sometimes having an uncooperative person wouldn't be much of a problem when creating excellence... that is, until a breaking point is reached.\n",
        "\nRainbow is a tale of two famous musicians, each with polarizing musical tastes. On the one hand, we have former Deep Purple guitarist Ritchie Blackmore, who specialized in rowdy, upbeat rock n' roll. On the other, we have singer Ronnie James Dio, who was relatively unknown at the time of Rainbow's formation, and favored music that featured mystical elements of fantasy. The two obviously didn't get along very well, but they managed to crank out several albums before parting ways. \"Ritchie Blackmore's Rainbow\" was the first of these albums.\n\nAs you can tell in the album's title, Ritchie Blackmore wanted a ton of attention, attention he felt that he didn't get enough of during his stint in Deep Purple. As he wanted to craft some rock n' roll songs, those songs are definitely to be found on this album, one of the best examples being the hokey, if not laughably silly, \"If You Don't Like Rock 'n' Roll\". It's only two minutes long, but that's all that Blackmore needed in order to create a fast and goofy rock n' roll song, complete with a piano and even the sound of a cheering crowd at the end! While \"If You Don't Like Rock 'n' Roll\" might sound asinine, even with Dio on vocals, there are other songs that I might say are more enjoyable. \"Snake Charmer\" is one of them. It has a bit of a bluesy, hard rock influence without being so cheesy. Then there's \"Black Sheep of the Family\", a cover of a Quartermass song. While it is a little goofy, I'm going to let that pass, since it is a cover, but it's part of the evidence of Blackmore wanting to pursue a more bluesy, hard rock sound for his solo band. I guess part of the reason why Blackmore hired Dio to be a part of his band was the fact that Dio has a rough, gravelly voice, but at the same time, he also had a soft and melodic tone whenever he needed it, like during ballads like \"Catch the Rainbow\". \n\nDespite Blackmore's name being featured in the album's title, I would say that Ronnie James Dio had more creative power in the music, as there are more songs with fantasy-related topics as the subject matter, or at least song lyrics with a ton of metaphors (Blackmore favored lyrics that were more simple and straight to the point). The all-time classic \"Man on the Silver Mountain\", an excellent song commonly associated with Dio's work, is only one example. There's also \"The Temple of the King\", which is pretty self-explanatory. That particular song, however, has a more mystical vibe to it, suggesting a classical influence. It is also quieter than \"If You Don't Like Rock 'n' Roll\", for there are more acoustic guitars and mellotrons involved. As he is singing, Dio's voice is softer as well. Dio was a very intelligent man who knew every nook and cranny of classical music, so he wanted to have that in a lot of the songs he wrote. This obviously didn't sit well with Blackmore. \"Sixteenth Century Greensleves\" has a bluesy guitar riff, but the lyrics are obviously Dio's, since they feature imagery found in fantasy settings, like drawbridges and towers. \n\nBlackmore and Dio have done great things together, including the making of this album, but that was never to last. The two were often embroiled in arguments over what should and shouldn't be in the music. This has led to Dio leaving the band after the release of \"Long Live Rock 'n' Roll\", thus joining Black Sabbath and putting his creative ideas forward a little more. Blackmore, however, made Rainbow a goofy AOR band, releasing the abysmal \"Down to Earth\" with singer Graham Bonnett. It's a shame that they parted ways, for they did an excellent job in creating this album.\n",
        "\nThis is the debut by Rainbow. A name that would be ridiculous for a band today, but was quite respected in their heyday. This features two all time greats working together. You have Ritchie Blackmore, one of the greatest guitarists of all time, and Ronnie James Dio, one of the greatest vocalists, crafting some excellent songs. They also craft some fillers.\n\nFirst of all, while the music and quality aren't consistent, the atmosphere is. This definitely achieved the sword and sorcery theme they were going for. The epic feel found throughout this album would provide a source of inspiration for many power metal bands of every nationality. From Savatage to Blind Guardian, their influence was visible. Going along with the theme is the excellent cover art. The whole scene of a winding pathway leading to the castle set in front of a rainbow and the crescent moon, all surrounded by foggy mountains, is exquisite. \n\nRitchie Blackmore is as good as his fans claim. For a time in the 70's, this man was probably the most technically gifted guitarist on the face of the earth. His solos could either go in a well-played bluesy area, slightly reminiscent of Hendrix, or he could go into a neo-classical world that only a couple of Germans were familiar with. To go along with this, he could usually craft quality riffs on a consistent basis. I find this odd considering how much he disliked rhythm playing, but it's a credit to his talent nonetheless. We have a couple of great ones on display, the groovy one on Silver Mountain, and the heavier one on Greensleeves. He also has a rather interesting one on Snake Charmer. It came from a rare, at the time, classical scale, and now rock guitarists call it the Snake Charmer scale. This is one of the most important aspects of Rainbow. Ritchie really emphasized his classical tendencies on these first three, and it can be excellent.\n\nRonnie James Dio has his first performance in the medium he was to become a legend in. Elf was a pretty lousy affair, and every hard-rock or metal fan should be glad that he went in this direction. In his prime, Dio had close to four octaves and more power than some opera singers. I'm not sure if I like Dio more than Gillan, but he was definitely worthy to be Ritchie's next vocalist. His best performances are on the first two sings I mentioned previously, and the ballads. I don't particularly enjoy the ballads, but he sings splendidly on them. I believe Dio also wrote the lyrics on these songs, and they're quite enjoyable. I would say that they're cut from the same cloth as what he would do during his solo career, as well his next couple of Rainbow albums. There is a slight difference in that this stuff is a little more complex and lush, but still pretty similar.\n\nNone of the rest of the band does a noteworthy job. The keyboards are there because Ritchie is used to working with one, I presume. The difference is that this man is no Jon Lord. He doesn't even add atmosphere really. The bass is also not particularly audible, nor is he really doing anything worth paying attention to. The drummer is easier to hear, but no more enjoyable. They would get a fine drummer on the next album, but this has to suffer through a very mediocre rhythm section.\n\nMy score is a reflection of the fact that as much as two of these are classics, the rest are not special. Snake Charmer is influential and the ballads are well-sung, but they're essentially filler. I tend to feel this way about most albums Dio has been on, but I do enjoy his vocals. This album would be much worse with just an ordinary vocalist working on this. This band would improve on the next two albums, but this is still alright. I would recommend this to fans of early, power metal, and hard-rock.\n",
        "\nThis is the last Dio-fronted Rainbow album. To an extent, you could argue no vocalist ever fronted a band with Ritchie in it. Looking back, it should surprise no one that this partnership didn't work. While it did exist though, excellent music was produced. A majority was just average however, and this album is no different.\n\nThe duo that this early line-up was built around don't disappoint. Ritchie riffs and solos like a possessed guitar hero. Overall, it's an excellent mix of blues and classical playing. Usually, the riffing consists of the former, and then he switches to the latter for the soloing. His playing is very melodic, and for the time, very fast. Ritchie was possibly the first shredder, depending on where you set the bar. Dio is also excellent on here. He doesn't seem to utilize his roar as much as usual, but he still impresses. His range, emotion, and bite are still evident to anyone with a pair of ears. Dio's lyrics are also pretty good on here. His mystical lyrics and his more down to earth lyrics co-exist perfectly on here. There are several songs on here that survive mainly because of these two guys.\n\nThere really isn't anyone else that stands up to these two guys on here. Cozy is a very good drummer, but not for his performance on here. Kill the King is the only special song from him on here. The rest of the time, he's pretty stock. I'm not saying he's overrated, just that this is not one of the albums that built his reputation. The rest of the instrumentation is solid at best. It seems likely that Ritchie did much of the keyboard and bass work himself, so they never take center stage. \n\nAs to the song quality, it's not very high on the whole. Gates of Babylon and Kill the King are metal classics. More bands than I care to count have covered those songs. They're awesome. The last two on the other hand suck, and that essentially ruins a quarter of the album. The other forty or so percent of the album is average or a little above. I am fond of L.A. Connection for its fun riff and good groove, but its far from the first two songs. This somewhat leads into my statement about Dio albums. They're never very consistent. They essentially throw various amounts of ballads, hard-rock, and metal to see what sticks. Generally the more metal tracks work, the hard-rock is hit or miss, and the ballads are boring. This is the rule on the Rainbow albums as well.\n\nAs an influence, this is pretty high. The top tracks on here inspired many power metal bands, and are some of the best songs these people ever did. This somewhat functions as a changing of the guard in a sense. As the 80's came in, Ritchie pretty much lost relevance. He ran Rainbow into the ground, and then he cashed in on a mediocre Deep Purple reunion. This is his last great performance as a meaningful force in rock music. Dio on the other hand went on to do a couple of praised albums with Sabbath, and then have a successful solo career. In a poetic way, this is their intersection. Does all of this make the album better? No, not really. There is a ton of mediocre or worse music on here, that the greatness can only do so much for. I would recommend the two great songs to any metal or hard-rock fan, but the album as a whole would only be interesting to fans of hard-rock, early, and power metal.\n",
        "\nThis is the greatest thing Dio ever put his name on. Some will point to Heaven and Hell, some point to Holy Diver, and a few even point to Dehumanizer, but this is it. This album is very good, and as close to consistently great as Dio ever achieved. Most of the songs are good to great, and this is the best instrumentation and songwriting Dio ever worked with. Yes, this album is short, but much of it is great.\n\nDio is a monolith on this album. His vocals soar and shout into the heavens and at fate. His range, his roar, his emotions, and his bite are all at their apex and he weaves them perfectly. Vocally, there are very few albums to rival this. Less than ten during the 70's, and no more than that during the 80's. His lyrics are very good as well, mysterious women and sorcerers. I am somewhat reminded of Uriah Heep with these lyrics, but Dio's aggression shines through even the words. The only problem with them would be his repetition on songs such as Stargazer. It's a great song, but he repeats himself far too much.\n\nBlackmore is spectacular on here as well. His solos are fantastic on Stargazer and others, tasteful mixtures of blues and classical. These were some of the best solos around at the time, only Schenker could match him for melodicism, only Uli could rival him in neo-classical technique, and Dimeola was the only one other than those two who could rival him for technicality at high-speed. His riffing is quite good as well. Combined with the keyboards, he creates great atmosphere on Tarot Women and Stargazer, and Starstruck is very fun. This was possibly Ritchie's peak in terms of skill and creativity. Rock music has not seen many guitarists rise to the level that Ritchie did throughout the 70's. \n\nAs for as the other people here, Cozy is pretty good. He does a very good job on most of these songs. He isn't hyper-technical, but he can still squeeze in some good fills along with playing aggressive and keeping time. Add in that he can also groove when the song calls for it, and you have a very good drummer. Powell often ranks amongst the best metal drummers, and he deserves the praise. The rest of this instrumentation is less impressive. The bass is not very loud, nor does he do anything. The keyboards are loud, but other than a few atmospheric touches, doesn't earn its place. It's possible that Ritchie did some of this himself, which wouldn't surprise me in the least.\n\nAs mentioned before, this is as consistent as anything with Dio ever was. Part of this is probably the short run-time, but that is besides the point. The bluesy rocker is below-average, but that is the only thing that damages the consistency, and it's short. It actually strikes me as a harbinger of the large number of filler songs that would populate Dio's solo albums. The first song and the last two are metal classics. They have great atmosphere, guitar playing, vocals, and drumming. The rest is more above-average. I enjoy Starstruck, but it's not really anything to get worked up over. The atmosphere on these songs is excellent as well. The cover pretty much sums it up, powerful and majestic. Compared to the previous record, this is more aggressive, and it's more epic compared to the successor. \n\nI would say that this is a very good to great album. It's pretty consistent, but it's short. Just over half an hour of great music is fine in death metal, but not really in hard-rock and heavy metal. The music just isn't built for that kind of brevity. That's probably the bulk of the ten point deduction, is that this kind of music should be longer. The rest is Close Your Eyes, but at least it's very short as well. This is the essential Dio and Rainbow release, that every early and power metal or hard-rock fan should hear. I would say that this is basically essential for those three groups of fans, both for the music contained, and for the influence it would have.\n",
        "\nRainbow is one of those bands that has two of early heavy metal's biggest heavyweights- Ronnie James Dio and Ritchie Blackmore- yet manages to slip under the radar of most heavy metal fans and music critics. Whether this was the result of Dio's work with Black Sabbath and solo work overshadowing Rainbow, or simply the fact that Rainbow had gone AOR when Dio left, I can't be certain. It is a disappointment that Rainbow isn't cited as often, since they had arguably the biggest impact on the sub-genre we today call power metal, much of it coming from this single album, \"Rising.\"\n\nHistorical rhetoric aside, \"Rising\" does what every great album should, by taking you on a journey away from your boring existence into another place altogether. To this end, it does so by utilizing not just the talents of one, but all of the musicians in the band, bringing the overall sound of Rainbow in a fairly consistent and realized direction. Ritchie Blackmore's combination of hard rock riffs with neo-classical soloing and harmonized solos leads the musical journey, with Dio's powerful vocals supplying the narrative. Everything comes together, without ever sounding superfluous, indulgent or (in the case of many of Rainbow's power metal disciples) down right cheesy. Even the inclusion of a keyboard solo in the opener \"Tarot Woman\" makes sense when the guitars come in and you realize where the song is taking you.\n\nAlthough filled with fantasy elements, the lyricism in Rainbow is not quite the ham fisted dungeons and dragons fare people tend to attach to the power metal that sprung from Rainbow (including Dio's own solo work). Instead, Dio relies more on mysticism, metaphor and subtlety, with \"Stargazer\" telling the fable of a wizard who demands a tower be built for him to fly from, only for him to fall and die like any mortal man. Not all the lyrics are quite so heavy handed, with the song \"Do You Close Your Eyes\" serving as a short hard rocker. I suppose you could argue that the song is out of place on this album and, in light of songs like \"Run with the Wolf\", \"Stargazer\" and \"A Light in the Black\", that would be a valid point. However, upon closer examination of all the lyrics, I find that the chief lyrical theme in \"Rising\" is less sword and sorcery and more about mystery and facing the unknown. A man's fear of an obsessed female fan in \"Starstruck\" or the sexual curiosity in \"Do You Close Your Eyes\" can be just as much of a struggle as facing witchcraft (Tarot Woman), mystical forces (Run with the Wolf), Tyranny (Stargazer) and the loss of a comrade (A Light in the Black). The difference is simply the scale of the conflict and the lens with which we choose to view it, and that Dio and Blackmore had the ability to make mundane subjects fit in a grander framework is, to me, extraordinary.\n\nFor fans of power metal, I feel that this is not only a great album to have in their collection, but an important one. The blend of classical influences and epic vocals and lyrics that has become a staple of the genre originated in this project four years before Iron Maiden had even recorded and album, and the guitar driven closer \"A Light in the Black\" could very well be the seed from which Blind Guardian's \"Somewhere Far Beyond\" and DragonForce's \"Through the Fire and the Flames\" sprung. Even if you are a metal fan for whom those songs mean nothing, the best way to understand the present state of the genre is to understand it's roots. Released in 1976, when both Black Sabbath and Led Zeppelin were past their primes and two years before Judas Priest's \"Stained Class\", Rainbow's sophomore triumph could be seen as the essential missing link between early metal and the speed and power of NWOBHM.\n\nPersonal Rating: \\m/ \\m/ \\m/ \\m/ out of \\m/ \\m/ \\m/ \\m/\n",
        "\nAwesome! This DVD feature of the original 1977 infamous sold out concert in Munich offers us the best Rainbow version ever. For those (of us) who had the chance to watch at least one of the many VHS bootleg releases, this is something way beyond. The analog recording had all kind of flaws and like any tape unavoidably deteriorated with time, but this digital conversion not only adds a great number of interesting and emotional extras, but also comes with an outstanding Dolby Digital 5.0 sound and the even more impressive DTS Digital Surround sound improvement, which kicks every other '70s concert’s ass.\n\nThe selection of the tracks for this concert might be a bit controversial since Rainbow’s masterpiece and highlight for that tour, Stargazer, was left out (not a personal opinion, check out the slide show), but every song here was interpreted the way any fan of the band would expect: Dio’s unique voice and his devotion and dedication to the audience, Blackmore’s majestic guitar riffs and solos, and of course, the brilliant accompaniment by the rhythm section of two other legendary names as Cozy Powell and Bob Daisley. David Stone never reached the popularity of the above names, but his performance here and on the upcoming album was unquestionably excellent. \n\nThe most remarkable feature of Rainbow’s live performances was always the long extended versions of all songs, a Ritchie Blackmore personal signature which explains why only 8 songs last almost two hours, the same playing time of the first three Rainbow albums altogether. Not only do the guitar solos go really long at some points, but also do the bass and keyboards, and there’s also one great and long drum solo at Still I’m Sad - Powel’s at his best! Besides this (and the lack of Stargazer), there’s nothing to criticize on this wonderful concert.\n\nIt all starts with some notes from Deep Purple’s Lazy marking the entrance for a short intro while the performers are presented and after the title appears on screen, comes the unforgettable Kill the King and the even more unforgettable, dizzying, giant, metallic rainbow assemblage all over the stage. Then comes DP’s Mistreated, a totally hallucinating version so much better than the original. Before playing Sixteenth Century Greensleeves, Mr. B delights us with a piece of Bach‘s and so they go, a couple of guitar-playing-proficiency solos here, a classical piece there, all perfectly timed and sublime. \n\nDuring the final song, Do You Close Your Eyes?, Dio sings on a malfunctioned microphone while you can see a rare image of his majesty with a lightened cigar in his hand. R. Blackmore explodes at the very end, throwing his guitar to the stage floor and creating some feedback with his high heeled shoes and right after that, he brutally destroys his beloved (?) instrument against the stage floor - horribly fascinating. Then the rainbow fades out and you know it’s definitely over.\n\nThere’s a lot of interesting stuff in the extra material like a gallery of pictures from photo sessions from this and some other concerts on this tour, tickets, promotional flyers, and Blackmore’s arrest headline. Also comes with a slide show with commented pictures about everything – and I mean everything – related to this show, like how the tour was made, how the stage was constructed, details on every instrument, lights, amplification, scenery, formation of the band, comments for every song, and each member’s timeline up to that date. This is a never-seen-before documentary/complete biography; if there’s anything you ever wanted to know about Dio-era Rainbow, here you’ll find it. Priceless!\n\nThere are 3 promo videos for their upcoming album (also in the original version), recorded live on pretty well-arranged sets that's nothing extraordinary, but is great classical visual material shot professionally: Long Live Rock ‘N’ Roll with slightly different lyrics from the original, The Gates of Babylon with Blackmore’s typical “I’m-the-best-guitar-player-ever” attitude, and L.A. Connection.\n\nIn the interviews section, the most remarkable thing is the use of images from that period to enlighten their involvement with Rainbow, fun stuff such as Blackmore’s arrest in Austria a couple of nights before this concert and some others truly touching, such as reflections on Cozy Powell’s regrettable decease.\n\nA special acknowledgment to the people responsible for the subtitles and the menus which come in English, Spanish, and Portuguese for both the concert and the extra material. That little detail makes this DVD even more enjoyable.\n\nTo summarize, a marvelous release that will fully take you into the most brilliant moment of one of the greatest bands from the seventies. An unforgettable concert and a brilliant documentary.\n",
        "\nRising is a legendary album. Rainbow itself may not be as well-remembered as it should be, but Rising and Long Live Rock And Roll are unforgettable, and their influence unshakable. Rising is almost unanimously agreed to be their best album, and I'm here to discuss why. \n\nHard rock music in the 70's was great, there's no denying that. This was when the music scene was ruled by greats like Queen, Led Zeppelin, and the Rolling Stones. Heavy metal, on the other hand, was limited to slower, Heavier bands like Deep Purple and Black Sabbath. Rainbow's Rising managed to bride the gap between the two amazingly well. The number of styles at work here is immense. From progressive to classical to folk to just traditional hard rock and metal, Rising spans countless genres. \n\nThe opening track, Tarot Woman, is fantastic and, in a sense, daring. Few bands at this time used synthesizers in such an energetic ways, and the minute-and-a-half opening on Tarot Woman sets the spacey, dreamy mood that persists through much of the album. The cello on Stargazer is implemented seamlessly, and you can even hear reminders of Stargazer in some of Iron Maiden's more progressive albums. There is just a ton of courage here, everything feels like a roll of the dice. \n\nRitchie Blackmore really lets out on Rising. I honestly think that he does his best guitar work ever on this very album, even better than most of Deep Purple's best stuff. His alien riffs on Run With The Wolf and Starstruck are truly a testament to how creative a guitarist Blackmore is. There's a memorable solo on just about every song. \n\nRonnie James Dio is fantastic as always. The greatest metal vocalist ever is at the top of his game. The vocals he belts out on Rising would never be topped until years later, on his magnum opus anthem Heaven And Hell (Yes, I know he was technically in Black Sabbath, but he just stole the show). Songwriting is truly fantastic. Dio is probably the only man who could ever sing songs about rainbows, magic and faeries, and still have it be true metal. It's almost surreal to hear him sing a rather simple song about sex on Do You Close Your Eyes, but that's still a pretty catchy little tune. Probably the weakest on Rising, but for most songs that would be an honor. \n\nRising is a pretty short album, but it uses that to its benefit. Instead of cramming as much material as possible into Rising just to keep treading water, Rainbow recorded six tracks, all of which were completely memorable in their own right. There is NO filler on Rising. It may look a bit short initially, but it's entirely worth it. To make an analogy, it's like comparing a big bag of potato chips to a fine dessert. A big bag of potato chips (For example, Pantera's Far Beyond Driven) would be initially very enjoyable, but eventually you would just zone out and start eating the chips almost unconsciously. You may not notice when the bag is empty; you may not even care. It simply lacks much beyond the surface value. Whereas if you really take the time to savor the fine dessert and appreciate it for what it is, you truly enjoy it more and think better of it than the potato chips. However, if you eat the fine dessert with too much haste, it won't be as satisfying. In short, you really need to appreciate Rainbow's Rising as more than a time killer, but a full fledged EXPERIENCE. \n\nRising is a groundbreaking album that incorporates tons of different musical styles. Many musicians would imitate it, but no one would ever truly recapture the purely intangible, indescribable qualities that make Rising a masterpiece beyond measure. If you dare call yourself a metal fan, you MUST own Rainbow's Rising.\n",
        "\nHonestly, I had no interest in hearing any of Rainbow’s recorded material after Dio departed for bigger and brighter things. Though the band was known as “Ritchie Blackmore’s” Rainbow, everyone knows that’s only half true: Ronnie had as much a hand in the band’s glory as the man himself. His replacement, Graham Bonnet (later to score some more minor notoriety with Alcatrazz, serving as a bridge between Blackmore and his reincarnation, Yngwie Malmsteen) is a strong, capable singer, but without Dio’s flair for the fantastical, I knew that Rainbow’s future was unsure. Little did I know just how right I would be.\n\nTo say that Down to Earth is a swift descent in quality for the band is to state the obvious. Even the album title seems to reconcile this: no longer is Ritchie rising to lofty musical heights…he’s come back down to earth, to the realm of mortal conventions. Pop conventions, in fact. Foreigner’s string of runaway hits must have been the inspiration for miserably cheery pap like “Since You’ve Been Gone,” a song I’ve heard on the radio for years and never once connected it with the band that penned “Gates of Babylon.” The side openers are the worst offenders in this eager beaver department: “All Night Long” is cool post-Purple pomp for about twenty seconds before it nose dives out the fucking window. Horrible, horrible lyrics, and a slightly creepy pre-chorus that serves as teaser between the horrible verses and horrible chorus. Are you catching my drift? This song is horrible. Textbook case of self-parody if I’ve ever heard one, and it’s still not as terrible as “Since You’ve Been Gone” by any stretch of the imagination. I flipped the record and it turned into a Cheap Trick LP, holy shit! Just kidding of course, those guys at least had some tuneful stuff like “Dream Police” in their holster: “Since You’ve Been Gone” makes wimp-rock like “Surrender” sound grisly by comparison.\n\nBut the fact that Ritchie sold out his super cool band for Top 40 revelry isn’t the insulting part. What’s insulting is that, nestled between all the hooky, one-dimensional bullshit, are delicate shades of what once was and perhaps what might have been. Besides the occasional glimmers of hope in the average tracks, there are actually some really solid tunes in here. “Eyes of the World” seems to be the one that everybody likes on this album, and what do you know? I like it too. Not exactly the atmospheric metal from the old albums, but close enough for my money. “Making Love” shadows this, as does the bluesy, emotional “Love’s No Friend.” Glimmers here and there of the old Rainbow shine through the muck, such as a few choice moments in “Danger Zone” and “Lost in Hollywood,” but why oh why couldn’t they have been the focus? I don’t get you Ritchie, and I’ve really been trying.\n\nIt’s a case of talented musicians performing schizophrenically, trying to balance artistry and accessibility, entertainment and enlightenment, and finding out just how Herculean a task it is. Not as horrible as it perhaps could have been, but at no point during the album’s run was I not reminded of how much better the band was just a few years prior.\n",
        "\nFirst off let it be known that this compilation only takes you as far as 1994 of Ronnie James Dio's storied career. It was released in 2003 so nothing from Dio's last LP (\"Master Of The Moon\") or the Black Sabbath reunion aka \"Heaven & hell\" could even be considered. This is Elf until the end of Ronnie's Warner Bros. contract in 1994 (the LP \"Strange Highways).\n\nIt's no surprise Rhino wanted another Dio compilation since 2000's mighty fine 16-track \"The Very Beast Of Dio\" collection sold over 500,000 copies in the U.S. (Gold certification in the U.S.). It was culled strictly from the band \"Dio\" and was the first North American \"best of\" (the import \"Diamonds: The Best Of\" had been available since 1994). Instead of doing \"The Very Beast Of, Vol. 2\", which they certainly could considering many many Dio tracks didn't fit on the first collection, they opted to compile Ronnie James Dio's career from his band Elf, through Rainbow, through Black Sabbath, through the Dio band. They decided to attempt this within the space of two compact discs (160 minutes max and Rhino admirably filled approximately 153 minutes worth).\n\nSo how did they do? Rhino usually nails it on their choices and they did pretty darn good on \"Stand Up And Shout: The Anthology\". It's obvious some knowledgeable people were involved with the selection. Of the 29 cuts here 3 come from the band Elf, three from Rainbow, eight from Black Sabbath and fifteen from the Dio band(s).\n\nDISC 1\nEven though the music of Elf, a bluesy, rock'n boogie band, isn't what Dio became famous for the Rhino team, for the sake of being thorough, picked three songs from two of the three Elf albums (\"Hoochie Koochie Lady\" & \"I'm Coming Back To You\" from \"ELF\" and \"Carolina Country Ball\" from the album of the same name, re-titled \"L.A. 59\" in the USA. Nothing from the final Elf LP, \"Trying To Burn The Sun\" is included). Personally, I would have rather Elf been excluded altogether and the collection begin with Rainbow, but that's just my take on it. The three Elf songs are cute but nothing special.\n\nNext up are the Rainbow years. Here is where Rhino makes it's first mistake. Not including live albums, Rainbow made three albums- one of which, \"Rainbow Rising\", is considered a Metal masterpiece. Rhino did pick one from each LP- three essential cuts, 'The Man On The Silver Mountain\", \"Starstruck\" & \"Long Live Rock & Roll\", but \"Sixteenth Century Greensleeves\" & \"Stargazer\" should have been included, perhaps in place of the Elf tracks. Or they could have cut one of the Black Sabbath tracks. Again, though, there's only so much space and Metal tracks are usually long so....it is what it is.\n\nThe Black Sabbath pics are nearly perfect. Three from \"Heaven & Hell\" (title cut, \"Neon Knights\", \"Children Of The Sea\"), three from \"The Mob Rules\" (title cut, \"Sign Of The Southern Cross\", \"Turn Up The Night\") and one from \"Dehumanizer\" (\"Computer God\"). In addition there's a rare live version (not from the the infamous \"Live Evil\" but from the 1982 \"Mob Rules\" tour) of \"H&H's\" \"Voodoo\" included. Nice as that may be they could have included another \"Dehumanizer\" track (such as \"I\") or one of the missing Rainbow songs instead. Afterall, this collection is not a \"rarities\" collection so baiting the hook with one or two is a bit obnoxious.\n\nDisc 1 closes with another rarity, a ripping version of \"Sacred Heart\" from the VHS-only (so-far) \"Sacred Heart-The Video\" release (rather than the mediocre 'Intermission\" EP- a stopgap 6-cut release foisted on the public between Dio's proper albums in 1986). A better rarity and better bait would have been the studio cut \"Hide In The Rainbow\", which was only released on \"The Dio EP\" during the \"Sacred Heart\" tour. The track has since been released on the bonus disc from the Deluxe Edition re-issue of \"Sacred Heart\"\n\nDISC 2\nRather than just copy the tracklist from \"The Very Beast Of Dio\" Rhino swaps a few tracks for a few not included on \"Beast\". \n\nFirstly, from the stone classic LP \"Holy Diver\" we are served up a healthy five tracks (title cut, \"Rainbow In The Dark\", \"Stand Up And Shout\", \"Straight Through The Heart\" & \"Don't Talk To Strangers\"), all but one (\"Don't Talk To Strangers\") of which were included on \"Beast\". From \"The Last In Line\" comes three cuts (title song, \"We Rock\" & \"Egypt (The Chains Are On)\"). The UK hit \"Mystery\" is dropped in place of \"Egypt\". Though a better song I think \"Mystery\" should've remained being it was so popular. Being that a live version of \"Sacred Heart\" was included on disc 1 two more obvious songs from the LP \"Sacred Heart\" are here (\"King Of Rock & Roll\", \"Hungry For Heaven\"). This is the second gaffe. The missing \"Rock And Roll Children\" (included on \"Beast\") was Dio's biggest hit single (#26 in the UK). \n\nAnother mistake comes with the \"Dream Evil\" LP selection. While the great title cut and \"All The Fools Sail Away\" are included the hit \"I Could Have Been A Dreamer\" is not. At this point it seems clear that Rhino wanted this new compilation to be somewhat supplementary to \"The Very Beast Of\". My theory is a bit stymied though by the fact the final two songs from Dio's final two Reprise LPs, \"Lock Up The Wolves\" & \"Strange Highways\") are the same as on \"Beast\", ie, the title track of each album. There were plenty of worthy tracks they could have swapped these for and been forgiven (\"Wild One\", \"Hey Angel\", \"Jesus, Mary & The Holy Ghost\", etc..).\n\nNow that they've released \"Black Sabbath: The Dio Years\" Rhino should do a 2 disc set on JUST the Dio band years. \"Stand Up And Shout\" was doomed from the start. Too much material for two discs. A good effort but ultimately flawed.\n",
        "\nThis 2 disc compilation is the first collection that covers nearly his entire career from his time with Elf, through Rainbow, through Black Sabbath, through Dio (band) to his last days with Heaven & Hell (Black Sabbath). Rhino's decent 2 Disc \"Stand Up And Shout: The Anthology\" stopped short at his final Warner Brothers LP (\"Strange Highways) but is a better overall (but still flawed) set since there's some glaring omissions on \"Mightier Than The Sword\" that were logically included on the Rhino set (\"The Last In Line\" being the most shocking). Only those not familiar with all the albums Dio was involved with will be pleased with this sampler. It does give a more comprehensive portrait of the man's career but it simply is not possible to fit all the essential tracks from Elf to H & H on two discs (not even three could cut it). It earns a point for including one track from his guest work on Roger Glover's \"The Butterfly Ball & The Grasshopper's Feast\" (\"Love Is All\") , which was ignored by the Rhino set but loses more points for omitting the most popular Rainbow track (\"The Man On The Silver Mountain\") and some essential Dio band tracks (\"Stand Up And Shout\", \"The Last In Line\", \"Hungry For Heaven\", \"Dream Evil\", \"Lock Up The Wolves\", etc.. Now, being that there was limited space only the absence of \"The Last In Line\" is completely unforgivable. They chose only \"We Rock\" from the \"The Last In Line\" album instead but since the disc clocks in at only 69+ minutes space was left for atleast one more track and \"The Last In Line\" is a no brainer!)\n\nElf was not a metal band but a boogie-woogie blues rock band so not much is needed despite three full albums being recorded by the group. It's not who Dio became and not what made him famous. Only \"Carolina Country Ball\" from the LP of the same name represents Elf of the 27 tracks offered here. After The Glover track that follows comes the Rainbow years- represented by a surprising 8 tracks. While the great \"Stargazer\", \"Catch The Rainbow\" & \"Run With The Wolf\" are here where is \"The Man On The Silver Mountain\" for crying out loud?!\n\nThe first two Black Sabbath stint is represented by six tracks (\"Heaven & Hell\", \"The Mob Rules\", \"Children Of The Sea\", \"Voodoo\", \"Die Young\" & \"Country Girl\"). This is acceptable even though \"Die Young\" & \"Country Girl\" could have been replaced with \"The Sign Of The Southern Cross\" & \"Turn Up The Night\" and made it slightly better. There's nothing from the infamous \"Live Evil\" set but \"Neon Nights\" appears later being the live version from Heaven & Hell's 2007 tour and subsequent album/DVD \"Live From The Radio City Music Hall\".\n\nNext up is the Dio band years. Not including the weak live EP \"Intermission\" Ronnie's namesake band released five albums before Ronnie rejoined Black Sabbath. Those five Dio albums are represented by a paltry five tracks. Two from \"Holy Diver\" (title track, \"Rainbow In The Dark\"). one from \"The Last In Line\" (\"We Rock\"), one from \"Sacred Heart\" (\"Rock And Roll Children\"), one from \"Dream Evil\" (\"All The Fools Sailed Away\") and nothing from \"Lock Up The Wolves\". Now while all five of these tracks belong here more tracks from these albums should have been chosen in place of too many Rainbow tracks (based on the premise something would have to be cut to make room).\n\nThe Black Sabbath reunion LP \"Dehumanizer\" is represented by \"I\" (not a bad choice even though \"Computer God\" is better) and then three more Dio band albums are completely ignored (yep, nothing at all from \"Strange Highways\", \"Angry Machines\" & \"Magica\") as the collection jumps to 2002's \"Push\" from the album \"Killing The Dragon\" followed by \"One More For The Road\" from the LP \"Master Of The Moon\". While these were the logical choices for the \"KTD\" & MOTM\" albums \"Magica\" deserved at least one track here (such as \"Fever Dreams\") instead of \"Shadow Of The Wind\", one of three tracks recorded by H&H for the \"Black Sabbath: The Dio Years\" compilation. Then comes the aforementioned live \"Neon Knights\", the penultimate track before we get to the fantastic final cut, \"Bible Black\". It was the best pick from an overall great album by Heaven & Hell, entitled \"The Devil You Know\" in 2009- one year prior to Ronnie James Dio's death.\n\nThe first lesson is that you shouldn't try to cram onto two discs a career that consisted of over 20 studio albums, many live albums and guest appearances. The second is that if you're gonna try find someone hip who will narrow it down to the bare essentials. Sometimes they got it right (\"Stargazer\", \"Heaven & Hell\", \"The Mob Rules\", \"Holy Diver\", \"Rock And Roll Children\", \"Push\" & \"Bible Black) and often they got it wrong (leaving off \"Man On The Silver Mountain\", having too many Rainbow tracks, the omission of \"The Last In Line\", \"Hungry For Heaven\" and nothing at all from four Dio albums: \"Lock Up The Wolves\", \"Strange Highways\", \"Angry Machines\" & \"Magica\").\n\nAll in all. Another incomplete \"best of\" comp that will have a short shelf life until someone does it right with a four disc box set.\n",
        "\nForgetting about historical and revolutionary aspects of developing music, Ritchie Blackmore decides that he wants to be commercial... but not so commercial. That's why he intends, maybe under the effects of a weird substance, to enlist his love-hate-tragedy friend Ian Gillan to lead the vocals. Anyway, the thing is that, after a bit of auditions, Grahan Bonnet, a nice vocalist with unique tone, maybe not as gifted as Dio, but with that distinctive touch in his throat, took the role and with the priorly-astonishing additions of Roger Glover in the bass, Don Airey, one of the most talented keyboarders in metal and always powerful Cozy in the drumms, the thing was promising, in one way or another, to say the least.\n\nBut (and as previous reviews by members of the Metal Archives cleverly noted) the thing about this record is the unshaped or undefined idea for it. It was like doing something like \"we love your attention and we are looking for that so anxiously, but we are not a commercial rock band\" and this is precisely why all the potential of this formation gets lost. That's why in here we can find very good (though not brilliant) pieces like \"Eyes of the World\" (by far, the best and the most metal-oriented track of the album, with Ritchie and Airey stealing the show with their progressive-neoclassical soloing) or \"Lost in Hollywood\" (a remanent spirit of Dio's hard-rocker tunes in previous albums, specially Ritche Blackmore's Rainbow or Long Live Rock n Roll, with Bonnet taking the high pitch) with excellent commercial songs like \"All Night Long\" and \"Since You Been Gone\" (both catchy and with a little touch of hard rock, being the album opener track a nice fusion of \"trying to be popular while trying to look heavy\" stuff. The riff does the thing, Bonnet's singing suites perfectly for the duty and the rest of the team, from backwards, fill the line with total correction. The latter one, well, that's almost pop-rock and stuff. But somehow, the lyrics enter your head and stay there for long time) with crappy and totally forgettable pieces like \"Makin' Love\" or \"Danger Zone\", totally unworthy for such a group of talented guys and a guitar god, as Blackmore is. The lyrics are goofy, stupid, without any sense and there isn't anything remarkable in the musical aspect. \"No Time to Lose\" and \"Love's No Friend\" are fillers with a more straightforward feeling and they have one or two things to be rescued, maybe some solo's by Ritchie, Bonnet's singing and Airey's work on the keyboards. Maybe not blasters, but they contribute to make those songs a little bit more enjoyable.\n\nFor fans of early and modern heavy metal, this album could enter in the in-between line of deception and the famous phrase \"it could have been worse\". And actually, it isn't totally crappy, au contraire, there are some worthy pieces here. We can find embryonary Don Airey doing his thing, Bonnet is at one of his higher points and Blackmore, as usual, even when he does shit, he does it with style and unique talent. That's why we can find here a couple of powerful and mindstrucker solos and riffs. And if we are going to judge this thing according to the success it had, well, the singles \"All Night Long\" and \"Since You Been Gone\" both reached the Top-5 in the UK and the rest of Europe, so, we can't say other thing but \"hey, Ritchie, you did it again\". \n\nIf you are a total metalhead, well, this is, maybe, the last \"standable\" album by Rainbow until their total downfall with Joe Lynn Turner. A little resurrection would be found with Doogie White. Enjoy it carefully if you think you are tough enough to play it. Otherwise, you better stay away from it and leave this only for Rainbow fans (not even Blackmore fans, the Turner era and Blackmore's Night are for those ones).\n",
        "\nAfter releasing one of the finest albums by Deep Purple (The Battle Rages On) and with a bit of dissapointment because of the disregard it recieved mostly from massive media because of the crappy grunge movement, that pest from America and after major misunderstandings with Ian \"I Hate You\" Gillan, our favourite guitar sorcerer decides to summon his Rainbow for the definitive last time.\n\nNow, the momentum and things implied into this were totally different from the environment that surrounded Blackmore's band more than 10 years ago. Somehow, Blackmore learnt from his mistakes and figured out that, since Ronnie James Dio's departure, nothing worthy for memories and future appraisal was made in his band. Yes, he achieved a bunch of top-10 hits, both in the UK and in the mainstream rock charts of US with some singles, but the name \"Rainbow\", far from being recalled worldwide as a popular rock band, actually was only remembered by that hardcore mass of fans, lovers of the now long and distant heavy metal period, when Blackmore, with a little help of Dio and Powell were developing (or highlighting Deep Purple's previous works) what would become later modern power metal, in the half-seventies. Notwithstanding, Blackmore, who enjoyed the taste of major fame and glory in DP, couldn't avoid from his mind the hope that in any moment and for any reason he could hit it hard and return to the spotlight.\n\nThat's why this album, far from being a \"return to the roots\" remains a hybrid attempt to look \"hard but cool\". From the bunch of guys he hired for the job, only Doogie White gained a name throughout time and was talented enough to share the line with Ritchie. Being this said, the content of the record lies between brilliance and, above all, mediocrity.\n\nThe opener \"Wolf to the Moon\" gives us no glimpse of the real intentions here. We get a nice intro opening, not a masterpiece but nice enough, and then Blackmore riffs and Doogie sings. The metal spirit can be felt here, we are sure about it, but there are dark reminiscences of pop Rainbow era here. This thing anxiously tries to look and sound mainstream. It never gets away from this. \"Cold Hearted Woman\" and \"Too Late for Tears\" are lingering around the same spot. Enjoyable, but hybrids, without defined shapes. An erratic Blackmore plays them without gràce and the rest of the crew do not provide very much to save this. And it is hard to admit it, specially if you are a diehard fan of the string sorcerer.\n\n\"Hunting Humans\", without being a heavy metal masterpiece, shows us a brighter side of this album. It's about a seductive tune, with seductive lyrics and a nice tempo and beating. If versatility was the thing in here, clearly, Blackmore has it. But then, we get \"Stand and Fight\", definitely the worst piece in here. I mean, I have no problem with country sounds and using harmonica as an instrument but, ¿really? I mean, Ritchie, my idolized, ¿is that you? This track is the perfect proof of that hybrid feeling I'm talking about. Of course, this can be a way to be creative and to think outside the box, most of us, metalheads, detest to admire another styles of instrumentation besides the classic ones. But, hey, believe me, this was not the way and here Ritchie Blackmore shows us that he is human, after all. \"Ariel\", then, is a nice jewel. A song driven by that mid-eastern-like riff, it gains strength with Doogie White's singing, which is the finest one in the whole album.\n\nThen \"Too Late for Tears\" returns us to the feeling produced by the first songs. An uninspired riff with correct but uninspired performances make this a totally forgettable piece. And almost the same would have happened with \"Silence\" if it wasn't for that riff, which makes us think about a possibility that Ritchie Blackmore, the wizard and guitar god of all times, could have been ripped off this from Metallica. To me, well, there is no posible way that Ritchie could have stolen this. No and no and no and no. And let's not talk about it anymore (and it is a mellow and weak song, by the way, disposable).\n\n\"Black Masquerade\" is the top guy here. Powerful, filled with feeling and with a legendary solo by Blackmore, here we return to hope. Here we remember why Ritchie is Ritchie. And of course, here we started to know this dude Doogie White, delivering the best. A masterpiece worthy of \"Stargazer\" or \"Kill the King\". Maybe not as good, but worthy enough.\n\nFor the closing, \"Hall of the Mountain King\" and a cover by Yardbirds \"Still I'm Sad\". From the latter one there are not many words to say. But the first one has some unique-ness. It's like an ode to the classic influences Blackmore recieved during his lifetime, the riff based in the famous ouvre by Edvard Gireg \"Peer Gynt\" is a blast and this song, which has lyrics written by the female I-shall-not-name, stands strong as a nice creation by Ritchie.\n\nIn any case, Ritchie looked for indulgence with this record. From his fans and specially from himself. Maybe, for a couple of reasons, we shall never know if he found it or not. Well, we are most sure that he actually found something during that time, but wasn't precisely the way for returning to the metal realms. An evil spell corrupted Ritchie's mind and we, probably, are going to die without knowing what could have happened if he kept on playing his Fender instead of those medieval things. ¿Can someone perform an exorcism on Ritchie and deliver him from the devil, if you know what I mean? We will really thank your help.\n",
        "\nAfter bringing the genoma for future power metal (or expanding it, actually, as Deep Purple would be the primary ancestor in the bloodline of that cited genre) in the magical and overwhelming Rainbow Rising, Blackmore decided to slow down a little bit while keeping the feeling that turned his band into a major force (specially recognized, in that time, in Europe). That's why we can find in this record the same early metal touch with a bit of trying-to-sound like everybody. But, hey, Rainbow wasn't a band like other ones. Here we have Ritchie Blackmore, Ronnie James Dio and Cozy Powell and dude, that's a hell of a trio. The rest of the band is expendable. And actually, as far as we know, Blackmore did the bass work and a little bit of the keyboarding so, we are talking about a power trio, with the full letters of the expression in every semantic, metaphoric and literal sense, with a couple of guys filling the chartier.\n\nAnyway, this is not as heavy as Rising, but stands still as an example of early power metal. And besides of it, we can find in here a couple of evergreen heavy metal anthems like \"Long Live Rock n Roll\" with Ronnie James shattering it with the catchy lines in the piece and \"Kill the King\", that unique song, with a resemblance of what has been created by Blackmore's previous band a couple of years ago and making a confirmation of the lines that would construct modern power metal. Yeah, from the keyboarding solo opening til the frenzy riff and Powell's insaniac drumming, this song is ahead of it's time. And then, we found after these brilliancies a couple of very good metal pieces: \"The Shed\" and \"Gates of Babylon\", both similar in many things but with a different approach. The first one has a beyond-earth-as-usual solo by Ritchie, with a ballsy beat by Cozy and singing by Dio. The lyrics are one of the best written ones by Dio. The second has a kinda atmospheric organ intro, picturing us the middle east moods and with Dio's singing as a top notch, lifts us to the finest examples of power metal in their time, oh yes it is.\n\nWith the nice ballad \"Rainbow Eyes\", a return to the roots planted in Ritchie Blackmore's Rainbow, we witness a very good and solid album. The main issue here is the weaker perspective taken by Blackmore, leaving the metal-at-all-costs style and trying to return slowly into the hard rock patterns. That's what happens with songs like \"Lady of the Lake\", \"Sensitive to Light\" and \"L.A. Connection\". They have nices riffs, nice singing and \"Sensitive to Light\" is even a speedy one. But they simply fail to deliver and that's because they were not for intending traditional heavy metal. Au contraire, Blackmore reduced Dio's influence and dragon-medieval themes to the minimum, so they could try to reach a larger audience. That's why precisely, \"L.A. Connection\" was a single release even before \"Kill the King\" in some places. If there is a weak spot among these nice but overall-weak fillers, it's precisely this. Trying to look cool and failing in the attempt. Blackmore would later hit it, with Bonnet and Turner, releasing maybe three or four hit singles in both sides of the Atlantic, but that's not heavy metal and that's not of our concern. We would have to wait until 1996 for a little bit of Rainbow's classic power metal. Ronnie James disliked the musical direction taken by Blackmore and left. Cozy didn't stand for very long either. And this is the last great album by the band, talking metally and creatively. As stated before, they reached a middle range popularity later, doing AOR stuff, but that's not of our business. Long Live Rock n Roll, Long Live Ronnie James Dio and hail to the string sorcerer, Ritchie Blackmore. Heavy metal world misses you, is waiting for the Rainbow Eyes to return.\n",
        "\nNo matter how many times you listen to this, there isn't anyway to feel boredom or melancholy. As a matter of fact, Rainbow Rising is one of the greatest (if not THE greatest) album ever made in the history of heavy metal. There is nothing that can reach such a virtuoso and technical atmosphere without entering in the pretentious world (i.e. Dream Theater or the late Rush) being at the same time catchy and ponderous. Yes, this is it, the cumma sum laude moment of Ritchie Blackmore, maybe the most talented guitar player of the heavy metal world, the moment where he finally realized the full power and energy he could produce from a music band. With Ronnie James Dio (say no more) and Cozy Powell on the drums, there isn't absolutely nothing to complain here, only loving and tenderness can be the feelings towards this piece of magic.\n\nThe opening theme for \"Tarot Woman\", that dreamy atmospheric keyboarding that leads us slowly into the universe of Rainbow, is beyond reach. Not even Jon Lord's rubato theme for Knocking at your Back Door, nor any other keyboarding intro from whoever you want to name can do the thing this intro does. And when this slowly fades away, giving place to that very known Fender Strat, well, we are simply witnessing the rise of a major force, something beyond reach, beyond imagination. Cozy, as usual, delivers the best and Ronnie James Dio, the most loved vocalist in the metal realm shoot us with one of his finest performances ever. (And, to make this clear, we have a technical draw between this song and the next five ones from this same album, because in Rainbow Rising, Dio shows us why he is the total god of metal singing). Can you believe this?\n\nJust after that witchcraft made by Blackmore and colleagues, we get a near-4 minute epic. Can you believe this? A kinda-short epic? Yes, and bloody hell it is a good one. I'm talking about \"Run With the Wolf\". Traditional metal with a touch of doom and the lyrics are moody and totally medieval with the most of the simplicity, Blackmore and crew roll it away while Dio slashes us with his unique voice. Another masterpiece.\n\nThe usual heavy bluesy formula by Ritchie has place here once more. \"Starstruck\" has a funny chorus, easy lyrics and maybe one of the most lick-y and aggressive riffs by Blackmore. A high score here for Cozy, who blasts it all away \"metallizing\" the song with his drumming. Then, we receive the catchy and more friendly sound of \"Do You Close Your Eyes\", even if may sound weak in the whole album, it never gets pale and actually, is a nice way to prepare us all for the cataclysmic rage that's about to come. An enjoyable filler, there is not much to say about it.\n\nCozy Powell, one of the pioneers in modern metal drumming, gives us a powerful solo which prepares us for the coming thunder. An outrageous headcutter and from-beyond riff by the String Sorcerer (though with some similarities with the one featured in Deep Purple's Stormbringer) mixed with the bass lines and the keyboard-filling chords provides the field for another out-of-Earth song by Rainbow with Dio swallowing and dropping everything away like the vortex of a tornado. \"Stargazer\", with its lyrical theme shaped in medieval moods, is an eight-minute asskicker, the song that every metal band would have liked to compose. Heavy-doom-power, you name it. A major piece in the history of the genre. Can you believe this?\n\nAnd if you thought that was it, babe, the greatest closer song of all times reaches your ears and propels them to another galaxy once more - \"A Light in the Black\". Ritchie Blackmore, oh my sweet lord, with his magic fingers can do the impossible without doing impossible things. The main riff for the song is not quite difficult but in the same time has such a tremendous power and feeling that you can only sigh and admit that this guy is a total guitar god. And let's not even talk about Blackmore's complexity when we are in the soloing moment. Cozy is gorgeous once again, as well as the rest of the band and, oh Dio, the vocals are fresh, powerful, slashing and totally metal. Another epic masterpiece in the same album, can you believe this?\n\nYes, you may have noticed. There is a great question in here. Can you believe this? Can you believe in such a brilliancy in the same place? Yeah, of course, only six songs. That's why I can't give the perfect rating for this record. It leaves you craving for more. But believe me, young metalhead, these six songs are more worthy than the whole discography by, say, Metallica. Do I believe this is the finest album in the history of heavy metal? My answer would be that, at least, it's in the top five ever. Even the art of the album is so majestic and mighty, so there is nothing you can do about it. If you don't like this thing maybe you should enter in YouTube and look for Justin Bieber's highlighted videos. You are not worthy of the Rainbow Rising!\n",
        "\nThere was a band led by a talented sorcerer, a guy who could almost give life to his guitar. This guy, who pioneered the genre we all love, met in strange circumstances a crafted swordsman with a sharped and edgy voice. Together with a couple of musicians (notably, Cozy Powell amongst them), Ritchie Blackmore and Ronnie James Dio created a trio of majestic albums which, until today, amazes us with their power and unique sound. Everything was a spillover of magic and craftsmanship. The finest metal band of their era.\n\nEven if Blackmore himself claimed that Rainbow was like a second-handed band, we fans know that this affirmation probably rests on the fact that it never reached the popular status achieved by Deep Purple and this, most likely, hurted Blackmore's ego. Notwithstanding, the influence and importance of the band is as much as the importance of DP in heavy metal.\n\nBlackmore and Elf gathered and Dio gained automatic sympathy from Ritche. Medieval stories and metal approach, that's what our favourite arrogant guy wanted and Ronnie James was the exact guy for doing it. Without excesive efforts, \"Ritchie Blackmore's Rainbow\" was born and still today sounds as a solid startpoint for the evolution of NWOBHM.\n\nSimilar to Smoke on the Water, \"Man on the Silver Mountain\" has a catchy riff and a solid lyrical line. The atmosphere of the song is well defined by the contribution of the organ sounds and, well, the only problem is the weak drumming and bassing. But, anyway, it's a great opener and reflects the spirit of the whole record. \"Self Portrait\" follows a classic formula crafted by Ritchie Blackmore: the heavy bluesy song. Here, besides of the powerful riff by RB, the only worthy thing is Dio's singing. Yeah, this song is far from other victorious heavy bluesy pieces like Lazy or Mistreated. Lacks of feeling, specially because of the other members of the band, weaklings in a far inferior position comparing with the guitar player and the vocalist in what's about musical talent. And the whole album will be filled of this thing. There are a couple of nice non-metal covers in this album: \"Black Sheep of the Family\" and \"Still I'm Sad\", they are completely enjoyable and forgettable, I'll say no mre about them.\n\nThe high pitches of the album are the two ballads in here. \"Catch the Rainbow\" and \"The Temple of the King\". The feeling here, forwarded by Dio's singing with the always witchy guitar work by Blackmore are beyond any dimension. There wasn't anything impossible for Ronnie James and Blackmore knew it. That's why he did this songs precisely the way they are now and they are the finest examples of Dio's magic voice, now that he is gone. Of course, he did brilliant work in other songs, but here, he was like a greek god of music.\n\nThe weaker songs of the album are \"Snake Charmer\" and \"If You Don't Like Rock n Roll\". They are total fillers, created for being fillers and they do their job, but justly, without inspiration or light. Though, the riff in Snake Charmer is a very intricate one.\n\nFinally, \"Sixteenth Century Greensleves\", one of the major masterpieces by Rainbow. This song does a lot and still can do it. The lyrics are a masterful creation of a genious and sounds so traditionaly heavy metal that you can't do other thing but smiling and banging your head listening the song. Perfect, Blackmore and DIo.\n\nThis nice fairy tale kept on going for a long and irregular time. It's fair to say that one of the finest albums by Rainbow is this one, by far. Usually, people thinks that Dio's Rainbow is the finest one. I tend to take that opinion as a right one, even if there are good things in the other line-ups. This story kept on going for two more albums and remains as one of the finest ones in the history of the genre. If you thought this album was a good one, well, get ready for the couple next to come. Buy this record, it won't dissapoint you.\n",
        "\nThis landmark Rainbow proved to be a turning point in the careers of all involved, but most particularly of Ritchie Blackmore and Dio; it not only established Rainbow as a credible band rather than a mere vanity project of Blackmore's, but it also saw Dio join the front rank of metal frontmen from the era. It would not be too much of an exaggeration to say that most of Dio's subsequent career would be based around refining and perfecting the fantasy metal blueprint provided by this album, both in terms of his Dungeons & Dragons lyrics and the driving proto-NWOBHM sound on display.\n\nI do not say that to denigrate Dio - quite the opposite. The fact that he was able to base so much of his future career on what was accomplished with this album just goes to show the rich creative vein tapped by it. As well as Dio's stalwart vocal performance and Blackmore's usual virtuoso guitar playing, major kudos has to go to the rhythm section of Jimmy Bain and Cozy Powell, whose driving fast-paced playing provides a rock-solid base for Blackmore and keyboardist Tony Carey's solos and Dio's quasi-operatic proclamations.\n\nAlthough it's of obvious historical interest, on a purely musical level I wouldn't count the album as an unadulterated classic. Tony Carey's keyboard playing, aside from the intro to Tarot Woman, is usually upstaged by the rest of the band and doesn't seem to add much to the compositions beyond the odd bit of texture here and there, to the point where it feels as though he's present solely because artsy rock bands in the 1970s were supposed to have a keyboardist. In addition, the songwriting flags a bit after the first half of the album, with Stargazer getting repetitive to the point where I never want to hear Dio yelling \"Whips and chaaaaaiiins\" ever again. In addition to this, fans of more brutal and aggressive metal styles - or even harder and heavier Rainbow-influenced variants of NWOBHM, traditional metal and power metal - may find it to be rather tame. But still, when I'm in just the right mood for a Dio fix and I don't want something as heavy as his Sabbath material or as quintessentially 80s as his best solo work, Rising hits the spot.\n",
        "\nFresh off the heels of their strongest studio album and the excellent live release On Stage, it was not yet known by 1978 whether Rainbow would settle into a pattern of releasing consistent, quality albums or not. Would the writing team of Ritchie Blackmore and Ronnie James Dio continue to deliver, or fade away into one-hit-wonder obscurity? Would they recreate and expand on the masterful Rising, or aimlessly plug away with nothing worthy to show for it? Thankfully, Rainbows third release Long Live Rock ‘n’ Roll is not only a great album, but resides among the (admittedly expansive) collection of the best albums Dio has performed on. The songs are all focused and fairly heavy for the time, and there is the same pleasing experimentation and versatility on display that the band’s previous albums featured as well.\n\nFirst things first: the fan-fucking-tastic songs. The evolution of traditional heavy metal energy and attitude can be directly traced to “Long Live Rock ‘n’ Roll”. It moves along at an above-midpaced clip, the verses supported by Blackmore’s brilliant, bouncy riff and Cozy Powell’s steadfast drumming. However, Dio steals the show here (as he is wont to do), because the man’s singing is so passionate here I have no choice but to sing along every goddamn time I hear this song. The guitar solo is amazing to boot; there’s no mistaking these leads for bluesy nonsense or stoned jams. This is a dead-on, completely over-the-top heavy metal mayhem styled guitar solo that tops off the track. You’ll wish that the chorus goes on forever, and it nearly does! “Live! LIVE! LIIIIIVE!!”\n\nAfter a song that more or less defined the ethos of heavy metal (soon to be found in everything from Running Wild to Razor), it’s hard to believe anything else would stack up: thankfully, two more tracks to reach the standard of perfection set. “Gates of Babylon” is this album’s epic: a vaguely Middle Eastern-tinged track with a main riff filled with mystique and an extremely powerful chorus. Boasting a keyboard intro similar to that of “Tarot Woman”, the track puts new member David Stone to good use here, as his keys both set the exotic mood present and return in the hook to bolster Blackmore’s riffs. On the other hand, “Kill the King” is less foreign in approach, but just as effective. Introduced a year earlier on 1976-77 tours, it’s a song everyone loves, from Lee Altus to Ralf Scheepers to my own mother. Fast as all hell, with that great, original riff and keyboard lick, it definitely is one of Blackmore’s most overwhelming “metal” creations, and damn does he do it well. More screaming heavy metal solos and an even more intense vocal performance from Dio are backed up by the return of Powell’s destructive double-bass patterns, making a return from “A Light in the Black” on the previous album. These three songs are all among Rainbow’s best songs, demonstrating the band’s undeniable influence on the slowly evolving metal scene: you won’t find anything more reminiscent of power metal by 1978 than “Kill the King”.\n\nThe remaining five songs range from great to mediocre, yet enjoyable. “Lady of the Lake” has some stop-start riffing that owes more to rock music than proto-metal, but it’s still a good song which would be worth it’s time in a live Rainbow set. “The Shed (Subtle)” is just incredibly fucking cool when you get down to it: the song opens with a sexy guitar solo, and gets mean as hell in the verses, featuring an aggressive, stomping riff which is guaranteed to force you into a headbanging rhythm. Again, Powell puts up a notable performance, as his drumming is powerful and drives the song along with gusto, hammering his bass drum and snare deep into your memory banks. Although “The Shed” doesn’t quite fit in with anything Rainbow has done before, it’s probably my pick for the band’s most underrated song and one of my personal favorites.\n\nIn true Rainbow fashion, Long Live Rock ‘n’ Roll does indeed sport a few pedestrian, more traditional numbers as well, although I would rate them above the songs of that sort on Ritchie Blackmore’s Rainbow. “Sensitive to Light” resembles “Black Sheep of the Family” from their debut, and I like this one more due to an unexpected melodic break in the middle of the song. Blackmore injects a few good melodies into the song, and prevents the track from falling into complete boogie-rock-n-roll oblivion. “L.A. Connection” is a bit awkward as well, despite sporting a particularly spirited performance by Dio; he’s clearly way into this specific song, for some unknown reason. I don’t know if it’s about drugs, prostitutes or what else, but the song’s slow pace and repeating riff do get tiring faster than the other songs here. However, neither of these songs are embarrassing to listen to, and nothing here mandates cruel and unusual usage of the skip button.\n\nAll that is left is the most unique and versatile song here, the album closer “Rainbow Eyes”. A lengthy, quiet song influenced by classical/folk/medieval music (whatever the hell is the right term, it certainly isn’t rock music), it’s a fitting end to the album. Here Blackmore and Dio trade in their raucous, energetic performances for contemplative, emotional ones, and the songs’ quality is difficult to determine. The flutes and other archaic instruments give it an intriguing, Renaissance-esque feeling, but the complete lack of a climax of any sort may put off listeners. Imagine something akin to “Stairway to Heaven, but with more solos and no mindfuck of a finale. I generally enjoy the lucid “Rainbow Eyes”, but some may feel disappointed with its bare-bones songwriting.\n\nLong Live Rock ‘n’ Roll is easily Rainbow’s second best album. After this release, Dio would leave and join Black Sabbath, a collaboration that would produce some of metal’s utmost finest releases. Without Dio’s influence, Rainbow would become solely Ritchie Blackmore’s project, and would stagnate in a rather hilarious manner as it headed in a more commercial direction. So here ends what was one of both rock and metal’s most promising outfits, not to mention the band that catapulted Dio to the front of heavy metal glory. And Long Live Rock ‘n’ Roll is a more than adequate chapter to ends this book: a consistent and rewarding combination of the proto-power metal of Rising and the rock ‘n’ roll sensibilities of Ritchie Blackmore’s Rainbow. Let it live!\n",
        "\nRising belongs to a rare category of albums because at once it contains elements that mark it as a clear product of its time, while simultaneously anticipating trends that wouldn’t appear full-fledged for another decade. For every second that points forward towards Maiden and Helloween there’s another moment that sounds like early Rush or Uriah Heep. That said, there are reasons Rising became one of the albums everyone mentions when talking about how metal evolved from a disparate collection of vaguely heavy rock bands to a single, definable scene.\n\nFirst, there are no weak links in the group in terms of musical ability. Ronnie James Dio always did his best work when surrounded by his musical equals, whether the riffs were handled by Blackmore or Iommi. His albums with lesser guitarists tend to be more vocals-oriented and they don’t work as well. Thankfully that doesn’t happen here. Richie Blackmore knows how to craft exciting riffs, whether they be fast proto-power-metal (“Tarot Woman”) medium boogie-woogie (“Run with the Wolf”) or epic doom (“Stargazer”). Bassist Jimmy Bain and drummer Cozy Powell can play along with Blackmore’s flying changes, and keyboardist Tony Carey is every bit Blackmore’s match in terms of soloing. When this version of Rainbow found their groove, they were the best band in the world.\n\nUnfortunately they didn’t always find it. Three of the album’s six songs are essentially standard 70s hard rock tunes, and only one of them, “Run with the Wolf,” works. It’s swung a-la .38 Special and features a lot of bluesy stop-start riffing. The verse and chorus, where Dio just repeats the title phrase, are nothing special in terms of melodies or harmonies. Fortunately, the pre-chorus bit in between with the chromatic descent (“There’s a hole in the sky, etc.) presents enough of a style change that the song stays exciting.\n\nThat can’t be said about the other two “mainstream” songs on here, “Starstruck” and “Do You Close Your Eyes.” Memorable riffs are decidedly absent from both tracks, and worse, the lyrics are really lame. I understand that metal was different in 1976, but trying to seduce women with clever phrases and having to hide from a crazy groupie are about as unmetal as you can get, especially for a bona fide deity like Dio. Dio does what he wants, he doesn’t have to ask! At least “Run with the Wolf” was about werewolves. You can hear the lack of inspiration in his voice on the other two songs.\n\nOn the other hand, Rising’s longer songs, “Tarot Woman,” “Stargazer,” and “A Light in the Black,” are so ahead of their time they might as well be called power metal. “Tarot Woman” gallops through shifting keys, RJD wailing away about witches and dark forests and the night sky, while “Stargazer” and “A Light in the Black” match Tolkeinesque lyrics with an appropriately epic lengths and blazing solos from Blackmore and Carey. Here, Blackmore clearly understands that in melodic metal of this sort, there must be harmonic excitement to underscore the lyrical and vocal drama above, and he crafts riffs and progressions that lead inexorably onward, yet are always surprising. I could just listen to the transitions in and out of the “Where is your star?” section in “Stargazer” and be happy forever.\n\nOverall, what you’ll remember after listening to Rising are the monster, building riffs and quite honestly one of the greatest vocal performances of any genre at any time in history. Yes, a couple of the songs suck, but they are easily skippable and don’t take up much space on the album. So, if you don’t mind a little melody in your metal or are looking for one of the great leaps forward in the history of music, this is an album to get now.\n",
        "\nConsidering that the genre didn’t really become solidified until the early 1980s, heavy metal music of the 70s is often somewhat overlooked and considered lacking in areas of songwriting and production. For the most part, all that are well-recognized are Black Sabbath’s first six releases, as well as some Judas Priest and Motorhead albums, which were gaining popularity by the end of the decade. Meanwhile, bands like Rush and Scorpions often lacked recognition until they found greater success in less metallic styles of rock in the 80s, while American groups like Sir Lord Baltimore and Legend lamented in obscurity. But one of the greatest metal albums of that era (perhaps of all time) was Rainbow’s Rising, a record which more or less brings together everything great about the year 1976. Ritchie Blackmore’s engrossing lead playing, Ronnie James Dio’s unique and powerful voice, and Cozy Powell’s intense and involved drumming help turn this into the second best album of the 1970s. This sophomore release displays Blackmore’s seasoned songwriting talents delivering strong, focused tracks, one of which remains one of the best metal songs to date.\n\nOpening with one of Rainbow’s strongest songs, the infectious catchy “Tarot Woman” demonstrates the sound of Deep Purple taken to its logical conclusion. Beginning with an almost “spacey” keyboard passage, the song explodes into a hammering, staggered riff which bounces along at a happy pace, supported by Dio’s energetic vocals and a mystical-sounding chorus. Make no bones about it, this song is the power metal that Deep Purple had always hinted at, years before Diamond Head or Black Sabbath cemented the genre. Also notable is the fantastic 8 minute closer “A Light in the Black,” which is surprisingly fast due to Powell’s uncompromising double bass pattern and the incredible dueling leads between Tony Corey’s keys and Blackmore’s guitar. They even play a few harmonized melodies near the end which makes you wonder why Iron Maiden never recruited a keyboardist. Overall it’s very fast, epic and intense stuff for 1976, which rivals and outstrips similar proto-speed metal such as “Highway Star,” “Paranoid” and “Tyrant.”\n\nTracks 2, 3 and 4 are all rather similar: short 3-4 minute rock-ish songs that make it very clear that this is 1976, not 1984. Yet the quality is still high, as “Run With the Wolf” switches between a slower, methodical riff and an exciting, carefree chorus with much aplomb and memorability. “Starstruck” is comparable, featuring a more upbeat tempo and funny lyrics about a cat-and-mouse chase between a woman and the recipient of her unwanted attention. Very catchy (“she’s nothin’ but back luck!”) and immediately accessible, it’s my top pick for these three traditionally-minded tracks. “Do You Close Your Eyes” goes a bit overboard in this department, being the shortest song here which doesn’t hint at what Rainbow is really capable of: it’s the one reminder of the mediocrity that occasionally showed up in Ritchie Blackmore’s Rainbow, but the riffs still deliver despite its goofiness. Even the lyrics are a bit cringe-worthy: “Do you close your eyes when you’re making love, yeah, yeah/Makin’ sweet love to ME, yeah!” Quite hilarious, really.\n\nBut however great all of the songs on Rising are, the album really comes down to one track. One single song that defies all conventions, one song during which the planets align (no matter the time of year) and the hand of a goddamn deity leads Rainbow into the most orgasmic 8 minutes and 27 seconds of music the 70s ever produced. This song is “Stargazer,” and it will be the greatest song you ever hear, whether you realize it or not. “Stargazer” is the reason why Dio is revered. “Stargazer” is the reason why Ritchie Blackmore remains worshipped by guitarists even after he abandoned rock music and refused to even play “Smoke on the Water,” of all things. “Stargazer” is the quintessential metal epic: a true tour de force of heavy music.\n\n“Stargazer” is why we listen to heavy metal.\n\nBeginning with an intense drum fill by Cozy Powell (easily my favorite drum intro ever), “Stargazer” soon settles into a majestic, heavier-than-Jesus main riff which sets the tone of the entire song. It’s a simple, three-note affair, but never before and never again has so much been accomplish with straightforward “dun-DUN-DUN-da, dun-DUN-DUN-da” riffing. Dio’s vocals completely steal the show, however, reaching an emotional performance that even rivals his work with Black Sabbath. During the chorus, the listener is introduced to the fact that “Stargazer” features the Munich Philharmonic Orchestra, and they (rather unbelievably) don’t sound out of place whatsoever. Despite Blackmore’s classical training, I couldn’t help but be skeptical of the inclusion of an orchestra here, but it truly works wonders: I have no qualms saying that this single song triumphs over all other attempts to merge heavy metal and symphonic music.\n\nNot even halfway through the song, Blackmore belts out an immortal guitar solo: completely out of this world in terms of composition, emotion and tension. Perhaps it’s not as over-the-top or demented as his playing on “Child in Time,” but the reserved nature of the solo offers all of the power of that song with added breadth and a warped, almost trance-like atmosphere. By the time the lead finishes, “Stargazer” has gone through all of the differing sections it has to offer, yet it keeps getting greater and greater. The remainder of the song goes through one more verse, and 3 minutes of excellent vamp and improvisation by Dio over the Munich Philharmonic Orchestra and the echoing strains of the guitar chords. The final piece of “Stargazer” is like a whole new song unto itself: the finale must be heard firsthand to understand how the pure energy and atmosphere could make something which was already heard before in the song even better. Oh, and the lyrics are about an evil wizard that enslaves humanity and forces the construction of a tower that pierces the sky, so he can reach the stars he so fondly gazes at. Yes, this song has it all.\n\nRising is Rainbow’s finest hour. Here, the band is focused and cohesive in all aspects: a noticeable step up from the band’s slightly muddled debut. It comes as no surprise that every extraneous band member on Ritchie Blackmore’s Rainbow was replaced for this album. Songs like “Tarot Woman, “Starstruck” and “A Light in the Dark” are amongst the best offered in metal by 1976, weaving a power/speed metal tapestry before anybody really understood heavy metal would become. Every time “Stargazer” comes on, time stands still and rapture begins. Even today, Rising is powerful and musically relevant, as it will always stay.\n",
        "\nAs the one year anniversary of Ronnie James Dio’s death approaches, I have dug up and re-touched these reviews of his golden age, which I wrote shortly following his passing. This is my manner of tribute to the man, my small way of giving back to a musician who gave us all so much.\n\nWhen you get down to it, Rainbow offered some of the greatest albums of the 1970s, thanks to the talents of former Deep Purple guitarist Ritchie Blackmore and future rock n’ roll giant Ronnie James Dio. Merging Blackmore’s experience in blues and his classical training with Deep Purple’s prototypical bombastic heavy metal thunder, Dio’s majestic vocals completed the band’s recognizable sound. Although the band would reach great heights from 1975 to 78, their debut is not quite a mind-blowing, life-changing release, however great some individual songs are. Ritchie Blackmore’s Rainbow is like warm cookie dough: however tasty and delectable it may be at first, it becomes apparent mid-digestion that it is mushy, undercooked and not as satisfying as it would have been had you fully baked it. Like cookie dough, this album is a great snack I love from time to time, but when I crave Rainbow I’m not likely to choose this debut over the warm, delightful cookies that are Rising, Long Live Rock n’ Roll and their plethora of live releases from the 70s.\n\nI’ll start off with the bad: those annoying bits of undercooked dough that annoy me so. “Black Sheep of the Family” is the reason Rainbow was formed, as Deep Purple refused to record this Quartermass cover, leading Blackmore to recruit Dio for this project. It’s a silly little rock n roll number with fun verses but nothing else substantial. There isn’t much inherently wrong with it, particularly in terms of “normal” Deep Purple songs, but I never look forward to this track. I’m also not a huge fan of “Snake Charmer” which has an weird riff under the verses that isn’t really a riff at all, just some bouncy musical noises that doesn’t support what the song is capable of, like the slinking, twisting guitar solo. Yes, this is Ritchie Blackmore we’re talking about, with talent as noticeable as his ego. Every tune here, even the mediocre ones, is guaranteed to have a fantastic lead or solo. But even that can’t save “If You Don’t Like Rock n’ Roll,” a genuinely annoying number with silly boogie-piano lines courtesy of the somewhat irrelevant keyboardist Mickey Lee Soule. Dio, I most certainly DO like rock n’ roll, but I do not like this filler of a song. Go join Black Sabbath or something.\n\nBut may I remind you, this is cookie dough we are talking about, and it is delicious no matter how much of a cookie it may not be. There is some fantastic hard-rocking material to be found here, not too far removed from intense Purple tracks like “Lazy” and “Fireball.” “Self Portrait” is a solid song caught between mediocrity and greatness, but Rainbow REALLY hits the nail on the head with “Man on the Silver Mountain” and “Sixteenth Century Greensleeves.” The former opens the album with an amazing but simple riff and stomps along with an unbeatable, organ-heavy groove. Possibly the single catchiest Rainbow song, this track even beats out the perfect “Stargazer” as my most listened song by the band. The chorus is excellent, and here Dio really comes into his own: he has a smaller range and lower register than Ian Gillan and Rob Halford, but is just as (if not more) expressive and powerful as those two. His commanding and intense vocals are hard at work on this album, marking 1975 as the year that Ronnie James Dio really started turning heads and began his legend as one of the greatest vocalists in heavy metal. He is just as good on “Sixteenth Century Greensleeves,” which is a bombastic, proto-power metal romp with another brilliant chorus and, as expected, an immensely enjoyable guitar solo courtesy of Blackmore. Live performances of this track are even greater, opening with Blackmore’s calming take on the original “Greensleeves” as well as an extra heavy crunch due to the live atmosphere. The price of Ritchie Blackmore’s Rainbow is worth these two songs alone.\n\nHowever, no Rainbow album would be complete without Blackmore reveling in the past. The mournful and bluesy “Catch the Rainbow” is the perfect counterpoint to the classically-influenced “Temple of the King.” “Catch the Rainbow” is a definite fan-favorite, using its slow and calm tempo to build suspense with Dio’s lovely croons and Blackmore’s inspirational chords and leads. “Temple of the King” is just as great; a somewhat forgotten song featuring classical acoustic guitar and one of the most satisfying song structures on the album.  Showing off Rainbow’s emotional side, these two great songs round up the general sound of the band at this early point in their career. Good, no?\n\nRitchie Blackmore’s Rainbow is a great album; this much cannot be denied. It’s simply the fact that Blackmore would eke out two more masterpieces with Rainbow and Dio would go on to have a magnificent career performing heavy metal that overshadows this release, even though it is superior to Deep Purple’s post-Machine Head fare. This album isn’t perfect as a whole, but it is still very enjoyable. Rockers like “Man on the Silver Mountain,” “Sixteenth Century Greensleeves” and the instrumental Yardbirds track “Still I’m Sad” bang out like the best of metal offered in the 70s. The band displays a multi-faceted variety throughout their debut, and the potential is obviously there; it would take only another year for Blackmore and Dio to capitalize on it.\n\nR.I.P. Ronnie James Dio (1942-2010)\n",
        "\nAfter Ritchie Blackmore left Deep Purple for the millionth time, the Man in Black brought back his baby in Rainbow one last time before venturing into the medieval times with Blackmore’s Night. This last incarnation of the band basically featured a bunch of nobodies with Doogie White on vocals, Greg Smith on bass, Paul Morris tickling the ivories, and John O’Reilly on drums. It is easy to see why Blackmore picked Doogie to sing because of his resemblance to one of his former singers in Ronnie James Dio. While some may find Doogie trying too hard to be like Dio, he does a fine job on this album and closes the end of Rainbow with a sparkle.\n\nMusically speaking, this album is kind of a cross between the Dio-era albums and the more commercial and pop oriented direction with Joe Lynn Turner. The most commercial sounding of songs though does not reach a level of “I Surrender” or “Magic.” However, Blackmore is not just rehashing the glory days with majestic power metal tunes or catchy hook-ups as he introduces some new elements to Rainbow’s sound.\n\n“Hunting Humans (Insatiable)” and “Ariel” are two brooding tracks which are haunting with their vocal delivery and dark moods. The former has a thumping riff and plods along with Doogie shining on the microphone. I think the song is about vampires and it just adds to the coolness this song brings. The latter tune, “Ariel”, has a biting, quick riff and lets Doogie shine again. The closing to the song features a nice solo by Blackmore. Both these songs are highlights of the album.\n\nThe true masterpieces lie near the end of the album with “Black Masquerade” and “Hall of the Mountain King.” These two rank near the top in Rainbow songs. A great, dancing guitar riff decorates this fast number and a soaring vocal performance makes this song Grade A material. The abrupt acoustic break in the middle of the song brings a nice touch as well and fits in seamlessly with the song. This is a bit of foreshadowing to what Blackmore would be doing in the future and still to this day. “Hall of the Mountain King” bears no resemblance to the power blast by Savatage, but it employs a classical tinge that Savatage’s did. The mad riffing and castle roaming lyrics make this one a winner.\n\nWhere “Stranger in Us All” fails is with the driving rockers that were more known in the Turner-era of Rainbow. “Cold-Hearted Woman” reminds of a country song and that is not a good thing. The cheesy lyrics don’t help either. “Stand and Fight” also falls on the dull side even though the use of a harmonica and the up-beat nature make the song a bit interesting. “Silence” is another song about love that has a nice guitar part, but the odd use of a horn section puts this one in the bad barrel. If these three were left off the album, I’d give this upwards 90%, but that can’t happen here. \n\nIn the end, what we have here is a solid and very good end to the Rainbow saga. While a couple of the songs tend to be boring, there is nothing offensively bad and are worth listening too. “Black Masquerade” and “Hunting Humans” will bring people back for more with this release and is a good way to remember when Ritchie Blackmore still let his electric guitar shine.\n",
        "\nAfter making three stellar albums with Ronnie James Dio, Ritchie Blackmore wanted to take a new approach with his band Rainbow. Dio exited the group and in came Graham Bonnet who started Blackmore's mission of hitting Top 40 on the charts. Bonnet brings in a more soulful and gruffer style to the band and fits the aptly titled “Down to Earth” perfectly. \n\nAs the first chord churns in “All Night Long” it can already be heard that this is a radical departure from the Dio records. With a riff resembling that of “Burn” from Ritchie’s Deep Purple days, the song is a catchy, up-beat tune. While it reeks of commercial excess, it is still very enjoyable and a solid start to the album. \n\nWhile “All Night Long” shows what the new direction Rainbow is going in, “Eyes of the World completely swerves the other way. The song begins with some spacey, futuristic keyboards from the new maestro in Don Airey and bursts into a lead by Ritchie. The track has an epic feel to it and could have easily fit onto a Dio album.\n\nThis album meanders from being really good at times and also being really bad at times. The Jekyll and Hyde nature of “Down to Earth” is what prevents this album from reaching its potential. Ritchie delivers standout tracks in “Love’s No Friend” and “Lost in Hollywood”, but then he comes back with total stinkers in “Danger Zone” and “Makin’ Love.” “Danger Zone” has one of the dumbest choruses with “Looking for love is a danger zone.” It just sounds so stupid and unfortunately the rest of the song can’t save it.\n\n“Love’s No Friend” could be called Rainbow’s version of “Mistreated.” It has the melancholic, bluesy riff accompanied by a brilliant, soulful vocal performance from Bonnet. “Lost in Hollywood” is a great closer with a driving riff and vocals with a rapid vocal hook by Bonnet just before the chorus. The solo is what really shines on here though and if Ritchie just let it rip on the rest of this release; it could have been something special. \n\nI could not talk about this album without mentioning “Sine You Been Gone.” This was the song that showed Rainbow was serious about going commercial. The Russ Ballard penned tune is addictive and undeniably catchy and it did exactly what it was supposed to do. It got Rainbow noticed and on the charts. I find enjoyment in the track, but it is not going to be everyone’s cup of tea.\n\n“Down to Earth” saw the entry of Roger Glover into the fold the new bass player for the group. With the talent this man has, there are unfortunately not too many awesome bass lines. The only one worth mentioning is “Eyes of the World.” That is the only track where he shines. It is the same case with Cozy Powell. Again, he has extraordinary talent, but his drumming was effectively neutered on this album.\n\nAs stated before, it is the Jekyll and Hyde nature of “Down to Earth” that dampens the listening experience. The album has its shining moments with “Lost in Hollywood”, “Eyes of the World”, and “Love’s No Friend”, but a couple tracks bring it “down” a couple notches. However, it is still an enjoyable record and worth the listen. This release saw the band take a dip into commercial territory, but the next album would see them take the plunge.\n",
        "\nRainbow's live shows were certainly an event. Over the stage ran an electronic rainbow that was so expensive to maintain and transport that it almost made the tour unprofitable. On the stage was a band that put on shows that were, depending on how you look at it, either mindblowing or bombastic and a showcase for mindless ego-stroking. Songs that were 3-5 minutes long in the studio were stretched out exponentially with solos, jams and the occasional foray into another song. \n\nFor many bands from the 70's, the live stage was an opportunity for a band to show what they were really made of. The lifeless production jobs that bogged down so many bands from that era (including this one) were replaced by microphones that captured the band in the raw. The guitars were heavy and the keyboards mean and dirty, the drummers did far more than just keep the beat. All of this was taken to an extreme by Richie Blackmore. Even though bands like Cream had done something similar, I can't think of a band that allowed so much time for one member to take the spotlight. \n\nThe band is at its best when it's amping up and improving upon the relatively punch-less studio versions of their songs. \"16th Century Greensleeves\" in particular is just so superior live that there is no comparison. \"Kill The King\" has a greater intensity as well, turning the tune into a speed metal anthem. The absolute best part of the album is hearing Richie and Dio rip it up playing Deep Purple's \"Mistreated.\" In all honesty, I'd take this version over the Deep Purple counterpart any day. I can't tell which affects me more, Dio's unbelievably powerful singing throughout the song, or Blackmore's heavy yet bluesy guitar playing. Cozy Powell is superb on drums as well in this song and throughout the album. He really was one of the top drummers in the 70s because he could play so fast (check out his footwork) yet play with so much feeling that is lacking in many of today's drummers, which sound more like metronomes than anything else.\n\nGranted, some songs go on for too long. \"Long Live Rock 'n' Roll\" is a fine tune if we exclude the several minutes where Dio interacts with the crowd in the middle; it really ruins the momentum of the song as well as the effectiveness of the climax at the end. \"Catch The Rainbow\" would have been better if trimmed to 12-14 minutes rather than the full 17+ minutes; the song is a definite improvement over the original, but there are too many dull moments where there isn't much going on. \n\n\"Man On The Silver Mountain,\" much like \"Long Live Rock 'n' Roll,\" is great while the band plays the actual song, but then everything sort of tails off while Blackmore noodles around on his guitar for a while and they segue into \"Starstruck\" for a few minutes before going back and finishing the original song. \"Still I'm Sad\" barely resembles the original and has a jaw-dropping drum solo from Cozy Powell, although to be perfectly honest I usually skip past it since, much like Led Zeppelin's \"Moby Dick,\" hearing the same long drum solo more than several times gets boring after a while. Sadly, they chose to finish with \"Do You Close Your Eyes.\" Let's just say that not even this awesome band in a live setting can salvage this dreadful song.\n\nThe greatest thing about \"Live in Munich\" is how incredibly well the band's sound and energy are captured. The sound is a definite improvement over \"On Stage\" and all of the instruments can be heard clearly. One must also credit the makers of this album because they presented a full Rainbow concert, flaws and all. Do I wish that perhaps \"Tarot Woman\" and \"Stargazer\" had been included instead of some of the longer sections and \"Do You Close Your Eyes\"? Sure! However, this is what a Rainbow concert in 1977 consisted of; the fact that it's on a CD format allows the listener to skip through any unwanted excess. Even though there are flaws on this album, this is a must own. There is no better way out there to experience what made Rainbow so great, especially as we mourn the loss of one of heavy metal and even rock's greatest icons.\n",
        "\nReleased less than a year after the success of their self-titled album, Rainbow's \"Rising\" finds Richie Blackmore further exploring the fantasy metal themes hinted at earlier. It seemed that the more that Blackmore and singer Ronnie James Dio wrote music together, the stronger their chemistry got. They are the only two members that returned from the debut. \"Rising\" marks the entry of drumming legend Cozy Powell into the band, and he adds considerable rhythmic strength to the songs he's allowed to open up on (like \"Stargazer,\" for instance). Other times he plays the role of a typical rock drummer.\n\nThis album suffers, at times, from what all of the Rainbow albums suffer from: too much restraint in order to promote accessibility. The production lacks any sense of heaviness at times. \"Do You Close Your Eyes\" is such an awful song that it tarnishes the whole album (especially if you have it on vinyl and can't skip it). Despite its long length, \"A Light In The Dark\" is more of a poppier song with a long, yet surprisingly boring, instrumental section in the middle. This band has a lot of potential, but Blackmore and Powell's restraint keeps adequate songs like \"Starstruck\" and \"Run Like the Wolf\" from achieving anything greater.\n\nOn the other hand, we have \"Tarot Woman,\" which could easily be a metal song had the guitars not been neutered in the studio. Dio shines on vocals and Blackmore has a good solo in the middle, but it's the guitar riffs and incredible drumming by Cozy Powell that make this song so great. We also have \"Stargazer,\" which is arguably Rainbow's best song and contains what is easily Blackmore's best guitar solo recorded in the studio while with Rainbow. This is a song that influenced countless metal bands (thankfully they chose this song and not \"Do You Close Your Eyes\"). Both of these songs are hurt by Tony Carey's incredibly dated \"futuristic\" keyboard sounds and would have been far better served by the heavy organ sounds of a Jon Lord or Ken Hensley-type of player.\n\nOverall, \"Rising\" is a decent album with a couple of spectacular songs. In all honesty, one could probably skip the purchase of this album and go with the Rainbow anthology instead, unless maybe if they are a completist. Dio gives some great performances, but even he cannot save some of the lackluster songwriting. This is far from a classic, but certainly has historical value and was most likely a great influence on many of your favorite bands.\n",
        "\nIt was pretty obvious in the time period leading up to this album that the band was probably going to splinter soon. Aside from the fact that Richie Blackmore is notoriously difficult to work with is the constant rotation of band members. Fortunately this means that Tony Carey and his terribly outdated keyboards have been replaced by the more traditional Hammond organs of David Stone, which fit the music much better.\n\nSong-wise, this is probably their most consistent album. The title track, despite the cliche title and lyrics, is a foot-stomping rocker. The oft-covered \"Kill the King\" is an example of early speed metal and is one of Rainbow's finest songs. \"Gates of Babylon\" is a worthwhile mini-epic with some fine guitar work by Richie Blackmore. There are also a bunch of accessible rockish songs like \"Lady of the Lake\" and \"L.A. Connection\" which are aimed at mainstream audiences. The closer, \"Rainbow Eyes\" is a frustrating listen because it has the potential to be a magnificent, breathtaking finale. The folk-ish, medieval sounding first half is spruced up with a flute and a string-quartet, but the song flounders and goes nowhere in the second half. There is no payoff, which was disappointing for me. Others may like how laid-back the whole thing is.\n\nRonnie James Dio again gives an outstanding performance, whether it be the singing on the rockers, snarling on more metallic songs or crooning on the quieter moments. Even though this is Blackmore's band, the real reason to hear this album is because of Dio's fantastic vocal work. The two virtuosos, Blackmore and Cozy Powell, are very restrained, probably in an effort to keep everything simple and accessible. I see this as a waste of talent; the live versions of these songs far surpass their studio counterparts (this is true on all three of the Dio-fronted albums). \n\nAlso, the production of this album, even on the remaster, is very rock-sounding. The guitars lose that heavy-blues sound that Richie brought to his live performances and makes everything seem too polished and safe. There's no bite to any of the instruments, as well as no feedback or guitar-squeals. This is another reason why the live recordings of Rainbow songs far surpass the originals, the guitars sound raw, like they should. \n\nSo is this album worth owning? Sure, especially if you have a keen eye and can find the remaster at a low price. However, money-conscious people can just get the Rainbow Anthology without really missing out on much. Dio is the main reason to hear \"Long Live Rock 'n' Roll;\" everything else is passable but not exceptional. Dio would soon leave after Blackmore wanted him to sing a song about cheating in a relationship (another attempt at a hit single) and would go on to join Black Sabbath and release the landmark \"Heaven and Hell,\" which would far surpass everything Blackmore would release afterward.\n",
        "\nHaving a large collection of cloned or otherwise useless compilations under your name is something of an occupational hazard if you’re an established name in heavy metal. Few suffer from this dilemma more than the founders of the genre Black Sabbath and many of its members who since went on to their own projects, and although Dio has been an established name on his own, he has a fair share of pointless releases under his moniker. This particular release essentially functions as a poor man’s “Stand Up And Shout: The Dio Anthology”, as it covers most of the esteemed metal icon’s career since the 1970s. They took the route of less Elf material and more Rainbow and Dio songs, which results in a much heavier and more progressive character, but botch the song ordering and essentially churn out a two disc version of most cheap song sampler versions of compilations that ought to go for $4 a pop at best.\n\nTo give you an idea as to how random this comes off at times, I invite you to listen to the song “Hoochie Koochie Woman” from Ronnie’s Elf days and then listen to either “Sign Of The Southern Cross” or “Dream Evil” immediately afterward and then tell me if placing a formulaic old school rock song with an exceptional vocal performance next to either a longwinded acoustic doom epic or a heavier and faster version of “Man On The Silver Mountain” with a 1987 production would make sense when listening to an album, compilation or not. There is very little sense of pacing going on here at all, apart from a compilation that tries desperately to sound unique from those that use either the tried and true chronological approach, or some variant of an album emulation approach where the songs are placed in a certain order to simulate the feeling of listening to an actual studio release. The only place where this even begins to succeed at sounding like the latter of these two approaches is at the beginning with “Holy Diver”, which has that pristine keyboard intro with the sound of wind in the distance, a perfect segue to any album.\n\nA positive aspect of this album that does make it a superior one to many single CD compilations is that the greater amount of space gave the compilers the ability to represent every album in Dio’s lengthy career with his own band. Too often albums such as “Lock Up The Wolves” and “Dream Evil” are woefully under represented and sometimes not at all, but here everything seems to be equal, though there is a little bit of a tilt towards “Holy Diver” and “The Last In Line”, which is typical of most compilations under the Dio name. The choice of “Evil Eyes” was a particularly interesting choice given that it essentially functions as the missing link between the two albums represented here, having the more keyboard oriented character of “The Last In Line”, but also having a really hard edged riff approach that is fairly similar to “Stand Up And Shout” and “Don’t Talk To Strangers”. The only disappointment here is that from the vast number of great songs off of “Lock Up The Wolves”, they had to go with the obligatory title track, which is all but interchangeable with the similarly slow and doom driven “Shame On The Night”.\n\nI give this album credit for making some interesting song choices and for attempting to differentiate itself from the rest of the point, but this is not something that I recommend parting with monetary wealth over. You get songs on here that you won’t get on the similarly long compilation “Stand Up And Shout: The Dio Anthology”, but you don’t get any songs that can’t be found on other releases, whereas with the latter you get more Elf songs that are hard to come by and a solid live version of “Sacred Heart”. If you like anything by Dio from his respective work with Rainbow and Sabbath, save up your pennies and get one of his full length releases from his 80s back catalog, you’ll thank me later.\n",
        "\n'70s metal? Black Sabbath and Judas Priest. The mistake a lot of people make is ending the list there, because not only is this 1976 gem the metal god Dio's breakthrough album, it's one of the best albums in the 1970s to take Sabbath's foundation and run with it, altering enough to remain original but keeping Iommi's newfound invention of heaviness along for the jog. One complaint I do have lies in the songwriting; tracks like \"Run With the Wolf\" and \"Stargazer\" are about as metal as Iron Maiden (and definitely as metal as '70s Halford and co.), but \"Do You Close Your Eyes\" is nearly unforgivable, even if its simple rocking nature isn't uncharming as an 'every once in a while'. The song has similarities to Elf, Dio's former band that played softer blues rock with an upbeat, rock'n'roll vibe. Other songs flirt with being radio-friendly, but for the most part [i]Rising[/i] is a masterpiece of traditional metal, with \"Stargazer\" being the absolute peak of the whole affair (maybe even extending to Dio's career - it's that good; [i]Holy Diver[/i] is fun but can't hold a candle).\n\nThe album blasts off with a minute and a half of Tony Carey showcasing his keyboard abilities before transitioning into the song part of \"Tarot Woman\". Not my favorite track, but it does define the model that most tracks on the album follow. Ritchie Blackmore plays thick galloping riffs interspersed with well-placed lead guitar, always aided in rhythm by bass player Jimmy Bain and drummer extraordinaire Cozy Powell. Powell is a real standout on this album, punishing the kit at almost every opportunity - fills galore - and rarely descending into simple timekeeping mode (thankfully the rock influence doesn't show up everywhere). There are a few synth solos, but they don't get in the way. Guitar solos are more prevalent (a given considering Blackmore's ego?) and are usually good, sometimes great.\n\nDio is on top of his game here, putting on a flawless performance made immortal by unforgettable melodies - \"Where is your star? Is it far? is it far? faaaaaaaar?\" - perhaps trumped only by Dio's successful stint in Black Sabbath. There's no real need to split hairs, it's all good, but [i]Rising[/i] seems to be, for whatever reason, the least championed of his prime efforts. Unjustly so, as it's legendary stuff in the heavy metal/hard rock field, cherry-topped by a total epic in \"Stargazer\" - which, I forgot to mention, features the Munich Philharmonic Orchestra.\n\nAnyone interested in Dio, Blackmore or just one of the first great metal bands should definitely pick this up.\n",
        "\nRainbow's sophmore effort is timeless. 33 years after its initial release, the album is still impressive with its song structures, killer guitar playing, operatic vocals, and powerhouse drumming. Ladies and gentleman, this is the essential heavy metal album. With the addition of Cozy Powell behind the kit, this album features three musicians that are arguably the finest at their craft. Ronnie James Dio at the mic, Ritchie Blackmore with the guitar, and Cozy Powell with the drums.\n\nAfter a very good debut album, Rainbow took the driving, straight-up rock and roll style of their songs and expanded it to and early incarnation of what power metal would come to be. Longer songs and deep, impactful vocals take the listener on a journey of the senses and will leave you wanting for more. One of the negatives is that there are only six songs, but each leave their mark.\n\nFrom the warped keyboard opening by Tony Carey in \"Tarot Woman\" to the brooding, stomping drumming to \"Stargazer\" the musicianship of this record is in the elite. From the up-tempo numbers to the epic numbers, the writing is stellar and flows brilliantly. All instruments are represented with not one outweighing the other as the chemistry with each musician is remarkable. \n\nA difference from the debut is more usage of the keyboard. Tony Carey does a phenomenal job with over using the obnoxious high note and reflects well off the solo in \"Light in the Black.\" That song also perfectly showcases the talents of every individual and is a true classic. It also has the trippy, like \"whoa dude\" intro to \"Tarot Woman\" and erupts into a vicious riff from Ritchie. Tony also delivers some interesting atmospheric effects into \"Stargazer\" which is an impressive epic number. The genius that it took to write this masterpiece brings me to tears because it is incredible.\n\nWith the stellar amount of musicianship on this record, Rainbow \"Rising\" is in the pantheons of all-time great heavy metal records. Unfortunately, they would only make one more record after this because the fickle Ritchie would revamp the Rainbow lineup and sound. The six songs that comprise this record are all different and have their own unique style that makes them memorable. So put the horns up in the air and enjoy the magnificent Rainbow \"Rising.\"\n",
        "\nThe last album featuring the the powerhouse trio of Ronnie James Dio, Ritchie Blackmore, and Cozy Powell is one hell of a way to go out. All three turn in stellar performances and make this a top notch release. What separates this record from the previous two of the Dio era are the more complex, unconventional song structure and guitar parts of Blackmore. \n\nRitchie Blackmore is a great guitar player. That was probably the most obvious statement one could make, but the songs \"Gates of Babylon\", \"The Shed (Subtle)\", and \"Kill the King\" separate Blackmore from any othe guitarist. From the unique opening to \"Gates of Babylon\" to the walking, thumping of \"The Shed\"; these are cuts that not too many guitarists can emulate or achieve. The man is one of a kind and one of the best and there is no better vocalist to complement the Man in Black than Ronnie James Dio.\n\nDio does it all on this album. He can do aggressive vocals like in \"Kill the King\" or melodic, catchy vocals in \"Lady of the Lake\" or \"Long Live Rock 'n' Roll.\" He can go along with a fast number like \"Sensitive to Light\" or carry a number like \"Rainbow Eyes\" with his smooth and mesmerizing voice. The man can nail every note and can sing any kind of a song that Blackmore throws at him. He excels in voice control and perfectly sings off of Blackmore's riffing. This is truly a magnificent performance from Dio.\n\nThe other member of the tremendous three of course is the one and only Cozy Powell. The calculated way he attacks the drum kit is remarkable. He found a balance to not do too much and attacks at the most opportune times. The perfect example of this is \"Kill the King.\" The sound is so fierce and accelerating that the head-banging will make your neck sore and that is a fact.\n\nThis album would be perfect, but a couple of songs just do not live up to what these three men can do. While \"Long Live Rock 'n' Roll\" is a good opener and very anthemic, the chrous does become a little repetitive and should have been shortened. \"L.A Connection\" is a poor, plodding rocker that is an obvious song to get into the mainstream. It is a big disappointment, especially considering the other cuts found here. The last song that falls on its face is the odd closing \"Rainbow Eyes.\" I mentioned before of the remarkable performance Dio gives on the song, but that is all there is...just Dio. There is no guitar or drums throughout the seven minute song. The only instrument is a violin and flute and that is unacceptable!\n\nThis release is a shooting star for metal and has many enjoyable moments to take in. It is very unfortunate that this lineup could not stay together because there could have been many more incredible releases from this powerhouse, but then there would have been no Heaven and Hell, so there are some positives out of that breakup. One thing is for certain though and that is: Long Live Rock 'n' 'Roll and Long Live Rainbow!\n",
        "\nI consider myself pretty knowledgeable in 70’s heavy metal, but one band I unfortunately never really got into (until recently mind you) was Deep Purple. When people would discuss Ian Gillan’s piercing screams or Jon Lord’s crazy keyboard ramblings, all I could thing about was how overrated “Smoke on the Water” was. However, I did understand the genius of guitarist Ritchie Blackmore from his post-Purple band Rainbow. Even from their very beginning, with the eponymous “Ritchie Blackmore’s Rainbow,” it was pretty hard to mask the immense talent of the formidable group which was not only responsible for keeping Blackmore alive and well in the musical world, but for formally introducing legendary frontman Ronnie James Dio (did anyone really listen to Elf?).\n\nRealistically, things on Rainbow’s debut aren’t completely foreign to the Purple sound. Some of the crunchy rockers on here, such as the exotic sounding “Snake Charmer” and the organ-heavy classic “Man on the Silver Mountain,” aren’t far removed from Purple’s heyday. The key differences here are the lack of Jon Lord (meaning keyboards focused on atmosphere than technicality) and the addition of Dio. A completely different animal from Gillan, Ronnie’s voice has a strong, lower range that can be as expressive as it can be badass, perfectly suiting the metal-tinged rock ‘n’ roll that Rainbow offers up on here. And though they aren’t Roger Glover and Ian Paice, Jimmy Bain and Cozy Powell lay down a mean groove on this record. So good in fact, Dio would recruit Bain for his solo project a few years down the road. [EDIT: Jimmy Bain and Cozy Powell joined Rainbow after this album's release. The bass and drums here were provided by Craig Gruber and Gary Driscoll, respectively, both former Elf members. My apologies for the mix-up.]\n\nRocking numbers are the norm here, with plenty of opportunities for Ritchie Blackmore to show the listener that his guitar chops are as big as his ego (instrumental “Still I’m Sad” is pretty potent). But the truly special material is that which leans toward the mystical. For instance, “The Temple of the King” has a very moving, epic sound to it complemented by Blackmore’s classical acoustic lines. Or “Catch the Rainbow,” the bluesy Scorpions-like-ending-ballad that caps off the album in style. Sometimes it’s whole songs like these, but many times it’s just the little touches here and there that truly make the album (the little lead lick during the pre-chorus of “Man on the Silver Mountain,” the serpentine guitar solo of “Snake Charmer,” the tambourine hits on “Self Portrait,” etc. etc. etc. etc. etc.).\n\nIt’s a great debut album with a little something for everybody (particularly guitarists/bassists). Yet another mandatory 70’s rock/metal album from Ritchie Blackmore, a man partly responsible for quite a few classic 70’s rock/metal albums.\n",
        "\nComing off a more rock and guitar oriented \"Straight Between the Eyes\" the members of Rainbow came just one year later with the final record with Joe Lynn Turner and yet again a change behind the drum kit as Chuck Burgi replaced Bobby Rondinelli. This album features another change in style with more inclusion of the keyboard and guitar working together at the same time during the verses unlike the albums before. While a bit weaker than the previous, it is still a very capable record.\n\nWith the use of more keyboard, at times this record grows a bit stale and could have just used more guitar during some songs. On the opening track \"Stranded\", Ritchie and Dave Rosenthal work the notes and flows wonderfully and then near the end of the song Ritchie takes over with a cool stop-and-go riffing which is awesome. There are other times though, were things just sound too much of the same. \"Fool For the Night\" and \"Make Your Move\" are virtually interchangeable and are just about the same with little to no variation.\n\nSome songs on here are great classics however. While \"Can't Let You Go\" is very commercial and poppy, the operatic keyboard intro and powerful chorus is truly something to behold. \"Fire Dance\" is a song that fits the mold of the Dio-era tunes and features some great back and forth blazing soloing between the Ritchie and Rosenthal. \"Street of Dreams\" has like a vibrating keyboard and the sound is very original and has a nice melodic solo from Ritchie and great vocal performance from Joe Lynn Turner.\n\nTwo instrumentals are also on this album. See Ritchie doing instrumentals is exciting, but unfortunately they are not really that good. \"Anybody There\" is just Ritchie doing a slow paced guitar job which while a little bit interesting, it is just too short. That one can be tolerated, but I cannot say the same for \"Snowman.\" The electric and strange sounding drums totally detract everything from this. I do not know why they were trying to experiment with this, but all I know is that it is just terrible.\n\nAs was kind of alluded to before, the vocals again on this album are superb. Joe Lynn Turner really found his niche with the band and his melodic, somewhat gruff vocals fit the music greatly. He puts on stunning performances on \"Can't Let You Go\" by hitting the high note in the chorus and delivers a fine paced vocal line in \"Stranded\" and does an impressive job changing his pitch and delivery in \"Desperate Heart\" with his voice carrying on the verse and then kicking it into high gear in the chorus.\n\nNew drummer Chuck Burgi does a good job on the album as well. He does nothing spectacular, but he keeps the beat going, especially on \"Desperate Heart.\" Roger Glover again brings a great performance on the bass and has a real neat bass line in \"Stranded.\" \n\nAs this record was released, Ritchie had found the end of the rainbow so it seemed as he reunited with the classic Deep Purple line-up. This album is worth owning as it has some great tunes and fans will not be really turned off by it. Every musician has a slick performance on this album and is something to be enjoyed from the more commercial and radio friendly Rainbow.\n",
        "\nAfter a very commercial and mixed release of \"Difficult to Cure\", Ritchie and co. came back one year later with \"Straight Between the Eyes.\" There was another switch at keyboard as Dave Rosenthal stepped in to replace Don Airey. With the band coming back to the studio just a year later, it is amazing how Turner finally feels at place with the band and his voice shines on this record and Ritchie incorporating more guitar into the songs strengthens this release as well.\n\nThe best song is the opener \"Death Alley Driver.\" The running and thumping bass line of Roger Glover and the dueling guitar and keyboard solo is specatcular and shows the musicianship of Ritchie and Rosenthal. This could be called Rainbow's version \"Highway Star\" as it is about driving fast. This is one of the best songs Ritchie has ever done.\n\nWhat makes this album strong is the riffage. Some of the riffs displayed here carry a couple of the songs most notably \"Power\" and \"Rock Fever.\" The latter is very fast and high octane and the former has a mid-paced rocking riff with a nice drum beat to carry the flow of the song. \"Miss Mistreated\" also has some good moments despite the terrible opening with Joe Lynn Turner whining that he never meant to hurt his baby. \"Stone Cold\" is also a highlight with a haunting keyboard intro and goes into a fierce pounding with the chorus. A great, melodic and emotional guitar solo comes and completes this tune.\n\nA couple songs completely fail on here unfortunately. \"Tite Squeeze\" is a horrible, slow song with Turner begging his woman to bring him to his knees and give him that tight squeeze. This song literally made me sick. \"Tearing Out My Heart\" wins the award for another bad ballad about some girl who broke Turner's heart. Nothing interesting, just a typical ballad. \"Eyes of Fire\" closes the album and features some obsure arrangements like \"Gates of Babylon,\" but the problem is this is a Dio song. Turner sings his heart out on this tune, but it just sounds wrong with Turner singing it and plus the song itself is nowhere near as good as \"Gates of Babylon.\"\n\nJoe Lynn Turner does give one hell of performance on this album though. The way he quickly, but soundly sings \"Rock Fever\" is impressive as his melodic and brooding vocal line in \"Stone Cold.\" He doesn't seem to force or sound whiny on \"Death Alley Driver\" and articulates the vocals well. \"Power\" also demonstrates that he can deliver a fun, energetic rock song just about as good as anyone else.\n\nThis is the strongest album of the Joe Lynn Turner era of Rainbow. The guitar and keyboard performances of Rosenthal and Blackmore are supberb, and the vocals of Turner are impressive as well. \"Death Alley Driver\" and \"Stone Cold\" are the best on here and any fan will enjoy them. This is a straight-up, fun, energetic rock 'n' roll as it is very enjoyable for fans of Ritchie's work.\n",
        "\nWith the dawn of the 80's came a new Rainbow. Armed with a more accessible sound for the masses and a new, more poppy vocalist in Joe Lynn Turner, the first record to feature this new voice would be their most commercial effort released by the band. The ultra talented drummer Cozy Powell was gone too, and Bobby Rondinelli stepped behind the kit and had some tought shoes to fill. While Turner would be a good vocalist for Rainbow, there are times on this album where he seems a bit off.\n\nThe opener is \"I Surrender\" and right away it is known that this record is not going to blow your mind. The poppy guitar intro and the often reapeated chorus leaves something left to be desired. Luckily, the next track saved me from turning off this album. \"Spotlight Kid\" is one of the top songs Rainbow has ever done. There is a flashy, fast guitar riff and some nice vocal cuts by Turner, but it is in the solo where this song truly picks up. The back-and-forth soloing from Ritchie to Don Airey is utterly great and mesmerizing. It is like they were trying to outdo each other as the flow and the speed of it is something that just must be heard.\n\nUnfortunately, most of the album does not feature the musicianship as found on \"Spotlight Kid.\" It is widely known that Ritchie could rip some awesome guitar parts and solos, but on this album it seems like he was holding back. A standard little riff followed by a solo which is not memorable or mildy entertaining. \"Magic,\" \"No Release,\" and \"Freedom Fighter\" are all guilty of this. There is also the awful \"Midtown Tunnel Vision\" which is a bluesy, mid-paced rocker and Turner cannot sing something resembling the blues.\n\nAs I said in the beginning, there are times when Turner sounds a bit off. On \"Magic,\" he is just trying to hard to hit that high note in the chorus and seems a bit forced. In general, his voice is actually just a bit too high. Some of the verse parts \"I Surrender\" and \"No Release\" seem like they are supposed to be a bit toned down and lower as Turner's voice control is not there. At other times though, he sounds brilliant, like on \"Can't Happen Here\" and his voice flows well on \"Freedom Fighter\" as his voice goes from reserved to full blast and is the highlight of that song.\n\nThankfully, not everything is bad. \"Can't Happen Here\" actually has a great riff that sticks in your head and the snappy piano ignite the sound and is something very easy to get into. The closer \"Difficult to Cure\" is also one hell of an instrumental. It is one of Beethoven's symphonies with the arrangements made by Ritchie. There is where Ritchie truly shines as he totally rules the classical musical and breathing life into it with his guitar and again Don Airey has great works on the keyboard. What a way to close the album.\n\nThis album definitly is a Jeckyl and Hyde. The poppy, uninspired songs are really bad, but the good ones are really good and must be heard. Joe Lynn Turner delivers an adequate performance, but he would become better on the next two albums. Ritchie is good as always, though he holds himself back at times. \"Difficult to Cure\" is worth checking out as it is enjoyable, especially \"Spotlight Kid\" and is something fans of Ritchie, Rainbow, or AOR would like.\n",
        "\nGuitar virtuoso Ritchie Blackmore formed Rainbow after growing more and more frustrated with Deep Purple because of the fusion of funk and blues elements brought by new bassist Glenn Hughes and new vocalist David Coverdale. Ritchie left and formed his own band featuring a the little known Ronnie James Dio on vocals. Combining these two equals a formula to success.\n\nWhen the opening riff to \"Man on the Silver Mountain\" starts, you know its an instant classic. The addicting riff has the same effect like \"Smoke on the Water\" and the powerful chorous belted out by Dio makes this one of the best songs of all time. Another one of the classics on here is \"Sixteenth Century Greensleeves\" with the pounding, marching guitar riff and the melodic and soothing vocal line of Dio talking about a damsal in distress locked up in a castle back in the 1500's.\n\nFast and short rockers like \"If You Don't Like Rock 'n' Roll\" and \"Black Sheep of the Family\" are nice and speed the pace of the album. They are not spectacular, but they are nice little numbers. \"Self-Portrait\" is a nice mid-paced rocker with a great vocal number and the chorous is just magnificent. The \"down, down, down\" part is phenomenal and strikes a chord in me. I love it.\n\nA couple of the more obscure tracks on here are \"Catch the Rainbow\" and \"Temple of the King.\" The former has been known to be a great live number with the distinctive subtle guitar tone of Ritchie with the crisp vocals of Dio. Its a slow number and has more of an effect on the live then in the studio. \"Temple of the King\" has an acoustic guitar flow that comes straight from the Eastern European Renaissance style that Blackmore is doing nowadays. Its a cool track and there is certainly no other Rainbow song like it. Dio gives a masterful performance on both these tracks as Joe Lynn Turner could not touch \"Catch the Rainbow.\" Turner is a good singer, but when hearing him sing this song watching a Rainbow concert, he is simply not better than Dio on it.\n\nThis album is definitly a must have for fans of Dio, Blackmore, and hard rock/metal. The tandem of both these musicians is awesome and created a classic. From the riffs and solos of Ritchie, to the powerful and melodic voice of Dio, this is a true winner. So buy it. Like it. Love it.\n",
        "\nSo here I am, reviewing an album, which was released when my father was slightly younger than what I am now! The band in picture here is Rainbow, a band that defines the word legendary because it did its own part to shape and mould the heavy metal genre. Rainbow was just another fish in the sea called 70’s hard rock but what made them stand out was the fact that heavy metal’s legendary guitarist Ritchie Blackmore of Deep Purple formed it.\n\nRainbow was formed when Ritchie Blackmore did not like the direction in which his band, Deep Purple was going because of the soul and funk elements bought to it by vocalist David Coverdale. When Blackmore saw Dio for the first time he was impressed by him and asked him to join his band and thus Rainbow was formed.\n\n“Ritchie Blackmore’s Rainbow” was the debut album by this band and is a classic blend of 70’s hard rock and heavy metal. The album opener “Man On The Silver Mountain” was the first hit single of the band and its success was the reason this album could be labeled as a mini hit. The first thing that strikes your mind when you listen to this album is the amazing range and versatility on the album. While albums of 70’s hard rock bands tend to sound similar through out the entire record, this album has everything from heavy metal to covers to ballads.\n\nWhile the band became popular because of Ritchie Blackmore’s presence in the band, I must tell you that he in fact isn’t the hero here. It is in fact Ronnie James Dio, who was unheard of till then by the masses. It is not often that you see iconic legends like Ritchie Blackmore being over shadowed, but with Dio’s performance on this album it cannot be said in any other way. Dio who is unarguably the greatest heavy metal vocalist in heavy metal now has a range that has to be heard. Dio’s vocals soar to whichever destination he intends them. Rarely do you find a vocalist whose vocals suit heavy metal, hard rock, acoustic based ballads, progressive rock and blues and that too in the same album! But this is exactly what Dio does, his vocal chords not once succumbing to the strain.\n\nA track that deserves a special mention is the acoustic guitar based ballad “Temple Of The King” which is my favorite track on the album. It’s ironic actually that a guy who sets the standards for heavy metal vocalists far and wide actually sounds best on an acoustic ballad! This track is 4 and half minutes of pure bliss. I just cannot find words to describe Dio’s performance here; it’s better just to stay mum, as there actually are no words to describe his performance!\n\nOf the 9 tracks on this LP, 2 are covers. The first of them is a cover of the track “Black Sheep Of The Family”, which was progressive rock band “Quatermass’” greatest hit. The second cover is an instrumental “Still I’m Sad” by blues rock band, “The Yardbirds.” Both of these covers have been done wonderfully well with Ronnie James once again showing his amazing range and his voice suiting both the genres (progressive rock and blues) amazingly well.\n\nI would have given this album a complete 100, but I’m deducting 2 points because in my opinion the album just has an extra cover, one should have been enough. Apart from that this album is an elegant blend of heavy metal’s most iconic figures i.e. Blackmore and Dio. Every self respecting heavy metal fan should try out this album as soon as possible because he knows not what he is missing.\n",
        "\nSo after toying around with a Deep Purple reunion for a while (and making a Rainbow album masquerading as Purple) Blackmore finally buried the hatchet and called up Zippy, Bungle and George and got Rainbow back together. You’d be forgiven for thinking ‘Stranger in Us All’ is a hidden classic due to the other reviews, well, its ok and probably better than both the JLT era Rainbow (see pop Rainbow) and the Purple reunion albums, with possible exception of ‘Perfect Strangers’, but Rainbow really lost their spell and charm went Dio decided that singing ‘All Night Long’ just didn’t leave sufficient scope for Dragons. \n\nThis line up is a completely new one for the band (barring Blackmore of course) and to be honest it’s a pretty dull one. Doogie White is perfectly fine rock vocalist just, better suited to Rainbow than JLT and Graham ‘Accounts’ Bonnet. However, the rest of the new fellows are competent but uninteresting and as such I’m going to invent new names for them… namely because I can’t remember who they actually are. Sir Jimmy Saville may well fix it but his bass playing leaves much to be desired and his constant cigar smoking can only have been a negative influence on the others. Ricky Martin’s drumming lacks the Latino flair of his vocal work and his sound is flat and weak. Peter Andre is a sleazy Guido and his keyboards are barely audible. My this is immature. Anyway, Ritchie himself as always provides some nice guitar work and although it’s hardly his finest playing he’s interesting and melodic throughout. The riffs here have their moments but you can’t help but feel you’ve heard it all before, for instance one song is a straight up rip off of ‘Can’t Happen Here’. It’s more workmanlike Blackmore than “I’m a fucking Wizard” ala ‘Kill the King’. \n\nThere are some pleasant tracks on ‘Stranger in Us All’, but nothing that affirms your faith in music and has you screaming “Let it Live!” whilst compulsively masturbating like some randy meth fiend. ‘Ariel’ has a nice eastern vibe and a ethereal atmosphere that even Candice Night can’t ruin…hell she could well actually be contributing to the song. YOKO! ‘Wolf to the Moon’ is a good fast paced opener with a catchy chorus with some real melodic class to it. ‘Too Late for Tears’ is the aforementioned shameless self plagiarism track, but it’s a rather agreeable retread. ‘Hall of the Mountain King’ is actually based on Greig’s (Alton Tower’s?) piece unlike the Savatage song. It’s fairly faithful to the original music (in a rock context of course) just with some spooky lyrics added on top and in all a pleasing homage to Blackmore’s roots. ‘Black Masquerade’ continues this neo-classical feel and is one of the albums stronger tracks but lacking in the bombast of early neo-classical Rainbow songs.\n\nSome of ‘Stranger in Us All’ is however just banal and run of the mill hard rock. I wouldn’t have a problem with generic song writing except it’s not very strong song writing either. ‘Cold Hearted Woman’ is a bit of cheesy 80s rock with some incredibly dull guitar work and ‘devils daughter’ lyrics which Sabbath and Rainbow seem to use as they often can’t just sing a straight love song. ‘Hunting Humans (insatiable)’ is plodding and again let down by some dull riffs. Then again everything Blackmore put out from about 1979 had some dreary moments so I guess this is no different. \n\nThis was Ritchie’s last rock album and it’s a shame really as although it’s no ‘Rising’, ‘Stranger in Us All’ shows real promise…and perhaps the band could have been on to something. But then of course something horrid happens; the beast herself emerged from her wicked veil of death…\n\nEnter Satan in the form of Candice Night as Ritchie studiously plays the electric guitar in preparation for the next Rainbow album.\n\nSatan: Hello, Ritchie. How are you enjoying your worldly success? \n\nRitchie Looks around the room as if to say ‘What’s not to like?’ \n\nSatan: Good, then you agree I lived up to my side of the bargain\n\nRitchie: But Candice, I mean Satan, I can’t, what about the fans?\n\nSatan: Bah, I give you infinite knowledge and riches and you ask whether your fans will actually enjoy my proposed direction of crummy medieval music more akin to ABBA than actual medieval music…Ritchie what is more important your future or your soul?\n\nRitchie looks mournfully towards his Fender Strat and lays it on the ground and then takes Satan’s hand and flies into the night… \n\n(Sounds of horrific laughter followed by impossibly Twee and dull tones of Blackmore’s Night)\n",
        "\nThis concert is unfortunately (at least as far I know) the only Rainbow concert ever to be videotaped featuring the great Ronnie James Dio on stage alongside Richie Blackmoore and Cozy Powell. This alone opens up for a great concert experience. \n\nThe stage is \"decorated\" with a great big rainbow above the stage changing its colors now and then and giving a very good lighting show to the concert. \n\nThe concert opens with a small introduction and first song is the fastpaced rocker \"Kill The King\" which is a great opener! The band then continues playing most of their classic tunes (remember, this was actually before the \"Long Live Rock'n'Roll\" album, although 2 songs from that album are featured) such as \"Catch the Rainbow\", \"Man on the Silver Mountain\", \"Sixteenth Century Greensleeves\" and so on. We're talking heavy rocking songs as well as the more down to earth ballads. One of the highlights of the concert, in my opinion, is the cover of Deep Purple's \"Mistreated\" (well, Richie wrote it in his Deep Purple days with David Coverdale), which I absolutely love when Dio is singing it. No one does it as good as him. The passion he puts into this song is unbelieveable!!! \"I been losing... looooosing... Baby, I been losing my mind\" - FANTASTIC!!!\n\nRichie Blackmoore plays some long solos too of course and I am not one to complain. I can never get tired of that man's solo playing! Especially enjoyable is the solo part of \"Catch the Rainbow\". \n\nCozy Powell plays a drum solo too and what a shame that man is no longer among us. Very original drum solo that features classical music which Powell gives a new life by adding some nice drumming to it. Really an exeptionally great drummer he was!\n\nRonnie James Dio, that man is some sort of God among men. One of the greatest singers of all time. What a voice! (and what a shame that he only stayed in Rainbow for 3 albums (and a live album)!!) Great performance and good at getting the audience into the concert, even in \"Long Live Rock'n'Roll\", which was a brand new song at this point. The audience hadn't even heard it before, but they're shouting their hearts out to please Ronnie.\n\nThis concert is by far the best concert I've ever seen on a dvd. What a great move to dig this out of the old German television archives so the rest of the world can enjoy it as well!\n\nThe extra material on the dvd only adds to the great experience of the concert. 3 promotional music videos from the \"Long Live R'n'R\" album. Perhaps the videos themselves are nothing really special, but the songs are great and the historical value can't be denied!\n\nFurthermore there are two interviews with bassplayer Bob Daisley and roadie Colin Hart. They tell us a rather amusing story of how Richie Blackmoore was arrested in Vienna, Austria, only one day before this concert in Munich, and how the show had to be moved one day, and Richie just got out of jail in time and had to be driven to Munich. The support act played an extra long concert so that Richie would make it \"in time\". He didn't have time to change clothes however so what he wears during this concert is the same thing he wore 2 days before at the concert in Vienna. Quite funny in this reviewer's opinion.\n\nIf you like Rainbow or if you just like hard rock from the 70s, you can't go wrong with this DVD. It's a delight to watch and listen to this concert. Actually my only reason for not giving it a 100 is that they didn't play Stargazer, my absolute favourite track by Rainbow. But that's the only thing I can critizise this perfect concert for! Go buy it now. You won't regret it!!!\n",
        "\nEvery once in a while a greatest hits collection comes around that will be an absolute must have for any fan of a band, one that contains all the right amount of perks and rarities to entice the most hardcore fan, yet still contain all the necessary hits to rope in the casual listener. “Stand Up and Shout” lives up to its name by shouting one thing to the potential buyer, “If you buy me you will get it all!!” You get every era spanning Dio’s career since the early 70s with Elf up until his last great effort in the 1990s Strange Highways.\n\nAs someone who was an already established enthusiast for Dio’s Sabbath and solo work at the time, my main reason for getting this release was the Elf and Rainbow material, the former of which I was 100% unexposed to while the latter had only been touched upon due to live performances and one greatest hits compilation. \n\nThe Elf material, for its time, is quite an innovative fusion of blues and rock that requires a bit of historical perspective in order to grasp. When you consider that the heaviest thing going on at the time was Black Sabbath and that they were considered an aberration, this is quite hard edged stuff and a path can been seen to where Dio would grow into what he is now.\n\nThe Rainbow stuff includes the obvious tour favorites “Long Live Rock and Roll” and “Man on the Silver Mountain”, as well as the only slightly less well known “Starstruck”. Although these songs are all a great listen and rock hard, I had hoped that more epic tracks such as Gates of Babylon would have made it onto here, but of course those tracks are to be found on Rainbow compilations.\n\nThe Black Sabbath stuff is presented chronologically, which is a breath of fresh air as most Sabbath compilations are dreadfully unorganized. You have all the essentials from both the early 80s era as well as the strongest song from the 1992 reunion in “Computer God”. We also get a great live version of “Voodoo” from the Mob Rules tour back in 1982 that qualifies as a genuine rarity.\n\nDio’s solo material has also been well organized and includes pretty much all the no-brainer tracks from the first two albums. We get a live version of “Sacred Heart” from the famous tour that spawned the Video concert carrying the same name, definitely a great perk for the Dio fan that already has most of the discography. To my relief, the Dream Evil material was not given the shaft and the two best songs from it are found on here. Likewise, both Lock up the Wolves and Strange Highways managed to get their title tracks onto this compilation, rounding out the tail end of a career that spanned more than 20 years at that point.\n\nTo the prospective buyer who is looking for some stuff with Ronnie Dio attached to it that is not found on the LPs, as well as the fan of metal who wishes an introduction to the artist, this is the album to go for. It listens extremely well owing to it being well organized and all of the songs being digitally remastered, which is more than what I can say for the majority of the large amount of Dio greatest hits CDs out there. Get yourself a copy today and be prepared to Stand up and Shout.\n",
        "\nRainbow really knocks you off your feet with their 1976 release, \"Rising.\" The album includes six awesome tracks of pure rock and roll typical of the 1970s. This is also its weakness though, in my opinion. It is too short of an album. By today's standards, this is an EP. This doesn't take away any of the enjoyment though, it just leaves you wishing you had more Rainbow to listen to.\n\nThe album kicks off strong with the opening to, \"Tarot Woman,\" a song with a great keyboard intro by Tony Carey. It builds up into a great hard rocker that's up there with some of the bands best. The flow of songs continues with the often-overlooked track, \"Run With the Wolf.\" Blackmore plays a great lead that is totally him in every way. He plays an incredible solo and the drumming of Cozy Powell and the playing of bassist Jimmy Bain keep the song moving in a nice temp.\n\nThe material gets familiar with the next track, \"Starstruck.\" The song includes a great Blackmore riff and Dio has a perfect voice for it. Cozy Powell's thunderous drumming plays throughout the song and is incredible. Blackmore pulls out another great solo that is, well, Blackmore. The next track is a track that is often forgotten as well, \"Do Your Close Your Eyes?\" The song has a fantastic Blackmore riff and Tony Carey really provides fantastic keyboard work and gets a great effect with them. Powell, though slowing down a little on this track, still has that thunderous effect on his drumming. The lyrics are great as well, rather commercial, but the instruments take this feeling away.\n\nThe final two pieces of the album are epics. \"Stargazer,\" is exactly that. You can sit there for hours and hours and the song still has you wondering what it's exactly about. Dio's vocal is completely unmatched on this song. He sings the entire piece with a passion, never letting up once. Blackmore's playing is incredible on the track and inspired a whole generation of bands that came after him. The track single-handily created the, \"Neo-Classical,\" style of metal. Blackmore's playing starts off on an easy riff, then explodes into a tremendous solo that includes everything a fan could want. Powell's distinctive drum sound shines throughout the song and is a key element to the feel. Tony Carey plays an incredible keyboard part and plays well with Blackmore. Jimmy Bain keeps the song flowing, and the entire Munich Philharmonic Orchestra strengthens the rest of the playing.\n\nThe final song (and the second epic) is entitled, \"A Light in the Black.\" The piece has a great Blackmore riff that plays through the song, giving it fire. Powell's drumming isn't as loud on this track, but sure does keep it going. Dio's vocals are great, but not as powerful and capturing as they are on, \"Stargazer.\" Keyboard can be heard, but on this piece it's lowered to a rather low level. Jimmy Bain continues his awesome bass playing and continues to help the piece flow.\n\n\"Rising,\" is a great album by any expectations. Usually considered Rainbow's greatest album, very little of the album made it into the band's live shows, with only, \"Stargazer,\" and, \"Do You Close Your Eyes?\" being shown in the bands 1976 world tour. Blackmore's genius shines throughout the entire record and Dio is unmatched. The powerful drumming of Cozy Powell, in my mind, was never captured ever again as it is found on the, \"Rising,\" album. Jimmy Bain and Tony Carey really should have been kept on for at least one more album, but as Blackmore doesn't like to work with the same people all the time, this was changed. The only reason I don’t' give this album a 100 is because it is too short and, of course, left me wanting more.\n",
        "\nIt is 1979. Ronnie James Dio has left Rainbow after 1978's, \"Long Live Rock 'n' Roll,\" a fantastic album in the Rainbow catalogue. Ritchie Blackmore spends three days trying to acquire former Purple singer Ian Gillan to enter the fold, but Gillan declines. So after holding auditions, Blackmore pulls in Graham Bonnet to handle lead vocals. \n\nThe album produced by this line-up of the band, \"Down to Earth,\" in my mind, is the greatest album Rainbow ever put out. Each song is carefully planned out and they all have great things about them. The album opener, \"All Night Long,\" is my favorite song of all time. Graham Bonnet was told to sing reminiscent of the old Stone's song, \"Out of Time.\" However, he adds his own style to the track and pounds out every word with passion. Ritchie Blackmore turns out a fantastic solo and the guitar work for the rest of the song, though tuned down a bit, is incredible. \n\n\"Eyes of the World,\" is next on the album and for fans of the Ronnie James Dio era of the group, it will most defiantly give them something to love about this album. Blackmore turns in an awesome solo, as does keyboard player Don Airey. The vocals are fantastic on this track and Bonnet still hands in a terrific performance. \"No Time to Lose,\" the next track, is a straightforward hard rock song typical of the 70's. Blackmore turns in a fantastic riff and his playing holds true throughout the track. The band decides to get a little bluesy on the next track, \"Makin' Love,\" which leads to a great song. The notes the whole band hits gives the song a bluesy feeling to it and in turn makes for a great song. \n\nThe radio hit, \"Since You Been Gone,\" is probably my least favorite song on the entire album. Mediocre riff and all right playing by the rest of the band. Bonnet doesn't impress me on this track as much as he does the rest of the album. In my opinion, this is a good filler track and I prefer the other hit off of the album, \"All Night Long.\" The band kicks it into high gear again with another bluesy track, \"Love's No Friend of Mine.\" Great musical structure with Blackmore turning out some great playing as well as Don Airey, who is often forgotten about. The keyboard playing on this whole album is absolutely phenomenal. \n\nThe band continues its outrage of material on the next track, \"Danger Zone.\" When I first heard this track, I felt greatly tricked by it. Some of the vocals that I expected that Bonnet would sing in a certain way did not turn out that way. They turn out better than what I had thought of and though some parts could be hit higher, the low octave gives this song a chilling feeling to it and is a straightforward rocker. Blackmore pulls out a great solo and his riff in the song is astonishing. Cozy Powell plays a great drum track on this song as well as the final track, \"Lost in Hollywood.\" Cozy gets a thunderous sound on this track and Blackmore continues to pour out great riffs. Probably one of the best tracks on the album, the solo is great and the entire song is deeply rooted in a classical style. \n\nAs you can probably tell, \"Down to Earth,\" is my favorite Rainbow album. It has everything a good hard rock album requires. Great riffs, stunning solos, thunderous drum beats, quality bass work, amazing keyboards, and a great voice. It angers me when people put this album down cause if you really care about the music and it all, you wouldn't judge it on just the vocal work. It doesn't really matter with me though, because I enjoy Bonnet's singing and I think it's a real shame that this line-up of Rainbow didn't stay together for at least one more album. An album with Graham Bonnet, a man who can give an emotion to these songs, is better than any with Joe Lyn Turner, a man who's voice is entirely commercial.\n",
        "\nRainbow has historically been one of the most influential bands in the realm of heavy metal, although like Black Sabbath they carried many remnants of the hard rock genre that metal essentially grew out of. This album functions mostly as a revisiting of that early style of metal, where the blues and jazz influences are highly blatant, and where there is a strong element of musical eclecticism that drives some of the material. One can notice that Ritchie Blackmore has been experimenting with acoustic guitars on both this album and the last Deep Purple album “The Battle Rages On”, which clues us in on how he has grown as a musician from his Smoke on the Water days.\n\n“Stranger in Us All” has a strongly symmetrical structure in terms of song placement, exhibiting a sort of back and forth between innovative metal songs on the odd numbered tracks, and more traditional hard rock influences on the even numbered tracks. “Cold Hearted Woman” and “Too late for Tears” are highly blues driven and remind heavily of Deep Purple’s early material, where the music was distinct from that of other classic rock bands only in the virtuoso nature of the solos. “Stand and Fight” probably has the most minimalist set of riffs out of the bunch, and is the only song on here that probably is devoid of anything that resembles metal, though it does pass for an excellent rock song. “Silence” proves to contradict its own title with a rather prominent brass section, a set of blues inspired riffs, all on top of a quasi-big band inspired rhythm section.\n\nAmong the more metal tracks we have the guitar driven “Wolf to the Moon”, driven along by one of Ritchie’s signature speed riffs, and Doogie White’s Ronnie Dio inspired vocals. “Hunting Humans (Insatiable)” is a slow gloomy track that flirts with the early Sabbath Doom sound. By contrast, the remake of “Hall of the Mountain King” is up tempo, and the re-arrangement of the instrumentation is quite well done, not to mention the words utilized to bring out the grandeur of the character depicted in Grieg’s original composition.\n\nHowever, the true gems on this album prove to shine quite a bit brighter than the solid songs mentioned previously. “Ariel” has a solid drum production, a rather haunting Eastern influenced riff that is somewhat reminiscent of “Gates of Babylon”, and some more top notch vocal work both by Doogie White and Candice Night. “Black Masquerade”, by Ritchie Blackmore’s own testimony, is essentially a variation on the original theme he composed for Deep Purple’s “Anya” off “The Battle Rages On”. It is loaded with technically intricate guitar and keyboard work, in addition to a brilliant classical guitar interlude reminiscent of the Spanish Flamenco style. We then close this album off with another cover version of Yardbirds classic “Still I’m Sad”, as sort of a final gesture to the original brilliance that was captured on Rainbow’s debut album back in 1975. It starts off with a brilliant clean electric guitar solo, followed by a rather somber yet up tempo body section. This song, more than the others, truly demonstrates Doogie White’s versatile vocal abilities, as well as how the dimensions of a song can be radically altered with some well placed keyboard and vocal effects.\n\nIn conclusion, this album underscores one of the primary differences between Deep Purple and Rainbow, unlike the former this project is completely Blackmore’s beast, and he has proven himself not to be the second rate guitarist who is saved by John Lord’s innovative soloing style that some quarters have pigeon holed him as. This album is mostly geared towards fan of Rainbow during the Ronnie Dio era, and has a highly classic rock feel to it at times that will probably sound old fashioned and passé to younger fans of metal who are looking for the technically driven speed sound of bands in the power metal genre. But regardless to one’s personal tastes, this album is fine for what it is, and that is a remembrance of the roots of where the music we love comes from.\n",
        "\nThe first Joe Lynn Turner album. I remember When I first heard I Surrender, I was like oh man why did Dio have to leave? And its funny how I love that song now. I guess its just a shock when you first hear their stuff without Dio. Its good, but it takes a little time to get used to. The biggest thing for me is that there is no Cozy Powell! I know Bobby Rodinelli is a sick drummer. Its just that in my eyes Cozy Powell is Rainbow's drummer. Rodinelli does an amazing job though. So no real problems about the drumming just a little mental thing. I Surrender has a pop feel to it, but dear god its catchy, and the singer.... I just can't describe Turner's voice. Then Spotlight Kid is a nod to their heavier days. Oh man this is the shining star of the album. No Release is OK I guess. I don't think there is a Rainbow song I full on dislike. Magic is better than the last track, it has a cool beat to it. A little bit on the pop side.\nVielleicht Nachster Zeit(Maybe Next Time) is a mellow instrumental. Can’t Happen Here is awesome! It’s a hard rocker, a bit on the commercial side though, heavily enjoyable! Freedom Fighter is another great heavy track with a cool chorus. Midtown Tunnel Vision is a song that you skip past. Difficult To Cure is a sick version of Beethoven’s 9th. Although the synthesizer makes it a bit cheezy. So Joe Lynn Turner’s first album with Rainbow is rather good. Although not as good as the album to follow it. Although it’s a lot different from their 70s stuff. Down To Earth foreshadowed what was to come. I prefer the Dio days, but this a good album.\n",
        "\nI have to say that for me never having bought a Rainbow album before this, it caused me to go out and buy a few albums: Ritchie Blackmore's Rainbow, Rising, On Stage, and Long Live Rock and Roll. It was also a great introduction to Ronnie James Dio as a heavy metal vocalist, and what a great and unique voice he has! Now, I have to also mention that Ritchie Blackmore has written some incredible riffs during his Rainbow years (and Deep Purple too, of course)... And the best of which are included on this album.\n\nFirst off, there's the Ronnie James Dio block. It kicks off with the greatness of Man on the Silver Mountain. The lyrics here are very high quality, as is the main riff and the solo. The way this song is set up, it makes me wonder if this isn't comparable to Smoke on the Water. \"Come down with fire. Lift my spirit higher. Someone's screamin' my name. Come and make me holy again!\" The lyrics here foreshadow the lyrics of Ronnie James Dio to come (the overuse of words like \"fire\", \"higher\", and conveying of mystical images). But really, they fit the music well, and are quite original for their time.\n\nThen comes the epic track Catch The Rainbow. Nearly 7 minutes long, this slow track is comparable to a more technical and better sung Stairway to Heaven. In fact, if you wanted to slow dance to a song (even though slow dancing is definitely not metal by the way, but sometimes you must do what you must do) then here's a winner. But this is better than any other slow ploddy song I've heard before, mostly because of the great guitar playing and singing combination. Ritchie seems to play atmospherically in this track, which is something I haven't heard him do from this point until later on in Blackmore's Night album Ghost of a Rose. \n\nAfter this comes Starstruck, which proves Ritchie's guitar chops with an insane main riff that isn't just metal power chords. It's a crazy set of single notes in a great sounding pattern. The solo in this song is very metal though, and the bluesyness shows through. There's alot of fast bends and little strung together licks that flow well together.\n\nThen comes Stargazer, which is a similar type of riff to Starstruck, except this one is much heavier. Yet again, great lyrics and vocals. I should also mention how well the drumming flows in this album, but namely during this song... The syncopation is amazing! And his timing is great for not having a click track or anything to go by. But wow, an 8 and a half minute track, that's pretty long for a rocky metal song back then. \n\nKill The King starts out with a great guitar, drum, and keyboard (yes, keyboards... and they sound so good) intro, and then this great Ritchie Blackmore riff that the vocals come in over. This track is a classic, with Ronnie's \"ooohs\" sounding so smooth, and Ritchie's solo being one of the fastest I've ever heard. Tremolo picking out the wazoo. But then at the end he goes with this crazy fast melodic line that fits in time perfectly with the drums.\n\nAfter that comes Long Live Rock n' Roll. Okay, so it's not the best song on the album, but it grows on you over time. The gradually higher shifting power chords that launch into the intro are great, but nothing beats the chorus line \"LONG LIVE ROCK AND ROLL!\". Ronnie manages to carry the entire chorus line by himself, it's amazing that a singer can be so talented.\n\nAnd now, Gates of Babylon, which is another Rainbow classic song. And it is rightfully so, with such a great little atmospheric intro (that reminds me of the later to come Holy Diver intro by Dio), and then the main riff starts. Ritchie has written alot of strange things, but I can't even place the style of guitar playing, it's sounds like it may be some sort of fusion, but it's amazing. Oh, and an amazingly melodic solo that has alot of intense feeling to it. \n\nThen we shift singers to go into the track Since You Been Gone, which happens to have one of the greatest guitar riffs ever. The singing isn't the greatest, but it's an enjoyable track. All Night Long comes next, sounding very much like Man on the Silver Mountain revisited, but also not a horrid track. The singing could be better though. Then comes I Surrender, which is a really strange love song. Too much choir of 'ooohs' in the background, but good keyboards. \n\nCan't Happen Here is a good track though, featuring this little bluesy intro solo and a guitar riff that reminds me alot of Stevie Ray Vaughan's guitar playing. Just the feel of the rhythm and the sound of the playing. This is the first track that has had very noticable bass on it, too.\n\nJealous Lover is a good track. Joe Lynn Turner does some amazing vocals on this track. Great bass and guitar combo here, and the guitar solo is based mostly in playing lower notes (whereas most solos are about high string and high notes over a riff), and it's a good changeup and it has a sweet bluesy flavor to it. Stone Cold is next, and it starts out with drumming and then it adds guitar and keyboards to that mix. The vocals are good, and it gets alot heavier later too, which I did not expect.\n\nPower comes after that, and it reminds me alot of an AC/DC song with it's main riff. Ritchie completely goes off on this solo, coming in with his guitar screaming. Normally he starts out slow and melodic and builds into crazyness, but instead he just wails all over this song, and it fits perfectly. Can't Let You Go is next... And its great, it starts out with this great music playing on an organ. It's reminiscent of Ozzy's song Mr. Crowley. A very Smoke on the Water riff over the vocals (the arpeggiated power chords with only slight distortion). \n\nThe album ends strongly on Street of Dreams, which has keyboards and bass and drums plodding along with this great groove. Then the vocals come in... and you hear Ritchie twanging away in the background. Amazing singing on this track, props again to Joe Lynn Turner. Pretty good for a love song, and a great guitar solo that is completely melodic. I like how Ritchie throws in alot of little fills, which he rarely did on any other tracks on this album. Great way to end this compilation. And the song fades out slowly, which is also kind of cool.\n\nIf you want to check out Rainbow, then get this compilation. It is a high quality sampling of all the eras, even though I really think they could've afforded to remaster some tracks on this album, it shows you exactly what you'll get if you buy any of the Rainbow albums these tracks come off of. And with nearly 80 minutes of music, it's a pretty much jam-packed CD. And with the booklet is this awesome \"Rainbow Music Tree\" that shows the Deep Purple, Rainbow, Black Sabbath connection with a bunch of bands and musicians. It's amazing how all these bands traded musicans back and forth!\n",
        "\nThis album is absolutely amazing. The first time I heard this was in my friends car, and we are both enormous Dio and Rainbow fans, the keyboard solo in the intro to Tarot Woman is a great intro to this album, preparing thee for a space rock jounrey to the ancient Babalonian Space Palaces. Then after this solo is over Ritchie Blackmore slowly makes his way in with a typical Blackmore rock riff. The song is truly insane. And what to say of Dio? Well, simply put, he is god. I for one would not be surprised if I died and went to heaven(being that it exists) and Dio is there sitting upon a mighty throne. ANYWAY! Back to the album, every single one of the musicians on this album is truly amazing, they all add to the greatness of this album. To talk about Run With The Wolves I must put the chorus in There’s a hole in the sky\nSomething evil’s passing by, what’s to come\nWhen the siren calls you go\nTo run with the wolf. This is such a great chorus for so many reasons. First, I personally think that the hole in the sky part is some sort of tribute to Dio's Sabbath days. Whenever Dio says the word evil, especially in this song, it makes my pants happy. And of course when the siren calls you go! Horns to that mother fuck!\n\nStarstruck! Gets right to the point. Poor Dio being followed by some obsessed woman. He think he can hide on the moon, but! she will find a way! This is a great song, and very well put together.\n\nDo You Close Your Eyes? No really, do you? I personally think this ones a bit cheesy, but still great anyway, especially hearing Dio speaking of babymakin'. \n\nNow, Stargazer. Stargazer could easily be an album all by itself. This song is absurdly epic. I think this is all I can bring myself to say about it. Its just such an amazing song. This is what I mean by Ancient Babalonian Space Palaces. Especially towards the end of the song. The solos that Ritchie Blackmore does in this song are truly a force to be reckoned with. This song just starts off fairly basic, and gets progressively more and more epic as it goes on. \n\nA Light In The Black, This is my personal favorite song on this album. A good fast one, great riff. The parts I like are toward the end of the song where there are dueling keyboard and guitar solos. And speaking of these guitar solos. There is one melodic part toward the end that sounds very Maiden-like. I love this song. Yes yes I do.\n\nOverall this album is just great. Nothing less. I had to listen to it three times over after I heard it for the first time.\n",
        "\nThis, Rainbow's first live foray onto vinyl, is a mixed bag of sorts. Recorded after Rainbow had released only two albums, On Stage indeed captures some, but not all of the power and majesty that was Rainbow, 1977. \n\nThe barnstorming rocker Kill The King first appeared here, before the studio version on Long Live Rock and Roll. The keyboards are a nice touch, and the drums totally kick your ass, but at times there's no guitar! The guitar is buried deep within the mix, only appearing prominently during certain times and during solos. Nevertheless, an essential tune.\n\nNext we have a medley of Man on the Silver Mountain (solid), a \"Blues\" (okay, kind of pointless), and Starstruck, again not bad but I wish they would have included the other \"Star\" song, namely Stargazer.\n\nCatch the Rainbow and Mistreated, a Rainbow and Coverdale-era-Purple song respectively, are both long and self-indugent. This can be good or bad, depending on how much you like hearing Ritchie Blackmore play guitar solos. Personally I wish they would have trimmed these down a bit.\n\nThen, from the debut album Sixteenth Century Greensleeves and Still I'm Sad (Yardbirds cover), two songs I always kinda liked, but I mean, come on! A cover tune on a live album, when there's a handful of other killer tunes they could have included? Eh.\n\nAnyway, this really is a fairly decent live platter. However, if you aren't familiar with Rainbow I would recommend the first album or Rising.\n",
        "\nThe previous incarnation of Blackmore's Rainbow (as performed on the 1975 eponymous debut LP) consisted of the band Elf, minus guitarist (Ritchie Blackmore didnt need help). Clearly the most valuable of these Elves was the one and only Ronnie James Dio, because he's the one and only one left for the follow-up, 1976's Rising. \n\nHaving belted the instantly-classic single \"Man on the Silver Mountain\" on the first LP, Dio had clearly and unalterably been delivered as the Voice Of Rainbow. They stepped it up a notch for Rising -- a stronger band was assembled around Dio and the ever-pissy Mr. Blackmore: keyboardist Tony Carey (who had a minor solo hit in the '80s with \"Why Me\"), bassist Jimmy Bain (who remains Dio's bassist and songwriting partner to this day) and drummer Cozy Powell (known more for his glam records previous to this). This unit as a whole is solid beyond belief, largely due to the addition of Powell; his status as a legendary drummer begins right here. The most powerful thunder Blackmore had yet had to work with, and it complements his equally thunderous riffing perfectly. \n\nAs if to signify the change in direction, the first noise you hear on Rising is atmospheric synthesizer tweakage. Rising anticipates the future of heavy metal in quite a few ways, and while the synthesizer emerges as a legit metal instrument here, it doesn't serve to take the edge off the rock, as was its purpose throughout the '80s. This is no \"The Final Countdown.\" It probably has more in common with Bitches' Brew-era Miles Davis, and is a prominent shift from the boogie-oriented ivory-ticklage prevalent on the previous LP. \n\nLeadoff track \"Tarot Woman\" is not necessarily first-song material, but it's suitably chugging as you prepare yourself for side one's more substantial gifts: \"Starstruck,\" lyrically an enraged dismissal of an overzealous groupie, is boogie with ten times more nutsack than the entirety of the \"Blackmore's Rainbow\" LP, thanks as always to monsieur Powell's punch. \"Do You Close Your Eyes\" is another prime example of this particular Rainbow's clairvoyance, as the dirty chords and four-on-the-floor approach anticipate sunset strip bar-chord raunch, thankfully devoid of similar posturing and/or visual aesthetics. Faster Pussycat would have neutered each other to sound this powerful.\n\nThe band stretches out for side two. You can look at that as a good or bad thing, depending on which half of the '70s you lean toward. Keeping some of the dinosaurish elements that would soon become boring enough to necessitate the rise of punk, yet sonically breathing fire. There are but two songs on side two, each of them 8+ minutes long, hence the dinosaur comparisons. Luckily, the dinosaur is more T-Rex than brontosaurus -- both songs are powerful enough to justify such gratuitousness.\n\nYes, both songs are sort of endless but they do indeed make the most of the jam time. \"Stargazer\" is caught somewhere in between \"Kashmir\" and \"The Last in Line.\" Eastern in musical and lyrical theme, plodding in a sense but blasting, and masterfully helmed by Dio, his voice as majestic as it ever was. This man has never once emitted a squeal. Pure authority... But I have to say \"A Light in the Black\" is this record's shining jewel. A barrelling locomotive of a backing track, rivalling anything Deep Purple ever attempted. Blackmore, Powell, Carey and Dio all give their finest performances on this one (bassist Bain is the odd man out, production-wise); Carey in particluar makes an amazing case for his inclusion in such a band. It sounds like Keith Emerson getting the beating of his life. Blackmore is, of course, Blackmore, and appropriately both his rhythm pickage and solo squalling are full of fireworks and renaissance references. Powell is nothing short of awe-inspiring. Clearly influenced by Keith Moon but absolutely focused, his rhythm is powerful and his power is rhythmic. He would stick around for 1977's Long Live Rock 'n Roll -- together, the two LPs could constitute a Cozy Powell greatest hits record. Credit must be given to producer Martin Birch for getting such an incredible, full drum sound. And Dio. Dio. DIO! Here's the record where his lyrics start taking on more underworld-ish aspects, but he could sing the Denny's menu and it'd still get me all woozy. You know it's funny -- I have early Dio performances with him singing rockabilly/early rock 'n roll in 1962 and it's still a metal voice. The man found his calling when he joined Rainbow.\n\nAlthough I give Long Live Rock 'n Roll a slight edge in the Rainbow sweepstakes (no 8-minute songs!), Rising is possessed of incredible power and thoroughly jaw-dropping playing. I am not one who favors a lot of twiddling and wanking in the general sense. I just dig superhumans, and Rising is a superhuman record. Go git it.\n",
        "\nI usually dislike live albums. Why? Because the production is usually worse than on the studio albums, the band plays the same songs the same way, so what you usually get is the same as on the studio albums but worse. There are exceptions of course. This is one of the best live albums ever recorded. The production is very good (mine has the words 'Rainbow remasters' printed on it). Produced by Martin Birch. Sounds familiar? Martin Birch was responsible for much of Maiden's production.\n\nSo why should you have this record? The song Catch The Rainbow, Sixteenth Century Greensleeves and Still I'm Sad are better than the versions found on the Ritchie Blackmore's Rainbow. That's one reason. Another is the song Mistreated. That song can't be found on the other albums. Let's take a closer look on the album. While it only has 6 songs it plays for more than one hour. \n\nIt begins with a cool intro, a small portion from the movie \"Wizard Of Oz\" which is merged with the song Kill The King (later released on the 3rd studio album). While it's a great song, it's not better live, I prefer the studio version.\nContinues an excellent 11:15 long medley with the songs Man On The Silver Mountain and Starstruck, another two classics with other words. Between the songs there's a nice blues section that adds to the feeling, the songs and the blues part is merged in a perfect way, with a short pause between the blues and Starstruck, which by the way is very different from the original, due to some parts with more or less only the vocals.\nFollows an upgraded version of Catch The Rainbow. The song is 15:36 compared to the originals' 6:36. Some might think that this is just a prolonged version of the same song. Truth is that the live version builds up the atmosphere a lot with long calm guitar parts. I never feel that it would become boring. While it's basically the same song, the original is more compact. Here it feels like the song has the room to become what it was meant to be, an epic masterpiece.\nMistreated is the next song in line. A classic heavy ballad with long calm parts building up the atmosphere. Pure excellence for 13:07! I don't think there even exists any release with this song not performed live.\nSixteenth Century Greensleeves is almost like another song, if you compare this with the version found on the debut. 3:29 has become 7:37. So, what's the difference? First of all, it has a calm two and a half minute long guitar intro. There's so much more emotions here than in the debut!\nStill I'm Sad is the last song on the album. It plays for 11:05 compared to the originals' 3:53. More of the great stuff by Blackmore and Dio with other words!\n\nHighlights: Catch The Rainbow, Mistreated, Sixteenth Century Greensleeves and Still I'm Sad\n",
        "\n\"Difficult To Cure\" was definitely Rainbow's hand at radio-friendly pop rock, adding more fluff to the mix and also seeing crooner Joe Lynn Turner join the fold, to replace Graham Bonnett. This meant that the blazing guitar work of axe master Ritchie Blackmore would be shoved into the background. NEVER a good move, and it proved to be just that.\n\nEnter \"Straight Between The Eyes\", a harder rocking, more guitar based album, just like the good ol' days. Yes, it still has some of those commercial elements, but it now has some extra kick to it, thanks to Ritchie's riffs. Joe Lynn Turner is still here, to keep the accessible edge, but he does a good enough job here, without sounding too out of place. Drummer Bobby Rondinelli shows off his skill quite well here, finding a balance between aggression and groove. Roger Glover shows once again that he's an awesome bassist that can hold down the rock solid foundation like very few can. Keyboardist David Rosenthal is kept in the background for most of this album, staying mostly with an atmospheric approach, which works quite well. And Ritchie Blackmore on guitars, well what else can i say?........It's Ritchie. Of course he rules!\n\nThe albums gets kickstarted with the damn near SPEED METAL of \"Death Alley Driver\". You can see this is as Rainbow's version of \"Highway Star\". It even has a similar structure, but nonetheless, it's still a very solid track. Fast riffs, fast solo, it's all good. \"Stone Cold\" is the commercial, radio-friendly ballad here, and it pays off, as this is one of the band's biggest hits and one of the better songs here. It's a pretty moody ballad, infectious and well-exacuted, nothing really more to say.\nWe then get into \"Bring On The Night(Dream Chaser)\". A hard rocker, with a catchy, poppy chorus. Nice guitar work, it's a typical commercial hard rocker, but it works. Now here's a song that kinda hit me out of left field, and it being an album cut, it's not very well known and therefore under-appreciated...\"Tite Squeeze\". It's kinda slow paced, got a cool groove throughout and the chorus and pre-chorus is just cool. Everything works well here. A highlight, for sure. \"Tearin' Out My Heart\" is another ballad, and not as interesting as \"Stone Cold\", kind of boring.\"Power\" is another hard rocker, that also got some radioplay for the band, and rightfully so, it has enough kick for the hard rockers, yet accessible for others to get into it. \"Miss Mistreated\" to me at least, sounds like a lost Foreigner song! Not quite a bad thing, as this track isn't bad, but it's not the best. It kind of gets old after awhile, and eventually you'll find yourself skipping it, even though it's not that bad. And for the record...i kind of like Foreigner.\n\nWe get to the energetic \"Rock Fever\" now. A straight forward rocker, for the most part, that contains a chorus that'll stay with you for days, maybe weeks, depending on how much you listen to the song. And finally, we get to the heavily atmospheric \"Eyes Of Fire\". This song sounds like a Dio-era Rainbow epic, with Joe Lynn Turner on vocals. Not as interesting or exciting as, say, \"Stargazer\" or \"Gates Of Babylon\", but it's still worth a listen, and it's good to hear that style again.\n\nSo, we see Rainow flex their hard rock muscle again, without sacrificing too much of the accessibility of \"Difficult To Cure\", but it's definitely less fluffy and more exciting. This is the best album of the Joe Lynn Turner era, and is worth looking into.\n",
        "\nSo this is where all started; Ronnie Dio was invited by Blackmore to join his solo project (and to keep the 'Dio' nickname as part of his name); and this is what we've got. An album influentied by Blackmore's past in Deep Purple and a bit of ol' Rock & Roll thrown here and there to make the album more catchy.\n\nMan on the Silver Mountain is now a classic song, if you are or if you are not a Rainbow fan; you will surely know the riff to it. It is probably, along with Self Portrait, the heaviest song of the album. They are both mid to up-tempo and manage to go catchily easy from one to another one as the starting of the album; and Man On The Silver Mountain is really a way to start the album!\n\nThen Black Sheep of the Family is a rock and roll influenced mid-up (the songs never go into wild up tempo, but the way it flows nicely from down to mid to up and can actually play with it, really works for the album and to keep the listener entertained) tempo, with silly lyrics and very catchy choruses.\n\nContrasting nicely with this up beat, joyfull song, comes the first ballad Catch The Rainbow, it is a rock and roll ballad and frankly I like it a lot, you can hear it when you want to chill out or just to listen to some beautiful music. But don't let yourself down, when minute 6.40 of this song goes away we have two Rainbow classics! The catchy mid tempo Snake Charmer, in which Blackmore's melody and one of Dio's singing masterpieces, really sets you a spell to go along with the magic of this song.\n\nIf you like/know Rainbow, you will probably know the next one, if you don't then shame on you! This is the low tempo Temple Of The King; another classic! In which the mood is well settled to continue with the magic of the previous classic. Again Dio sings like ment to the Gods and the melody is just beautiful, along with the solo.. a very remindable and comendable song, if you like Rock and Roll and it is perfect to chill out a bit...\n\nAfter that we almost reach the end with the short Bluesy up tempo If You Don't Like Rock And Roll, which really sets my mood into \"Happy\", I love this song, as silly as it might be, the riffage and the arpeggios are memorable! You have to have a real cold heart if your mood isn't changed by this. One of the weirdest songs I've ever heard, with the piano solo and the clapping; but one of my favourites!\n\nThen the album practically closes with the last lyrics-included song in the album, which is Sixteenth Century Greensleeves, which as you might think, it doesn't feature the melody of the classic piano song. This is, if you ask me, a good way to end the album, mid tempo but still catchy with good guitar works, and, as always, Dio's voice is flowing perfectly with the mood and the sounds. Then the song fades into the instrumental Still I'm Sad, which is an ejoyable performance from Blackmore and drummer (as well as bass player) which I can't, sadly, recall his name.. but this is, I repeat, a very worked out and enjoyable solo performance which shows us a bit of wankery from Blackmore but I actually can really see the capability and talent of each musician here.\n\nHighlights of the album: Man On The Silver Mountain, Black Sheep Of The Family, Snake Charmer, Temple Of The King, If You Don't Like Rock And Roll.\n",
        "\nYou know, I feel remarkably unhardcore liking this one because in my brain I know that the public opinion of Ritchie Blackmore's R-A-I-N-B-O-W as the band's finest hour is just plain wrong, but my gut tells me that it's just stupid to dislike such accomplished, fun, dopey hard rock on that basis alone. Therefore, I'm already more open-minded than droves of underground metalheads, so I guess I should be proud of myself.\n\nAnyway, the album in question doesn't have much wrong with it at all. It lacks the ambition of future Rainbow monsterliths (the next two anyway), focusing on Deep Purple-alikes and obscure rockabilly covers, sort of a 'Deep Elf' really. Metallically speaking, there ain't much beyond barnstorming opener \"Man on the Silver Mountain\" and \"Sixteenth Century Greensleeves\", both pre-power metal with a vengeance, a continuation of Purple-y castle tones on \"Pictures of Home\" and the majority of Ritchie's classically-based soloing.\n\nBeyond that, this bouncy little album boasts a surprising amount of variety. In \"Temple of the King\" you get what amounts to a Blackmore's Night track twenty years early, all renaissance faire and soothing melodies, Ronnie exercising a lot more of his clean vocals here and on the rest of this album than any future releases. Way I figure it, that regal roar probably loosened bowels back in the early 70's and thus was used sparingly.\n\n\"If You Don't Like Rock'n'Roll\" with it's boogie piano and \"Black Sheep of the Family\" (the straw that broke the Deep Purple camels back!) are just hooktastic, the former sounding like Elton John crossed with a happy Who, Ronnie writing some hilariously out of it lyrics. \"She was dressed the way the stories tell/I tried to grab her and I saw she'd read the story well\". That sounds, to me, like a D&D fanboy's first (and only) date being recounted to his equally hopeless buddies. \"Black Sheep of the Family\" is incredibly catchy, bravely stupid melody inspiring the most embittered metal head to smile brightly and sort of bob his or her head left and right.\n\nBeyond these we get some really grim hard rock in \"Snake Charmer\" and \"Self-Portrait\" that sounds like (surprise!) a particularly irritated Purple jamming on a track like \"Into the Fire\". It's odd that this album is virtually devoid of true steel, the majority of the metallic tracks being very minor updates of older concepts with perhaps just a slightly bloodshot eye to the future of grandiose spires like Rising and Long Live Rock'n'Roll.\n\nStand-Outs: \"The Man on the Silver Mountain\", \"Sixteenth Century Greensleeves\", \"Still I'm Sad\" (a Yardbirds cover, from back when Jimmy Page didn't suck)\n",
        "\nOkay, this is my fourth Rainbow compilation review. Here's a rundown of the others:\n\nVery Best of Rainbow: Starts strong, but feels incomplete overall\nMillenium Collection: Cheap, easy primer, but less than complete\nPot of Gold: Bizarre collection of primarily album tracks\n\nCTR is essentially an expanded version of the VBOR, and it's is far superior. This album for a wonder features virtually every Dio-era Rainbow song you could possibly need. My God, this thing has \"A Light in the Black\"! That is amongst the most unbelievable and underrated songs in the catalogue! \"Mistreated (live)\" as stated in the Millennium Collection review is a fantastic track from On Stage album that is somewhat obscure and fills in the Dio album chronology was the was incomplete on VBOR.\n\nThe first disc is in the high 90's, one of the best compilations to get. Now, the second disc is understandably bad, but in fact it has some bright spots, specifically: \"Eyes of the World\", \"Power\", and a live \"Difficult to Cure\" are probably the most adventurous and entertaining post-Dio tracks, and although I would prefer dropping some weak Dio numbers and tacking these three songs on the end of disc one, it at least makes it worth something to spin the second disc a few times.\n\nProblems? Nothing from Stranger in us All (not that it's good or anything), and the liners are pathetically out of date, basically a reprint of the liners from VBOR, a comp from 1997. Come on folks, it actually talks about Rainbow's reunion as though something might come from it. Heads up, nothing did and Ritchie went out and started playing Renaissance Festivals. End of story.\n\nStand-Outs: \"A Light in the Black\", \"Stargazer\", \"Kill the King\"\n",
        "\nWell, I decided to review all the Rainbow compilations thinking that with the relative difficulty to obtain the Rainbow albums proper people could use reviews of the easier to find hits collections, and that it'd simply be a relatively easy job because many of them are rather similar. Really though, this one is just bizarre.\n\nFirst of all, this collection virtually ignores the radio hits. \"Long Live Rock 'n' Roll\", \"Man on the Silver Mountain\", \"Catch the Rainbow\", \"All Night Long\", \"Street of Dreams\", \"I Surrender\"... although those songs vary wildly in quality, they ARE in point of fact Rainbow's biggest hits. With the exception of \"Since You've Been Gone\" and \"Stone Cold\", these aren't even singles! It's like this no name Dutch company just tried to keep the costs down by not licensing the band's most expensive material.\n\nInteresting doesn't begin to describe the track selection here. From Rainbow's self-titled we get closing Yardbirds cover (and instrumental!) \"Still I'm Sad\". I won't debate that it's one of the coolest songs on the album, but this is the most bizarre choice possible from the band's most accessible Dio album. And, they open the album with it!\n\n\"Stargazer\" makes sense as a choice from Rising, which is actually incongruous with the rest of the weirdness.\n\nThere are three tracks from Long Live Rock'n'Roll, not including (in an astounding move) the title track (doubly so since it's not on the 20th Century Masters disc), which is only slightly balanced by the other three predictable choices. I mean, \"Gates of Babylon\" is not the most commercial thing they ever released...\n\n\"Since You've Been Gone\", actually fits. Which upsets me, because allegedly this album has some super strong album cuts I've never heard. Meh.\n\nOf the rest, I can only shake my head in disbelief. Despite the amazing level of whoring that Ritchie did with Rainbow in later years, only \"Stone Cold\" truly was a hit of the rest of this bunch, the best being accessible 80's melodic hard rock/AOR, generic stuff, most tracks really interchangeable.\n\nPoints for being unconventional, but really an incomplete picture of the band.\n\nStand-Outs: \"Stargazer\", \"Still I'm Sad\", \"LA Connection\"\n",
        "\nIn no way does this capture the greatest of Rainbow in its heydey, but this is actually a slightly better overall collection than the poor Very Best of Rainbow set, mostly due to the fact that’s it’s considerably cheaper. I have the same problems here as I did on the last one, specifically not enough Dio and too much Bonnet and Turner. Each album is given only a cursory once over, but often it succeeds in getting the cream of the crop.\n\n\"Man on the Silver Mountain\" and \"Catch the Rainbow\" are obvious choices, probably the most famous songs in the catalogue, and \"Stargazer\" is just as obvious. While I'm surprised they didn't grab \"Tarot Woman\", Rising is such a great all around ALBUM that divvying it up doesn't do it proper justice. From Long Live Rock 'n' Roll we get the power metal cornerstone \"Kill the King\" and the playful \"Rainbow Eyes\", but it's baffling that the title track, with its immortal riff, chorus, and especially incredible verse are excluded. Still, for a 20th Century Masters/Millennium Collection disc this is passable so far.\n\nThe post Dio years are a mess. \"Since You've Been Gone\" sounds like KISS, \"I Surrender\" is so sugary I feel like choking, \"Stone Cold\" is doddering and boring over all, and \"Street of Dreams\" is everything you hated about 80's AOR. The lone gem from the Turner years is the gleeful “Power”, featuring a tasty riff from Blackmore and an irresistible 'clapping' percussion. Only the fact that Turner, long one of the most bland singers in music, sings on it keeps it from greatness.\n\nFor those following along, you'll notice I skipped one song. \"Mistreated\" is a Coverdale-era Deep Purple chestnut, and Rainbow just owned the song. Ronnie's on fire, the jamming is quite good, and best of all this is one of the few places to hear tracks from the somewhat hard-to-find On Stage album, and it saves you the time of going through the occasionally boring jam-sessions that are all over that record..\n\nThis CD is dirt cheap, and warts and all is a good Rainbow primer. I'd suggest you hunt down Rising and Long Live Rock'n'Roll instead, or failing that, the very comprehensive Catch the Rainbow greatest hits set.\n\nStand-Outs: \"Stargazer\", \"Kill the King\", \"The Man on the Silver Mountain\"\n",
        "\nThis is THE definitive metal/rock album, certainly the best classic metal release studio album ever, in my opinion. It has the perfect blend of songs. The vast majority being hard rockin', drivin' metal pieces, with some blues influence, though far less than bands like Led Zeppelin, for example. In fact, the classical influence is far more prominent here (although not as much as on 'Rising'), and the thrilling, remarkably fresh-sounding songs (well, most of them are) are because of that classical influence. Blackmore was classically trained in the guitar, and it shows. His solos are mindboggling in their speed and sound, he uses some very interesting scales to add spice to them, which is why, for me, this album and Rising would both be in my top 5 list (no. 1 would be this album) of great rock guitar albums. Ritchie simply oozes class and sounds very comfortable. Of course, riff-wise, he was never as inventive as Jimmy Page, but he does pull some remarkably good riffs out of the bag here. Anyway, on to the songs.\n\n1. Long Live Rock N' Roll - This is a great up-tempo rocker, does exactly what it says on the tin! Extremely fun, and it's so catchy without being just a pop song, like later Bonnet- and Turner-era songs (btw, I don't actually hate the later era material either). Great guitar solo, too.\n\n2. Lady Of The Lake - This sounds vaguely Led Zeppelin (Physical Graffiti, Houses Of The Holy era), and the plodding riff is very heavy-sounding. The chorus is very memorable. One of the high points of the album. Very smooth, effective Guitar solo.\n\n3. LA Connection - I think this is the weakest song on the album, though not a bad song per se. A mid-paced rocker, has some nice piano lines to accentuate the jazzy, classy sort of sound. A good song to fill the much-needed gap between the slightly dark subject matter of 'Lady...' and the even darker lyrical content of 'Gates Of Babylon'.\n\n4. Gates Of Babylon - Centrepiece of the album along with 'Kill The King'. Song about walking through the gates of Babylon and the devil and stuff. An amazing song, could be Rainbow's best ever, especially with the orchestra and the guitar solo. And what a guitar solo! My favourite guitar solo ever, Ritchie's very finest, even including Deep Purple-era songs. You just have to hear it to believe it. Malmsteen loves this too, but butchers his version. The original is so subtle and builds up on an arabian/eastern scale solo and then, ... BAM! The most amazing and original rock guitar part you'll ever hear. This song and solo deserves so much more recognition. (like in Japan, where it is recognised as a classic)\n\n5. Kill The King - On the original vinyl, you heard the amazing 'Gates Of Babylon' and thought 'hey, the second side can't be nearly as good as what I've just heard on the first' and so you don't expect much (''Kill the King'? cool song title, probably just another storming rocker.'), but boy, does this surpass all expectations. This is the complete version, unlike the version played on the 'Rising' tour, and for me, this is so much better. The opening guitar part is just genius, simple but so effective, and deceptively hard to play. Dio's vocals hit the spot, so aggressive without resorting to shouting. Cozy Powell's drumming is so powerful and incredible, the blueprint for so many drummers today. He more or less pioneered the double bass drum technique, I think. The solo is very rapid, and the ending is perfect, you can see where Iron Maiden took the basis for their driving sound in the last 5 bars of this song. It does sound a bit like Aces High, for example. One of the original Speed-Metal songs (along with Deep Purple's 'Fireball', though Fireball came first)\n\n6. The Shed (Subtle) - Bizarre title, as it doesn't mention sheds, and it's not a very subtle song either, a heavy rock/metal tune to follow another. The intro guitar solo is just cool, and a good song to boot. Tends to be overshadowed by Kill The King, but it's still a good song. \n\n7. Sensitive To Light - Very competent rocker, a party tune, in the vein of 'Do You Close Your Eyes' from 'Rising'. The skill of Rainbow is blending the epic with the rockin' on the same album. I actually really like this song. Dio's vocals are great, and great lead guitar work from Ritchie. A great groove will hook you in this song. \n\n8. Rainbow Eyes - Depends on whether or not you like ballads, I really do, but you'll love this or hate it. I, personally, love it as one of the high points of the album. Very emotional, and a great vocal delivery from Ronnie. The guitar is so beautiful it makes me want to cry. Flute and String quartet combine to give this a mediaeval feel, and makes it the second song on the album to feature a classical ensemble. A real treat for people who appreciate good music, and an excellent way to finish an overall heavy album. \n\nAn absolute classic, has my vote as the best rock album ever. No bad songs on the album, ends (arguably) better than it starts (maybe not, actually), and that's why it's such a satisfying experience to listen through end-to-end. If you're even mildly interested, but it now. You will not be disappointed, I guarantee it. Something for everyone. For metalheads, Kill The King and Sensitive to Light, for lovers of darker music, Lady of the Lake and Gates of Babylon, for those who like ballads, Rainbow Eyes, and for Ritchie fans, evry song, but especially Gates of Babylon, Kill the King and Rainbow Eyes. I only don't give it 100, as a matter of policy. so treat the 99 as a 100\n",
        "\nRainbow is a band that started out strong, got unbelievably awesome, then fell down, down DOWN to such an extent that they became unrecognizable and AORrrrgh terrible. Unfortunately, this album spends far too much time on the uninspired and unremarkable Graham Bonnet and (*shudder*) Joe Lynn Turner years, songs that come off as even more awful when they are stacked up against seven mighty slabs of metallic genius from the Dio years.\n\nTo be brief, from Ritchie Blackmore's Rainbow you get \"The Man on the Silver Mountain\" and \"Catch the Rainbow\". There's no denying that both of these songs should be here, the former Rainbow's most famous song and the latter it's most languidly dreamy and magical. I would argue that \"16th Century Greensleeves\" and \"Black Sheep of the Family\" (the song that led to Rainbow's creation!) should be here too, particularly as there's more than enough space for them when you axe total shit like \"Jealous Lover\" and \"I Surrender\".\n\nFrom Rising, one of metal's all time highwater marks, there are only two tracks, and I think they are strange choices myself. \"Starstruck\" is an amiable rocker that is more like the first album than the progressive power of Rising, and while it is quite good and features one of Ronnie's more tuneful vocal performance (i.e not the usual snarl) it is really a weak track. I think \"Tarot Woman\" is a much stronger song and also more in line with the album at hand. I'm so exuberantly happy that they put \"Stargazer\" on the album as it is one of the best songs in the Rainbow catalogue, but it isn't really a \"greatest hits\" type song. Still, I won't complain. I would've liked to see the albums other serious epic \"A Light in the Black\" on here too instead of some of the awful later song, but what can you do? Perhaps the theory is that if you put all of the good songs on the greatest hits nobody'll pick up the whole thing. Ah well.\n\nNothing from On Stage? What are you kidding me? This album features a fine rendition of \"Sixteenth Century Greensleeves\", an embryonic \"Kill the King\", a rockin' \"Stargazer\", and an interesting take on Purple's \"Mistreated\"(albeit a very long one). I have to respect possible space shortages considering how long many of these tracks are, but again just get rid of some of the chaff (read: JLT stuff) and everything should be rosy.\n\nGood move choosing three tracks from the awesome Long Live Rock'n'Roll record, and also good choices. \"Long Live Rock'n'Roll\" is just a fun, fun song with a drop-dead anthemic chorus over dour, brooding, and unbelievably awesome verses. Truly one of Dio's finest performances. \"Kill the King\" is, along with \"Stargazer\", Rainbow's primary contribution to metal and is one of the cornerstones of power metal. Still, I won't get into it too deep because I'll probably be reviewing this album like the others at some point, and I'll save myself the effort until then. \"Gates of Babylon\" is not a track I'm overly fond of, but again, more Dio equals higher ratings. Hell, despite the \"Mortal Kombat\"-ness of the heavy synth lines it still reeks of castle-rock aristocracy and the chorus rules. I'd have liked to see something else from this one too, maybe Dio swansong \"Rainbow Eyes\" or \"The Lady of the Lake\".\n\nHere's where the shit takes over. I've heard that Down to Earth is a very good album, but the selections from it are just awful. I despise the fucking clap-rhythm of \"Since You've Been Gone\", and \"All Night Long\" seems to last that length of time despite it's relative briefness. I think maybe \"Lost in Hollywood\" might've been a better selection. Perhaps the only selection from this POS. Oh, and I despise Graham Bonnet's voice, whether it's here or in MSG or even on a Sabbath album. Take a minute to shudder with me. \n\nStill, things could get worse and they do. Joe Lynn Turner has such a horribly bland singing voice, like any AOR act from the 70's, that I cannot say that I could pick him out of a line up. \"I Surrender\" is terrible, \"Can't Happen Here\" is bad, \"Stone Cold\" is boring and overlong at only five minutes, and \"Street of Dreams\" epitomizes selling out, even if the actual transaction happened right about two seconds after Ritchie fired Ronnie. The only song here that has any life is \"Power\" based on a really fun, bouncy riff, but Joe Lynn Turner sucks it down a notch, the solo is boring, and it's one of those songs that you despise yourself for humming uncontrollably.\n\nAll in all, shoulda just been one disc of the Dio years. Actually, if you can find them the albums are quite cheap and it's worth it to buy all of the Dio records, especially two of metal's most important albums in Rising and Long Live Rock'n'Roll.\n\nStand-Outs: \"Stargazer\", \"Long Live Rock 'n' Roll\", \"Kill the King\"\n",
        "\nThis is by far the best album Rainbow ever recorded in my humble opinion. I also believe that this is Ronnie James Dio finest performance on any album that he has recorded vocals for. This is pure straight our 70's rock n roll that you can just chill out to and scream at the top of your lungs. Fun album indeed is what this is. Some of the most memorable songs you will ever hear appear on this album (Man on the Silver Mountain, Self Portrait, Catch the Rainbow, Snake Charmer). I'd rate this album up with some of the best ever recorded. As Richie Blackmore's band he pulled out some of his grooviest, hard rockin riffs he could come up with. You also really feel like pulling out the bong to let the sparks of old fly by. Not many old classic rock freaks mention this album, but I find that theres still a few out there that regard this album as one of the best in it's day. If you enough killer Rock N Roll this one is differently the one for you. Good times, or Bad times this Album is opted to teach you a lesson that you'll never forget. I highly recommend this album to any classic rock fan or any music fan in general. This is a must have for your collection. Drink your beer, smoke your pot and listen to Rainbow, hell you know that what our fathers did! Enjoy the tunes and Cheers!\n\nBest Tracks: The Whole Godforsaken album is equally amazing!\n",
        "\nShit. I hate it when this happens.\n\nYou know that feeling you have when you wake up in the morning and you think it's just going to be another normal day, so you get dressed and gulp down some liquid caffeine (coffee) and you head out the door to over where you work? And then you sit down, ready to do your job, and just as you're about to start concentrating, your asshole sadist co-worker next door starts playing That Song on his computer . . . the one that you can NEVER EVER EVER EVER get out of your head once you hear it? You know, like I Will Survive (and you can never remember any of the verses, just that damn chorus), MacArthur Park (\"Someone left the cake out in the rain!\") or Enter the Glade (you may not get this one, but Power Metal freaks are nodding their head as they read this)?\n\nYou know?\n\nThat's what happens to me when I hear this album. Specifically, when I hear the title track. That bitch just grabs you by the ear and rocks your ass off. And GODDAMN it's catchy! \"Long Live Rock 'n' Roll! Long Live Rock 'n' Roll! Long Live Rock 'n' Roll!\" Just try to listen to this without singing along with the chorus. Go ahead--I dare you.\n\nAnyway, the album. To be short and sweet, it rocks. This is Rainbow at its absolute finest hour, and boy can they do it right. One of the other reviews of this album (I can't be bothered to actually check which one) mentions how the album \"bridges the gap between rock and metal,\" and I could not have put it better myself. What you have here is classic Rock 'n' Roll mixed in with key elements that later flesh out into the styles of metal pioneers like Metallica, Iron Maiden and Judas Priest. Rainbow is most certainly a major metal influence, and this album is the corenerstone of that influence.\n\nObviously, the real standout is the title track, which has thrashed, riffed and ass-kicked its way into metal legend. Long Live Rock 'n' Roll features very nice guitar playing by Ritchie Blackmore with loads of cool riffs and a very well-done solo. The beat provided by Cozy Powell is simple yet timeless and strong, and the vocals by Dio are just unbelievable. Rainbow doesn't get any better than this headbanging, anthem-singing masterpiece right here.\n\nThe other anthem song is Kill the King, and there is a huge amount of style here as well. The sound is much more distinctly that of old-school Power Metal, and you can definitely hear some early Iron Maiden sounds in here. The vocals are cool, and the solo work is fantastic, not to mention the very original riffage here.\n\nNothing is really that weak on here. Gates of Babylon features some of the infamous \"Middle-Eastern-sounding riffs,\" along with some fantastic keyboard work. The Shed is a real headbanger with a very cool opening guitar solo. The most Rock 'n' Roll-sounding song on here is Sensitive to Light, and there's nothing wrong with that; it's still a good song.\n\nThis is some fantastic music right here. It's old, but the production is good and the playing is even better. It's definitely worth a purchase. By the way, if you're looking for some good covers, there are two covers of songs on here that are quite well done: Gamma Ray's cover of Long Live Rock 'n' Roll (featured as a bonus track on Powerplant) and Stratovarius's cover of Kill the King (on Intermission). I leave you with this thought:\n\nLONG LIVE ROCK 'N' ROLL!!\nLONG LIVE ROCK 'N' ROLL!!\nLONG LIVE ROCK 'N' ROLL!!\nLET IT LIVE! LET IT LIVE! LET IT LIVE!! LET IT LIVE!!\n\nHells yeah. Rock 'n' Roll forever, bitch.\n",
        "\nWell after a twelve year hiatus, Blackmore decided to rebuild Rainbow, and what a great decision that was. This album is full of killer bluesy hard rock/ metal. The songs move along at a decent pace, and their are melodic leads to be found all over the place. Also, the vocals are awesome featuring Doogie White current singer for Yngwie Malmsteem. \nThe first song is Wolf to the Moon. This one has most of the classical work you'd expect from Blackmore, it opens with one hell of a riff. One of the best Blackmore's written. Killer vocals and killer guitarwork = awesome song.\nCold Hearted Woman is straight up blues metal, and it is killer. Reminiscent of some of the work on Dio's Holy Diver.\nHunting Humans (Insatiable) moves along at a slower pace as it plods along. The main idea stays the same, but each time Blackmore returns with something new. Good song.\nStand and Fight is another bluesy cruncher. Complete with harmonica. \nAriel has a wierd atmosphere to it in the beginning, with some cool keyboard work, then we get a cool acoustic passage. I guess this could be classified as a ballad, but it has some killer parts with the guitar and keyboard, and a great solo around 2:30.\nToo Late for Tears continues the heavy blues rock. This is one of my favorites on the album. Heavy riffs with some great vocal work. Oh yeah, another killer solo.\nBlack Masquerade is next. This is another killer song. It sounds like it came straight off of Malmsteems first few albums. The way the keys and guitar blend together to produce some great melodic ideas. The vocals are at their best on this one. This is the highlight of the album. The spanish guitars towards the end are awesome as well.\nSilence opens with a riff that Metallica must have heard when they were plotting out Load, because they ripped it off on one of the songs, cant remember the name of it. All in all this is a good song.\nHall of the Mountain King is next, this one, as you might guess, is based on the song by the same name. Immediately you recognize it under the vocals in the versus. This is a killer adaption. The way the guitars keep building as the versus continue, until at 1:58 we get the riff everyone knows. Good song.\nStill I'm Sad closes the album, if you were wondering why Blackmore was holding back the classical stuff, he threw alot of it into this one. The killer opening leads to a fast past crunching song.It features on of the best solos, and is a great closer.\n\nWell, this is a killer return of one of my favorite guitarists. He keeps up the tradition of Rainbow by pumping out some fine blues rock/metal. Fans of Rainbows older stuff will most likely enjoy this album. The only thing that could make this album better would have been a Dio reunion, but I doubt that will happen anytime soon, and Doogie's vocals are top notch on this album. Go get this!\n",
        "\nWhile the history of Rainbow is well documented elsewhere, all you really need to know is that it was a band started by former Deep Purple guitarist, Ritchie Blackmore. Deep Purple routinely had Dio’s original band, Elf, open up for them on their tours, and thus Blackmore was quite impressed and invited Dio to join him on this musical venture. The result was something similar to Deep Purple at the time, but still a little different. \n\nOn their first release Rainbow essentially combined 70’s Rock, a little bit of blues, with a touch of early 70’s Metal; something that would later be much more pronounced on their next two releases. Unfortunately, at least to some Metal fans, this is largely a 70’s Rock release. But to me, that’s not a bad thing, since I’m a casual fan of 70’s Rock. The CD opens up with the now classic “Man On The Silver Mountain”, which has an instantly memorable riff and is probably the most Metal (though 70’s Metal) sounding song on here. The rest of the CD is actually quite varied. Not one song sounds the same and it seems that each track incorporates a fresh idea (like it or not, the 70’s was a great time for song writing). The guitar work is an obvious highlight as each song is very guitar driven and Blackmore uses everything at his disposable from slide guitar to intermittent solos. Dio’s vocals are in very fine form, he sounds pretty much like how he does now and his voice gives the band the unique atmosphere that only Dio can bring to a song. Dio’s voice, combined with Blackmore’s guitars, really helps carry songs like “The Temple Of The King” and “Sixteenth Century Greensleeves”. Other song highlights include \"Stil I'm Sad\", which is a very cool instrumental that is a lot more upbeat than the other songs and features quality guitar playing and \"Self Portrait\", which is surprisingly doomy . Also of note is the bass work, which like most 70 bands, is quite upfront and can be heard perfectly. The lyrics tend to be quite poetic at times and this helps add to the overall appeal as well.\n\nI don’t really have any major gripes with this release, the actual music is very well performed and the music is very moody and engrossing. The only song that I’m not a huge fan of is “If You Don’t Like Rock ‘N Roll”. This track is ok but it effectively sounds a little too dated and has an annoying piano in the forefront that is considered typical to early Rock music, but it’s not my thing at all. The actual main problem, to many Metal fans, will be the fact that most of the songs are very laid back. Blackmore seemed to opt for a more mood and atmosphere heavy CD than one full with energy and oomph. I personally really like this approach and was very surprised the first time I heard this CD because I wasn’t expecting much. Now keep in mind, I enjoy 70’s music so chances are if you have absolutely no use for 70’s Rock, then you won’t like this release very much. However, if you’re more like me and like 70’s music, enjoy Dio’s vocals, and like Blackmore’s song writing and guitar work, then I highly recommend this even though Rainbow’s other Dio releases are superior and more Metal.\n\nSong Highlights: Everything except If You Don't Like Rock 'N Roll\n",
        "\nLong Live Rock N' Roll is a classic rock/metal album, with loads of catchy and fun rocking music. It's definitely stronger than the previous Rainbow release Rising, not to say that was a bad album.\nOn the previous, there were more epic influences, while this one is more fun rock n' roll all over, except for the awesome epic Gates Of Babylon, which is in my opinion Rainbow's second best song ever. It's a mystical song with an amazing atmosphere, and a really cool keyboard intro and a brilliant, atmospheric guitar solo.\nRitchie's guitarwork is all over the album, with lots of groovy riffs and blazing solos, and he is accompanied by damn great musicians. \nFirst, of course we have vocalist Ronnie James Dio, and he does a great vocal work on this album, adding alot to the feeling of each song.\nBassist Bob Daisley, also known from Ozzy Osbourne, does a very good job, and the bass sound is just loud enough.\nDrummer Cozy Powell can drum like few other men, but sadly he rarely ever gets to display his true talents on this album. To see what he can really do, check out the drum intro to Stargazer (Best Rainbow song).\nAnd keyboardist David Stone, who does some solid keyboard effects, although I think that Tony Carey on Rising did a much better job.\n\nThe album doesn't really have one weak song. The title track is a classic rock anthem, Gates Of Babylon is just amazing, Rainbow Eyes is a beautiful ballad, and of course the fast and catchy Sensitive To Light, and all the rest rock just as much.\nExcept for Kill The King, which is another awesome track, it's right there below Stargazer.\nAn amazing guitar intro leads into a speedy power metal-ish song, with some unusually great guitarwork, even for Ritchie Blackmore.\n\n\nEach song of the album rocks in it's own way, and all through this is a very solid album. Some great, catchy rock/metal can be found on here, and this is definitely recommended for fans of this style of music.\n"
    ]
}