{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Reading, Pennsylvania",
        "Status:": "Active",
        "Formed in:": "2009",
        "Genre:": "Progressive/Technical Death Metal",
        "Lyrical themes:": "Metaphysical, Natural world, Cosmos, Human nature, Esoteric",
        "Current label:": "Metal Blade Records",
        "Years active:": "\n2009-present ",
        "Number of Reviews": 39
    },
    "Band Reviews": [
        "\nBecoming one of the more known groups in the progressive and technical death metal sphere, Rivers of Nihil have certainly made a name for themselves that had my expectations pretty high for this new album. Having only heard their third album “Where Owls Know My Name”, I can easily say my feelings were mixed about this band. While that album sure was impressive in every aspect of proficiency, I found the experience of sitting through the entire record quite difficult, although rewarding. Now the American quintet returns with their fourth full-length release, “The Work”, and I’m glad to say that one aspect that bothered me is gone.\n\nDon’t get me wrong, “Where Owls Know My Name” was an incredible album, but one that required a lot of effort from the listener. And while “The Work” is anything but catchy or simple, I feel like they’ve refined their craft and balanced out the aspect of their sound to make this album run with a much more coherent and natural flow that just gets you engaged and sunken into the atmosphere. I’ve always looked at Rivers of Nihil as a tech-death band but with this record they prove to be much more than just that. Although still loaded with aggression and technical proficiency, the album doesn’t focus exclusively on that aspect but brings many different influences and layers together, sounding eclectic and refined enough to satisfy even the most stuck-up of prog snobs.\n\nAs I first played the album, I was caught off-guard by a slightly bluesy tone to the intro, smooth and Ambiental clean vocals and a highly atmosphere-focused approach. Although sounding eerie and ominous, the sound is strangely relaxing and fully sucks you in, only to then shock you once the brutality kicks in. There’s an excellent flow from the soft to the heavy sounds that this band puts together that makes them connect so well, because when the riffs and growls kick in, the atmospheric aspect of synths and sound design as well as the melodies are maintained, wrapping the harsh death metal textures into that same atmosphere.\n\nLooking at the full metal soundscape, we get a lot of the elements that are familiar to fans of the band. The roaring guitar and drum sound must be some of the most brutal and corrosive in modern technical death metal. There’s a strong use of blast beats and double kicks as well as fast noodly riffs, but as a difference from most bands in the genre, these guys did not designs their music to be fast a fluent. Instead, it’s shocking through its extremely tight delivery of mathematical odd-timed riffs and patterns as well as its unpredictable nature. I feel this album went less tech and more prog as the tempos are usually moderate and the composition relies highly on groove and rhythmic experimentation, allowing the full blast beat driven tech-death sound to make its way in only in the highest moments of tension (and there’s plenty of those). As a result, the music is a lot less constant. It comes in waves from chill, groovy and melodic parts to brutal riffage, intricate techy musicianship or blistering fast technical parts. All the different aspect keep moving back and forth, stealing then releasing the spotlight for a different sound to emerge, but the music keeps its flow.\n\nLooking at songs like ‘Wait’ or ‘Maybe One Day’, we notice a lot of skill in creating melodic tones, blues/jazz mixes and even a beautiful use of acoustic guitars in the latter. The band sure knows how to deliver emotion and put it on theatrical display. The subtle details in changing tones allow these songs to move from dark, creepy and ominous to frustrated or even slightly demented and then to calm and peaceful. And that’s just looking at the softer side of the sound. Then the likes of ‘Dreaming Black Clockwork’ or ‘Episode’ offer some truly horrific soundscape of drama, the former sounding downright apocalyptic at times. They know how to use slower tempos and grandiose soundscapes interlaced with momentary technical flurries to merge their technical proficiency into otherwise digestible structures that allow for massive, majestic moments to occur. A special shout-out is needed for the echoing drops in ‘Dreaming Black Clockwork’ that just suck all color into a black hole.\n\nBut the tech-death aspect still holds true, as we see in ‘The Voice that Carries No Sound’, ‘More’ and the epic closer ‘Terrestria IV: Work’. These show more consistency in the realms of fast blasting and drilling guitar riffs but not without their fair share of proggy intricacy. I particularly love how these guys will use a blast beat but instead of maintaining it as most tech-death does, they will chop it apart into pieces, almost turning it into djent blast beats.\n\nTo top it off, I feel there’s also a deep psychological concept to this album. I can’t tell for sure if there’s a story or just some recurring themes but the album as a whole seems to be dealing with the idea of someone who is unwilling to accept his situation, and mainly he work that needs to be done. The music battles through drama, frustration, exhaustion and hopelessness while allowing glimmers of peace and serenity to shine through but the storm never really seems to cease. The final 2 tracks are the only ones that I feel clear the tension a, allowing a brighter tone to shine through, mainly through the lead guitar melodies and solos that breathe an uplifting feeling of release to the music. Lyrically, it seems these songs are the moments where our protagonist accepts his duty and comes to terms with what needs to be done.\n\nAs final highlight, I must mention the addition of keyboards and synthesizers that works wonders in delivering the atmosphere throughout the full record. I don’t think keyboards were a constant in previous releases from Rivers of Nihil, which is why this was a pleasant surprise. And of course, in a number of songs they make use of saxophone, which has certainly become a star in their sound even from the previous record. “The Work” is likely one of the most eclectic and refined tech-death releases of 2021 (rivaled by First Fragment’s “Gloire Eternelle”) and it sure is worth giving a listen before you decide what your favourite albums of the year are.\n\nOriginally written for The Metal Observer.\n",
        "\nI recently reviewed Where Owls Know My Name, Rivers of Nihil's 2018 saxophone metal album, and I thought that it was fine, but a bit generic and quite boring. However, their debut album is far less boring as well as less generic (though it still is a little bit of both). Dieffenbach's vocals are still probably the weakest link of the album, but his deepish fry manages to not be quite as bad as it is on their later albums like The Work. This album is also a lot more exciting instrumentally. I wouldn't say the clean production necessarily robs the music of its impact because everything on here is a lot more lively and fun than most of what they've done since.\n\nThe Terrestria series of instrumentals began with this album, and Terrestria 1 is probably one of the best songs on here. It is very intense, combining many different riffs and rhythms together in an undeniably satisfying way. There are actual blast beats on this album, tempo changes, tremolo and otherwise rhythmic picking from the guitars, and a lot of clear death metal influence shining through. There's some prog wankery, but it's mostly very tasteful. Another thing I love about this album is its decidedly fast pace. There's a lot of frantic blast beats, guitar harmonies, and other fun and interesting things thrown into the mix; most of it, honestly, really does work.\n\nOther than the mostly great heavy parts, Rivers indulges in several clean parts too, which are, as usual, very good. I said in my last review that those clean, ethereal parts were the better sections of Where Owls Know My Name, but on here they're just about as good as the death metal. To expand on what I said earlier, there's death metal influence for sure, but also a little bit of core, which rears its head during Birth of The Omnisavior especially. Though, I must stress, it's not TOO MUCH core. They employ breakdowns here and there, just like they employ proggy sections here and there. This album is simply downright well-written and quite tasteful with how it's arranged. It's melodic and heavy in all the right places, so I have very little to complain about.\n\nCan't believe I'm saying this, but Rivers actually isn't a band I dislike anymore. I was not very inclined to dig further into their discography after seeing them live and hearing them meander their way through those boring 2018 songs, but I'm glad I did. This is a very good debut album. While some of the things I dislike about their 2018 album are still on display, like the super sterile production and Dieffenbach's frankly \"meh\" vocals, the music is damn good and I'm confused as to why this has a 64% average. Bullshit if you ask me, because to my ears, The Conscious Seed of Light is very effective, exciting, and well worth a listen or two.\n",
        "\nRivers of Nihil is a talented band, no doubt. They've carved a niche for themselves in the progressive death metal scene with flourishes such as saxophone parts. While they have a lot going for them, I can't say that I myself am a fan, even though on paper I totally should be.\n\nThere's a criticism leveled at 70s jazz rock legends Steely Dan that their music is overproduced and \"too perfect\", so it therefore lacks soul. I personally don't think that's true in their case, but for Rivers, this absolutely does seem to apply, at least to my ears. These songs would be way better with 80s/90s style boominess and mud. The songs Rivers serve up here are well done for sure, but the production is so sterile and perfect that it saps them of the realness (for lack of a better word) they need in order to truly bite. Everything is mixed perfectly, but it's almost too perfect, so much so that it doesn't even sound human anymore. This is not the only reason I dislike this album, but it certainly is something I wanted to mention, because it contributes to the boredom I feel while I listen.\n\nThe first true song outside of the intro, The Silent Life, sounds like Gojira when it's heavy, but launches into a pretty nice clean interlude with a sax solo. Strangely, these clean instrumental parts entertain me the most, and I think it's partially because they don't feature their main vocalist, Jake Dieffenbach. His performance isn't really that great in my opinion. Their backing vocalist/bassist, Adam Biggs, should be the main guy, as I feel that this music would benefit from his higher pitched harsh vocals. I was bored as hell when I saw them live, until Biggs had some standout vocal moments, at which point my interest was captured. The friend I came with remarked that Biggs made Dieffenbach obsolete, and I can't help but agree.\n\nI must reiterate that this music often sounds lifeless due to the production and songwriting, as tracks like Old Nothing feature crazy tremolo riffs produced so cleanly, it almost sounds programmed. I'm not asking for mistakes, but a little bit of rawness and imperfection would enhance these tracks a lot. It sounds nearly electronic when they do technical parts. It feels wrong to keep saying that this music is too perfect as if that's valid criticism, but the production and style the band opts for truly does prevent this record from becoming something great.\n\nSo, Rivers of Nihil's production is too clean, their main vocalist is boring and one-dimensional, and their clean parts overshadow their heavy parts (which is odd for a tech-death band). You might ask, what's to like? Well, since the production is so clean, you can hear the bass parts really well, and Biggs does a lot of cool stuff with his instrument. The guitars also sometimes impress rhythmically, especially on tracks like A Home. The guitar solos are usually great when they showcase technicality, but when they don't, they're relegated to an ambient role.\n\nSubtle Change is probably my favorite track on here, it's one of the few songs which ebbs and flows through clean and heavy parts (with actual singing) quite effectively. The proggy riffs and keyboard solos really remind me of Dream Theater at their best. This is one of the few tracks that didn't leave me bored; that's right, it actually made me feel something! Biggs is featured quite prominently both vocally and instrumentally on this one, and overall, it just works. I wish they could capture the same energy on other tracks, because a lot of this album's tunes are in desperate need of the emotion and humanity on display here. Death is Real was honestly pretty good as well, as it doesn't lean on Dieffenbach as much, and features some fun guitar and bass wankery. I also liked the electronic elements on display during instrumental track Terrestria 3, which starts off with clean ambience but breaks out into some hard-hitting electronica about halfway through.\n\nThis album just makes me bored, and I really shouldn't be, because it's got so much going for it. The modern, sterile production on here is probably some people's wet dream, but it's not mine. I expected to hear something exciting like Death's later albums or Cynic's Focus, but I was rarely interested while listening. I wish I liked Where Owls Know My Name more than I do, but I just can't seem to get into it, which is a shame. The instrumentalists are all very talented, and sometimes they really ball out, but the band's instrumental prowess is robbed of a certain je ne sais quoi by the production and Dieffenbach's frankly lackluster vocals.\n",
        "\nRivers of Nihil have made a name for themselves in the metal world, ever since the release in 2018 of the masterpiece and contemporary classic Where only Owls Know my Name. This album even made it in Banger.tv top ten albums of the decade 2010-2019. But we are now in 2021, a year and a half into a pandemic and Rivers had the impossible task of following Owls. So, were they successful?\n\nFirst, let’s talk a bit about the band, but spoiler alert, yes. Yes, they were! So, Rivers of Nihil started as a fairly typical technical death metal band but on their release, Where only Owls Know my Name, they included many progressive elements, including what they became known for, the saxophone. Sax and metal had already been mixed before, but I don’t know what Zach Strouse did, but the mix became pure magic on Owls. Every member, from Jake Dieffenbach’s unique vocals to Adam Biggs on the bass to the guitars of Brody Uttley and Jonathan Topore and new comer Jared Klein on drums, are on top of their game. For The Work, they have the same line up as Owls. I think this and all the extra free time the band had made it possible to create the band’s most experimental and creative album to date.\n\nAfter my first listen, I’ll be honest, I was kind of disappointed. Probably because I was expecting Owls. I remember hearing them in an interview they did, shortly after Owls, where they said that they did not know if they would even keep the sax in their next album. They did not want to be cast as the “sax band”, which I understand. I love the sax so much that when I heard the singles, I became kind of worried. But have no fear! The sax is back even if it’s a bit different from Owls. So it took me multiple listenings, but I can now say with certainty that this album is a genius way to follow Owls. It is so different, yet you still hear the core sound of the band. And by core sound, I don’t mean metalcore. Don’t freak out, all of you metal elitists out there, I just mean what makes it sound like a Rivers’ album.\n\nNow let’s dive into it. Each album represents a season: Spring (The Conscious Seed of Light), Summer (Monarchy), Fall (Owls) and now Winter with The Work. Winter can be harsh, violent even, with heavy snow or blizzards. It can also be peaceful and clear. I’m a big fan of the light/dark, peaceful/heavy dynamic. Both sides are masterfully represented on The Work, with noise like section, furious death metal and peaceful, calmer passages. What gives the noisy part an organic feel is probably that much of the noises was sampled and recorded by the band themselves. For example, we hear a train on the first track. Well, it’s the train that passes near the guitarist’s house. The metal clinging noises on Terrestrial IV was recorded in an abandoned chemical factory near the old high school of one of the guys. All these sounds are weaved expertly in the album, giving it a raw grounded feel. Keeping with the theme of the seasons, the last seconds of the album is just birds chirping, softly signifying the end of Winter and the return of Spring. In a larger sense, it is the end of a cycle and a metaphorical rebirth.\n\nSo, the saxophone is back, but it is used much more sporadically throughout the album. It functions more like a support for the atmosphere of the record and is less put forward with big solos, with the exception of the song The Void from Which No Sound Escapes which features the only proper Owls sounding sax solo. This is probably my favorite track on the album. With its Terrestrial 3, sounding intro, impeccable roller coaster built up to a powerful and beautiful chorus which leads into an epic guitar solo, to be followed by THE saxophone solo on the album. When the sax solo starts, it’s a grandiose feeling. I have been waiting for a long time at this point for that solo, this song being number six on the album.\n\nThe first five songs are kind of an experimental journey. We start with the slow, atmospheric built up of Towers 1, which features a lot of clean vocals. We then go on the fully experimental, dissonant and, quite frankly, weird Dreaming Black Clockwork. But it’s the good kind of weird! This song leads into, in my opinion, the best transition on the album. The end of the song is a noisy part that builds and builds up, and when the tension is at its max, the song Wait starts with its soft piano melody, that reminds me of the First Gymnopedie of Éric Satie, cutting the tension completely. Wait is a super chill song with only clean vocals. It’s a great example of the band’s ability to write slower, calmer songs. The next two songs were the two singles released before the album was launched and it gave a pretty good idea of the overall vibe of the record. These two songs are both slower, progressive and are incredibly catchy. I guaranty you’ll have the first lines and the melody of Clean relentlessly stuck in your head: \n“I want your money, your time; I want your patience and your pride; I’m a restless innovator; And I’m working over time; So Heaven help me (heaven help me); And the dollar defend me (dollar defend me).” \nI interpret those lyrics as being a commentary about the expectations/relations of fans vis-à-vis the band’s work. It’s also the debut of the drummer, Jared Klein, doing back vocals on the lines (heaven help me) and (dollar defend me). An other part that will be on repeat in your head is in the song focus: \n“My body, my pride, my radiant insight; I figured all this focus, had just been given to me; So set in self derision, as I feel my vision slipping away; I figured I was worthless, destined to wither away”. \nThis is dealing more with the mental toll that life can have, essentially the work that life constantly demands of us.\nThe rest of the album is pretty much pure gems again. Going from the furious, blast beats and techy solos infused, death metal of More? to slow, proggy and beautiful songs like Towers 2 and Maybe One Day. The album closes with the progressive death metal epic that is the 11 min and 30 sec Terrestria IV: Work. This song is the ultimate showcase of the song writing and musical talent of the band. When an 11 minutes song ends and you say to yourself “Wait! What, already finished?”, you know it’s an incredibly well written song.\n\nSo, to conclude, The Work is the most mature piece of work (pun intended) the band has released so far, with so many memorable moments I didn’t even talk about. Just as an example, the guest vocals of Black Crown Initiate’s James Dorton on the track episode: he sings, in its powerful growls, do the work. It gives me chills every time! So, Rivers of Nihil had the impossible task of following Where only Owls Know my Name and I think they succeeded in every way, elevating more and more the band on par with contemporary prog masters like Gojira or Mastodon.\n",
        "\nI remember hearing \"Monarchy\" in that year it came out and it left me intrigued, but not surprised. Rivers of Nihil is a band that at that time did not generate so much enthusiasm for me, but that changed when I listened to their work again and my point of view changed slightly, in addition to the fact that deep down they were a rather particular group. However, I had my first warning with \"Where Owls Know My Name\" throwing me back. It is an album with an ambitious touch and that unfortunately also falls into the saxophone fever that even to this day I believed that it was less popular, but no, it is still quite common.\n\nBut the biggest surprise came to me with this new work titled simply as The Work. A title so superfluent is already a bad sign for me and my hunches end up being fulfilled with the first song, which begins with an unnecessarily long piano passage and a finish from the vocalist whose strength is quite poor accompanied by weak guitars. That intro is like a poorly composed soundtrack.\n\nAnd yes, the saxophone is back on the attack on this album, which in itself is the accompaniment that makes my expectations worse. The title \"More?\" of the seventh song I find it curious, because it seems like a kind of metaphor, a message from the band to their fans of yesteryear asking them if they really still insist on the brutal sound of previous albums, as if it were an irony, almost like mocking from them.\n\nHowever, the worst of all this work is probably the song “Maybe One Day” which is a graceless ballad, you feel it as pure and bad filler. And finally, “Terrestria IV: Work” sounds, which is the classic long-duration closing where supposedly where the band shows all its potential, its talent and musical quality, but it doesn't succeed, it's just boring. It's an unnecessarily long, predictable, presumptuous, and soporific album.\n\nThe Work is a work that inspired me to frustration, it made me reflect on the time I spent in order to appreciate it well. Rivers of Nihil with this album has proven to be another group that thinks they should bring variety after variety with them, but they did not spend any of their time presenting something with consistency, forcefulness, something that makes you remember the good time you spent listening to their new work. And the funny thing is that many people are overvaluing this work, curiously many people who are not so into it.\n",
        "\nRivers of Nihil has become one of the most controversial and well known bands in technical death metal in the past few years. Things started out rather standard with their first two records, but took a wild turn with the release of the album reviewed here, their third album \"Where Owls Know My Name,\" released in 2018. This saw the band treading new waters, going headfirst into atmospheric and progressive death metal, in the vein of Black Crown Initiate on LSD. WOKMN is one of the most challenging, controversial and experimental death metal records to be released in the 21st century, and its ambitious efforts have succeeded exponentially to these ears.\n\nRivers of Nihil exceed where Fallujah began to fail towards this time. Where Fallujah began to focus too much on atmosphere and began making more and more boring music after their first album, Rivers of Nihil managed to make the atmosphere interesting by adding more layers to it. The most obvious of this, the main talking point of the album, is the use of a saxophone regularly. They helped spearhead this movement by infusing wind instruments into technical death metal, now seeing Exocrine and Fractal Universe among others head in this direction. The saxophone works well with the technical death metal, as the beauty of this instrument mixes perfectly with the chaos of the music. And when the music doubles down on the chaos, the sax will become dissonant and intense, evoking a sense of fear.\n\nThe technical death metal itself is tight as fuck, with a lot of meaty riffs, flashy solos and jazz/classic interludes. Good riffs are not a rarity on this album, as each song seems to have a plethora or chunky riffs, most notably the monstrous riff in the middle of \"Old Nothing\" that makes the song worth repeating multiple times just for that one part. \"The Silent Life\" and \"Death is Real\" are also good examples of songs with meaty riffing in them. The solos are just as gorgeous as anything else on this record, memorable, clean and emotional. The emotion above all is the greatest feature of this entire album, as each song is like a rollercoaster of feelings, from angry and intense to melancholy and hopeless. The lyrics help with these narratives as the story carries on into the fall theme, matching the depressiveness of the autumn season.\n\nThe instrumentation is unsurprisingly technically adequate and impressive. The guitars are masterful, as the solos are not only emotive, but complex without being just a wall of notes. The drumming is blisteringly heavy, as crazy fills are delivered at Mach 1 speed, leading me to believe that all these tech death drummers have to be sharing some underground drug that gives them the energy to be able to do this. The bass playing is also impressive, jazzy and surreal as it helps balance the guitars and drumming very well. Vocals are the weak point, as is usually the case with these records - they're, again, not bad at all, but they don't stand out either. The clean singing is nice but the regular growls might as well be copied and pasted from other bands.\n\n\"Where Owls Know My Name\" certainly isn't for everyone - I can see people being turned off by this album quite easily. Not only is technical death metal looked at negatively by elitists, but the almost poppy, atmospheric elements and the bloody sax may seem pretentious and overdramatic. I think everything is pretty much perfect in my eyes. It's just so enchanting, and it's one of those albums that transports me to a different realm and I could just listen to it again and again without issue. I've been listening to it for 3 years and it just seems to get better every time. I've heard two of the songs from the new album that was just released, and was not impressed at all. It seems very disappointing, but I'll save that for another day when I decide to listen to the new album. Until then, this will do, and it does more than enough - this is one of the greatest progressive/technical death metal albums ever written.\n\nFFO: Fallujah, Burial in the Sky, Black Crown Initiate\nFavorite song: Old Nothing\nFinal score: 10/10\n",
        "\nLet's get this out of the way, Rivers is a great band. They are skilled musicians who have excellent mastery of their instruments (except the growling ability of the vocalist). I don't dislike them, nor do I love them, either. They have not proven themselves enough to me, either way. \n\nNow that we got that out of the way, on to the record itself. I have several problems with this album as a \"work\". First, it does not \"feel\" like a coherent work to me. The album title, \"The Work\", is extremely misleading. It is hard to explain, but it just does not feel like I am listening to something trying to convey to me a consistent idea or theme. This isn't like \"Leviathan\" from Mastodon or \"Winter's Gate\" from Insomnium. It feels disjointed and piecemeal. I can't fully explain why, but being a musician myself, a lot of it is just feel. I am telling you, this does not feel complete or like \"the work\" they were seeking to showcase.\n\nIn addition to the flawed/failed theme, this record also feels like a forced composition and a chore to get through. I care not that an album is long; I care that an album \"feels\" long. This album slogs on, and is an unbearable chore. So many times I had to \"set out\" to listen to the whole thing, only to grow tired of it and say, \"fuck this\", and go listen to something better and much more interesting (even Rivers of Nihil's previous album, in fact). This is more a tour de Rivers than a real album. There is lots of empty space that drags on for minutes. I don't think this band realizes that even progressive metal fans do not like this much quiet in a metal album. It is just too much. The build-ups take way too long and are way too similar throughout the album. How many times do I have to hear the bass and saxophone and then the djent style guitar come in to start a song? And, it is boring, me too stuff. They are even biting off their own previous material here.\n\nThe third big flaw with this record is the song-writing. Rivers seems to have taken a bunch of ideas, thrown them in a blender, scrambled them, then put them on repeat for an hour. This record will bombard you with abrupt changes, for no reason, slow, slogging, dragging parts that serve no purpose and long passages that will put you to sleep. And, all of it feels pointless. I don't know, but this music does not feel very inspired to me; it feels like dudes jamming/practicing under lock-down. Sorry. Most of these don't even feel like songs. There are only two songs on this entire album that I actually enjoyed: 1. Dreaming Black Clockwork 2. Terrestria IV: Work. Unfortunately, these happen to be at the beginning and end of the album, respectively, which is a horrible crime. For such a long album to only have two bright moments, is quite a travesty. \n\nAs far as the other brighter moments of the album, yes the production is top notch. It does not feel overproduced or overcompressed. All aspects of the album are allowed to breathe. All instruments can be heard in great clarity. Production values are clearly not the problem here. They probably spent a massive amount of money on the production. And, the cover artwork is superb. The cover art alone will probably garner some album sales.\n\nThe skill/musicianship is also a bright moment of this album, although I must say it is less of a bright moment than the production. All instruments are well-played, but there are two problems that detract: 1. The rhythm guitar lines are unmemorable and basic. Very easy to play stuff, here. 2. The death metal vox have never been great for Rivers and that trend continues with this album. All of his growls come from his upper throat and not from his chest. His growl is very throaty and kinda grates on me after a while. \n\nHonestly, this is my least favorite Rivers of Nihil album, with their last album being my favorite in their catalog. If this is the direction they are going, I think they need to rethink things a bit here. It feels like they are trying too hard to be a type of band they are not ready to be - just yet. To me, this is a death core album trying to disguise itself as prog. Sorry, I am not fooled.\n",
        "\nRivers of Nihil are known for one thing, being different. They are not really prog Death Metal in the vein of Cynic or Atheist, they are not Tech Death like Alarum or Arsis, of course they are not just plain Death Metal neither…they are something quite different. And some people just hate when things don’t fit in a regular box. \n\nAnd of course, when a song lilke “The Void from which no sound escapes” adds not only sweet melodies but even some straight jazz soundscapes, naysayers will hate it, or jat least they ust won’t understand that it’s kind of the whole point of this music, it was never supposed to sound like anything else, it’s meant to not fit in the mold.\n\nAnd this album just keeps delivering songs with a bunch of genres colliding, “Maybe one day” is a ballad that could easily be taken out from an Opeth album, “More?” sounds like Djinn, I mean, I could go on and on about all the different tones, schemes and genres in this album, but the real question would be, is it any good?\n\nYes it is, I mean, I don’t think it will win greatest metal album of the year, but it surely deserves respect and a focused listen. The songwriting is excellent, the arrangements and production are clean almost to perfection, so yes, I think people should give this one a go, but of course knowing that they won’t be getting old school prog death, it’s not even old school Rivers of Nihil, it’s a more matured band with even greater musical goals. \n\nTry it, you won’t regret it.\n",
        "\nThis band had definitely come a long way with just those first three successively more incredible records, carving out a place in tech death that was all their own. This genre has definitely been in a certain state for the past decade and a half with everyone just trying to see you can play faster sweep arpeggios and play more computer-like precise than the other. Rivers of Nihil was a nice breathe of fresh air as they create real atmosphere with real heaviness, not resorting to extremes of dynamic shifts. That was the Rivers of Nihil we had been exposed to previously, but that band is just no more if this record is any indication. \n\nFirst song \"The Tower\" sets an extremely weird tone that I truly hate. I instantly am transported to the world of mindnumbingly boring progressive metal not unlike Dream theater at their headiest, and I am not a fan. You almost speak too soon and breathe a sigh of relief once \"Dreaming Black Clockwork\" comes in, as we're treated to precision-based extreme tech death riffage like what you know and love from this band. Even that is short-lived though as even that gets tempered unfairly early by these odd instrumental interludes. They are just uneasy, edge-of-your seat prog-iness that almost feels like it is for the sake of it. At the album's heaviest moments like the initial riffing of \"MORE?,\" the vibey jackhammering in 1:35-2:13 of \"Clean\" or the piledriving 1:36-2:31 of \"The Void from Which No Sound Escapes,\" you get little feelings of hope. Like, 'hey, I'm reading too much into this. This is the same band that put out \"Monarchy\" and \"Where Owls Know My Name\" and they still have the brutal delivery!' However, these moments are fleeting and get dashed upon the rocks as soon as another clean section, synth part, Floyd-esque guitar solo, or saxophone interlude kicks in out of practically nowhere. The funny thing is, you find yourself loving these parts individually; these parts would be huge moments on any other record where they put into music more befitting them. Here, they just interrupt, and not like a mere conversational interruption, but like a Debbie Downer, grind-to-a-halt interruption. As a result, oddly my absolute favorite track on here is the most out-of-place tune herein, the ballad-ey \"Maybe One Day,\" where finally these weird elements seem to coalesce and unify to a very positive end result. But then you remember that this is a Rivers of Nihil record, predominantly a tech-death unit, and you just get bummed that such an awesome, killer tune is coming from a source that just seems incorrect. Like when your former school bully gives you a ride to your therapist's office. I'm grateful, but woefully confused.\n\nAs I type this, I am going through such a weird rush. Many would argue that the purpose of music is to evoke emotional response, and in the case of metal that it doesn't necessarily need to be mindless headbang chug riffs. While I can appreciate this sentiment, you hear a record like \"The Work\" and feel that a little more mindlessness could have been a serious step in a better direction. This album has more peaks and valleys within one song than most complete albums have and I say that not as a compliment at all. This is a record that pulls you in close and hits you hard in the feels, but those feelings are uneasiness, anxiety, and near suicide-inducing depression. It is dark, it is bleak, it is heavy on the riffs when it wants to be, and heavy on the heart every other time to a huge fault, the only exception being that incredibly uplifting and tragically out-of-place \"Maybe One Day.\" \n\nOdd as it sounds, it is a record that I just really hope I never hear again because of what it does to me as a listener.\n",
        "\nThe first time I found this band I listened to their song \"Perpetual Growth Machine\" and I thought it was pretty decent and had a super catchy main riff. I said why not and decided to listen to one of their albums later that day. This was the album I chose. With the exception of the intro track (\"Cancer / Moonspeak\") and \"Terrestria III: Wither\" which are just instrumentals meant to open the album and add flow respectively, I loved pretty much every song on the album. Before I get into the meat of the review I wanted to talk about my main gripe with the album, the production. This album is really clean and obviously produced pretty thoroughly. I cant help but think how much better the album would sound a little dirtier and with less effects on the cleans. \n\nWhile I thoroughly think this album is meant and should be listened to front to back, I couldn't help but add some of the songs from this album to my playlists (The Silent Life, Old Nothing, Subtle Change, and Where Owls Know My Name) The flow in this album is so god damn good with some of the atmosphere and breaks being the best I've ever heard injected into this style of music. I'm not going to address the saxophone parts much as I can take them or leave them, but the band has spoken that they will most likely not be using it for their next album as it was something they just wanted to experiment with with. The clean parts are surely produced a little too much but I don't think there's auto tune (at least much of it) as you can find clips of them recording the vocals online and they sound pretty much exactly how they sound on the album. \n\nLets talk riffs and flow on some of the songs that are a little more notable on the album, as without riffs, this album would be nothing. Literally.\n\nThe Silent Life opens with a really cool dissonant chord progression with a meaty bass line over it transitioning into a riff that you can't not headbang to. Seriously a good opener for this album. One of the things I like most about this song is it shows just how they dialed back the technicality a bit so that they could truly shine in the writing department, as well as adding breaks to really make the heaviest parts stand out.\n\nOne of my favorite parts about this album is when they just go all in on a section, or in this case, a whole song. Old Nothing is a very interesting song that truly showcases how just god damn good this album shines in sections. The song has blistering fast palm muted tremolo picking for the main riff and is absolutely stacked with double bass pounding. The song manages to keep my attention every time I listen to it. The ending to this song is one of the most memorable as it slowly fades out with a chunky riff and Jake Dieffenbach repeatedly belting \"COMMENCE THY SPIRIT,\" one of my favorite moments on the album in all honesty.\n\nThis album truly shines in the progressive department at some points on this album, primarily shown on Subtle Change. This song is such a gem that seems to have gone a little under the radar as far as this band goes, probably because this isn't what people are listening to Rivers of Nihil for, they're here for the tech death carnage that they've released in the past, but this song is, for lack of better words, a flawed masterpiece in my opinion. I don't want to ruin any of this song in case you haven't listened to it yet, but there's a lot of blues / jazz influence in some of the riffs with some cool arpeggios, but don't get me wrong this song also has the heaviest mid-section of this album on it. \"I feel sickened, entropic vision\" is growled with such vitriol with pummeling riffs under it and believe it or not, there is a black metal section on this song too, nearly a whole minute of pure kvlt. \n\nThe last song I want to talk about has been stuck in my head since I first heard this album, over two months ago. While I may not have mentioned the other songs on this album, they are still very good, I didn't want to do a track by track review but rather point out the highlights that are in my personal opinion the best shining moments and songs on the record. The song in question I'm going to talk about is Where Owls Know My Name, my favorite song on the record. I don't know why, it neither has the best writing or the most captivating riffs but it just resonated with me personally in a way nothing has before. Something about the lyrics and the melody at the start with the groovy riffs and the outro instrumentals gives me the feels. \n\nAnyway, if you were to ask me if you should get this album or maybe just listen to it online, I would say you should do it as soon as possible. I rate this album a 9/10 and sincerely hope this band gets the recognition they deserve.\n",
        "\nThey did it! After a little less than a decade of being active, they released their 3rd album which made the band explode into the headliner category bands. Anything they did wrong on any of their previous records is gone, COMPLETELY FUCKING GONE! No deathcore elements at all, weird instrumentation, progressive and technical elements that could make bands like Obscura and Revocation jealous and variety in the vocals(!!!). This is easily their best release so far and it will stay this way for a while...\n\nNow let's see why this album is that great. Well, I could talk about the amazing instrumentation for example, and the same things could be said about this album as the last one: song structures are complex, but they have an amazing flow to them (and this is one of the most important things for tech death bands), the extraordinary technical guitars and drumming are also here as usual with their blazing solos. You would think from this that it's your basic tech death, but you would be terribly wrong. The progressive elements in it makes it truly unique: the acoustic and sometimes nearly ambient segments of some songs, the use of saxophone (which actually made a bunch of people go ape-shit on the album), the mix of clear, shrieking and growling vocals just take it to a whole new level.\n\nThe chilling intro that is Cancer / Moonspeak (which is clearly the greatest intro that the band has ever made) starts the album off with a great atmosphere, but as soon as it's over, one of the greatest (if not the best) songs of this release starts playing. The Silent Life has everything you would ask from a Rivers of Nihil song and even more. Fast, weird tempo changes and heavy fucking vocals, yet there is space for a calm part, saxophone solo, and shrieking. As soon as it's done comes A Home, which has everything that made the previous song great with progressive elements cracked to the maximum. All of these could be said about basically every single song on the album it's that consistently amazing.\n\nThe only negative element I could mention about this album is.... well there isn't any. From the Mastodon like clear singing elements, through the industrial-ish instrumental song, to the use of saxophone and other weird instruments, everything suits this album no matter how risky they sound on paper.\n\nOverall this is easily the the 2nd best \"death metal\" release of 2018. It lacks mistakes, although I wouldn't call it perfection since it's not an album that I could listen to anytime, you need to be in the mood for it, but when you are then you are in for an experience that you won't forget for a long time.\n\nThe highlights of the album are: The Silent Life, A Home and Hollow.\n",
        "\nAfter a short break, the band finally released their second full-length album and at this point the style of the album is pretty obvious: technical death metal with progressive elements. This is the album that finally made the much needed steps and got rid of the deathcore elements completely (and no I am not counting the vocal style). Not only is this a improvement from the already good The Conscious Seed of Light, but it's also their first album that can compete with top tier tech death bands such as Obscura.\n\nThe band's ability to play their instruments is obviously there, they already proved it on the previous record, but this album takes it to a whole new level. Right at the start an instrumental song starts playing just like on the last release, but this time we don't get the same good transition to the opening song that we got from Terrestria I: Thaw on the previous album. While on The Conscious Seed of Light the first 2 tracks were the strongest, Monarchy gets stronger as the album progresses. It's not that the first 2 songs are bad, in fact they are really aggressive in terms of drumming and the guitar riffs (e.g. Perpetual Growth Machine). Yet as soon as Sand Baptism starts playing the album starts to rise to a whole other level. The progressive elements start to get more frequent and an atmosphere starts building up slowly but surely. From Ancestral, I it totally gets to the top: the album gets an atmosphere that previous records couldn't manage to build up and this is mostly thanks to the occasionally made calm and sometimes even acoustic parts of each song, and even though it has a lot more progressive and atmospheric elements going for it, it doesn't lack the brutality that we all know and love about tech death. It's also worth mentioning that this album is 50 minutes long and it managed to stay entertaining for the whole time (which was near impossible for the last record even though it was only 40 mins long).\n\nWhile this is the first time they managed to top their second EP, this isn't a perfect record. As I mentioned while the first 2 songs (+ the intro) are relatively heavy, they are not heavy enough compared to the previous album's songs and they also lack the progressive elements on the later tracks. These 3 songs don't offer anything, but apart from them the album has no other major mistakes.\n\nOverall this album is the very first time that the band made something that's not deathcore and manages to compete with other talented tech death bands. We could say this is their magnum opus, but that would be wrong. The band has come a long way from being a deathcore band, but their journey is not over yet...\n\nThe highlights of the album are: Ancestral, I , Circles in the Sky and Monarchy.\n",
        "\nAfter 2 EPs we finally got a full-length from the band. After the horrible Hierarchy came the amazing Temporality Unbound with its technical approach. This is what I expected from this album too: make it technical and progressive, but don't turn it into a wank fest and also keep it heavy. Frankly, they managed to do just that, yet it still feels odd.\n\nFirst of all, lets see what's good about the album. As soon as the record start Terrestria I: Thaw hits you with its melodic and atmospheric style. It's gotta be one of the best intros that I have ever heard especially since it transitions to Rain Eater so well (which might just be the greatest track on the album). After that calm and atmospheric intro you get 38 mins of relentless riffing, technical drumming, much better vocals than the ones you could find on the EPs (they are sharper here and have even less deathcore elements) and bass technicality. It truly has everything that the EP had and even improved at some points. While the album showcases the skill of the members on each instrument, it never goes to the wankery territory where bands like Beyond Creation prefers to stay. The production is also a killer, it's much more clean than it was on the EPs making it an easier listen.\n\nSadly the band still didn't get rid off every deathcore elements, but they are using even less now. Occasional breakdown parts are still here, but they are less common than they were. On some songs (e.g. Soil & Seed) you can hear some black metal shrieking, and this would be great as backing vocals (and luckily it usually stays at that), but when it goes from backing to lead vocals it really ruins the atmosphere of the songs. These are the smaller problems compared to the fact that it's just too god damn long. The album is pretty much their second EP with more melodies, and the reason the EP worked to good is because it was short and the material was just good enough to fill it up, but when you take an album that's 40 mins and it has the same quality of songs it is just a little underwhelming and gets boring easily towards the 30 min mark.\n\nOverall this isn't a bad album by any means, it's enjoyable and an improvement in instrumentation and they added some much needed melodies to the mix, but the fact that it overstays its welcome by a whopping 10 mins ruins it. Luckily for us the band isn't done just yet.\n\nThe highlights of the record are: Terrestria I: Thaw and Rain Eater.\n",
        "\nAfter a debut EP as bad as Hierarchy the band could have just split up, but instead of that they tried again and boy, am I glad they did? They dropped almost everything that was horrible in the previous EP (namely the deathcore instrumentation) and decided to improve the (few) technical parts in their debut. The real question would be, is new different sound going to make this record any better than the previous? The answer is YES! \n\nThey absolutely set a new standard for themselves with this EP. It has crushing, yet technical riffs with some crazy licks. While the debut was all about \"chugging brutality\", this record builds an atmosphere with it's neck-breaking technical, yet brutal guitar playing, hardcore-like vocals (with some shrieking in certain songs), drums being too loud to take anything away from the mix, and with occasional \"hidden\" bass lines that are just as impressive as the other instruments in terms of technicality. The atmosphere gave me the feeling that I was traveling through time and space, and I am 100% sure this is what they were going for. While songs like (Sin)chronos and Birth of the Omnisavior are on the more technical and progressive side of the spectrum, there are also songs like Sea of Neurons with its insane heaviness (especially towards the middle of the song). This album just got you covered in every single way possible.\n\nAlthough they got rid of deathcore instrumentation, there are still some elements of the horrific aforementioned genre in the vocals, but luckily for us the occasional shrieking makes up for the somewhat uninspired vocals. There really aren't much more negative things about this record, but I can't give it a higher rating since this is still not the quality that would come latter in the band's career.\n\nOverall this EP is a HUGE improvement from the debut and it foreshadows the style that the band will use from now on. The lack of major mistakes and the overall quality of the songs makes it an album worth your time.\n\nThe highlight of the record is Sea of Neurons.\n",
        "\nWhen I first heard Where Owls Know My Name I felt the urge to check out the band's previous material, but when I decided to listen to Hierarchy something unexpected happened. The only way I can put this experience is like when you are walking at a majestic part of a gorgeous city, but then you find yourself in a dirty alley with garbage, repugnant smell and a couple of homeless people laying around. In this situation, this metaphorical alley is a deathcore album. I never expected the band's first EP to be some sort of technical masterpiece, but god damn it this is terrible.\n\nThe vocals never get out of the set vocal range, this would be alright if it wasn't in some Z-tier deathcore style. They try to sound brutal yet they fail miserably. If the boring and stale vocals wasn't enough to make you vomit, the guitars got you covered! The deathcore chugs are here to ruin your whole week, they are unimaginative beyond belief. Oh and let's not mention the production. If there was one possible redeeming factor that would be the production, yet they still managed to fuck it up that it sounds like every other deathcore band on the scene. It's bland, the vocals are way too loud, the drumming (which is also generic) sounds way better than everything else, but in this case this makes the mix sound even more out of place than it already was.\n\nThe only two good things I can think of about this album is the (very few) progressive/technical elements that it has (they foreshadow the sound that would come latter on in their career), and that Dying Fetus like breakdown in the third song around the middle. I think it's pretty obvious that these 2 positive elements won't make the album great, especially when it probably takes up 2 mins at best from the 15 min of boredom this album is. Avoid this at all costs!\n\nThere are no highlights because there are no good songs on the release.\n",
        "\nI remember reading a post from Rivers of Nihil on Reddit stating that their records are conceptual. This concept, however, only goes deeper into these decaying, depressing nature-freaks and loneliness of this desolated and abandoned world they sing about. People didn’t rate Where Owls Know My Name as the “metal album of the year” for nothing. Third time’s a charm perfectly applies in this scenario, from the first two to this. Rivers of Nihil have perfected their sound, experimentation and origin with this masterpiece.\n\nThe atmosphere and experiment are consistent and unveil a new world of the death metal universe. Blasting drum sequences, neat and catchy guitar works and explosive solos, the developed and insane death growls, the horrifying shrieking from none other than the bassist, along with his amazing clean vocals and impressing bass lines. The band also welcomes the additional friends of the band, from the Thomas siblings Sarah & Andy to the saxophone player Zach Strouse, who’s probably the best part about this whole record. This shows that the band has finally found their direction and shocked the world and doesn’t make you question the brutality and the genre, as if they’re a bad thing. It shows you a unique perspective of what musicians can accomplish within the genre.\n\nThe record begins with the hauntingly beautiful prelude Cancer / Moonspeak (and what I liked more about the structure of this amazing release, is that the prelude is practically the interlude for Capricorn / Agoratopia). The guitarists remarkably executed the chorus effect for the atmosphere, and the haunting vocals are terrifying with the clean vocals. Just what I needed! The background voices remind me of the first Max Payne game, where in one soundtrack of the game you can hear background voices (refer to the second nightmare level in the game). That’s how powerful the band can start their records; putting you in this state of mind, you’re into the story, demonstrated by the music. That says quite a lot...\n\nThe first half of the record already gives you a glimpse of the experiment, atmosphere, unorthodox instrumentation, and the saxophone work for the first time (and just to point out the mind-blowing bridge/breakdown of The Silent Life). The other half speaks for itself on how the band can range within the subgenres of death metal. All the instruments and vocal styles take a huge part in making this record, creating balance. Nothing is being overshadowed. The longest and longest-titled song is a happy and scary one. Subtle Change (Including the Forest of Transition and Dissatisfaction Dance) offers acoustic guitars and guitar tapping before the solos, background music fueling the atmosphere, catchy organ/keyboards, a saxophone that sounds like something you’d listen from Blade Runner‘s soundtrack, and sister Sarah showing her vocals. This whole freaking song is like a video game, overall revealing the band’s experimental capabilities the most.\n\nAt this point, the instrumental track Terrestria III: Wither is a clear representation of what the album cover looks like: a personified apocalyptic wasteland. Hollow, being my favorite song, is incomprehensibly astonishing with the shocking growls at the end of the choruses like you’re beating something up. Death Is Real is just too groovy and too Meshuggah-like (especially in the bridge), which the inspiration came from the first EP. Probably the most brutal and energetic song. The title track has the finest guitar work by far: the notes, the solos, the effects, and the extra acoustic guitars. As for the last song, Capricorn / Agoratopia describes what hell is from the band’s concepts. The choruses are bone-crushing and intensive. Like I said... a personified apocalyptic wasteland.\n\nWith the being said, while a near-perfect death metal record, some parts still don’t sound like they belong. Despite mentioning how Subtle Change (Including the Forest of Transition and Dissatisfaction Dance) is both happy and scary, and being the most experimental song, it’s not as fulfilling as the rest and doesn’t stay faithful to the concept. Terrestria III: Wither is on the same boat. The background instrumentation is what made this track welcome you into the rather creepier side, but other than that, it’s empty. Terrestria I and II speak more volumes. I feel like if these two tracks weren’t in the record, the band could have used those spare 12-some minutes and make some shorter songs longer. A Home, Old Nothing, Hollow, and to make Capricorn / Agoratopia even longer than it already is for being the dominant songs. It would be the perfect 8-track death metal record, sounding more powerful.\n\nI don’t think the band will ever top this record, not to mention fans will regard it as one of the best in death metal, as it’s influential to the experimental side of things. It’s their magnum opus for sure, and I believe it will stand the test of time like other bands who’ve brought something new for these subgenres. I bet you’ll have a hard time choosing your favorite/s, but if you were to choose a few, mine would be the prelude Cancer / Moonspeak, A Silent Life, Old Nothing, Hollow, Death Is Real, and Capricorn / Agoratopia.\n",
        "\nThe right Rivers of Nihil product that displays who they are. Monarchy is the band’s true debut. They can be progressive, technical, brutal, and atmospheric; all within death metal. With each track being atmospheric, the elements of the technical/progressive death metal are consistent, while some even offer brutality from start to finish. It’s important to note how significantly they improved once again. It took them to record a second EP to showcase their improvement; slide off track a little with their debut and returned with some unwarranted chugging. Now, it required a second studio album to fulfill that obligation.\n\nThe song structures, the mix, and the lyrics are fantastic for this 50-minute product. It’s a bliss or a trip that can make you happy, sad, excited, afraid, hallucinate or imagine. The atmosphere of this record gives you this glimpse of entering a world of despair and loneliness, swimming in the rivers of the wastelands (or should I say the Rivers of Nihil, no pun intended). The title track is the prime example of that. Circles in the Sky’s intro sounds like something you’d hear from Rush, but it will put you in this mindset of rage and war, something that would fit in a video game. It’s very calming. I would also add Suntold (great metaphor).\n\nThe guitars fill this record with strong melodies and build a melodic atmosphere, with pretty solos, excellent guitar compositions, and great technical instrumentation. The bass helps in filling this desolated atmosphere of nature, and the layers of it is why it’s my favorite part about this record; incomprehensible goosebumps. I honestly can’t express how good the drums are. One thing for sure, they sound much more blasting. I think Monarchy is where the lead vocalist developed his voice to the fullest. He doesn’t sound like an average death-growler. Here he growls in “story-telling horrors” and expressing the lyrics the way they should.\n\nThe downside of this record is that its first half isn’t remarkable as the second half. Heirless was a dull prelude, and the rest of the songs (other than Sand Baptism) sounded... normal. They still have quality, but they don’t sound exciting. Monarchy originates the core sound of what Rivers of Nihil would later become. The band likes all sort of music, and they made the ultimate record. The best tracks are the last four tracks.\n",
        "\nThe Conscious Seed of Light has a very fascinating and impressive intro in Terrestria I: Thaw. It’s beautifully composed, with one of the most blistering blast beats I’ve ever listened to. Quite frankly, it’s one of the best preludes for a death metal record! Followed by Rain Eater, this song is terrifyingly good that you can’t ask for more, using the substance of the prelude to expand on the meaning. That’s a prime example of how to start a record with a bang.\n\nWith that being said, the record started to show its cons. There’s no denying that it showed how developed the music is and how prominent it is to technical/progressive death metal. However, it doesn’t contemplate and enhances the atmosphere and style I thought the band was portraying. The re-recorded versions of Birth of the Omnisavior and Human Adaptation (which was not that bad) are not as good as the originals, especially when the former sounds more generic and tasteless, while the original had more progressive layers. Speaking of the former, where’s the chorus effect in the song’s bridge?! More of the record’s portion reminded me of their first EP: chugging and the deathcore subgenre, uninspiring listen and the whole technical part is underwhelming (to some extent), as it’s simultaneously combined with said chugging.\n\nSoil & Seed, Central Antheneum, and Mechanical Trees describe the experiment the band was working on, not to mention the titles themselves, the meaning and the metaphors behind them. It showed proper technicality and progressiveness, sounding fresh and uncommon. The vocals are in place, as I imagined the singer would go with, while these three songs’ experimental approach pinned for future reference. This doesn’t take away from how excellent Rain Eater and the re-recorded version of Human Adaptation are.\n\nI’m still complimenting the band for building up their direction in later years, which this record halfway through proved so. If only the rest of it followed the prelude and the opening song. I only wished they’ve incorporated the sound of their second EP into The Conscious Seed of Light since that’s what hooked me up and would break away from the band’s deathcore influence. While the debut is unfavorable, at least the band isn’t losing their edge.\n",
        "\nAlmost two years after the release of Hierarchy, the band released their follow up EP Temporality Unbound. Its sound and writing confirms that the band experimented with making their sound unique and original. The music is better than what Hierarchy offered, the song arrangements are better, it offers quality and memorable songs and good 25 minutes of sheer technical/progressive death metal. This excellent EP is a great start to try the band, let alone the subgenre/s.\n\nThe vocals with the shrieking sound better, the melodies are amazing, the blast beats are as advertised, the bass is superb, and the sound is being perfected to the likes of Cynic, Atheist and others. Other than the incredible music, my favorite part of this EP is the unpredictability. A song like (Sin)chronos that starts off groovy and traditional for death metal - two minutes into the song you get black metal vocals, as the music changes. You’d be asking yourself, where did this come from?! Birth of the Omnisavior has a bone-chilling, Cynic-like guitar solo (much like in their debut EP). Sea of Neurons has everything that you want to hear from Rivers of Nihil, like the technicality and excelled progressive elements, while the length provided a lot of substance. Words cannot explain the sheer awesomeness of that song... just do yourself a favor and listen to it!\n\nTemporality Unbound isn’t perfect. I didn’t like half the EP, to say it still contains what the predecessor had: chugs and some deathcore elements. However, it doesn’t take away how the quality from every track is extraordinary. This release shows how powerful and dedicated the music recorded into a freaking EP can be, you just wished it was longer. (Sin)chronos, Birth of the Omnisavior, and Sea of Neurons are the highlights of this EP.\n",
        "\nRivers of Nihil might be your typical, modern American technical death metal band, even though they were longing for something better. They were experimenting and originating their sound with their EP debut Hierarchy. This EP describes modern technical death metal with progressive death metal elements, yet leans towards deathcore. As you may already know, deathcore offers repeatable chugs, growling and shrieking of vocal inconsistency, forgettable and uninspiring music and directionless approach in the subgenre.\n\nIt seems like the band wanted to throw five songs into this EP and call it a day. The result becoming generic. The music had a solid potential of sounding much better, as only two songs suggested: Postmortem Prostitution and Human Adaptation. Had the guitar transitions, audible bass and common death metal growls been more prominent, the EP would benefit more in the process to produce an outstanding and thorough listen. Judging by what inspired the band to write and record their music with their approach, it was rather a disadvantage and hasn’t brought something new to the table. You may find Ultimate Sentience fresh than the rest of the EP’s songs, but it’s lackluster because of the band’s technical nature, fused with some black metal elements and more chugging. I’m not implying that whichever bands and genres the band’s inspiration would be is bad, but the writing was still poor.\n\nRegardless, Hierarchy attributed to the music becoming more developed and original in the band’s future releases. The most memorable song that gives such example is Postmortem Prostitution: Cynic-like guitar solo and Meshuggah-like guitar riffs. The blast beats also helped with the sound and made it likeable. Another shout-out to Human Adaptation for sounding better than the re-recorded version on The Conscious Seed of Light. It’s a good, heavy song, giving the example that sometimes original writings are best left alone.\n\nOverall, this EP is unoriginal since it brings nothing new for technical and/or progressive death metal. But I’m complimenting the experiment for at least trying to sound unique, as the band proved so with Postmortem Prostitution. It can be a decent start for metalheads to get a glimpse of their sound, though it doesn’t offer more than the aforementioned song and there’s more to look out for beyond this EP.\n",
        "\nRivers of Nihil came highly recommended to me more than once and their latest album \"Where Owls Know My Name\" made it on quite a lot of 2018's top 10 lists. Eventually I had to see for myself what all the fuss is about and to be perfectly honest I don't find it exactly \"better\" than other technical death metal albums released last year (For example Beyond Creation or Irreversible Mechanism) but it certainly offers a seriously surprising and unique experience, displaying extremely high levels of technicality, composition and overall musical mastery.\n\nThe first thing that hit me about Rivers of Nihil was the sheer aggression that they deliver. This has to be one of the heaviest and most impactful albums I have listened to even in the tech-death area. The reason for that is partly the raw brutality of the riffs, bass and drums but also the outstanding production work that makes the whole soundscape sound like a total downpour of devastation. The one thing I disliked about the mix of this album is exactly the one that makes it stand out. Everything sounds super processed, mathematical, flat and lifeless but not in the way you might expect. Because it is also absolutely massive! There's just this raw, empty stream of relentless savagery in the drum sound, prominent gut-punching bass and grinding overdriven guitar effects that there's really no room for anything else. It is clear that they had heaviness as their first priority in all that concerns production, mixing and mastering.\n\nAt first I was a bit bugged by this because it's so machinery-like that you almost feel it's played on a computer program but after giving it some more time and also digging into the concept, it became pretty clear to me that it's not supposed to feel like it's played by humans. There is no vitality in this album because it's all about death. The story is a continuation of their previous albums that I am not familiar with but you don't need any background to understand it. They present the last man on Earth as the sole conscious witness of death on the planet. And that morbidity is actually expressed in the mix. Because it is so flat and linear but also somehow digital it does build up a pretty strange, hollow and sickening atmosphere that allows every vibration to reek of despair, hopelessness and decay. That also comes through in the screams that are also pretty flat but still aggressive and somehow tormented. I guess the idea that comes with this savage but completely stiff sound is the inevitability of death as despite any hope or emotion the man may conceive, everything remains cold, still and dead around him. Obviously the lyrics bring out regret, loss, aging and death.\n\nNow the composition itself is also based primarily on brute force. The riffs have little to no melody. The bass easily comes through in the mix though it generally stays in the low octaves and the drums are an ongoing grind on pedals and blast beats that most likely drains every last drop of sweat from the man behind the kit. There are also guitar solos based on excessive technique and shredding and not much else. However, they take smooth turns towards clean guitars, more groovy bass and drum parts and unveil elements like saxophone, cello and trumpet. These parts do NOT contrast with the depressive vibe! On the contrary, they enhance it. The use of these unexpected instruments carries a sad and mournful tone that builds a deathly, funeral atmosphere. In the end this is undoubtedly the darkest tech-death album I have listened to!\n\nI have to say that overall, the album is masterfully pieced together but between the storm of techy noise, apocalyptic concept and eerily depressive atmosphere it does feel a bit toxic and exhausting, especially given that it's almost an hour long. For a good dose of uncontained rage, I recommend one or two songs off this album but I'm afraid a full stream is potentially brain-damaging and I suggest you meditate a while and contemplate on inner peace before you get into that.\n",
        "\nRivers of Nihil rapidly evolved from the moment of formation, quickly cementing their place in the local music scene in the years before they got signed to Metal-Blade and went on to work and tour with death metal heavyweights. Temporality Unbound represents the band having found their own unique sound – heavy technical death metal that draws influence from a diverse range of bands including Meshuggah, Suffocation, Death, Atheist and Decapitated to name a few. \n\nThe production is crisper and tighter than Hierarchy, which was recorded, mixed and mastered by Len Carmichael. The guitars are thick and crunchy, at times carrying a decent groove through odd time signatures. Adam's bass work can often be clearly heard delivering intricate riffs amidst the brutal chaos. There are plenty of jazzy melodic guitar solos as well, and there are whole sections of songs that are experimental and atmospheric. There is definitely some Meshuggah worship, especially at the end of \"Arise in Repeat\" with a groovy odd-time signatured riff with spacey riffs echoing into the void. There is still a small amount of slam-death metal influence as well, but it is clear the band is moving away from that, perhaps to avoid the deathcore comparisons. The songwriting is also pretty damn solid, most of the songs here (except maybe \"Vacuous\") appeared in their live sets back in the day and had time to be road-tested before put to tape. \n\nJake's gruff hardcore barks are sometimes complemented by higher black-metal style shrieks from Adam Biggs. I think Adam channels Travis Ryan from Cattle Decapitation in \"(SIN)Chronos\" for a bit. \n\nThe song \"Vacuous\" is an outlier here. This was recorded by Andy Thomas and is an experimental instrumental interlude. It provides an abrupt break from the chaos. It is a really beautiful and simple piece, and is an early example of the band willing to go beyond just pummeling death metal. Adding saxophone isn't much of a stretch after all. \n\nEverything comes together to form two solid chunks of death metal with a short intermission in between, along with some sojourns into extra-dimensional space. When they first formed, I initially thought of them as \"Amongst Decay 2.0\", but they quickly had transcended that. It was an exciting time for Reading area bands when the news broke that Rivers of Nihil had been signed, and now this area also has Black Crown Initiate and Outer Heaven.\n",
        "\nRivers of Nihil is a very important band to Reading, Pennsylvania – along with Black Crown Initiate, they put this town on the map internationally in the death metal world. Sure, this local area has seen other acts tour internationally from a wide range of genres, this is where Taylor Swift grew up, but death metal finally had its day here. \n\nI know most of the full story behind Rivers of Nihil and their history because I've had the privelege of seeing it in person. A few members, including Jake and I think Jon and Ron as well, were in a slam-death metal band called Amongst Decay (sometimes also called Amongst The Decay), while Brody and Adam played in the area with a band called Dissian. \n\nHierarchy represents the earliest era of Rivers of Nihil, this is the band at their most primeval. There are still some tinges of the members' previous bands, especially Amongst Decay. There are slamming breakdowns and ultra low guttural vocals from Jake, who has an incredible vocal range that he effectively employs here, going as guttural as Wormed in The Shrugging of Atlas (which is a bonus track in the second version of this EP).\n\nI admit I view this release through rose colored glasses, because of the nostalgic value these songs have. It's been a very long time since I can remember Rivers of Nihil playing Ultimate Sentience, my favorite song on this release primarily because of the whiplash inducing slam towards the beginning. Nevertheless, they did re-record Human Adaptation on The Conscious Seed of Light and their aspirations for something greater than the sum of its parts are clear here. The technical playing is brilliantly presented here from everyone. Brody's riffs, Adam's bass riffs, Ron's ironclad drumming, Jon Kunz's crawling blackened riffs and Jake's barking and guttural vocals all come together on each track. Postmortem Prostitution contains a melodic guitar solo that serves as a harbinger for the type of brilliance to come in songs like Circles in the Sky off Monarchy. \n\nWhat I especially enjoy about Rivers of Nihil is that from the beginning they have an impeccable ability to showcase each member's talent. Ron Nelson starts off the EP with full on technical blasts and well executed fills. The guitar riffs have an excellent variety and sense of melody. There are crunchy slams, rapid fire death metal tremolos, chaotic crawling blackened riffs and even a little bit of Meshuggah style groove. Ultimate Sentience contains one of the heaviest slams in the Universe. Biggs' tricky bass playing is allowed to shine throughout the album. \n\nEspecially for fans of Rivers of Nihil, this is an absolutely crushing start to their career. But for me, this takes me back to seeing them at The Silo in 2009 and yelling \"Fuck Yeah!\" after each song.\n",
        "\nRivers of Nihil continues their musical dominance in a somewhat unusual, but very mellifluous and enjoyable way with their latest, most ambitious effort to date. Where Owls Know My Name is a pretty good example of a band not being scared of going out of their safe zone and trying out something new, going away from usual riff heavy tech death into more experimental territory, continuing their growth with an open minded view of tech death with features such as saxophones and beautiful acoustic and keyboard sections.\n\nUnlike the previous two albums where the first track was a typical metal intro, this one is opened by a rather mellow, very later Opeth-esque track that absolutely soothes the listener before the epic rest of the album blows your ears, which honestly really surprised me and made a good impression right off the bat. Right afterwards comes the awesome tech death beauty that is The Silent Life and the beautiful, solo laden adventure Subtle Change. Adam on the bass is, along with the vocals, a definite highlight of the record for me. His talents really shine in Subtle Change and the title track.\n\nThe vocals are spot on and brutal throughout the whole record, but the highlight for me is the self titled Where Owls Know My Name where Jake and Adam absolutely steal the spotlight, along with the sax. Many might find the sax parts on this record cliché and needless; in my opinion, it's pretty difficult to make an instrument like the sax fit into a metal record, but the band executed the potential of the sax in a way that absolutely fits the tech death parts and made it work beautifully.\n\nThe album ends with, in my opinion, the two best tracks of the whole record, the self titled song, and Capricorn / Agoratopia. The self titled is absolutely beautiful in all aspects - both the tech death, and the more mellow clean vocals parts which I mentioned above; the last song is the product of when you put the whole album you've just listened to into one song, and is probably the best possible closing song the band could've come up with. Despite being a bit longer, it doesn't feel needlessly drawn out just for the sake of the song's length.\n\nOverall, this is a joy of an album to listen to and by far the best we've heard of Rivers of Nihil so far, and I hope they continue to explore the style of this album even further in the future.\n",
        "\nRivers of Nihil have been around for a bunch of years and have released a couple of albums already, but it’s not until this album came out that I had even heard of these guys. Prior to its release, Where Owls Know My Name had started to receive very positive buzz, mainly due to the first track they released “The Silent Life.” I must admit I got caught up in the hype myself, with the perfect blend of brutality, melody, and sax. Now the album has been released, I’ve heard it a bunch of times, and the hubbub that was surrounding the album has largely subsided. That’s the natural life cycle, I suppose, however the lucky thing for Where Owls Know My Name is that it still sounds fresh and exciting each time I play it.\n\nAfter you notice the stunning cover art with its subtle green colour, the first track sets a very melancholy scene to what’s coming. Once the music begins, I first noticed that the production was actually really good. Everything can be well heard, with no instrument overpowering any other. I also noticed a good dichotomy between the hard hitting parts and the softer parts, allowing both the suffocation of their power and the space of their subtleties. Their first single “The Silent Life” exemplifies this with their saxophone section sandwiched between death metal. Other songs such as “Subtle Change” and “Where Owls Know My Name” also show snippets of saxophone and show the range this album presents – in particular the title track shows a much more melodic side to the album that was hinted on earlier, but this one extends that to the whole song.\n\nThe three-peat of “Subtle Change,” “Terrestria III: Winter,” and “Hollow” is my favourite part of the album, without a doubt. “Subtle Change” is a long track taking you through many moods that has their most intense blasting section (you’ll know it when you hear it) before coming back with some more saxophone afterwards as a sort of intermission to the track before returning for one last hurrah with the chorus. It all works seamlessly together. It flows into “Terrestria III: Winter” which bisects the album but sounds really nice with its quasi-industrial sounds. Then that leads into my favourite song on the whole album “Hollow,” with it’s amazing clean vocals, lyrics, and scintillating drum work. \n\nAs much as there is good here, a flaw arrives in that some songs are just not as good as others, which hurts the album in that I’m waiting for the good ones to come. None of the songs are outright bad, but I find that songs such as “Old Nothing” and “Death is Real” just don’t have the same vitamins and minerals as the stand-outs here like “A Home” and “Hollow.” Again, there’s nothing inherently wrong with these songs, and it’s not like they’re stylistically different to anything else presented here, but I don’t find them to be anywhere near as interesting. Another point of conjecture might be the title track “Where Owls Know My Name” in that it’s likely the most melodic track here, with its abundance of cleans, lack of blasting, and its general rock-like structure. I don’t mind it, although I would’ve liked it to be a minute or so shorter.\n\nDespite that, Where Owls Know My Name is a real winner in my mind. Even the “bad” songs aren’t actually that bad, and the good songs, namely “A Home,” “Subtle Change,” and especially “Hollow,” really stand out and give this album a lot to hold onto. I hope Rivers of Nihil continue this direction they’ve carved for themselves, but for now I think this is a really great album and will get plenty of spins.\n",
        "\nRivers of Nihil is one of those bands that you hardly hear about until they release a new album, and when that happens, everyone loses their shit.  This is probably due to Metal Blade being one of the biggest metal labels and they sold this band very well this year but whatever.  This band is one of those tech death bands that has guitars tuned low enough to make Dave Mustaine throw a fit and is muddy like Allegaeon or early Arsis.\n\nFor me, anticipation for this album started when I was scrolling through the \"Upcoming Albums\" tab on The Metal Archives, saw Rivers of Nihil, and was like \"hey they're tech death, right?\"  Cool story, right?  I know, I'm great at telling them.  The singles started to drop, and I listened.  The first two were \"A Silent Life\" and \"A Home,\" the first two tracks on the album (a bad sign, if you're me).  The third single was the title track which was track nine (a good sign).  The singles sounded good to me, although the title track was pretty dull compared to the other two singles.  They were chuggy and almost groovy but mostly just extremely atmospheric.  That is, more atmospheric than Monarchy, their previous 2015 effort.\n\nThe atmosphere on this album is very welcome because I usually love that kind of stuff, especially when it's done right, and, trust me, it's done right here.  There's a nice flow to the album that goes beyond being limited to one track, and it carries the listener on a down-tuned ride of sweet melodies and jazzy passages.  This flow is lost with \"Old Nothing,\" a track that has nice atmosphere, but it comes and goes as the song jumps through various sequences.  In fact, I lied because this flow really only lasts through the first three tracks (including the intro) and through the tracks \"Subtle Change\" and \"Terrestria III: Wither.\"\n\nSpeaking of \"Terrestria III: Wither,\" I hate to admit it, but I've always had a sweet spot for good techno, so I think that the song is okay.  I understand that a lot of metalheads hate techno, and I would disapprove of it, should it not fit in the album.  However, this particular song does fit where it is, and I think it serves as an interesting intermission.\n\nWhen the title track finally rolls around, it starts with this crunchy guitar that doesn't sound good, only to lead into clean vocals that are almost metalcore whiney.  After the intro, everything smooths up and it becomes a good track.  I really don't know if it's actually a good song or if the two songs before it made it look good by being boring.  Whatever it is, I know for a fact that it isn't up to par with \"A Home\" or \" The Silent Life.\"\n\nAlso, I watched the mini documentary (or, what I could get through before I got bored) of the process they went through to write this album, and I remember one band member saying it was highly influenced by Pink Floyd and other classic rock bands.  I'd just like to point out that that riff about two and a half minutes into \"Subtle Change\" is half metal, half \"Carry on My Wayward Son\" by Kansas.  Also, the whole intro to the song is straight from a 1970s dad rock band like Foghat, Led Zeppelin, Rush, or, duh, Pink Floyd.\n\nHere's the gist of this album: it starts out very strong only to dissolve into really boring death metal that is hardly technical.  It just hits a lull after the techno track where everything is just going through the motions.  Also, one of the tracks after \"Terrestria III\" is literally called \"Death Is Real.\"  Oh, thanks I forgot.  Where Owls Know My Name is pretty different for this band, but that doesn't mean it's great.  I would hardly even call it good.  It's mediocre, having only four or five songs that I really enjoyed, and that doesn't include the techno song.\n\nOverall Rating: 79%\n\nOriginally written for themetalvoid.wordpress.com\n",
        "\nYou could say I'm an open minded person. My favorite music genre is no doubt metal, especially death metal, but I'm able to name a couple of records that I like in most kinds of music whose existence I'm aware of. I'm not an elitist by any means, and I'll enjoy both the death and the core, so to speak. I'm no stranger to sonic mayhem of all sorts, as I've even ventured as far as harsh noise. Lately, I've decided to check out \"what's hot\", what's the top 50 music these days. One artist comes to mind, and that is Dua Lipa, a pop singer. I figured that even though her music is predictable and kind of shallow, it sounds pleasing to the ear and catchy, and the production is simply flawless, for the goals it means to achieve. People criticizing the genre for not having much depth and appealing to the lowest common denominator, for me, come off as pretentious, because this is exactly what is says on the tin. Pop music. You get what you click. And honestly, I don't care it's mass-produced by the machinations of capitalism. They've gotten so good at it that artists have managed to become distinctive, taking little details into the fabrication equation.\n\nAnd regardless of my traits and musical experience, this, this makes me fear for my life. It gives me existential dread of sorts. Have you ever seen one of those \"for kids\" apparently computer generated videos that appear on YouTube, featuring Spiderman, Elsa, Hulk, Joker, et cetera? These have millions of views, and once you venture deep enough into the rabbit hole, you'll notice that some of these contain weird, uh, fetishes? Such as being buried alive, forcing needles into eyes, general gore, eating feces, and the list goes on. Presented in such a way that is extremely disconcerting and uncanny. I find \"Where Owls Know My Name\" to be on the same page. A manufactured product lost somewhere in between the authentic (such as old school death metal), and the unrealistic (pop music, so overproduced that the sound can never be replicated live sans playback), but still pleasant. Stuck in the uncanny valley of the neural network \"mind\", produced by feeding it information through deep learning algorithms. And it rears its ugly, abominable head.\n\nListen to 0:30 and onward in the track \"Death is Real\". Now, the title of this review pretty sums up my reaction. On my first listen, I clicked straight into the part, because just the first two seconds of the track assured me that I'm in for something boring. And oh boy, I regret not turning the whole thing off altogether. Without context, I was under the assumption that this is some kind of special effect placed on the music, akin to what a lot of deathcore bands use before breakdowns; an EQ sweep that cuts out all the treble and bass. To my horror, I was wrong. The next section showed absolutely no change in dynamics or general tone, so it couldn't have been an effect. Listening again, starting a few seconds before 0:32, I realized that this is supposed to be a blast beat. Holy fuck. I had a hard time discerning each single element of the movement, as this on first impression seemed like something vaguely techno-like. But in reality, there's a guitar. There's bass, there's a snare, there's a kick, and there's a hi-hat (?). The drums, sonically, are completely lifeless and stale, as if from a cheap drum machine. I mean, they apparently do have a drummer, but this doesn’t even sound like a badly triggered drum performance, nor an electronic drumset. Infant Annihilator has constant, piercing snare hits, which, while sounding laughably fake, do carry a ton of power. Sure, it’s 127 on the MIDI volume scale all the time, but it does the job. Rivers of Nihil seem to float around a constant 90. Mediocre, inoffensive. If I were to find a fitting onomatopoeia for the snare, it would be a muted “plomp”. Plomp plomp plomp. Maybe with a double “o”. Something like “ploomp”. Complimented by scratchy, djenty guitars and a nigh inaudible bass, this creates an uncanny parody of whatever extreme metal genre this attempted to mimick. And here I must ask a question of utmost importance: How the fuck did the genre of death metal get from “Altars of Madness” to this?\n\nWell, at least what passes as death metal these days. How did the collective consciousness of metalheads listening to the more extreme branch of this music accept this as “death metal”? And of the “progressive” variety to boot. The post-Bitcoin age is truly frightening. There is nothing progressive, nor death, nor metal about this straight off the conveyor belt product. Zero substance or power, devoid of any real emotion. A product of artificial intelligence fed with stereotyped data. Songs on this album seem like they’ve been sewn together by a computer program. Here’s the blast section. Here’s the clean section. Here’s the fuzzy chord section. Here’s the fucking sax. These songs neither sound pleasant, nor do they tell a story. They don’t have a personality. More faceless than the fucking Faceless. Each track consists of a mash-up of the most generic tropes you can find in metal, djent, -core, and whatever other genre this AI-generated fecal smoothie contains. I’m not against mixing various styles of music. I fucking love Surrounded by Silence by Design the Skyline. And the difference between this and that one uniformly-hated-by-everyone song is that the kids in the latter had passion and genuinely expressed themselves. In contrast, \"Where Owls Know My Name\" is a coldly calculated product. But fuck, are they bad at math.\n\nWhile output of previous generations of run-of-the-mill “techdeath” bands such as Rings of Saturn could be described as “technically competent”, this cannot be. I am not convinced that this is music performed by human beings, sans the vocalist (which is weak and forgettable at best). And I do not mean this in a good way. Inhumanity could be descriptive of Cryptopsy, but in their case, the musicians are just extremely tight, while retaining the little flavor that always creeps into authentic performances. You could say that Cryptopsy is a licensed surgeon gone serial killer. Rivers of Nihil is an autistic (with all due respect to those with the condition) hunk of aluminium and plastic, straight outta DARPA – technologically impressive, uncanny, and not quite fit for any field task, because it failed at the prototype stage. When listening to this record, you’re not listening to a band. You’re listening to statistical charts of the record label executive. Paid goons at whatever studio this was “recorded” in just converted ghostwritten (by an AI) Guitar Pro files into instrumental tracks, then tracked the vocalist over the resulting mess. In 2012, the year on which “Dingir” by Rings of Saturn was released, there was no software for electric guitar programming. Now you have it, and here’s the result of its misuse.\n\nThere is no single hook, memorable track, or anything that would stick in my head. The AI they used doesn’t yet have an understanding on what creates timeless tracks. And I believe that neither does the band, nor does the record label. Metal is supposed to be based on riffs, and what the guitars do here is either Periphery demo session semi-random djent noodling, “jazz” wanking or post-rock chord progressions. Outside of stringed instruments, there’s a fucking sax which unpleasantly jizzes into your ear at random through the running time of the record. Sometimes, the vocalist decides to sing with this horrible autotuned vocoder effect. By now, you should get the picture of how annoying and incoherent all of this sounds. Opeth meets Deafheaven meets Cynic meets Meshuggah meets Devin fucking Townsend. While I am aware that the aforementioned combination would make djentsters climax from excitement, I wouldn’t recommend this record even to them. Any pleasure a die hard eight string+ guitar aficionado could experience listening to this album will be hindered by one of the worst mastering jobs I have ever had misfortune to hear. It seems like the AI did the production part, too. Metal is supposed to be loud, huh? Okay. 01010011 01001000 01001001 01010100. Mastering complete. Every single instrument is now compressed to hell and back. Or, no, compressed is a bad word. It’s like it put a fucking limiter on every single thing and cranked it all the way up to the point where it starts to distort, then set it a little lower. I hope Metal Blade puts all income from this album into AI research.\n\nLong gone are the days of labels helping artists realize their true potential. The labels, as any other business in our capitalist society, really just want the money, so I wonder why the fuck won’t Brian Slagel start releasing mumble rap instead of diluting the already quite substanceless metal scene even further with liquid turds such as this and nu-Whitechapel. Better make Phil Bozeman grow dreadlocks and try to set him up to be the next Lil Pump. I’d rather listen to that than anything in the modern Metal Blade catalogue. And all in all, that’s a lot of words for what’s really just a shitty post-rock album with faux-growls, faux-blastbeats and a mallcore dressing. Avoid.\n",
        "\nThis album wouldn't even be worth talking about were it not for the fact that the band has their priorities all wrong. The way to make boring music more interesting is to write more interesting parts - better riffs, more imaginative beats, perhaps throw a curve ball in the songwriting. This simple concept is one that is lost on Rivers of Nihil, because in their attempts to make their sub-standard, formulaic, modern extreme metal more interesting they've managed to turn what would otherwise be a not at all noteworthy mishmash of extreme metal styles into a stupid, annoying album.\n\nAt its core this album is what I just said: a really boring, below par mix of modern brutal death metal, technical death metal, deathcore and progressive metal to create a sound that falls under the vague 'extreme metal' banner. Everything about the music is impressive on the surface but leaves zero lasting impact. The triggered drum performance that's all too common is as rapid fire as a minigun and as precise as a sniper rifle, but it sounds mechanical and lifeless. The same can be said of the guitars, which play really uninteresting and unmemorable 'extreme' riffs, tedious mid-paced chugging (reaching a high point on the boredom scale during 'Subtle Change') or run of the mill tech death leads. Admittedly the leads are technical, but again they aren't really emotive at all and don't impact the listener beyond 'wow this must be hard to play'. The vocalist's harsh styles alternate between serviceable rasps and a somewhat barking growl; he's probably the standout performer simply because it's hard to make vocals sound mechanical and shallow like every other performance here. The production is pretty standard for this type of music too; it sounds compressed and overly loud and the instruments on the album are so polished that they sound synthetic. All of the edge to the guitar tone has been stripped and none of the instruments ever bleed together or sound organic at all.\n\nIf this was all that was wrong with the album then I wouldn't be writing about it; the above problems apply to a lot of average modern extreme metal albums. What really makes this album stand out as being bad is that Rivers of Nihil saw fit to 'improve' their sound by adding a lot of outside influences. Sometimes they draw from progressive rock and metal in the form of tranquil acoustic/keyboard driven sections and rather expressive, passionate leads that are of a much higher quality than the ones found in the metal portions of the songs. Other ideas they throw in are the gratuitous and aimless saxophone a few minutes into 'Home' or the bland attempts at electronica they'll dive into in an equally pointless fashion. Aside from being masturbatory and flashy rubbish, the problem with these sections is that they're jammed into the songs with no rhyme or reason; the band never really weave the metal and non-metal components of their sound together, and as a result one track feels like a mashup of two or three songs, and it makes the album an incoherent and uneven listen. The songwriting in general is pretty piss poor, with any one section of a track dragging about and not really going anywhere to the point where these bloated compositions get tiresome very quickly. You can't improve bland music by jamming in unrelated sections into the music in an attempt to have a progressive and open minded approach to songwriting. It throws off the pacing and consistency of the album and actually makes the music more unmemorable than it otherwise would have been; which is quite the feat given the base of lifeless 'extreme' metal the band were building off of to begin with.\n\nBleh. Don't bother.\n",
        "\nRivers of Nihil represent a lot of what I hate in modern death metal. They are somewhat techy, somewhat brutal - even somewhat -coreish at times - and resolutely mechanical. The sound is compressed to shit, the bass drum is as clicky as a metronome and the whole thing comes off as terribly overproduced. Probably in an attempt to counteract the fact that they really don't have much of a personality of their own, they throw in heaps of window dressing. Some of it is actually quite awesome when looked at in isolation, but they don't make a lot of sense in the framework of their sound. Where Owls Know My Name (the fuck type of album title is that lol) is not so much a giant progressive leap forward, but an incredibly stale example of soulless modern death metal. While they have tried their damn hardest to spiff it up with all this non-metal padding, all they end up doing is turning a turd into a polished turd. \n\nRivers of Nihil don't really settle on one style of death metal, rather taking bits and pieces from BDM, tech death, deathcore and whatever is passing for progressive extreme metal these days. They amalgamate these styles in an aggressively modern, accessible and technically skilled way. Besides the riffs largely being meh, the problem here is the sound doesn't allow it to breath. The bass drum is ridiculously clicky, the guitar sounds mechanical (especially during the breakdown parts) and the lack of dynamic range is quite noticeable. As for the vocals they're fine and not that run of the mill for death metal. You get a more barky vocal and a more raspy one. They're fine I guess, it's hard to care either way. The short of it is this is overproduced, doesn't have much of an identity and is honestly not that interesting. \n\nRivers of Nihil probably realized that the metal portion of their sound was aggressively unremarkable and decided to add all these progressivisms to counteract this. A lot of these sections are cool on their own, but they are baffling in the context of the album. Like having this mechanical overproduced death metal and then out of nowhere this beautiful Pink Floyd section complete with a sax? Makes no goddamn sense at all. You also get some really emotive vaguely progish lead guitar, some atmospheric acoustic breaks and even some timid flirtations with electronic music. It's almost like they tried to mash two separate albums together hoped no one would notice. The only really egregious facet of their non-metal side is the clean vocals. Combine the worst of alternative rock and emo and you get a picture of what's going down. They're whiny, nasally and trying way too hard. They're not that far off from the shitty made-for-teens metalcore bands that started breaching the mainstream give or take a decade ago. So you have some cool padding and not so cool padding. What you don't have is non-metal elements integrated in any sort of coherent fashion. \n\nSo yeah, this blows pretty hard. The metal is so fucking mechanical and boring. I really wish more bands realized when you go this balls deep with compression the lack of dynamic sonic range actually makes ends up making it not seem as heavy when the more vicious parts do come crashing in. Even if some of it is cool, the window dressings probably make the album more frustrating because it results in a pretty harrowing blue-balling experience. For all the effort put into production, technical skill and a anything goes mentality to padding, Where Owls Know My Name is a really tame and irritating listen.\n",
        "\nThis is what I wish the natural progression was from Meshuggah. Unfortunately, and as a whole, we were given djent. There are palpable influences of Meshuggah and even a more technical Gojira when it gets at it's most proggy (As well as some of the vocal stylings). Though not by much, this album is a little bit slower and less technical than their other albums. They already were almost not quite qualifying as \"technical death metal\" in my book with how simple their songs were, but this album even less so. It still gets somewhat tech in some spots, like on \"Old Nothing\" and parts of \"Death is Real\"\n\nLike mentioned above, this is a less technical releases than previous efforts and this is most palpable in the guitar sections. The guitars have some interesting sections, but nothing very impressive. The rhythm section is pretty basic. The leads are akin to the prog/blues-influenced solos perform by mastodon, especially on \"A Home\". They're mostly extended whammy sections and some tremolo scales. The tone/effects on the guitar are very enjoyable throughout. That facet is both recognizable and pleasing to the ear and is It's best quality. I really enjoyed the bass due to it getting the limelight in quite a few jazz bits. Listen to it on \"Silent Life\" and \"Subtle Change\". The bass works best when it can slink around the prog/jazz sections released from the structure of a rhythm section. The drums, I feel, were either holding back or just couldn't keep up. Whenever they started living up to their genre tag on this website (technical death metal, at the moment), the drums would very quickly change it up to an easier to play drum beat. The drums still try far more than the guitar to be tech and usually succeed where the latter fails. Also of note is the best saxophone in recent memory because the band realizes it is a real instrument and then implements it. Think of The Faceless and Satyricon. They have used it but it but just as a gimmick.\n\nThe flow of the album keeps the pace going with a lot of transition both in writing and play style. I don't love all of it but there's a clear sense of direction. There isn't too many songs that haven't much meat, but \"Hollow\" sticks out to me as a low-point. The songwriting, as noted above, is leans heavily into the progressive camp with multiple excursions into jazz. They do play around a lot and experiment, like on \"Where Owls Know My Name\" and \"Subtle Change (Including the Forest of Transition and Dissatisfaction Dance)\". These sections are enjoyable on their own, but don't blend as well as the straight-out jazz sections. There are some exceptions, like on \"Old Nothing\" where it's more akin to their older, straightforward, albums.\n\nFavorite tracks:\n--\"Old Nothing\"\n--\"Subtle Change (Including the Forest of Transition and Dissatisfaction Dance)\"\n--\"Death is Real\"\n\nTechnical skill: 67% Originality: 79% Song writing: 83% Production: 75%\n",
        "\nIn a relatively short amount of time, Reading, Pennsylvania's Rivers of Nihil have come a long way with their sound. Their early EPs were nothing I would consider as astounding, but their debut album The Conscious Seed of Light from 2013 blew me away when it came out, and I still listen to it all the time. Not re-inventing the wheel, but showing hints that they were trying to be different and subtle foreshadowing of the future. \n\n2015's Monarchy took a step forward in terms of songwriting, while adding more of those haunting, ambient guitar sounds in the background that helps add tension to the songs. The last three songs on that album really lost the intensity, with a bit too much melody for my taste. \n\nNow we have 2018's Where Owls Know My Name, an album that has pretty much been critically acclaimed and overwhelmingly loved everywhere you go on social media. Let's dive in...\n\nMy biggest gripe with the album is they quite often lose the plot of what they were all about - a technical death metal band with progressive touches here and there. Far too often, the band devolves into almost a metal version of Pink Floyd, while adding saxophone in numerous songs, and lastly some really dispassionate clean vocals that stick out like a sore thumb. When the band is playing Tech DM on songs like 'Old Nothing' or 'Death Is Real', they upped the ante of speed and brutality, while certainly moving towards a truly original sound in the genre. These parts are what keep me coming back for another spin.\n\nThen you have the sections I refer to as 'kitchen sink metal' - parts that absolutely do not fit within the confines of the genre. Weak, hipster-ish saxophone solos and melodies nearly run this album into the ground. The thought to bring in a sax player as a guest truly boggles the mind. This isn't Dream Theater or Spiro Gyro. Being brave and having the guts to try new stuff is admirable, but there are limits to what Tech DM can withstand without coming off as pompous or trendy. The clean vocals are totally unnecessary, while being heavily processed. It will be interesting to see fan's reactions at shows when the band has to use backing tracks on their laptops to recreate the sax and clean vocals parts.\n\nIn the metal world, most often you see fans share similar views of an album. Kind of like a herd mentality - a mentality that goes against what metal was founded upon. My guess is the influence of mind-altering drugs would help me enjoy this album like so many others seem to, but, alas, those days are long over for this metalhead. Quite frankly, I'm incredibly surprised at the universal praise of the album. For me, this quite often falls off the rails of what the band had established, to take steps into areas that really should have been saved for a side project. With a side project, you could really explore these new sounds, without diluting the main sound the band had spent nearly a decade establishing.\n\nThere are so many great moments on the album that keep me coming back, yet the previously mentioned flaws definitely impair my ability to call this a 'great' album. Here's hoping for a return to form on album number four.\n",
        "\nIn the 23 years I've spent on this planet, Where Owls Know My Name may be the most frustrating album I've ever encountered. Somewhere within this behemoth of a record, there lies an amazing journey that's equal parts harsh and melancholic; unfortunately, all of the external baggage caused by the inconsequential songwriting and sterile production robs it of its power. What's really sad is that, initially, all the ingredients to make this a masterpiece are in place. We're presented with incredible technical abilities from the musicians, lots of emotional potency in the performances, and an experience that's clearly striving to elevate the world of progressive death metal to something more ambitious and impactful. However, Where Owls Know My Name just goes in one ear and out the other and quickly becomes a dull grind akin to background noise.\n\nThe lack of dynamic range may actually be the biggest culprit here, especially as far as the metal sections go. There never seem to be any discernible climaxes or moments of catharsis, as the waves of guitar distortion and compressed production just wash over any sense of sonic variety. The best moments of variation and emotional weight come in the form of the album's quieter segments, such as the subtle keyboard-driven opener \"Cancer/Moonspeak\" or the beautiful saxophone break in \"The Silent Life.\" But even these types of segments tend to be undercut by the generic riffing and djent-oriented chugs that kill both the pacing and ambition of the album. The entire first half of \"Old Nothing\" is crammed with intrusive blastbeats and dull deathcore riffs that ruin the album's sense of progression, as well as killing any potential atmosphere that could make it interesting. On top of that, quite a few moments just sound out of place and... well... ugly. \"A Home\" sounded great during the opening guitar chords, and the band didn't really need to throw a giant mess of triggered drum acrobatics all over it. Really, the majority of the metal in this experience is defined by strikingly similar chord progressions and tempos being glazed with gutless melodic noise that fills the treble end, while some chugs and mid tempo drum progressions try to fill in the cracks of the low end. That's basically the metal-oriented material in a nutshell, and it defines most of the tracklist. It's really easy to tune out of this album as it's playing, and very few moments really manage to gain one's attention back in a significant way.\n\nStill, I'll give credit where it's due. Some moments still manage to be breathtaking, most notably that gorgeous acoustic intro to \"Subtle Change.\" The song sounds like a real expedition, as the melodic bass traverses across the ample terrain of the rolling drums... there's a lot of 70s prog influence on this one, and it's one of the only songs in which the loud and quiet moments aren't too intrusive to each other. There's also a nice cleanly sung ballad intro that kicks off the title track, reminding me a lot of Paul Masvidal's vocals in the last few Cynic records. Finally, the last track \"Capricorn/Agoratopia\" cleverly brings the album full circle by using the intro track and giving it more fleshed-out instrumental accompaniment to drive the final mini-epic home. It's a decent way to conclude Where Owls Know My Name; I just wish the journey to get there was worth it. \n\nIt's not that the album comes off as misguided, but rather it sounds inconsequential and dull. If it was reduced to about 30-35 minutes and given an EP format, I might recommend it to fans of progressive death metal or even post metal. But in its current state, it happens to be arduous, overbearing, and boring all at the same time.\n",
        "\nRivers of Nihil are a band I’ve always gotten a lot of enjoyment from. Their blend of atmosphere mixed with pummeling death metal always sat well with me as it was blended skillfully with fantastic transitions that never felt jarring. 2018 has arrived and with it comes Rivers of Nihil’s third album “Where Owls Know My Name”. Does it continue the trend of subtle atmosphere mixed with pummeling death metal?\n\nNo, it does not. As you can tell from the score above it’s not a bad deviation at all. “Where Owls…” sees Rivers of Nihil switch from a more riff based death metal with splashes of progressive and atmospheric tendencies to a atmosphere focused, less riff based approach. At first the shift bothered me. I felt the album lacked any sort of heaviness and while building fantastic atmospheres and great use of progressiveness the lack of riffs made it feel weak and lacking. After diving in and really looking at things, I ended up really enjoying this record.\n\nComparisons can be made to Fallujah’s “The Flesh Prevails” and especially “Dreamless”. However this is far from a carbon copy of those records. Fallujah often evokes atmospheres of the cosmos, while Rivers of Nihil evoke a bit more of an organic atmosphere. The atmosphere is crafted extremely well and never comes off gimmicky creating a flow throughout the record that is seamless and refreshing. \n\nRivers of Nihil implement all sorts of tactics to make this work.The vocals are the same as they’ve been throughout Rivers of Nihil’s career a mix of growls and shrieks, but here we see some cleans sprinkled around to add to the atmosphere, such as on the seemingly Opeth influenced “Subtle Change” or the fantastic “Hollow” in which they are interjected perfectly. It’s a nice addition, doesn’t sound cheap or shitty and it works very well. I’ve always enjoyed the vocals on Rivers of Nihil’s records and thought that they added much to songs in the past to give them an edge, tracks such as “Sand Baptism” and “Rain Eater” on past albums would not have been as great as they were without Jake’s vocals, and here it is more of the same. I wouldn’t say this is a vocally driven album, but when the song writing changes the vocals also change to suit it. This helps build the atmosphere rather than pull you out. \n\nThe guitars and bass are the fucking meat here, and I absolutely love them. Up above I mentioned that at first the lack of riffs bothered me, but once I listened to the guitars and what they were doing I was floored. The sheer range of styles here needs to be noted. These guitars create both dizzying rhythms and entrancing rhythms. Tracks like “Hollow” and the title track contain soaring melodic lead work. There are some great solos here as well, “Death is Real” having the most memorable (though the closing track has a ripper as well), they fit well in the song structure and don’t suck you out of the atmosphere. The bass is fantastic, incredibly audible and can be heard throughout the album. The bass adds so much to this record and I absolutely loved it. On tracks like “Subtle Change”, “Death is Real”, and “Where Owls Know My Name” the bass absolutely kills it and sounds powerful as can be. Throughout the record the guitars and bass are woven fantastically, again creating the atmosphere and just driving these songs into new territory all the time. \n\nThe drums are of course another centerpiece for the sound. To keep up with the array of styles here and all the changes of pace, Jared Klein pounds that fucking kit into oblivion. There are blasting sections, constant changes in tempo, and holy fills galore batman. I’ve hard some complaints about the drum production, but I think it’s perfect. It doesn’t overshadow anything else, but is fully audible and none of that “trash can” drum sound (though on an album like this, that would be stupid anyway). \n\nI also must speak of the atypical instruments. We’ve got keyboards, trumpets, cellos and saxophones. They are interwoven perfectly and add to the sound. I absolutely love the keys in “Subtle Change” and I love the jazz break in “The Silent Life” where the saxophone is first introduced. After that you are treated to varying sections throughout the album with different instruments added to the metal mix. The metal is never degraded to allow these instruments to shine however, as they are the perfect accent to the songs as written. Another huge plus to the songwriting ability of Rivers of Nihil.\n\nOverall this is a fantastic record full of atypical moments, great atmosphere and skillful songwriting and instrumentation. The only knock I have on the album is, as a death metal fan I do prefer riff based metal and while I (obviously) enjoy atmospheric based stuff too, in death metal I enjoy riffs over atmosphere and the atmosphere here is the focal point of the song writing rather than the riffs. So “Where Owls Know My Name” is an album that will continue to get plays, but over time I can see it being a record that will fit better when I’m in a specific mood rather than something I want to listen to regularly. Despite this, I must say such a departure from their core sound is welcome and appreciated and I cannot wait for what comes next. This will be an exciting band in the future.\n",
        "\nThis is River of Nihil's sophomore album. I gave their debut, The Conscious Seed of Light a spin back in 2013. I enjoyed the first track which had some neat Morbid Angel-esque elements, but the rest of the album left me cold. Seeing the glowing reviews for the second album made me curious to see if the band has indeed taken their music to more impressive heights.\n\nThe answer is yes, but also no. It is no doubt a technically impressive collection of songs, the music complex as it writhes out of the speakers, demanding my attention. Yet even as it is a solid blow to the skull, with a powerful production and lots of neat little touches scattered around, the album fails to captivate me. Like so many technical bands before them, River of Nihil are like a set of very talented artists, but they can only paint by numbers. Isolated, each riff, each line of melody, each breakdown, each drum fill are dull as the proverbial ditchwater. It's in the coming together of elements that River of Nihil show their penchant for complex arrangements, but is also here that the album starts to fall apart for me - it becomes if not soulless, at least not music that makes me feel anything. \n\nI mean, there is metal to make you happy, sad, angry, depressed, suicidal, strong, etc etc but Monarchy leaves me listening to people who are really good on their respective instruments, without ever touching me in that special place (no, I'm not referring to the G.spot). The band comes the closest on the eighth track, \"Terrestria II: Thrive\" (despite its lifeless title), where the music is given room to breathe (almost evolving into progressive metal as opposed to technical death metal) despite being as complicated as the rest of the album. It weaves effortlessly between acoustic guitars with soft, beautiful solos and fast, aggressive metal parts, and manages to display all the disparate elements of the band's sound cohesively, organically, making it the only piece on here that feels like a true song.\n\nOne negative element that overshadows everything so carefully built on Monarchy are the vocals. About half the time the vocals are shouted in a monotone manner that reminds of me of metalcore (am I allowed to use that word), often in parts where the band also musically drift close to that dreaded genre; whenever the vocalist buckles down and employs more regular death metal growls, such as in the first half of \"Circles of the Sky\", it's palatable. \n\nThere are a number of breakdowns on this album that get old the moment I hear them, and which mar otherwise clever songwriting and interesting use of acoustic instruments and keyboards. Some solid melodies come to the fore on the latter half of the album, but for the most part the band relies on unmemorable riffs and predictable hooks, even as they can sound progressive as hell the next second. It definitely is a weird album and hard to review; I suspect a few more spins would make me appreciate it more, at least the more progressive elements. In conclusion, there's too much Pantera and too little Morbid Angel for my personal tastes to give this album a glowing review. I do recognize the obvious abilities the band is in possession of, but I still find Rivers of Nihil a bit directionless, dare I say too modern. Your mileage, as always, may vary though - if you don't mind a lot of breakdowns and assorted elements mixed up in your technical death metal you could probably add another twenty or so percent to the score. I feel bad about giving this album such a low score, but music is, as always, subject, and despite the inherent qualities I find myself mostly bored. They definitely should give more room to melody and atmosphere (the slightly eerie, beautiful last minute of \"Suntold\" shows that the band is definitely capable of creating compelling music without resorting to overly technical or complex arrangements).\n",
        "\nI've long hypothesized about a day when a new wave of bands would take what the ultra-tech bands of the early 2000s were doing and infuse it with superior songwriting, and I think that day is finally here. Monarchy is incredibly modern in it's approach to technical death metal, following the trend of increasing progressive elements in the genre, as well as a strong atmosphere and the aforementioned songwriting improvements. These musicians are all ridiculously talented, with my particular favorite being the bass player, who pops up often throughout the album and always impresses.\n\nI never got much into their debut album, The Conscious Seed of Light, but the lyrical concept of representing the four seasons intrigued me from the start. Monarchy is Summer, and while it's more of a lyrical theme, the songs often create a stifling and suffocating atmosphere that accurately depict a sweltering desert setting. The songs are appropriately technical within the confines of the song, which is where I started this review. Rivers of Nihil are what could be considered 3rd generation death metal, directly influenced by the lot of bands in the early 2000s that took technical and brutal music to monotonous extremes with a lack of real memorability. They know how to write a good song and have balance between technical and progressive elements, but their actual skill level is outstanding. Doing a track by track review isn't the best way to absorb the album, but I will say Monarchy is my favorite track of the bunch as that track is flawless, and the rest range from very good to awesome. The focus is on the songwriting of the album in it's entirety with plenty of softer moments that allow the death metal sections to really shine. \n\nI'm reminded a lot of The Flesh Prevails by Fallujah minus the deathcore elements, as well as Job For a Cowboy's Sun Eater although far superior. This very well could've been my favorite album of 2015, except for that damned Cattle Decapitation. I could not have been more surprised and I hope this is a sign of good things to come from these young men and the genre in general. Even if you hated the debut album this is a must-listen and I can only hope they keep this quality up for their Fall and Winter albums.\n",
        "\nI had decided to listen to this album on a whim, to be perfectly honest. I'm not a huge fan of technical death metal to begin with, but the beautiful Dan Seagrave artwork drew me in and so I gave this record a shot. I had actually heard Rivers Of Nihil's previous release \"Conscious Seed Of Light\" back when it came out in 2013. I couldn't really get into it though. The production was kind of weird, the vocals were subpar, and the songs overall were just not very interesting. However, even then, I could tell that for all the issues I had with the record, Rivers Of Nihil had something in their sound that set them apart from their contemporaries. \n\nFast forward two years, Rivers Of Nihil releases their sophomore album \"Monarchy\" via Metal Blade Records. This album fixed all of the problems that I had with the last one. For one, the guitar work is monstrous. There are riffs galore on this thing, tight rhythms and melodies, and even some memorable solos, which I find to be fairly hard to come by in this sub genre. The guitars are complimented well by some really groovy, pounding bass lines that do an excellent job navigating through the bizarre song structures found on this album. Additionally, the drums are pretty versatile on this thing. While many technical death metal drummers find themselves recycling four or five mechanical sounding blast beats throughout the songs they play on, Rivers' new drummer Alan Balamut does a great job alternating between some really unique jazz beats and more traditional blast beats. These proficient but creative players are really what make this band stick out to me. But also, many of these songs are just really catchy. Especially songs like \"Ancestral, I\", \"Sand Baptism\", and \"Monarchy\" just have super catchy passages that I wouldn't quite call choruses, but parts that are repeated throughout the songs. Jake Dieffenbach's vocals are also quite responsible for said catchy parts. He has a growl that sounds kind of like a deep, injured bellow of a werewolf or something. It's as if his throat is caked with mud and sand. But that doesn't stop him from yelling pretty damn loudly on this record. \n\nConceptually, Monarchy tells a story of some ancient civilization living under some sort of Monarchy that worships the sun. It's kind of hard to follow if I'm being perfectly honest, but really this record is also the second in Rivers' four album project of making a record to represent each season. This one represents summer, which can definitely be inferred from the lyrics and artwork. All and all, this is a sick album. I can't wait to see what else these guys cook up in the future.\n",
        "\nRivers Of Nihil is a technical death metal from Pennsylvania. This album mostly showcases mediocre 8 string guitar masturbation, while sometimes showing promising moments of technical proficiency from the band. \n\nThe vocals on this album aren't very typical for technical death metal. They're almost in vein of hardcore vocals. While these vocals aren't commonly heard in technical death metal, they don't really correlate with this band's style. Might I add, these vocals sound very monotone. Although the guitars on this album are very technical, a lot of the guitar parts and riffs are very average. The bass on this album is also very conventional for technical death metal. Then we get to the drums. The drums on this album are absolutely atrocious. The double bass triggers on this album are very uncoordinated with the other instruments surrounding it, while the actual trigger sound is very synthetic. Excluding the double bass sound, the other drum parts on this album are standard for technical death metal. \n\nThis album opens up with \"Terrestria I: Thaw\" which shows a promising start for the album with tremolo picked guitars. Following the first track is the song \"Rain Eater\" which in my opinion is the highlight of this album. The next track is \"The Birth Of The Omnisavior\" which is another above-average technical death metal song. After this is when this album starts to go downhill. \n\nThe album from here starts to get very monotonous. Almost every single track from here is very mediocre and dull. The continuation of dull tracks throughout the album absolutely kills this albums composition or any sort of flow it might have possessed. In summary, you might like this album if you're a fan of technical death metal. The spamming of 8 string guitar notes, 6 string bass notes, and horribly triggered drums just isn't for me. I'd like to see how Rivers Of Nihil stylistically grows with their next album, if they grow at all.\n",
        "\nI really wanted this to live up to its magnificent artwork. Just look at it, man. Pure Dan Seagrave magic! Rivers Of Nihil hail from Pennsylvania and sport a brand of decidedly modern technical death metal, which whilst managing to avoid a few of the elements I dislike about the modern strand of the genre, isn't something which would make for my regular listening.\n\nThe opening instrumental \"Terrestria I: Thaw\" almost had me thinking otherwise, with its cool atmosphere created via icy tremolo-picked guitars, although come true opener \"Rain Eater\" Rivers Of Nihil unleash a relatively standard array of up-tempo, blasty DM anchored via mechanical, low tuned guitars (likely eight string). Throughout The Conscious Seed Of Light Rivers Of Nihl blend together sounds heard in the Polish death/black scene with atypical modern technical death metal and some twanging Meshuggah flourishes. \n\nWhat I do like about The Conscious Seed of Light is the idea behind it. Whilst the album isn't to be seen as a concept release, the band began the project with plans to do a sort of four-release cycle, with each one reflecting a particular season. Now, I think that's pretty fucking cool, and I'll definitely be interested to see if they stick to their guns and pull it off. The Conscious Seed of Light represents spring, which can be seen in the lyrics, song titles and album artwork, and whilst death metal would be the last music style I'd expect to invoke feelings of spring, I can certainly see what they're going for. Particularly with the icier beginning of the album paving the way for chaotic blasting which could represent the seeds sprouting, and saplings pushing their way through the thaw; a sort of dramatic, tumultuous look at new life I guess. \n\nThe music itself, as previously touched on, is standard fare. You'll have heard these ideas before in varying acts, and whilst Rivers Of Nihil put it all together into a fairly cohesive package, genre buffs will no doubt be able to pick apart the influence the band wears on their sleeves, from Decrepit Birth to Meshuggah to Behemoth. In saying that though, the performances are exceptionally well done, and the band's technical pedigree is no doubt impressive. Jake Dieffenbach's vocals are surprisingly enjoyable too, whilst decidedly modern, I hear a little less tough guy and more David Vincent which thankfully tears down one of the major barriers I have in enjoying a lot of this stuff.\n\nIt's a shame Rivers Of Nihil couldn't fully realize their concept with some more original music, although I'll certainly be interested to see how, and if the band grows. As a debut, The Conscious Seed of Light has its moments, and it's cool they don't bludgeon you with overt technical drivel. Whilst it's not my ideal strand of DM I think this will really appeal to fans of the style.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nThe Conscious Seed of Light album begins with a very solid introductory instrumental. I am usually one to toss all thought of short intro’s aside, but this one serves a good purpose. The gradual build up with its entrancing melody, the bass softly pounding in the background steadily merging with the destructive crashing of symbols towards the end of the song is absolutely mesmerizing. On top of all this, it ties into the second track beautifully.\n\nRivers of Nihil’s vocals could be described as aggressive shouting, they are similar to Meshuggah’s in that sense but sound meaner and a little more strained, nonetheless totally vicious. The lyrics are still very understandable which a lot of people like myself appreciate greatly. They occasionally switch to a gentle but still deadly growl for a few verses, but only in a couple songs. There’s nothing wrong with all out hell-bent guttural growls, but it sure is nice to learn the lyrics from just listening casually and not having to look them up.\n\nThe bass can be heard more often than not, blaring a wild line going in every direction, tying the chaos formed between the guitars and drums together. Said guitars and drums are usually playing at the same speed through the entire album, always keeping a steady melody brewing.\n\nI recommend the introductory track “Terrestria I: Thaw” combined with the following song “Rain Eater” if you desire to check this band out. Just as the hypnotic riffs of the prior are ending, the latter picks up what was left behind and quickly turns it around into a savage explosion of metal rage. Also, the fading outro to “Rain Eater” is captivating in every sense.\n\nThere is a severe lack of solos on this album, so if you are hungry for such then you may be filled with a bit of disappointment after listening to The Conscious Seed of Light. Aside from that, everything featured here is a masterful presentation of modern technical death metal, which in my opinion easily makes up for the lack of guitar spotlight.\n\nwritten for metalmasterkingdom.com\nhttp://www.metalmasterkingdom.com/rivers-of-nihil.html\n"
    ]
}