{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Phoenix, Arizona",
        "Status:": "Active",
        "Formed in:": "1997",
        "Genre:": "Nu-Metal with Tribal influences (early); Groove/Thrash/Death Metal (later)",
        "Lyrical themes:": "Spirituality, War, Violence, Slavery, Politics",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n1997-present ",
        "Number of Reviews": 29
    },
    "Band Reviews": [
        "\nMy first release from Soulfly was 'Savages' which I found to be interesting. This release seemed bland the first few listens to. Then it kind of grew on me. I wasn't exactly sure what to expect here and well this one is a little bit more experimental and cut-throat. I've been a fan of Max Cavalera since the early Sepultura days in the band. He took quite a different approach then those days here is experimental Max. I like it though, the not knowing what to expect here sort of idea. The brutality, the temperance, the enlightenment. It's 40 minutes of in your face metal with vocal effects and odd time signatures.\n\nThis type of metal has a bit of a groove to it with death metal components. A really odd release including the leads with terror on the vocals bellowing. These guys have riffs that are simply atypical and sort of bizarre. I don't know how else to describe this album but just that: ATYPICAL. It might be the norm of how Soulfly works and that's how Max wants it, I just sense a peculiar sounds and rhythms. Nothing seems to remain the same it's just different from all respects. Then the clean tone guitars, it gives me pause about the direction the band is taking here. Weird metal and highly atypical.\n\n40 minutes of this going on what I've described here. It's solid here, Max sounds odd on this it's forceful but not to the extent reflective of Sepultura's Max in your face. Hell, he's in his 50's now still making metal and Igor doing Sepultura tributes too. He's had to relearn their songs but still sounds good. Soulfly is his project. Weird metal it's totally him just whatever he's doing he's putting his thoughts into this music the rhythms are cool and heavy but this experiment with Soulfly puts Max in a different position. I don't hear a plethora of fans liking this band. Those I do because it's metal but it's just different genres.\n\nThe anger and brutality is here but Max is in a league of his own dynamics. If he continues in this direction, who knows what to expect on the next LP. More experimenting or something more straightforward? It's unpredictable as to where he's going here. Heavy guitars, clean bouts and vocals with an echo/reverb. This guy is totally metal, it's just his ideas for metal aren't at all the same as the Sepultura days where he's utterly thrash galore. But on 'Roots' is where his strange where his writing went opposed to 'Beneath The Remains' and 'Arise'. I think the expectation is a new Sepultura here with Max but it's so not. Don't expect that at all. For Soulfly fans, this is a keeper!\n",
        "\nMax Cavalera is now rightly known as an icon in the music we love, his legacy needs no explanation to the readers of this publication, and if you have any knowledge of Soulfly you will be expecting a certain kind of aggressive music, blended with tribal beats, lyrics of violence, and heavy hard riffs.\n\nThe opening number from 'Totem' hits you hard with the riffs and distinctive vocals from the outset. 'Superstition’ certainly leaves you in no doubt who you are listening to. Max’s riffs are as bad ass as you hoped for and the speed and tone is fast and powerful as what we may expect. This opening number certainly sets out the Soufly stall. It’s brief and sharp, as is the second track 'Scouring The Vile'. Marc Rizzo is no longer with the band but the fast little guitar licks are still prevalent in the music, and the familiar vocal talents of John Tardy appear here too. The addition of his voice works well and complements Max’s voice. He is used to sharing the mic these days due to his other musical projects such as Killer Be Killed and his music only benefits from this.\n\n'Filth Upon Filth' contains a riff sure to throw heads around in a live setting, and continues the short but powerful track theme. The album is produced by Cavalera alongside Arthur Risk and sounds thick and layered. All the menace and beef in blackened thrash are captured well. 'Rot In Pain' (a song name that has to be exclaimed very quickly) has a very slight hard-core element with its tone and ferocious drumming from Zyon Cavalera, which is demonstrated here and throughout 'Totem's length.\n\nThe tempo slows slightly with 'Damage Done' but the hostile tone does not. Frantic guitar solos pepper this song as it gradually comes up to speed which then halts to a white noise buzz. The title track is a little longer than previous tracks and has more textures contained in it. The aggression is soon joined by speed presently followed by a nasty catchy breakdown that still contains Cavalera aggression.\n\n'Ancestors' is once again raw and high in its octane. Again adopting the slower route to get its point over. And when I mention slower I don’t mean 'Crowbar' slow, just a little slower and less frantic than some other tracks. The razor riffs soon return in 'Ecstasy of Gold' before we are then met with the confusing sound of the song 'Soulfly XII'. We are all accustomed to Max’s penchant to throwing us a curve ball once in a while, and he has not strayed from the path.\n\nOn the final track 'Spirit Animal' we are joined by Chris Ulsh (Powertrip) and Richie Cavalera, Max’s step-son. This song begins with an epic tone and contains a kind of black metal chanting adding another level of metal to this album. Richie’s vocals are an excellent addition here and this track tops off a really really good Soulfly album. One of the best I have encountered for a while.\n",
        "\nMax Cavalera and gang come up with a nice catalog of songs somewhere between traditional/actual metal and nu-metal. In parts the nu-metal aspect might be a little much, but the songs are generally ripe with a strong identity and distinct from one another. The music is of course very simple technically, but it's more about testosterone-laden rhythmic energy therefor the listener shouldn't look for all that much articulation in the riffing to begin with. It should be rather emphasized Cavalera comes up with pretty good grooves considering that simplicity he works with throughout the entire record.\n\nThe guitars sound excellent for this style. They're abrasive and detailed in tone. The vocals are just pure rushes of adrenaline in typical Cavalera fashion, and they play a major role in giving each song a specific identity with sheer presence and catchy rhythm patterns. Although some of the material here is nu-metal in spirit with the jumpy grooves, the record doesn't come across as entirely early 2000's trendy cardboard metal. Songs like 'Enter Faith' for example with the chorus in particular, or the iconic ultra heavy 'One Nation', have that post-thrash vibe to them, and the album as a whole avoids catering to necessarily younger fans with the usual cheap melodic aspect that's such a cornerstone of the nu-metal movement. This is angry Cavalera metal and it won't compromise on that level, and there's an undeniable sense of nostalgia feeling that Sepultura (albeit late Sepultura) signature in the music.\n\nThe album also contains some of the Brazilian percussive stuff, as on the track 'Brasil', and it's fairly judiciously mixed into the whole. Finally there's some pretty interesting musical variety with ethnic sounding world music or acoustic parts; as on 'Four elements' or 'Soulfly III', or the closer 'Zumbi' which second half is particularly interesting; and they surprisingly don't sound out of place and help give this album a more unique flavor and a fuller body of work besides the heads down aggro stuff.\n\nAll in all this is decent stuff with memorable tracks, tight song-writing with purpose, and pretty huge sounding moments. It certainly doesn't come across as rushed or overly simplistic. It isn't worth a prime Arise era Sepultura, but heck, it works.\n",
        "\nIt can be loosely stated that Soulfly is the logical continuation of the sound Max Cavalera formed with his final Sepultura album \"Roots\". Again, I'll reiterate that this can LOOSELY be described as such. I'd agree with that statement more so with the self-titled album that came two years prior to this one. On \"Roots\", Sepultura was heavily inspired by Korn, especially their 1994 self-titled record with a very similar guitar tone and overall heavy, groove-laden sound. As much as I hate using the term \"nu metal\", that's the name that was given to the sound, and that album followed suit. With Soulfly, Max decided to continue with a tribal influenced nu metal sound, but stripped it down even more and made the music more simple. This album is not Soulfly's finest moment but I'd say it's not their worst, either. There are some cool ideas here and there but it does seem a bit cliche and at times, can be quite a bore to listen to. So, without further ado, let's \"Jumpdafuckup!\"\n\nReleased in 2000, \"Primitive\" is the sort of album you'd expect to hear from perhaps a watered down version of Slipknot, or a more \"metal\" version of Staind or Limp Bizkit, but certainly does a better job than the latter two bands in that little list. The guitar tone fits in quite well with the nu metal bands at the time and aside from the interesting tribal influences that make their way through some of the album's music, what we have here is basically a stereotypical nu metal album of the early 2000's and is full of angst. Oh yes, it can be downright cringe worthy at times. One can easily picture a teenager with the colored spiky hair, wearing baggy jeans and a wallet chain. Basically those kids that are assumed to be doing drugs and snorting weed (heh...) by their parents. But I digress. I'm here to talk about the music, not the style of those associated with it. Curse my ADHD.\n\nThere is nothing on here that resembles pre-\"Roots\" era Sepultura, save for the \"nu metal\" label. It seems that the sound is overall more simple and while it still has a dirty, heavy sound, it's not as thick and distorted to my ears. There are no lead guitar parts, which were sparse on \"Roots\" but still there in a few songs. Interestingly enough, there are a few notable guest parts on the album. \"Pain\" features Grady Avenell but more importantly, in my opinion, also features Chino Moreno from Deftones. When I first listened to this album, I was a huge Deftones fan (I still enjoy them, but not quite as much nowadays) and this immediately took to me. The most well-known song is arguably \"Jumpdafuckup\", which I've already brought up previously in this review. Corey Taylor of Slipknot/Stone Sour fame is featured on this one and, as stupid of a song as it is, I still listen to it every now and then. I'm a huge Slipknot fan (insert poser accusation here) and I've always loved his vocals, though the lyrics are quite stupid. That seems to be commonplace here but I can't really blame Max, as this was mainly a product of the nu metal genre at the time. In my opinion, the final most important guest appearance goes to Tom Araya from Slayer, featured on \"Terrorist\", which is another strong point on this album. In addition, there is a lyrical excerpt from Slayer's \"Criminally Insane\". I find this to be a neat little segment. Unfortunately for Soulfly, these guest appearances are really the shining moments of the album and the rest seems to fall a bit short.\n\nTribal instrumental sections are featured throughout some of the songs though most of the album retains that 2000's alternative sound. Max uses a berimbau on some of these tracks. One of the best examples I can give is \"Son Song\", which does sound fairly cool. There are some tribal drums throughout the album too that add some an interesting vibe, which Soulfly is also known for, as well as Max's final recordings with Sepultura. Unfortunately, they are not as commonplace as they should be, as it would make the music stick out more and add more diversity. \"Soulfly II\" starts off with some really cool tribal instrumental sounds and they add so much dynamic to the song. \"Mulambo\" features some of the album's talent with guitar riffs aside from the tribal sounds but fails to be as interesting as \"Soulfly II\" and falls short in comparison. \n\nThe lyrics are generally...pretty bad. In my opinion, this is one of the worst aspects of the album. There's really nothing interesting lyrically going on here aside for the neat little allude to \"Criminally Insane\" I spoke of earlier. The rest of \"Terrorist\" is lyrical garbage. \"Jumpdafuckup\" is pretty silly, and although I greatly respect Corey Taylor, these definitely aren't some of his lyrically captivating moments. Say what you want about Slipknot, but their lyrics can be quite good, though I am well aware there are better examples out there. He at least makes up for it with his unique and instantly recognizable vocals. \"Back to the Primitive\" is also very angsty and, to me, cringy. The whole \"fuck your bullshit\" attitude pretty much stains the entire album throughout, and while I understand it is to serve as a \"fuck you\" to politics and injustice within, it just sounds strained and cheesy. Oh, and \"Bring It\" sucks too.\n\nIt is very important to listen to this album for what it is: a nu metal album from the early 2000's with some neat, if under-utilized tribal influences. Max Cavalera has definitely done better in the past with Sepultura, and I consider this to be a bit of a step down from the sound he ended up going for on \"Roots\". I feel if he kept that sound and added more intricacy to it we could have gotten something really special. I will say this is fairly unique for \"nu metal\" but unique doesn't always make something better. I think Soulfly has evolved as a band though and following the release of \"Prophecy\", they would end up crafting a sound that showed a change for the better.\n",
        "\nWith there now being more than two decades of distance since Max Cavalera’s departure from Sepultura, it is a foregone conclusion that the metal world would have made peace with his bizarre and commercially viable shifting with the stylistic winds. Nevertheless, posterity would do well to remember that Soulfly’s origins hang well outside the metal paradigm, baring the sentiments of late 90s nu-metal trustees who cleave to the idea that Limp Bizkit is in the same league as Slayer. Named for a lyrics taken from a Deftones song that Cavalera himself provided guest vocals for, this is a band that would ordinarily be forever the antithesis of metal purity, and yet time seems to have decreed that things unfold a bit differently. The meaner, faster and fancier groove-thrashing goodness that defines this band at present can be traced back to the entry of lead guitarist Marc Rizzo and 2004’s Prophecy, though it didn’t come into full focus until 2012’s Enslaved, and it is in this context that their latest studio outing Ritual stands as a force to be reckoned with.\n\nThis band’s unique stylistic expression has always been marked by a high degree of eclecticism, incorporating a number of world music influences from indigenous tribal chants and flamenco music to even the occasional nod to the industrial coldness normally reserved to the likes of Ministry and Fear Factory. Be this as it may, the past six years of this band’s output has provided a much more measured and metallic-based blend that puts it a cut above a number of their peers, be it the aforementioned two bands and the California groove metal mainstays in Machine Head. The same degree of biting thrash and death-tinged aggression that has painted the works of Max’s other project Cavalera Conspiracy, a band that likely informed Soulfly’s present stylistic direction to a strong degree, is all over this album and often trades blows with the slower-paced chugging and atmospheric interludes in far more of an even-handed fashion than the drab window-dressing that came along with Ministry’s crapshoot of a comeback AmeriKKKant.\n\nThough it may be a bit of a stretch to call this a concept album, there is a very methodical structure to this album that manages to cover every stylistic base and also features a fairly auspicious recurring theme. This time around the focus centers upon the tribal music of the North American tribal peoples, as the opening title song “Ritual” kicks off with a sampled Powwow song that recurs a bit later in the album. The song itself is has a bit more in common with the down-tempo grooving that first reared its head on Sepultura’s Roots and went on to define Soulfly’s early sound, but dressed up with a much denser atmosphere and featuring several faster breaks that point to their present paradigm. A few other songs occurring later such as “Blood On The Street” and “Demonized” feature occasional helpings of earlier stylistic trappings as well, but even on these songs there is a tendency towards high octane thrashing that was not on the American metal radar back in the Primitive days.\n\nPutting aside the aforementioned exceptions and the quirky jazz ballad instrumental that closes this album out in “Soulfly XI” (complete with a saxophone no less), this album bashes one’s neck in with the same degree of fast paced intensity as the one-off Nailbomb album Point Blank. Some of this may owe to Max deciding to revisit said album live with this band just a year ago, but regardless of where the fury behind these songs originated from, this album listens like a fire was lit under Max’s ass when he was putting it together. High octane thrashers such as “The Summoning” and “Dead Behind The Eyes” showcase a degree of aggression that rivals the high period of Demolition Hammer, and along with the more grooving “Bite The Bullet” also showcases a degree of virtuoso lead playing out of Marc Rizzo that finds him in similar territory to Chris Broderick. Yet despite all of the highly impressive feats of combining Slayer’s flash with Exhorder’s bottom end, arguably the best and most memorable moment on here is the old school Motorhead inspired thrasher “Feedback!”.\n\nOften when the metal community opts to write off a band as being outside the borders of accepted creeds and traditions, it is very much warranted. But between the past few albums out of this band and this highly impressive synthesis of old and new, even the most ardent skeptic will have to admit that Soulfly has earned itself a place of prestige in the world of modern metal. This is definitely geared a bit more towards the same outer rim of metal occupied by Machine Head and current Sepultura where the line that separates metal from hardcore gets a bit blurred, but it wouldn’t be too much of a stretch to see an average, run of the mill thrash metal fan with a taste for the more extreme character often embodied in Brazilian revivalist acts to go for an album like this. This isn’t a return to the archaic splendor of Schizophrenia or Beneath The Remains, nor does it have to be.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nFrom Black Metal to Jazz and everything in between, Ritual is an album which tries to touch upon many subgenres of metal and yet keep its grooviness. Max Cavalera is back, this time with Soulfly to take you on a journey back in time to his “Roots, Bloody Roots”. Ritual is an album which best reflects this spirited and maybe spiritual journey home; it is a flavorful metal chalice from which you sip heavy metal of ages.\n\nThe tribal and ceremonial opening title track, followed by sinister guitar tunes, heralds an alarming state of Brazilian thrash. It immediately brings to mind the older days of Max with Sepultura and his early days with his current band. 20 years after the release of his debut album with Soulfly, Cavalera offers the same atmosphere and shows he still has the knack for some bloody metal.\n\nThen the climax of the album, Dead behind the Eyes, punches us from inside a gift box. Randy Blythe of Lamb of God raises the bar miles high and lifts the spirit of the album. It is a feat for the metalheads to scrape away the rust on their metal ears. What a crunching duo of vocalists!!! I couldn’t wish for anything better. Icing on the cake, period.\n\nFrom this astronomical peak, we are then thrown back to earth by the next song, The Summoning. This track is a blend of back metal drumming in the beginning, a metalcore breakdown in the middle and an industrial metal closure. It sure feels heavy as hell but not cohesive. The same is true about the next track: Evil Empowered. It kicks off as a fast-paced thrash, then wanes to another breakdown and pick up the pace again towards the end. \n\nJust when you are losing hope, another guest vocalist, Ross Dolan of Immolation appears mid-song on Under Rapture to give you a taste of his weighty and menacing voice of death. Here too, we have a vicious duet of vocalists who fit the grinding guitar riffs and machine-gun drumming impeccably. \n\nThe following three tracks carry the same load as the third and fourth tracks of the album, albeit in a different fashion. They each contain bits and pieces of different styles, from acoustic-opening-turned-full-force-black-metal track Demonized, to the hardcore/death-driven Blood on the Street, and to solo-riff of Bite the Bullet. Add to these three some short instances of the title element, i. e. ritual, and pound in some core-ish breakdown and you get at the recipe for the second half of the album.\n\nUnexpectedly and out of nowhere and much to our abundant rapture comes Feedback! For a moment you think that Lemmy is the guest musician on this track or maybe even he is going to appear as a guest vocalist too (I know how much you crave that!). Old school speed metal brought back to life by Soulfly, that’s something I would least expect but most cherish. \n\nYou might wish, at this point, that the album would just end, at its second peak. But you have to go through the jazzy instrumental track (Soulfly XI). Out of habit, there is one instrumental self-titled track on each of their albums. These tracks have mostly been bonus tracks on the Deluxe Edition or the Digipack versions of the albums, but this time, it is the closing song. It is unlike other tracks and provide a subtle relief, if that’s what you are looking for!\n\nBesides the music, the lyrics are also a bit of everything. A vast array of themes, such as sacrilege (of a band like Behemoth in Dead behind the Eyes), aggression, hostility and war are present on this album, even the story of the murder of a girl by the police (Blood on the Street) has found its way in. They are well-written and they flourish with the music. \n\nOverall, as for the music, it is commonplace and somehow disappointing (to me); however, as far as the quality of their music and their musicianship is concerned, they are world-class, top shelf, untiring metallers. This is one badass album with some minor, though frequent core-ish unpleasantries. \n\nRating (Out of 10): \nLyrics: 7.5\nArtwork: 9.0\nMusicianship: 8.5\nVocals: 9.0\nOverall: 8.5\n",
        "\nReally? I see a lot hate towards this album all over the internet. Seeing comments on Youtube like \"fuck this band, max is a sellout\" made me think I was reading reviews for the newest turd BVB may shit out. But no, apparently all this hate is aimed towards the first Soulfly album. Honestly, people really need to stop bitching about this album. It is not nearly as bad as some people are making it out to be. Do I think it's the most br000tal record I've ever heard? Absolutely not. But do I think it's absolute excrement? Not even close. In fact I actually really like this album, enough to have played it multiple times actually. So for today, I'm basically going to back up why I think this album is really good in my opinion, and hopefully maybe open some people's eyes. \n\nFirst of all, yes, I'm fully aware that we are dealing with a nu metal album here. You can gather that from the first opening second of Eye For An Eye that this is going to be a nu metal album. However, Max and his band actually show that Nu Metal can be good, if done right. Now granted, later releases from this band absolutely destroy this album, but here, we see a band that has a clear idea of what they want sound wise, which is very rare for a debut album honestly. Yes, the instrumentation on here isn't the most technically advanced playing, but you can defiantly see that there was a lot of effort put into these songs. Take a song like \"First Commandment\" for instance. A song featuring Chino Moreno should have been an automatic dud, and I have no gripes towards Chino at all. It's just that whenever a song features someone, the song is usually built around them, and then it turns into an ego massage more than anything. However, that is not the case here. Both Max and Chino get an equal amount of time to shine on this track, and it's honestly a great example for me as to how a collab should be done. Going back to the instrumentation for a minute, a lot of the riffs on this album while simple, are actually really effective and for me get stuck in your head for days. Max was on top of his game for this album riff wise, because I immediately recognize songs such as Eye For An Eye, No Hope=No Fear, and Tribe because of catchy and memorable Max made these riffs. You can tell that he carefully examined each song before putting it on the record, because the riffs are just so goddamn good on this album to be quite honest with you. I actually like the riffs on here more than I do the ones on Roots. Maybe it has to do with the fact that Max no longer felt restricted to do just one style of music anymore? \n\nGoing into my next point on here, regardless of how you feel towards the actual music on this album. You just have to respect the variety of this album. Seriously, it's really amazing the variety that's to be found on this album. You have plenty of groovy heavy songs, but then you also have a fair share of Brazilian style music found on this album. This is another reason I love this album so much, Max took the experimentation done on Roots, and just did it tenfold without having too many songs that are either heavy or mellow. There just as many metal songs, as their are Brazilian culture meets funk kinda vibe. The experimental songs are probably my favorite out of all the tracks found here. The drumming on these tracks are very tight, and they defiantly carry a very tight, yet also loose style of rhythm. Come to think of it, Roy Mayorga just totally kills it on this album. I'm being serious when I say the drums can sound funky from time to time. Eye For An Eye and Umbabarauma are simple in the sense of what's being played, but they're also hard at the same time because the drums often carry the same tight funk meets metal drumming style throughout the album, but it just sounds so well done that it's hard not to bob your head to them. So well done Roy, ya done good. There are so many different types of cool sounds being made on the Brazilian style songs that it's hard for me to say much more than simply just check it out. They're extremely creative songs. \n\nFinally, we need to talk about Max's lyrics on this album. In my opinion, and I know people are gonna crucify me for saying this, but I feel this album is Max at his peak lyrically. Think about it, after being essentially forced out of Sepultura at the end of the roots tour, Max could've very easily written a very bitter, angry, and cocky album full of \"don't fuck with me\" attitude (sadly that attitude would be very prominent on Primitive, but that's another review for another time), but he didn't. Instead, he chose to try and look at things in more of a positive way and less on the hateful side. Yes, songs like First Commandment and Bleed somewhat derail my argument, but honestly they more or less feel like honest expressions of how Max is feeling, rather than using fucked up situations as a means to write a \"don't fuck with me\" song. I guess that also has a big part in why I like this album so much. The realness of it. Max doesn't hide how he's feeling or what he's thinking, but he just channels it in such a way that even the more negative songs on here sound more relatable than if they'd turn into a \"woe is me\" way of writing. No whining on a nu metal album? Who would've thought?!?!?!?!?!?!?! I like music that makes you feel or think, and to me, Soulfly does all that and then some. \n\nIn conclusion, Soulfly is an album that defiantly deserves more respect and recognition than it gets. I get that it's a nu metal album and a lot of metalheads like me wouldn't go near anything that genre has to offer (except Deftones, they're awesome), but this honestly is not a terrible album. I think the reason that people give this so much hate is because people didn't expect more nu metal material from Max after Roots. I know that a lot of people were probably hoping for an Arise part 2, rather than a Roots part 2, but this isn't poorly executed at all in my opinion. Soulfly is a great album with lots of experimentation, and lots of kickass riffs that defiantly make you wanna JUMPDAFUCKUP! Sorry, I had to XD. Anyway, check this album out if you haven't already, it's a great place for new fans of this band to start, as it gives you an idea of what Soulfly is about. And if you haven't listened to this album in a long time because you were bitterly disappointed by the sound of it, give it another chance. It may sit with you better now that the band has moved on from this style of music and more into the original Sepultura sound, even if the newer style is a little bland from time to time, but we'll get to that too at some point.\n",
        "\nReally good effort from Max Cavalera, especially comparing this to all of his earlier releases with Soulfly. This album kicks the shackles of 'nu-metal' off and instead goes for a more groove/thrash metal approach. This becomes apparent on the first song 'Prophecy' on the album as you hear a strong blast of metal come pouring out of your speakers.\n\nThe riffs are consistently strong throughout the album, the only song I would say is a little weak in the riff department is 'I Believe,' which unfortunately has a bit of a bad start to it. The other songs however, do not lack as they deliver similar riffs that you hear off of 'Prophecy.' One of the songs that stuck out above the others was 'Moses,' with its interesting combination of reggae and metal, two genres that most would think could never go together. \n\nProduction is solid. You can hear all of the instruments on pretty much every song in the album, even the bass. Not to mention, the implementation of the bass, which sounds stellar on the album. The guitar also fits with the heavy sound that they are going for. Max Cavalera sounds brutal as ever on this album with his growling throughout the chorus of the album.\n\nThe lyrical content of the album is much better than on their previous recordings. You can feel the anger that Max has on tracks like 'Defeat U,' rather than the senseless banter on previous works like 'Jumpdafuckup.' \n\nOverall, Prophecy is a transition point for Soulfly away from the field of 'nu-metal' into the much more interesting field of groove and thrash metal. While this album may not be the next Max-era Sepultura, its probably the closest we are going to get.\n",
        "\nWhen it comes to Max Cavalera, I admittedly don't really know much about his music outside of those three absolutely wicked thrash albums that are Schizophrenia, Beneath the Remains, and Arise. I guess you can say I truly fear to tread outside of my little happy place formed by those records, but by some strange twist of things - I ended up listening to Soulfly. I've had the \"pleasure\" of dancing around in my tribal getup while \"jumpin' da fuck up\" and yelling about oppression and Babylon and, umm, \"Armmagideon\"? I don't think that's how it was pronounced, but I'll let 'em have it. Anyway, this is the only Soulfly I've heard and I'm not exactly impressed, rather, disappointed. There is some potential here found in some unique song ideas, groovy riffs, and a fearsome dose of aggression, but it is sadly wasted. \n\nAt first I wanted to just blindly hate on this as shitty robbb flynnny styled mallcore, but it has a serious advantage over music in that vein - there's actually a good amount of experimentation and musical exploration. This makes it, sometimes, an actually interesting listen. In addition, there's some thrash in here. Granted, you have to dig around for a good bit to find it, but there are some thrashy solos and some aggressive riffs here and there. So at least this record avoids being completely banal and grating. Some parts of the album, like the few decent riffs scattered about such as in \"I and I\", \"Innerspirit\", \"Bleak\", and a few others. There's also a few clean, relaxing, borderline reggae sections on the album and they are the best parts of the album. \"I and I\" has a really beautiful part like this included, and that part in addition to the decent riffs make it the best song on the album. \n\nHowever, not every song can boast some neat experimentation and some cool riffs. In fact, this entire album, barring that song, shoots itself in the fucking foot like you wouldn't believe. All of the unique clean sections and aggressive solos are covered in empty attempts to sound tough, awkward, purposefully out-of-tune leads, weird tribal elements, and some annoying rapped sections. It really rubs me raw because some parts of these songs are actually badass, like \"Carved Inside\", whose totally badass riffs make you want to punch someone in the face, then he starts up his weird vocal bits that make you want to punch Max in the face. Even then, Max isn't the prime offender - it's that fucking horrendous lead guitarist with his horrible atonal wanking as an excuse for soloing. Everything this band is doing on this album just doesn't jive quite well, and the presence of the out-of-key leads accompanied by all of this tough-guy bullcrap really makes for an experience that gets old fast. \n\nSo really, it all boils down to a few good ideas pulled off in an absolutely obnoxious and overly simplified manner. The riffs, the maybe 3 good ones, are pretty awesome, but the songs utterly lack any amount of focus or direction to make them work. The lyrics are like the equivalent of a 5th grader who is tired of getting bullied who's pissed and has a serious urge to push down some kids on the playground, and honestly the weak musical approach combined with these lyrics make the whole thing laughable. That said, this isn't completely atrocious, only mostly. The few neat musical parts make this tolerable at times, but you need only check out \"Babylon\" to see why it is, for the most part, a huge waste of ideas and time. Max, we already arose, we don't need to do it again.\n",
        "\nAnother year, another Max Cavalera album. \n\nBut one asks, is the new Soulfly album Archangel any good? Does it offer anything new and exciting or is it an act of superfluous mass-produced metal with the only difference being the cover, the title and the band name (the alternative being Cavalera Conspiracy)? Unfortunately the truth sits somewhere in the middle. \n\nThis album follows on from Savages and Cavalera Conspiracy's Pandemonium in its attempts to be more brutal and stripped down, not that Soulfly or Cavalera Conspiracy were ever that complicated in the first place. For the most part it's a slight improvement over the disappointing Savages with the songs being more memorable and the sound being tightened up a bit. \n\nThe problem is whatever spark prompted Max to come back to metal and churn out some great album starting with Dark Ages has been slowly fading. There is not much sense of immediacy or excitement here. It's largely predictable meat-and-potatoes Cavalera-style groove thrash metal. Sure there's some cool riffage, but you've heard it a dozen times before on other Soulfy or Cavalera Conspiracy albums. And indeed Cavalera Conspiracy and Soulfly have effectively blurred into one sound and style.\n\nThe only off-kilter element thrown in to spice up this brew is a religious theme both in terms of lyrics and actual musical elements such as chants, guitar and synth effects, and big, brooding riffs. This is actually done pretty well, though it is completely ignored on some tracks such as the ironically punky \"We Sold Our Souls For Metal\" or \"Live Life Hard!\" featuring the unmistakable Bon Scott-on-speed screaming of King Parrot's Matt Young.\n\nSo yes, Archangel is a good album. It is, however, not a great album. There's not much room left for the Cavalera metal brand to exploit the current direction and it's starting to show. It is possible that Max might want to consider whether Soulfly is due another reinvention like he did ten-odd years ago with Dark Ages.\n",
        "\nAfter the abortion Om was, Soulfly changed their lineup with Max being the only original member. This lineup released the album Prophecy, which marked a change in direction- from the primitive (pun intended) nu metal that was present in their first releases, to a more stable groove metal sound. And it really worked.\n\nAs the first song begins, a very atmosphere- conducting intro hits you right in the face, which is then followed by some very strong tribal drumming by Joe Nunez (who auditioned for the drummer of Slayer in 2001, because of Dave Lombardo recommending him for his high skills) that instantly brings Chaos A.D in mind. This is one of the best songs of the album, and one of the best in the band's discography, because of its groove-laden nature that is accompanied by slaughtering, sluggish and down-tuned riffs along with the catchy vocal line. This follows the whole album in its entirety, with \"regular\" drums beats which appear every once in a while.\n\nExcept for the impressive instrumentation this album is characterized by, the song structured are impressive as well. From unrelenting Sepultura- like thrash sections, to groovy breaks, to calmer parts, and to goddamn REGGAE. You've read it right. Reggae. The band, along with the increased level of brutality in the music, has incorporated more untraditional elements into their music, and in this album, the reggae factor is the most powerful. They don't interrupt the angry atmosphere of the album, but accentuate the album's creative manner. The most notable reggae parts are in the songs Mars, I Believe, and last but not least, the whole reggae-driven track Moses that features the Serbian reggae punk band Eyesburn,which are pretty talented within their own genre.\n\nMax has earned his place among the best modern metal vocalists. His trademark grunting fits the music perfectly, even on some calmer sections, and a clean voice which doesn't fall out of quality appears in a few songs (with I Believe being the best example for this). Even the lyrics match the music perfectly. The \"JUMPDAFUKUPP! OI!\" lyrics are long gone, and angry lyrics on the angrier parts are followed by more personal, spiritual based parts:\n\n\"Wings all over us, watching us from above.\nProtecting us from this world, protecting us with your sword.\" (Wings)\n\n\"Fire spreads killing fear, motherfucker your end is near!\nCan't bring me down, in a sea of shit you drown\" (Defeat U)\n\nThe production here is powerful by itself. It makes the music darker, with the guitars and bass made more distorted and the drums and vocals are made loud and hitting in a good way. This is easily the best Soulfly album, and one of the most interesting groove metal releases of all time. Recommended.\n",
        "\nIt’s business as usual in Camp Cavalera. Soulfly’s 10th album arrives just over a year after its predecessor, “Savages”; Max Cavalera has also formed a supergroup called ‘Killer Be Killed’ at the same time as releasing a new Cavalera Conspiracy album, “Pandemonium”. And of course after 18 years Max is still moaning that he thinks Sepultura suck. It appears that, recently, Max has his dreads tied up in knots with the amount of new music and extensive touring he is undertaking with Soulfly- but will he channel this pressure into heaviness as he once did on 2012’s “Enslaved”.\n\nMax Cavalera’s presence is copiously spread across the album. His voice is as gravelly as ever- almost a reflective noise of what Lemmy would sound like if he took up death metal instead of rock. ‘Titan’ is just as titanic as the title suggests; undertaking a menacing death metal tone as hefty riffs grate over Max’s howling screams that lead to a truly hostile breakdown. ‘Ishtar Rising’ provides us with vocal hooks in the chorus that generate massive power despite the simplicity of the lyrics and the deathly growls in ‘We Sold Our Souls To Metal’ attempt to unite the masses. (We’ll just gloss over that Fred Durst collaboration shall we then, yeah?)\n\nHis riffs in “Archangel” are also just as meaty as his voice. ‘Sodomites’ is an affronting and hoarse track where his leads trudge their way through sludgy soundscapes. The only complain about on guitar front with this album is down to Marc Rizzo. He’s trying so hard to display his technical abilities on this album, particularly the title track, ‘Shamash’ and ‘Live Life Hard’, that his constant hooks and licks become irritating at times. At times, they just sound like Ned Flanders having a mental breakdown. (“diddlydiddlydiddlydiddly”).\n\nThere are a number of different genre styles found in this album that sound like Soulfly are experimenting with their gruff and tribal-like sound. Soulfly have been built on a nu-metal foundation which is replicated with bass heavy grooves in ‘Shamash’. The thrash influence is just as potent as ever which is displayed in frantic and alarming tracks such as ‘Deceiver’. The first 50 seconds of ‘Mother Of Dragons’ are also frantically thrashy however the majority of the song is down to a basic breakdown that unfortunately ends the album on a sluggish note. The clearest attempt of experimentation is during ‘Bethlehem’s Blood’ though where trumpets, horns and acoustic passages crop up unexpectedly to create a majestic tone. The issue with this is that ‘Bethlehem’s Blood’ would be an even better track without these textured elements. Occasionally Soulfly need to realise that all they require to create a great song are unsympathetic vocals and a chunky riff; anything extra ends up compromising the elephantine weight of the song.\n\nAs Max recites in ‘We Sold Our Souls To Metal’: “metal runs through my veins”. This statement is very much true with “Archangel” however it might be time for him to chill out a bit before his numerous album releases and frequent touring affects the band on their next album. \n\n originally written by: http://tinyurl.com/o7uohgf\n",
        "\nSoulfly have never had it easy, largely because most people still hated Max Cavalera for bringing Sepultura to its knees and then leaving the band to go on his own musical journey. Until 'Dark Ages' in 2005, Soulfly were mostly still persevering with the tribal influences and crunchy modern nu metal sound that had appeared in Sepultura's 'Roots', so ॐ (that's the album's name, and it's a fucking pain to type) was met with a fair bit of shit-flinging back in 2002 and even more bad weather in the following years when the Cavalera brothers got together again and Soulfly started to put out stuff like 'Conquer' and 'Enslaved', which had some fairly decent and more conventional metal songs. I was a nu metal fan for some time (it was my entry phase to metal) and I never quite understood Soulfly back then, but listening to this album now I think that they weren't aiming for many of the same targets as Korn or Slipknot or Deftones and probably shouldn't be judged by the same criteria.\n\nFrom a metal point of view, ॐ has its roots in nu metal and dabbles in a little of the post-thrash that Sepultura used for 'Chaos A.D.'. Around half of the songs here merit inclusion on this website while the others wouldn't qualify if they were stand-alone pieces. The album starts out in a much more straightforward manner, with 3 bruising metal cuts to open, the clean-then-heavy approach of 'One', and the thrashing 'L.O.T.M.'. The playing doesn't reach a terribly high standard for this kind of material, though the point of Soulfly's heavier songs has always been about passion and anger, never finesse, which one should instantly recognize upon reading Max's lyrics. The downtuned grooving riffs in 'Downstroy' and 'One' don't satisfy from a nu metal point of view, since they just aren't catchy or bouncy enough to be memorable, nor flat out crushing in their tone and atmosphere. 'Seek 'n' Strike', on the other hand, really gets it right, with a mid-paced crusher of a riff and great vocal rhythms, even if the actual vocals aren't much to write home about. 'Enterfaith' has some of the most traditional metal riffage on the album and sounds cool in parts, particularly the cruising tremolo riff after the verse and a tasteful solo.\n\nMuch of the rest of the album delves deep into other genres, combining the tribal and South American folk elements of previous Soulfly efforts with influences from funk, pop, rap, and some kind of ambient, relaxing parts. Regarding these elements, I'm not sure exactly how much metal fans are going to appreciate the frequent digressions, since they are more or less pure examples of these other genres, though many bands have tried the same approach and not fallen completely flat. 'Soulfly III' and 'Zumbi' are the only purely instrumental tracks and push the other genres the most, with no metal content and chilled traditional and ambient sounds, while 'Tree of Pain' and 'Four Elements' both contain long sections of gentle lamenting pop and ethnic (Asian) music respectively. The sitar section of 'Four Elements' is pretty good, as are the funky verses of 'Brasil', which make use of a rumbling bass presence and upbeat drumming.\n\nWhat really remains the problem with this album is that the two parts of Soulfly's sound never come together. 'Four Elements', for example, begins as a nu metal song (in fact it begins with a Slipknot riff from the 'Iowa' album, but that's really a moot point) and completely stops after a minute or two, at which point the sitar motif developments for about 100 seconds, at which point it too comes to an inconclusive end and the nu metal song picks up where it left off. Ditto 'Tree of Pain', which starts off as a tolerable pop ballad and throws two other songs into the middle, one sung by Max and sounding fairly typical for the band, plus one sung by his son Ritchie in a hardcore vocal style. 'Brasil' and the heavier opening tracks have the same kind of issues, but manage to at least sound like one song, even if they don't gel very well, throwing in random parts at will. 'Soulfly III' has the distinction of being the only song to actually keep its focus for the entire length, yet that's fairly boring. Then there's the trio of 'One Nation', a minute's silence, and 'Call to Arms', which is not only counter-productive (the cover actually features members of Sacred Reich playing their own song) but actually offensive, since the general intention is to grieve the deaths of the 9/11 victims and spread hate towards terrorists, yet the lyric 'Drop the bombs in! Wipe out your motherfucking schemes' has exactly the same general attitude that the jihadists had towards the Americans.\n\nThe dreadful flaw that this album suffers from is overthinking. Some of the ideas aren't bad, but they aren't presented in any coherent order, have a lot of boring crap thrown in the middle, and also waste so much fucking time in the process. This drags out to almost an hour when it could have been done in 35 minutes and had double the impact. The songs are generally of mediocre quality and the planning is dire, some of the studio effects are worthless and annoying (the end of 'Enterfaith', for example, is Max just shouting \"Faith is a weapon\" on a loop for a minute), and the decent parts are mostly lost in the resulting chaos. It's a pity, because Soulfly could have made a reasonable album, but we had to wait another 3 years for that.\n",
        "\nHow interesting to see time weather even the most solidified of opinions...there was a time when this reviewer found Soulfly vacuous, cloying, just outright HORRIBLE due to more than one bad first impression (both in the live and recorded settings). It's like \"really, Max? You left Sepultura for THIS???\" But as time marched on, a darkness overtook the band and, despite what I'd originally thought about them, I found myself enjoying later recorded works. I'd even go so far as to say \"Enslaved\" was one of Max's strongest albums in YEARS/in GENERAL, not just for Soulfly. I, as well as many others I'm sure, were glad to see Max remember his old groovy thrash roots and incorporating more of that into the mix (Cavalera Conspiracy helped a lot with that, as well...), replacing the Korn-fed bongo drums appeal of his early days. Damn fine stylistic replacement if ever there was one.\n\nSo with this new work, what can one expect...?\n\nOn the plus side, I'm still stoked to hear Max continue on his path of born-again thrasher like he has something to show the world. After a milquetoast opener, it really comes to life by way of pounding rhythms, simple yet groovy brutality and piss-headed Slayer worship (not too unheard of given the talent at hand, here). The rhythm work is devastatingly tight, from the grinding guitars to the sharp (if mixed too loud) drum work, when it stays on target that is. I'm sadly seriously, here...there were a few too many moments where the drumwork sounded too detached from the rest of the group, doing it's own thing while keeping time with everything else in its barest term. And really, Zyon, you DO have a high hat and ride cymbal, I hope...lay off the crash next time, please! But anyway...when it comes to the main bulk of the record, things don't really leave a specific tempo all that often; sometimes things are faster (\"Cannibal Holocaust\"), some are slower (\"Spiral\"), while the majority is a fine middle ground of mid-ranged groove and outright nastiness (\"Master of Savagery\"). It doesn't matter how to slice it, it will all come off the same block of meat, and can still serve to satisfy in their own way if taken for what they are.\n\nThat being said, that increase in heaviness and songwriting appeal tends to be limited by the group's still-present sense of repetitive performance and arrangement schemes. Maybe it's just so deeply engrained in the Soulfly way of life, but I couldn't help but feel that some extra riff padding would only serve to work for the group's benefit that much more. And given how long some of these tracks are that would REALLY be a good thing. Can you imagine how much more could have been added the 8 minute rager of the same few riffs in \"El Comegente\"? Barring that odd acoustic segment, of course, which kinda comes out of nowhere. You may not notice it all that often with the previous work, so I'm curious to know what happened with this one. Maybe as it had only been a year or so since \"Enslaved\" and not as much time had passed for the creative juices to naturally flow and truly breathe as well as they need to. Maybe that could have been the catalyst to making this more of a grand album that it is at this point in time. Well...guess we won't know now, for here it is in all its completed glory.\n\nAt the end of the day, \"Savages\" offers fleeting moments of awesome fury in between bouts of tedium and blahness. Take what you can get from it, but with the understanding that while Soulfly is still a far better group now than way back when we had to jumpdafuckup, we all know they can do better than this, even in their own small way.\n",
        "\nIt's been a long time since the turbulent year of 1996 and the departure of Max Cavalera from Sepultura. The band continued their existence, brought a new singer and made departure from the groove/tribal/ proto-nu metal approach which has been presented with worldwide album Roots. At the same time, Max formed Soulfly. His new band was supposed to be a continuation of his vision from the Roots album. Two years after parting with Sepultura, Soulfly released their debut self-titled album.\n\nThe music from this album can be simply described as nu metal with tribal elements. Max wants you to jump and shout simple and unimaginative choruses, with the addition of tribal drumming. Many expected a return of thrash metal sound, orgasmic solos, brutal riffs and pumped vocals with Soulfly, buuuut no. Max is perhaps pumped, but his vocals sound pathetic and overstrained. Combine that with bad lyrics which mostly consists of \"fuck\" , \"shit\" , \"motherfucker\" etc., and unimpressive riffs that practically recycle themselves. Tribal element even raises the score of the album, but it's more my personal opinion. If you like the sound of berimbau, sitar and conga, this could be just for you.\n\nOf course, it's a sin to release a Soulfly album without guests. Max looooves guests, especially those related to his new love - nu metal. The album features guest appearances by no less than Fred Durst and DJ Lethal (both of Limp Bizkit) and Chino Moreno of Deftones. Anyway, this album is enough bad itself, and why not make it worse by adding all those fresh faces. The best example is the song \"Bleed\" which also has a music video. To sum ​​up, the chorus consists of \"wannabe tough\" barking into the microphone by Max and Fred Durst. BLEED! BLEED! If there is any definition of facepalm, then it's this song. Oh, and don't expect much from a song in which the repeated line is \" I'll make you bleed and you're bleeding now\". Imaginative. (sarcasm /off)\n\nFrankly, after listening to this album I had a feeling that Max practically spat himself and did great harm to his brilliant career (even the Roots album is better than this). In the end, who remembers the songs from this album today? Absolutely no one except a few die hard Soulfly fans who think that this is the most brOOTal thing evah. If you want to hear some good stuff from Soulfly, keep looking because you will not find anything good here.\n\nBest songs: Maybe Bumbklaatt... Give it a chance.\n",
        "\nWhen Sepultura parted ways with Max Cavalera, what followed was the arrival of Derrick Green in the former and the formation of an all new band for the latter. That band is Soulfly. The final albums that Max did with Sepultura, Chaos A.D. and Roots, marked a departure in sound from their initial death/thrash metal output, turning their attention to slower groove metal songs, and later bringing in nu metal elements with Roots. Whereas the Derrick Green fronted Sepultura worked their way back towards straight groove metal and later back to their death metal roots, Max Cavalera fully embraced the nu metal style with Soulfly for a few albums, before finally turning away from that style starting with Prophecy. \n\nPrimitive is rich in nu metal songs, and full of angst and hatred. Whilst this factor alone is enough to put some listeners completely off from the album, it is consistently strong musically, as, in all fairness, the band play this style of music well, which compensates for the sometimes repetitive negativity in the lyrics. Also, like Roots and all of the Soulfly releases that came before and after, there is an emphasis on tribal elements, as heard in interludes between songs and especially in \"Soulfly II\", part of a series of self titled songs the band would release that shied away from the loud guitars in favour of melodic pieces that utilized acoustics. For Primitive, especially, it's a welcome change of pace from Max and co. seemingly cursing everything and everyone that dominates much of the rest of the album.\n\nLyrically, there are some areas that are better than others. Max encourages independence and non-conformity, which, by itself, is fine, and we also hear chants in Portuguese and intriguing philosophical quotes from time to time. As for the weak spots... I get that this album is mostly nu metal, but even by nu metal standards, it's difficult to take Max seriously sometimes. Take songs such as \"Jumpdafuckup\" and \"Terrorist\" for example, in which Max talks about how you don't understand all his hate and that you shouldn't fuck with him because he's full of hate and he sees a lot of shit while walking down the streets, and then he encourages you to bring the pain/rage/shit to the motherfucking pit and rise above the bullshit. Well, he's right about one thing. I don't really understand his hate, because he often does not elaborate beyond \"bullshit\" when he is angry, though occasionally he'll call out political stuff as part of the reason for his anger, which is, however, nothing new, as Sepultura had a number of songs with a similar message. Max just seems more vague about it here than he did before.\n\nEarly Soulfly albums featured a number of guest appearances, and this album features Chino Moreno, Corey Taylor, Tom Araya, and Sean Lennon among its ranks. The guest appearances enhance many of the album's songs and add some depth to Max's anger, which, on its own, sometimes falls flat, and I find that the tracks I generally skip repeat listens of are the ones that Max and the core band handle on their own. The two tracks I mentioned above in reference to weak lyrics feature Taylor and Araya respectively, and if it wasn't for those two appearing on the songs, I most likely wouldn't consider them tracks worth going back to. Max's growling vocal style when combined with angsty lyrics can become a chore to listen to after a while, and so the other vocalists help to keep your interest during a sitting through the entire album.\n\nPrimitive showcases Max Cavalera still working to find a true musical path for Soulfly. Whilst there are unconventional instruments and tribal elements in the mix, much of the album stays within the margins of nu metal. Soulfly's later albums would put more focus on faster, heavier songs that would sometimes hearken back to Max's death metal roots, and these are the albums that are more highly regarded by fans today. However, for all of Primitive's shortcomings, there is an intriguing musical section or a guest appearance that compensates for it, and that is why this album is still worth checking out. Of course, if you do happen to want a decent nu metal album, this will most likely satisfy you anyway.\n",
        "\n1st album that I've owned by this band, was interested because I figured that if it is Max Cavalera's band, they must be GOOD. Not to seem biased, but since he was the frontman for Sepultura alongside his brother for years, his own band I concluded I'd give it a try! I was not disappointed at all really and since the focus was on groove/thrash metal, that sparked my interest in them. After hearing this latest CD some times now, I thought that everything seemed to fit together-the music, lyrics and genre(s). There really wasn't anything that I disliked about this release, it is at the top of the list for best albums in 2013.\n\nThat I felt so strongly about because it's wholly creative and original not to mention an album to \"chill\" to. The lead guitar work was also good and well played out on that aspect, it wasn't in any way half-assed or just annoying executions, there was real talent here that Max recruited, not to mention playing with his 20 year old son now on drums. Amazing production, thickness in the guitar riffs (I'd say they're in B-tuning). Not really overtly aggressive songs with exceptions of course. Ultimate creativity in the songwriting, lyrical concepts, vocals and mixing. The fact that they're on Nuclear Blast says something great which is another reason why I picked this out to try.\n\nEverything seemed to fit together and the concept of pure hatred wasn't the only goal I think Max wanted on this album, I also think that the focus was originality in the music alongside lyrics that people could relate to. I'd have to say that the backup vocals/guest vocals fit the album quite well. Some of the music was really atypical though, giving it more of an aura about it which brought about more depth. There wasn't a song on here I disliked. All of the music and vocals I enjoyed immensely. A very groove-laden release and definitely a CD that's well worth hearing. If this sparked some curiosity in my review, YouTube \"Cannibal Holocaust\" and you'll hear what I'm talking about.\n\nThe thickness in the guitar is what stuck with me and Max's vocals seemed more higher pitched than what I was used to on Sepultura releases that he was on. I actually like his voice here more than on Sepultura, which is quite a thing to say regarding the album. Definitely good to have variety in the vocals so that you're not stuck hearing monotonous screaming or low bellowing bouts it's a little bit of both on here which is another reason why I like this release. No regrets here, the musical compositions are just so darn creative and expansive. Max definitely remains high still on the creativity factor.\n\nSavages will hit you hard with heavy guitar work and tempos that are simply awe-inspiring. I don't think that this one you'd get bored with, like I said, a mild metal album with a modicum of fast tunes, mainly just riffs that'll just knock you on your ass. Totally awesome work here and the band needs more recognition with this one because Max does a great job at coming up with music and lyrics that really rock! It'd be great if they stick with this kind of style because it really is an album that deserves more praise. Definitely not a sell-out at all, a balls out release with great riffs. Get it and you may come to the same conclusion!\n",
        "\nAt first, this song starts promising with a tremolo picked Covenant era Morbid Angel style riff over fast double bass drumming. Then the Max Cavalera after finding god delirium kicks in. Constipated, broken English vocals that make the crowd chant of Mass Hippie Noses from the live in Barcelona video seem intelligible followed by some imbecilic constipated noises of an even more moronic nature courtesy of the Cattle Decapitation vocalist. If Max Cavalera recorded himself while on the toilet and a drunk redneck attempted to emulate pitch shifted Carcass vocals by making throat noises, you have an idea over how awful these mixed to the forefront distractions are. The music seems decent at this point though, then comes Max Cavalera's inability to string together riffs in any coherent, meaningful way since Arise.\n\nAfter the cool death metal riff, we are greeted by a very annoying Earth Crisis styled chorus, with gang vocals. It sounds like the best riff some straightedge Victory Records band like Strife would have come up with in their \"prime\". The stupidity continues further in the song after the verse-chorus repetition when we get to the lazy tremolo picked notes riff followed by the \"atmospheric\" dissonance part with the \"important sounding\" spoken word gibberish underneath. We then go to a Marc Rizzo disposable solo played over it which accomplishes nothing more than \"being there\". The song ends with blast beats over what sounds like a parody of Behemoth's 2000s and beyond era parody of their favorite Morbid Angel Domination parts. It all amounts to crap.\n\nIf Max Cavalera is attempting underground redemption, he failed. The insistence on grooves, the disconnected riffs,... it all feels very phoned in, like usual. The lyrics reference Celtic Frost, but have stupid religious overtones he tries to force feed upon you like in the rest of his post-1996 days. The Morbid Angel sounding riff in the beginning was cool, but alas, it devolves into parody like the rest of Soulfly's discography. Listen to Murder immediately after this to hear the final days of Max Cavalera having any motivation or spirit.\n",
        "\nUgh. Why did I buy this album? It is the first Soulfly album I ever bought and upon hearing it, the last. Being a fan of Sepultura's early output up too \"Chaos. A.D\" , and the occasional Sepultura album following Max's departure, I decided to give this band a fair chance. So I picked it up for a mere £1 online. \n\nThe music found on here is a mixture of mall core, post-thrash, groove and the occasional \"experimental\" section. The result is an hour long slog through this modern \"Jump Da Fuck Up\" take on metal. Every song contains what is needed for this god-awful style, fast \"Br00tul\" sections, breakdowns to satisfy mosh pit fiends, groove riffs and the use of irritating “tribal” samples. \n\nTo be fair, there are some good aspects to this album. Some riffs stick out and catch your ear, however they are often repeated far to many times to remain interesting. For example \"Unleash\" starts with a fairly generic breakdown style riff, that is then developed upon effectively. However as the track goes this repetitive pattern gets more and more annoying, you begin begging for and change and it comes. Slap bang in the middle of this track is an \"ambient\" section, these sections offer little, other than a break from the boredom that preceded them. This basically sums up the positives of this album, there are indeed some good , memorable guitar playing to found here. However these catchy ideas are often repeated for far too long, with VERY predicable song structuring. Upon-listening I would guess how the song would develop, and quite often my guess would be correct. \n\nSongs like \"Fall Of The Sycophants\" can be frustrating to listen too. For example this track starts out fast and thrashy ( I was briefly reminded of \"Arise\"). After repetition of this thrashy section, we are treated to the mandatory slower section containing a mundane melodic guitar melody. However to justify this section, there is a very fast and fairly impressive solo to be found here. Sadly, the mood created by the solo is quickly destroyed by a rather predictable return to the previous fast section. \n\nAnother example of a frustrating song is \"Doom\". This starts out well, nice and thrashy, with a catchy chant of \"Doom!\". However following this is a highly irritating section where max shouts \"Scream Motherfucker\" over and over again. Following this is, you guessed it, a breakdown, followed by a VERY unfitting clean section. If they had dispensed of the \"Scream motherfucker\" and the clean section, this review's score could have gone up by 10%. The only track on here (If I remember correctly) that did not frustrate me to hear was \"For Those About To Rot\". This track is solid, not too much to complain about here other than its slight repetitiveness.\n\nThis highlights my main beef with this album, how inconsistent and repetitive it is. The music jumps from fast too slow, followed by breakdowns and these previously mentioned irritating \"ambient\" sections. A further example of these clean/ambient sections is seen at the end of the album. The album is ended with an instrumental ballad titled “Soulfly VI” that comes out of nowhere, and completely changes the mood of the album, I was expecting Max to burst into song whilst listening to this. There is nothing wrong with this piece, it is actually fairly well written, however it is completely out of place. If the band had put more effort into smoothing over the tempo changes and the transition between heavy and clean, “Conquer” would be a hell of a lot better.\n\nA further problem with this album is the lyrics, whilst Max’s vocals are tolerable ( using his trademark shout , with some nice deeper grunts) the lyrics are weak. They are either uninteresting or childish. This effects the songs for the worse, for example the track “Doom” as I mentioned before is ruined by the “SCREAM MOTHERFUCKER” section. I try not to judge music on the lyrical content, but as Max’s vocals are comprehensible on this release, the lyrics bring the album down.\n\nThere is little to say about the production, the guitars and drums sound solid and clear. The bass is completely inaudible (unless it is playing on its own, which does happen occasionally). The bass being silent is no surprise for me, considering the modern tendency within metal to drown out the bassist’s tracks entirely. \n\nI feel bad for dismissing this release so harshly, there ARE good aspects , but the flaws completely ruin the positive aspects for me. \n\nStandouts (Trying to be generous here) \n- \"Unleash\"\n- \"Doom\"\n- \"Fall Of The Sycophants\"\n",
        "\nIt’s 2:35 in the AM and I’m sitting at my computer, yet again. My right hand glides about, forefinger tapping here and there with a reverberant *click* as accompaniment. My left hand never far from a frosty lager, my feet propped up on a subwoofer that’s slowly churning out some obscure Scandinavian metal I’ll probably never have time to review as I lean back in my chair and mindlessly scour the world wide web: this is my life at this moment, I am content. But my serenity is illusory, maintained by a veil of ignorance that, once lifted, will have me yearning for merciful nepenthe. Truly, I am not prepared for the horror of the thing. My eyes grow wide and stare forth, yet I do not see. My teeth clench involuntarily, painfully, as my mouth becomes uncomfortably dry. Aware only that I’ve been stricken by an unnamable ailment as my body begins to convulse, my thoughts turn grim. This…is this how my life ends? Blood pressure rising, every synapse firing, forming disjointed impulses, my mind basically pleading with my hands to strangle the consciousness out of my frame. Limbs turning against body, senses dull and ever-fading, my will resigning itself to its fate…when out of the blackness, my reasoning returns with a silent crash, shattering my moment of weakness and bringing hope where before there was none.\n\nAll is not lost. I do not spill my beer.\n\nThis was my instinctual reaction, and in my opinion, it is a fairly reasonable one to have when finding Soulfly featured amongst these Metal Archives. I’ve never claimed to be an old-head around here; it’d be tough considering my life experience is limited to a mere quarter-century. But come on now…there’s got to be some standards, lest we open the floodgates to the whole host of unholy horrors. What’s next, an entry for Stuck Mojo? Body Count? Or maybe even… dare I say…. Hatebreed? I mean this is Soulfly we’re talking about here; the band that assembled all of nu-metal’s loosely gathered grown-man angst into a collective monument to its own stupidity. A band whose founder, Max Cavalera, might very well be the personification of the “sell-out” mentality. This band, no matter how overtly “metal” they could be these days, is still responsible for turning Fred Durst’s otherwise innocuous suggestion of audience participation into the almighty Gospel of Jumpdafuckup. For these sins, any ostensible repentance would have to be pretty damn repentant. We’re talking the musical equivalent of ending world hunger, curing HIV, and resurrecting Hitler just to kill him again. \n\nDoes Soulfly achieve this? Not really. But they’re certainly working on it. And I begrudgingly admit that I guess they sort of have earned the right to maybe be considered on this great slab of internet. Kinda.\n\nThings open without any degree of promise. “Resistance” is a very skip-worthy opening monologue in the usual Cavalera anti-establishment vein; ambient non-music to these ears. But soon enough the actual songs begin, and believe it or not Toto, we’re not in mallcore anymore. Somewhere in the decade between 2002 and 2012, Max Cavalera got back in touch with his roots (not to be confused with his Roots) and focused his efforts towards crafting extreme music once again. I imagine this was a slow and difficult process, considering the intense intellectual atrophy he must have suffered writing material like that on those first three Soulfly records (and his last two Sepultura albums for that matter). We must suppose that lead guitarist Marc Rizzo (acquired back in ’04) had something to do with this, as his obvious technical skill could not be shackled to the primitive conventions of nu-metal. For this most recent album, the rhythm section is also brand new, and the fellas by the name of Tony Campos and David Kinkade seem to know what they’re doing as well. All this fresh talent must have rubbed off on ol’ Max and pointed him down the right path for the first time in ages.\n\nNot that he doesn’t wobble off the path on occasion. There’s still an emphasis on slow groovy parts and the “atmosphere” that comes with it, if we wish to be generous. Lyrical content, though infinitely improved from the brain-dead ramblings of old, still does not make the same impact as the roar from the man delivering them. There are also some weird, unnecessary production gimmicks that come in now and then and the mandatory sitar part or two that Max has to include to be “diverse,” but now I’m just nitpicking. There are no more hardcore breakdowns, no more rapping or turntable scratches, and no more tribal bullshit; the mandatory “Soulfly” tribal jam got demoted to bonus-trackdom on the deluxe edition. No really, I’m serious, they’re not completely fucking off on this one. I’d be speechless if I didn’t have a review to write here.\n\nSo now that they aren’t pandering to the mall crowd, what are they playing, the ravenous death/thrash of Cavalera antiquity? ‘Course not, and don’t let anyone tell you any different. If there was a physical scale displaying these two styles as opposite extremes, Enslaved would fall squarely in the middle as a bizarre amalgam of melodic death metal and groove metal in a Crowbar meets The Haunted kinda way. It’s the metalcore sound in a sense, but something about the delivery makes it a bit more extreme and legitimate than the typical delinquent Americans robbing Swedes that we usually get to hear ‘round these parts. One minute there are slow, dissonant metalcore-reminiscent sections, simple, repetitive choruses and plenty of riffs that are too easily described with onomatopoeia (chug chug……ch.chug chug chugga chug…… recycle and repeat) and the next minute there’s bouncy mid-paced head-bangage, ripping death fetish tremolo blasting, and even the occasional thrash nightmare relapse. What’s impressive is the uniformity between the opposing styles that many modern bands fail to achieve. Where a somewhat similar band like Lamb of God, Chimaira, God Forbid or whoever might have the occasional neat passage quickly ruined by their usual bullshit, the strong compositional elements here are solid and numerous enough to pull up the weaker bits out of the mire. See “Treachery,” “Plata O Plomo,” or “Gladiator” as samples: Rizzo’s attention-worthy solos, Max’s fierce vocal approach, and the constant percussive battery will clang around in your short-term memory much longer than you’d probably care to admit.\n\nStill, I’m not going to praise this new Soulfly to the high heavens, as it’s stylistically modern without being extreme enough for my tastes, most comparable to latter-day Exodus. But holy hell is it a big step in the right direction and it could slay contemporaries like Unearth, Trivium, or Killshit Engage like Charles Bronson punting kittens off the Statue of Liberty: easily. Okay…maybe I’m not making any sense, but neither does this, a Soulfly album that doesn’t eat feces. Good is bad. Black is orange. Left is pineapple. It’s imperfect and flys well beneath say, the last Slayer album, but I’d gladly give this another listen over anything Machine Head, Austrian Death Machine, whoever else the kids think is heavy these days, or post-Max Sepultura have bothered to release. And this coming from a usually strident philistine in matters of this sort of “untrue” metal. That said, it might be worth a look.\n",
        "\nWhen I was just a wee lad I had discovered Sepultura and was blown away by the intense thrash attack they provided. I loved their classic thrash/death metal albums, and I even liked a few songs from “Chaos A.D.” and “Roots.” But, once Max Cavalera left them I got off of the Sepultura Kool-Aid and haven’t looked back. Once I had heard about Max starting a brand new band called Soulfly that was supposed to be more of a continuation of the “Roots” sound I was intrigued and wished to check it out. I’ll freely admit that I liked a few nu-metal bands back in the day, so the first few Soulfly albums gelled with me pretty well. However, I was beginning to tire of their repetitive “Jumpdafuckup” nature and finally had to abandon them in the way I did Sepultura around 2004, with the release of “Prophecy,” which brought a whole new meaning to the word ‘boring.’ After 8 long years I have decided to stumble back into the Soulfly world and explore their brand new offering, “Enslaved.”\n\nI’m sure by now a lot of us are acquainted with Max’s insufferable lyrics and album concepts, and things are no different with “Enslaved.” Can you take a guess as to what the this album is about? If you guessed how free market economics and capitalism are the best way to ensure equality among all people, then you would be wrong. The real answer is slavery. That’s one hell of an original concept, right?\n\nDumb and cliche album concepts aside, Soulfly opens up the album with a short introductory track in ‘Resistance,’ with a simplistic two-note riff that is continuously played for much of the song on top of a double-bass attack. It’s a better way to open up an album than just another two-minute ambient track that serves no purpose, but Max’s voice is modulated in a way where you are unable to tell what he is saying, and it all comes out garbled except for him yelling “resistance” a few times. Now, this is where things begin to throw me for a loop.\n\nIn all honesty, I was expecting my face to contort into multiple disapproving expressions, but as soon as I heard new-comers Tony Campos (bass; Asesino) and David Kincade (drums; ex-Borknagar) open up ‘World Scum’ with an energetic performance I couldn’t help but feel my neck involuntary nodding up and down. Once the rest of the band kicks in I realize that this album might actually have some death metal influence to it, especially once I hear Travis Ryan’s (vocals; Cattle Decapitation) growl make an appearance I was put on my ass. I really was not expecting to hear his vocals in a Soulfly song of all things. This is by no means close to anything that Sepultura would have put out in the ’80s, but there was no possible way I could have anticipated a thrash/death metal song on this record.\n\nAs “Enslaved” continues onward, you are met with a healthy mixture of death, thrash, and groove metal. Soulfly wanted to create a diverse record, and so far it is definitely holding up to their visions. You’ll have more catchy and groove-oriented tracks in the likes of ‘Intervention,’ ‘Legions,’ ‘Treachery,’ the first half of ‘Chains’ and ‘Revengeance.’ I think those four songs are the weakest of the bunch as there is just nothing memorable about them. The more thrash-centric tunes such as ‘American Steel’ and ‘Redemption Of Man By God’ (featuring Dez Fafara (vocals; Devildriver, ex-Coal Chamber)) are okay at best since they are cleverly disguised as Testament b-sides from “The Formation Of Damnation,” except without the eccentric minds of Alex Skolnick and Eric Peterson. Although I will say that it was interesting to hear Max and his boys doing the entirety of ‘Revengeance’ themselves, with each of them on vocals, guitar, and drums. The song itself is mid-paced groove and doesn’t really get anywhere meaningful. His kids do have some talent, but they are obviously not ready for the music industry quite yet.\n\nBesides ‘World Scum,’ I thought that ‘Gladiator’ and ‘Plata O Plomo’ were the highlights of “Enslaved.” ’Gladiator’ has a great mixture of melodic death, groove, and thrash metal infused in it. Max and Marc Rizzo (guitars) do a phenomenal job of packing memorable melodic leads over the rhythm guitar. ’Plata O Plomo’ is one of the more groove-oriented tracks, but it’s sung by both Tony and Max in I believe both Spanish and Portuguese. The groove metal is good, but what I really love about it is the Gaucho-style acoustic guitar that comes in, giving the music a classy flair that sticks with you, plus it is ridiculously cheesy to hear out-dated gun shots that came from John Carmack’s classic first-person shooter, Doom. Those are the stars of “Enslaved,” and I was actually surprised that Soulfly had it in them to make songs like this.\n\nHonestly, “Enslaved” could have been so much worse than it actually was. I was prepared to tear Soulfly a new one, but I came away appreciating what was on this disc. Not because it is groundbreaking in any meaningful way, but the band did a decent enough job of blending death, thrash, and groove metal together. While the album certainly has its faults, it has a good bit of charm to it, too. I never really got any emotional response from it, but I suspect that people who are fans of this more light-hearted and accessible style may feel differently than I do, and in a world where we are able to cherry pick whatever type of heavy metal we want, that is perfectly okay with me. ”Enslaved” will definitely surprise the naysayers like myself, and it will continue to appease the Soulfly fans that have somehow stuck around for the past 8 years. I am actually tempted to stick around and check out their new album whenever they record it. I never expected that to happen again.\n",
        "\nAfter Max Cavalera left Brazilian legends Sepultura in 1996, he didn't have a pause in making music. He formed Soulfly almost immediately after his departure from the band he first formed, but didn't hurry in releasing his new band's music.\n\nSepultura did change a lot during over ten years of existence, that Max was in the band. From primitive black/thrash metal act to world traveling giants of thrash metal, they assumed far more simplified power chord driven, ehh... drivel, to put it nicely! Sepultura's 1998 album 'Against' was badly lacking, especially in songwriting. So is Soulfly's debut. In my wildest dreams, I was waiting for back-to-thrash style stuff from Max, but no. With this debut, Max continued with simple power chord driven stuff. The album lacks of memorable songs. And when the music is simple as this, some songs are way too long as is the whole album! Soulfly's \"jump metal\" is accompanied by HC stuff, but also by traditional Brazilian music and bits of various different music styles, for example, sadly, rap!!! These accompanying styles liven up this power chord stuff quite a bit, minus the rap shite, but still the album gets tired during its long duration. Basically, this is Max's 'Roots part 2' in my ears, 'Bumbklaatt' being the closest reference point, even its' drumming is so fucking Igor Cavalera-esque.\n\nThis is performed with energy, no doubt about that, but production isn't very raw or dirty as it should be. Max had lost some close people and this was his therapy to overcome his losses. There's a couple of feel-good songs, though (e.g. soccer song 'Umbabarauma'). Lyrics vary from Max's personal feelings to Brazilian every day life. It's always good to hear Max's rough voice, but then again, his \"solos\" are more like random guitar noise (which on 'No Hope = No Fear' happens to sound like angry Donald Duck, believe me!). And all \"fucks\" and \"motherfuckers\" are a bit old, eh?\n\nMaybe Max and Sepultura guys were much more a force than they want to reckon nowadays. We will probably hear no another album from classic Sepultura line-up. Anyways, I picked up the latest Soulfly album 'Dark Ages', because someone mentioned \"thrash bits\" on it, and I must say it's much, much better and more deliberate one from Max!\n\nAbout the remix/live bonus disc: I don't know about remix styles and do not care to know about them. However, the remixes are more varying than the album itself, but do not provide any listening pleasure for my ears. Concert recordings are okay with heavy sound and live atmosphere. Remixes are for lame lemonade alcohol drinkers, live tracks for beer swelling bastards. Roadrunner Records have a fucking annoying habit to release their year-old releases for a second time with a bonus disc. Buggers!\n\n(originally written for ArchaicMetallurgy.com in 2006)\n",
        "\nJust as there are songs/albums that are so good that they literally take a person back to a past experience in life associated with them, there can also be ones that work in the opposite respect. When I reminisce on everything that I positively couldn’t stand about the music of the 90s, I always find myself somewhere in the midst of the latter part of the decade when Kid Rock, Limp Bizkit, and Soulfly enjoyed widespread circulation and my high school days were coming to a close. This particular time period is negative primarily because it also coincided with the demise of my first actual metal band (a Black Sabbath cover band) when everyone, save me, jumped on the nu-metal bandwagon and suddenly my love of guitar soloing became a staple of lameness. Suffice to say, I have a bone to pick here beyond the mere terribleness of this single’s contents.\n\nThere’s much to be said for how anti-metal the person of Fred Durst is with his wigger image of a backwards ball cap and baggy, thug-inspired clothes, or the hokey addition of DJ scratches into a metal song, but the most offensive thing about this sad collection of the songs is the outright commercial pandering and trend-hopping displayed by Max Cavalera. This isn’t a mere experiment in innovation (that’s what was going on 4 years earlier with KoRn), this is a man voluntarily going from being a pioneer of a genre to a wannabe to the point of literally sounding indistinct from that of Jonathan Davis. There’s maybe a slight nod towards Cavalera’s uniquely political past in the lyrics, but its presented in a manner more indicative of the reactionary, jock-like tough guy B.S. that listens more like a 4th rate Pantera clone distilled to the point of unintentional slapstick comedy.\n\nMusically, the contents on here mostly resemble the stagnant mess of muddy 2 note guitar drones, hypnotic beats and gibberish-like scat vocals (imitating percussion instruments rather than brass ones) featured on Sepultura’s “Roots”, to the point of sounding like a carbon copy sequel to said album. The lead off song features our favorite man to hate providing his gimp-like screams alongside Max’s unoriginal mallcore growls, but perhaps the truly offensive thing about “Bleed” is the slavish reliance upon gimmicks and sound effects to cover up the idiotically oversimplified formula at play. “No Hope=No Fear” is the same general story minus the presence of Durst and DJ Lethal, thus the KoRn worship is even more pronounced, though the musical format still maintains a somewhat tribal, percussive tendency. In fact, the entire essence of this music seems to be attempting to render the concept of the metal band arrangement into a mock percussion ensemble of sorts, and in the most grating way possible.\n\nThere’s nothing redeeming about this group of songs to speak of, even and especially the butchered Discharge cover at the end. Just as was the case on “Roots”, Max has decided to throw in a token thrash/crossover song that was good in its original form, and then butchers it with his annoying mallcore vocal style and a bare bones instrumental recreation that offers no real distinction from the original other than being of a lower production quality. This whole album just reeks of laziness and indifference musically, while attempting to sound brutal by just loading on the yells and noise as if that will turn a mess of muddy diarrhea into rock solid metal. This music sucked horribly when it was popular, and in this day and age where even this band has moved away from this style for something more metallic, anybody who likes this stuff should be at least somewhat embarrassed to admit it publicly. Sadly, I have a feeling that at least one or two of my old high school buddies might still be following Fred Durst’s antics and being impressed by them, which may explain why I lost track of them after graduation.\n",
        "\nAfter reading some interviews with Max and even watching video interviews on the Tube, Max himself stated that this album \"ॐ\" or \"3\" or \"Soulfly three\" (as Max says it) was one of his weakest works he has done in his career. He actually says that he didn't get any inspiration for this one, but I honestly like this album a lot. You'll find way more decent stuff on here than the two first Soulfly albums.\n\nLet's start with songs like \"L.O.T.M.\", \"Four Elements\", and \"Call to Arms\". The first one has a lot of a thrash metal vibe, pretty much Sepultura's \"Arise\" when it comes to the guitars and is pretty fast. Even \"Four Elements\" has a lot of that vibe, and \"Call to Arms\" is pretty much of a hardcore song on the album that reminds me a lot of his side-project Nailbomb. I like those three songs. There's even a lot of decent stuff in \"Downstroy\", \"Seek 'n' Strike\" and \"Enterfaith\", to be honest, with a lot of groove in it. And then it has some typical nu-metal stuff like \"One\", \"Brasil\", and \"Tree of Pain\". I actually like the song \"Brasil\" 'cause it has some great grooves going on and it fits pretty good for a song about his country. \"Tree of Pain\" is a pretty lame song, though. Well, it's kind of interesting when you put a ballad-type thing in a song and then it just blows you away, but I'm not much of a fan when it comes to drum machines. Yes, it has a drum machine when Max starts singing. Roy Mayorga actually didn't participate in the song and I think that's why \"Tree of Pain\" is not a big favorite. And then we have \"One\", the worst song on the album featuring the singer from Ill Niño. First of all, I have nothing against Korn, but this song feels much of Korn-plagiarism, and the Ill Niño singer sounds very irritating to my ears, and yes, I hate Ill Niño. So to me, they could have skipped this one. The cover of Sacred Reich's \"One Nation\" is pretty funny 'cause members of Sacred Reich are actually playing on Soulfly's version of this song, but I have to be honest, it sounds pretty damn tight and maybe even better than the original that can be found on the \"Surf Nicaragua\" ep. \n\nOverall, like I said, this album has more interesting stuff than their self-titled album and \"Primitive\" album, and I have to say that of all these Soulfly albums with the tribal elements (That will say, their four first albums), this one is their best \"tribal metal\" album they have done.\n\nI could give this album a better rating, but what really bothers me with it is the album cover. I really can't deal with this Om thing on the cover. It just pisses me off when I look at it. According to Max, the album was gonna be called \"Downstroy\" from the beginning, but what really happened we don't know,and even Max doesn't know why he changed it from \"Downstroy\" to this. And yes, the song \"One\" bothers me a lot, too.\n",
        "\nAfter Soulfly released the 2005 album \"Dark Ages\", the band went more to a thrash metal direction with that album, and so does \"Conquer\", which was released three years later. In 2010, \"Omen\" was released and I was expecting a lot from this when Max Cavalera stated that the songs were gonna be shorter and faster, but the songs happened to be less inspired, boring, and the band itself sounds tired. The production seems alright, though.\n\nAt least we've got four songs that came out to be great: \"Bloodbath & Beyond\", \"Jeffrey Dahmer\", \"Off With Their Heads\", and \"Mega-Doom\", while the rest feels nothing but just weak. \"Kingdom\" must be the worst song off the album as it doesn't feel like a Soulfly song. The album also came with three bonus tracks on the double disc digipak edition, but they're all cover songs. The Excel cover \"Your Life, My Life\" was the only one that came out pretty alright. I've never even liked Led Zeppelin, so I always skip the cover of \"Four Sticks\", and last...isn't it pathetic to cover a own song? Soulfly recorded Sepultura's \"Refuse/Resist\"; I bet the ideas just ran out for Max when it comes to doing covers. I can understand that Soulfly plays Sepultura stuff during live shows, 'cause people want to hear the Sep's songs played by the former Sepultura frontman, even with a better guitar player that is Marc Rizzo, but doing something like that on an album just doesn't work.\n\nI also said the band sounded very tired on this album and that's pretty obvious. Max's voice sounds tired and old here. Marc, though, does pretty great here, but Joe Nuñez's drumming doesn't impress me on this album and Bobby Burns' bass...well, I can barely hear it. And he also happens to be the worst bass player Soulfly ever had and pretty much drags the band down with his bass playing. Even in live shows he looks boring. He left the band the same year.\n\nWell, I said that the album came out as a double disc digipak and contains a live dvd recorded at the Will Full Force Festival in Germany in 2009, and that pretty much saves everything. I rather watch the dvd than listen to the album, and even play those four great songs I mentioned.\n\nOne cool thing about this album is the album cover. I think it was pretty cool they had these seven \"space monks\" or whatever you see it. While this is the seventh Soulfly album, Max stated it was gonna represent like \"the seven deadly sins\". While these creatures are holding something that reflect the seven deadly sins, it must be the only cool thing about the album.\n",
        "\nOf all the abominable nu-metal acts that sprung up toward the end of the 90's, none hold as dear (read: bitter) a place in my metal heart as Soulfly. Why? It's because Max Cavalera did what I had hoped to be impossible - he ruined his own career even more profoundly than Chris Barnes did with Six Feet Under. Truly, it leaves me appalled when I watch footage of Sepultura from the early 90's and see the raw energy and passion the Cavalera Bros & Co had, only to know that the band I'm watching is nearly twenty years past their glory days and its former frontman went on to start a music project which is so insultingly bad that most of the metal fan base finds it approximately as appealing as a Sunday school teacher finds video footage of a partial-birth abortion. But alas, this is ancient history in the metal world, and there is no option but to move on and accept it.\n\nHoping that I would finally be able to approach Soulfly with an open mind after all this time, I prepared myself for listening to their debut record by placing myself in the proper mindset, ready to be floored by slamming riffs and spiritually moved by the tribal passages, ultimately coming out of the listening experience as a stronger and more enriched human being. This did not happen. Instead, I was greeted by some low, rumbling noise. For a few moments, I waited in eager anticipation to hear the powerful crescendo and transition into the opening riffs, but it never came. The transition into the opening riff of Eye for an Eye consists of one snare drum hit. The riff that follows this less-than-subtle intro is actually rather promising and reasonably catchy, bordering on being acceptable as groove metal. The problem, however, is that the opening track is in no way indicative of what lies ahead.\n\nActually, that's not entirely true. The bad parts of Eye for an Eye could be considered accurate foreshadowing of what is to come, including insipid lyrics with passages that get repeated over and over, screeching \"solos\" and samples, pointless interludes featuring tribal drumming, and a TOTALLY SIKK breakdown that's so br00tal that all the mall kiddies pinch nerves in their necks while headbanging to it. Sarcasm and satire aside, if the rest of the album was of the same quality as the opening track, I would not find it nearly as detestable as I do. Unfortunately, as soon as Eye for an Eye ends, the listener is promptly sent to nu-metal hell, from which the only escape is reaching the end of the CD. \n\nNo Hope = No Fear is an effective summary of the remaining contents of the record, subtly warning us that there is no hope whatsoever from this point onward. The most egregious offender, though, is Bleed. Promoted heavily at the time of the album's release, to the point that a music video was made for it, Bleed was deemed the obligatory \"hit single\" off this record. However, it's just another obligatory hit to the crotch, and a microcosm of the nu-metal movement. \"Creepy\" screeching noises, rapped lyrics about pain and insanity that are so overdone they actually sound more angsty than angry, profanity thrown around to show all the eleven year-olds that Soulfly are gangstaz, a one-word chorus that is shouted several times over while the vocal track alternates between the left and right speakers, a breakdown laden with BRING IT taunts... Bleed has it all.\n\nAnd really, it never improves from there. In the spots where the music isn't downright awful, every potentially promising moment is inevitably ruined. Whenever the tribal drums and chanting comes in, Soulfly desecrates it by adding more of that screeching sample shit to it and adding growling to the vocals. Whenever there's a riff that starts to grow on you, it promptly ends and descends into a breakdown, at which point you will most assuredly be informed via rapped lyrics that you enjoy fucking your mother. Whenever Soulfly comes to what they believed to be an awesome chorus, they hammer the point home by repeating it at least half a dozen times before moving on. Not even the closing instrumental track can lend the album any credence, as it consists entirely of sampled noises and bullshit so common in nu-metal. \n\nWhat can I really say in summary? I wanted to be able to say that this album is completely void of creativity and is where metal went to die, but it is not. The most unfortunate fault of this album is that you can tell throughout that Max and his crew are being completely serious. They really were exercising their creativity, and they really did give it an honest effort. The result, perhaps to all eyes other than their own, is a revolting album with few, if not zero, redeeming qualities. It has bits and pieces derived from the likes of Korn, Limp Bizkit, and Slipknot, all wrapped up in its own unique package courtesy of the tribal influences - and yes, it really is just as awful as that description sounds.\n",
        "\nWith a new lineup (except for Max) comes a new sound, more or less. There's still nu-metal on this album but this is the album where Soulfly starts to move into a more metal direction. Perhaps after six years of creating substandard, boring nu-metal, Max wanted to return to his roots? But there are still elements from the previous two albums here - still nu-metal, still the tribal themes, and a song with another nu-metal musician doing guest vocals. Does One get to join Jumpdafuckup and Bleed in the dunce corner?\n\nThe nu-metal on this album is unremarkable. Downstroy sounds like it has a recording of some alien bird whirling in the background and Seek 'N' Strike has a cliche overused syncopated groove that is common in nu-metal. One is somewhat more atmospheric, and I don't mind Christian's vocals. I was even into Ill Niño quite a while ago and consider them a more tolerable nu-metal band. I certainly don't hate this song and find the chorus rather catchy. Brasil is a tribal nu-metal tribute to Max's motherland. Four Elements is only remarkable for the tribal break toward the end heralding the nature of the last several songs on the album.\n\nMy first thoughts about Tree of Pain was \"Wow! Soulfly has a ballad?\", it starts calmly enough and has a soothing melodic voice of Asha (who sang on Flyhigh in Primitive), but in the middle it suddenly explodes into a fury of groove-laden pseudo-thrash and nu-metal with Max screaming overtop about his pain. Richie Cavalera makes a guest appearance here too with youthful screaming more suitable for hardcore before the song returns to the calm, tropical ballad of the start of the song. It seems stitched together, this would have been better as two different songs, instead of a crazy and mediocre nu-metal song smacked in the middle of a gentle ballad. Still, the point of the song is grief, both toward Asha's friend D-Low and Max's stepson Dana Wells, and the song communicates both somber grief and furious anguish of loss.\n\nSoulfly III is truly a shining star on this album as it effectively transports the listener to someplace else. The acoustic sitar sounds off throughout the song with a distinctly Indian melody, fitting as this album does feature the symbol of Om - a sacred syllable for Hinduism, Buddhism and Jainism. Otherwise stylistically it isn't that much different from the previous Soulfly instrumentals, and it's the only song on here that could be worth meditating to. Zumbi closes the album with another tribal instrumental that is rather quiet and laid back.\n\nNevertheless, there are moments when the band sounds like they are trying to get away from nu-metal, or at least branch from it instead of creating an album that is more or less monotonous on the heavy parts. Enter Faith has some groove metal elements, L.O.T.M is trying its hardest to be a thrash song, and Sangue De Bairro, a cover of a song by Chico Science & Nação Zumbi, is sort of thrashy, but also quite tribal in nature. With the energetic sitar joining in I actually found myself headbanging to this song at the end. \n\nOne Nation is a thrash-metal cover of Sacred Reich's song from their Surf Nicaragua EP, and a couple of the members lend assistance to Soulfly on this song - so yes this song thrashes! Is it good thrash? The somewhat-rapped vocals kind of put me off, but the riffs are decent enough despite containing the palm-muted downtuned sound that pervades the heavy riffs on this album. I thoroughly enjoyed the solo though. After this is a minute of silence in tribute to the victims of the September 11th terrorist attacks followed a minute of violence in the form of Call To Arms. This song gave me chills, because it is the angriest song on here and having it follow 9-11-01 is a clear message to bomb the shit out of the terrorists. It's a crossover/thrash song, it's frenetic energy is quite refreshing, the only downside being its short length - but its message is clear and concise. \n\nThis album is a definite improvement over Primitive, but it's still not something I see myself meditating to anytime soon. There are still some shining moments, such as the beginning and ending of Tree of Pain as well as Soulfly III, Call to Arms and One Nation.\n",
        "\nThe album opens with Back to the Primitive, that musically isn't too bad for a nu-metal song. Continuing the tribal+nu-metal groove of their debut, this song speaks a message of going back to the state of politics where society was organized in local tribes, rather than an overarching government. Anarcho-primitivism? Unfortunately it quickly goes down hill from here with Pain and Bring it which are two boring nu-metal songs. Though there is some tribal elements in these songs, it's just aggro caveman metal with an attitude problem. Bring it does have a latter half reggae jam that I found enjoyable. A good break from the aggro nu-metal I just had to endure, perhaps it is an apology in advance for what is coming next... FUCK IT I'm skipping it! \n\n...\n\nMulambo's a good song. It's got a diverse array of sounds, quite tribal, the guitars do work in providing a degree of atmosphere to the song aside from the palm-muted groove. The extra tribal percussion melds perfectly with the standard drums, both of them driving the song along with a steady beat. \n\nSon Song was a pleasant surprise, sure it has downtuned heavy guitars and may be somewhat nu-metal but this has Sean, the son of John Lennon doing vocals and he gives an excellent performance! \n\nThen more nu-metal. Boom is substandard aggro-metal, while Terrorist starts off nu-metal but has a vocal guest that is quite familiar - Tom Araya of Slayer. The end of the song picks up in speed, almost like thrash. Nu-metal thrash? It doesn't work here, and Araya's vocals sound like what they were on God Hates Us All. The Prophet has an almost decent sludgy riff for the chorus, and it's not too bad. \n\nThe sequel to Soulfly starts off with the same calm congo drums, but here there are much more elements that come together to form a near perfect harmony with the diverse array of sounds here - I cannot for the life of me name all of the instruments I am hearing, and there is so many... but it is mixed perfectly and wonderfully. There is a backing melody of a piano that accentuates the piece, a soothing voice coming from various wind instruments, an enticing melody from what I think is a sitar. A twang that sort of sounds like a jaw-harp, the moroccas rattle in the background. Nothing is out of place. Why hasn't Max recorded a whole album of this yet?! In a way, he has, assuming Soulfly III through Soulfly VIII are in a similar calm style to this. Just not directly. Perhaps I'll listen to all of these Soulfly instrumentals in sequential order.\n\nIn Memory Of... is a tribal/hip hop/nu-metal song. Sounds like it should be the worst thing ever created but it's not. The lyrics are deeper than what one would expect from rap, although it definitely has a Christian slant toward it. Still not sure if I like it or not, but I don't see myself listening to this on a regular basis. I commend Cutthroat Logic for a rap-performance that I didn't outright hate. Flyhigh closes the album with a beautiful vocal performance by Asha Rabouin, who is related to one of the guys in Cutthroat Logic, and overall the song is one of the solid ones of the bunch.\n\nSimilar to the first record, this album has a first half that is mostly crap nu-metal, with a latter half that is more diverse and less crap. The songwriting overall is better to a degree, but it's inconsistent - there are flashes of pure genius, and farts of pure stinker. Highlights - Soulfly II, Son Song, Flyhigh and Mulambo. \n\nOh, I did skip Jumpdafuckup... sorry Jumpdafuckup, you should go sitdafuckdown in the dunce corner next to Bleed.\n",
        "\nThe year is 1996, Max Cavalera has just left Sepultura after the release of the album Roots and his stepson Dana Wells was murdered. He formed Soulfly and about two years later this album is the result. \n\nLet's cut the shit and get to the shit, starting with Bleed. This is by far the worst song on the album. Bleed may not be the worst song I've ever heard (pretty sure that honor belongs to Nicki Minaj or Rebecca Black), but it is the rock-bottom pit on this album with its vapid aggro-metal grooves, annoying electronic squeal and the wiggerapping of Fred Durst. The first half is dominated by bland and boring nu-metal songs. Eye For An Eye, No Hope = No Fear, Bumba, First Commandment and Bumbklaatt are five songs that I don't give a single fuck about. Bleed only gets excluded for being how terrible it is. Tribe is skipped because it is the first song that I can call listenable. So the chorus isn't exactly mind-blowing genius, and it's still nu-metal, but the idea of this song isn't GRR ME ANGRY caveman metal, but rather a near seemless integration of tribal rhythms with groove-laden downtuned guitar. In future albums, Soulfly excels at utilizing tribal and world music, and those ideas are present here in a primordial state. \n\nThe later half of the album is quite a bit more diverse. Umbabarauma continues the primordial, tribal groove but in a much different way - this being a cover of a Brasilian samba-rock song by Jorgen Ben Jor. At least I think this is \"samba-rock\", it's distinctly Brasilian but has a downtuned hard-rock backing riff that has distinctive 70s hard rock characteristics. Perhaps the most primordial song on the album is paradoxically the most intricate and beautiful - the title track, Soulfly, the first instrumental of a series of instrumental jams that is included on every Soulfly album to date. It's calm melody is backed by a gentle conga rhythm, with very very slight traces of distortion - especially during one of the few guitar solos (there are some, such as on Fire) that appear on the album. Quilombo is a tribute to a 17th century Brasilian slave hero named Zumbi, except it is ruined by DJ Lethal of Limp Bizkit barging in and farting in his awful scratches. Fire is a song in the vein of Tribe that has a distinct guitar sound to it, not quite the same as the nu-metal groove of the other songs, but rather reminds me of the overdrive on stoner-rock songs. The Song Remains Insane is a cover that kills two birds with one stone, both of them hardcore birds, one being Caos by Ratos de Porão and the other Sepultura's song Attitude at a frenetic hardcore pace. No and Prejudice continues the nu-metal of the first half of the album, and though Prejudice has lyrics that are against racism and all that honorable shit, the song still doesn't impress. The album ends with Karmageddon, an atmospheric outro with a tribal beat and some drone over top. \n\nOverall, Soulfly's debut album is not the worst album ever made, but it's no masterpiece. It is disjointed but diverse, there are some good songs on here with the highlights being Soulfly, Umbabarauma, Tribe and The Song Remains Insane. The rest are low with Bleed being especially low.\n"
    ]
}