{
    "Band Information": {
        "Country of origin:": "Finland",
        "Location:": "Jyväskylä, Keski-Suomi",
        "Status:": "Active",
        "Formed in:": "2000",
        "Genre:": "Melodic Doom/Death Metal",
        "Lyrical themes:": "Death, Grief, Loss, Despair",
        "Current label:": "Century Media Records",
        "Years active:": "\n2000-present ",
        "Number of Reviews": 63
    },
    "Band Reviews": [
        "\nDespite the melancholy beauty of the music on offer on Moonflowers, I found it one difficult album to listen to. Songwriter and lyricist, Juha Raivio, has channelled his grief over the loss to illness of his partner, Trees of Eternity's Aleah Stanbridge, into the release and it is a heartbreaking journey through mourning and grief that is genuinely affecting to anyone who has ever suffered the loss of a loved one. A lot of the album is filled with an overwhelming atmosphere of sorrow and desolation of the soul, expressed through quite simple melancholic melodies, clean vocals and ever-present strings with some extremely soulful lyrics that can really cut to the heart in places. Then sparingly, but all the more effectively for it, anguish is unleashed with huge death doom chords and growled vocals, becoming even more desperate and angry by the album's closing track, This House Has No Home, which erupts into black metal-led pummelling as Juha's anger and rage finally explode from the speakers in search of catharsis.\n\nOpening track, Moonflowers Bloom in Misery, starts in gently mournful fashion, softly picked guitar notes, swelling strings and melodic clean vocals poignantly asking \"can you die of a broken soul?\" before exploding in anger with huge, enveloping death doom chords and savage growls replying \"You cry through the fires of Misery! Bleed dry through the nights of Misery!\" as if the pain of loss has just become too much to bear and anger at the injustice of it is all that remains. This, in common with much of the album, is more melodic than most of the band's usual output, but don't let that fool you, this is still powerful stuff and when it does explode it hits like a slap in the face! In a reversal of Moonflowers Bloom in Misery, the following track, Enemy, hits hard with anger and rage from the off and throughout the verse as Juha's lyrics tell of how he withdrew from the light into the darkness inside his soul, becoming softer and more melodic, returning to clean sung lyrics for the chorus as he recognises this darkness within himself.\n\nWoven Into Sorrow is the most gothic-sounding of the album's eight tracks and, arguably, the most accessible as it eschews any death metal vocals and has only brief heavy riffing, at least up until the five minute mark when it unleashes a real gut-punch of a riff as once more Juha's lyrics are no longer able to contain the pain he feels. This is followed by my favourite track, Keep Your Heart Safe From Me, which I perceive as a genuine masterpiece of gothic death doom, expressing in music and lyrics everything that exemplifies the genre in a track that only a few of the masters of the genre can match with it's expression of misery and despair. Oceans of Slumber's Cammie Gilbert supplies female vocals on All Hallows' Grieve, as the lost love speaks to the bereft narrator in a duet that is as heart-rending as it is melodic. I will dispense with the track-by-track review, but suffice to say, the latter half of Moonflowers retains the ability to move the listener every bit as much as the first half, culminating in the aforementioned visceral savagery contained within closing track This House Has No Home as Juha's suffering becomes insurmountable and threatens to overwhelm him.\n\nI think there is an authenticity contained within Moonflowers, as a result of Juha's personal loss, that gives it an edge over many other gothic death doom albums' expressions of mourning and sorrow, which are borne of the songwriter's imaginations rather than personal experience of genuine sorrow. Another important contributing aspect I haven't really covered much is the addition of the string accompaniment from the three ladies of Trio NOX which is present throughout the album and is considered so fundamental to the album's success that the deluxe versions contains an extra disc which contains the string versions of each of the album's tracks to be enjoyed in isolation. The strings add an extra layer of lushness to the sound and contribute to the sorrowful atmosphere in that way that strings do so well when accompanying certain types of doom metal.\n\nThis is, for me, one of the best gothic death doom albums I have heard in a long while and is deeply affecting on a personal level, as well as providing some top-quality songwriting and performance and this personal connection is something that is very hard to achieve but is deeply rewarding when it is successful and, as such, I consider this very successful indeed.\n",
        "\nThe band decided back in 2015 to offer a unique kind of release. A package containing three CDs that can be described as three albums completing all the facets of the band. Gloom, Beauty and Despair are the three titles chosen for these albums, each of them excellently portrayed in their respective parts.\n\nGloom was probably chosen as the word to describe the first album because of its atmosphere, as would be the case for the other two CDs. Gloom in the sense of depression, someone trapped in pain and suffering. This whole first album was partly eerie, sad and did possess a somber expression throughout with the occasional aggressive passages. The general sound of this album was doom, with a bit of pure death metal passages to really hit you when you don't expect it.\n\nSome highlights of this first CD came as a female vocalist in \"Heartstrings Shattering\" that added another layer of sadness to an already sad track. The great use of death metal aggressiveness in \"Silver Bullets\" and \"Silhouettes\" pushes these two tracks into a great contrast with their respective more calm passages. Overall, this first CD gave a good example of when the band mix passages of aggressiveness with calmer tones. In present retrospective, this reviewer understood that the sound present here will be the future sound of the band.\n\nThe second CD named \"Beauty\" could be listened to on a beautiful winter evening with a glass of wine. It started with a piano introduction that leads the listener into a calm state of mind, the exact state someone needed to be to enjoy this part of the release to the fullest. This CD was a more Neo Folk release than a metal album, but it was all the greater for it. \"The Heart of a Cold White Land\" was actually the title track of the entire 3 CDs, since it was also the only time we heard \"Songs from the North\". I found fascinating that a metal band decided to put its title song of such a release in the only CD without any traces of metal at all.\n\nThis CD was my personal favorite part of the release in how each song flowed from one another in the most intrinsic way, giving this CD the complete right to possess the title \"Beauty\". It was such a bliss that I sometime find myself today listening to only this part of the release just for how much serene it was and still is. As you could probably tell, I cannot choose highlights here since the whole of this CD was seamless and genius all around. \n\nIn the third CD, a vision of despair hit the listener right from the beginning. In complete contrast to the preceding CD, the listener will have no time to prepare himself. \"Gathering of Black Moths\" was indeed the perfect track to throw anyone starting its listening session into the right mindset. This whole CD was in the style of \"Death Doom\" in its purest distilled form. Slow and steady rhythm assailed the listener with one of the best death growl in the genre gave an ominous atmosphere of the greatest kind throughout this CD. The slowest track named \"7 Hours Late\" was particularly efficient at giving that sense of dread the style is known for and may be the highlight of this CD while also being so slow it was very close to be only ambient music. I would even add that this track was the perfect representation of barely having something means you have something great.\n\nBarely hearable spoken words completed the delivery of what may be one of the best idea for a more traditional death doom album. I let you discover despair like no other album of its kind can.\n\nThere was some negative during this release that explains why the score I gave wasn't higher. Some tracks like \"Lost and Catatonic\" and \"Gathering of Black Moths\" did repeat themselves too much and could have been cut down by a small amount. There were also some small sacrifices done to variety to confer more easily the different atmospheres during the entire release.\n\nThe production during the entire release was pretty spot on, with no instruments taking too much space or taking too little. We could hear everything perfectly fine and the different vocalist all sounded quite well, even playing into their accent for added authenticity like in the aforementioned \"The Heart of a Cold White Land \".\n\nIn conclusion, I thought of this release not with the general title \"Song from the North\", but with the more specific titles \"Gloom, Beauty and Despair\". These three words did represent the band on this release and was proof enough that the band had known quite well its objective.\n",
        "\nThough no sensible person seeks after tragedy, it can often provide the inspiration for some of the greatest works of art that the world has known. The doom metal movement, in all its various permutations, has often proved to be the most adept at turning the ugliest truth of existence, namely memento mori, into a structure of beauty cloaked in agony. Among the northern European death/doom scene, this concept often focuses upon a more particular mode of calamity, specifically the death of a loved one, and though a latter day entry to said scene, Finland’s Swallow The Sun has been at the forefront of providing an accessible gateway into the woe-steeped dirges of love now lost. Led by guitarist, composer and founder Juha Raivio, himself no stranger to the affliction of mortality, this expansive ensemble of six had embarked upon yet another highly ambitious opus of auditory woe in Moonflowers, an eight song portfolio of sadness with a dense atmosphere and a highly dynamic character.\n\nFollowing two years after the highly acclaimed When A Shadow Is Forced Into The Light, an album inspired by the untimely passing of vocalist Aleah Starbridge, this studio offering draws from the same aforementioned tragic circumstance and functions as a de facto continuation/sequel of sorts. Building off of a slow drifting, minimalist skeleton of lamenting chords, the sound at work here bears a strong resemblance to the symphonic and post-rock driven character of melodic death outfits Eternal Tears Of Sorrow and Insomnium, with a particularly dream-like atmosphere that dovetails a tad more with the Finnish melodeath sound of this band’s mid-2000s contemporaries rather than the murkier old school death metal trappings typical to the 90s death/doom outfits hailing from England and Sweden. Nevertheless, the dank rage of the contrasting brutal elements with the dreary Gothic balladry conforms itself sufficiently to the example of the older guard, specifically that of Katatonia and October Tide.\n\nThe genuine character of this album’s sentimental nature is heavily bolstered by the instrumentation that adorns it. While the two-dimensional expressions of rage and serenity are heavily reliant upon the shifting dynamics of the guitars, bass and drums, the latter is bolstered superbly by a mixture of synthesized atmospheric additives courtesy of Jaani Peuhu and Raivio’s keyboard input and the live string group Trio NOX providing real violin, viola and cello parts to inject a mildly symphonic flavor into what is already a dense arrangement. Likewise, the jagged edges of vocalist Mikko Kotamaki’s deep growls is tempered by one of the smoothest baritone croons this side of the metal spectrum, further defining the borders of this musical exposition of opposites. It should likewise be noted that both Raivio and somewhat newer second guitarist Juha Raiha are not wholly averse to dabbling in more technically advanced territory from time to time, though the bulk of their interplay dances between a spacey post-rock flavor and a dank, sludgy stomp.\n\nDespite strictly adhering to the principles of death/doom, each song revels in its own unique take on mixing a depressive gloss with a beautiful melodic contour. On the dreamier side of the equation and definitely drawing heavily from the same idea well that Insomnium frequents stands a series of longer offerings in “Woven Into Sorrow” and “The Fight Of Your Life” that all but cry out Aleah Starbridge’s name with teary eyes while weaving a picturesque assortment of acoustic and smooth orchestral motives, flirting with what one might call death/doom’s version of a power ballad. By contrast, the largely aggressive and simpler performance put on via “Enemy” and the somewhat swifter and busier epic “Keep Your Heart Safe From Me” afford the band’s metallic end some needed time in the moonlight. But where this album truly shines is when things are either brought to an absolute fever pitch as one the agitated blasts and shorter respites of album closer “This House Has No Home” and the highly infectious and closest thing that this style could get to a banger “The Void”.\n\nAs with most continuation of a work of unbridled greatness, this album doesn’t quite capture the same level of brilliance as its immediate predecessor, but it gets about as close as one could have hoped. The only area where it arguably outclasses When A Shadow Is Forced Into The Light is in the ambitiousness of the arrangement, which is underscored by this album coming with a second CD containing all eight studio songs rearranged into a classical, instrumental format that further conveys this album’s sorrowful source of inspiration. In a sense, Raivio and the rest of Swallow The Sun have outdone themselves here, though ultimately their 2019 album holds the edge in terms of how concentrated and effectively the looming ghost of the recent past has been communicated. Nevertheless, a fine offering that is sure to appeal equally to old guard fans of death/doom and also melodeath trustees who don’t mind their favorite style played at a considerably slower pace.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nMelodic doom masters Swallow the Sun have just released their eight full-length album, Moonflowers, which came out on 19th November 2021 via Century Media. The new album follows what many consider to be the pinnacle of the Finnish band’s career so far, 2019’s When a Shadow Is Forced into the Light, a gorgeous, dark record suspended between doom/gothic metal, prog and post-rock and packed with tremendous emotional intensity due to the dramatic events that inspired its songwriting (the untimely death of Juha Raivio’s partner, Aleah Stanbridge). Written entirely by Raivio and recorded by the same line-up as the previous album (minus keyboard player Jaani Peuhu, who here only provides backing vocals), Moonflowers draws inspiration from the same sorrowful place as Swallow the Sun’s previous LP and it can be considered in many ways its lyrical and musical continuation. There are subtle differences in mood and style, though, which ensures Moonflowers tells its own tale of pain and sorrow and does not just replicate what had already been told by the previous album. \n\nThe 8 tracks of Moonflowers tell the intimate and unashamedly personal tale of Raivio’s pain and depression triggered by the loss of Aleah, symbolized by the album’s shocking cover art that Raivio painted with his own blood. The music perfectly captures this dark mood: it is slow, oppressive and full of dramatic contrasts. The songs swing continuously between minimalistic sections dominated by delicate guitar arpeggios and beautiful string arrangements, and violent accelerations with distorted guitars, devastating growls and blast beats. The music feels intentionally unadorned: drums and bass often play very simple patterns, sticking to the beat without too many embellishments. The keyboards are also used sparingly and even the guitar riffs are used in moderation, leaving arpeggios and simple, forlorn leads take the spotlight. \n\nThe other main ingredient of the album are the string arrangements played by the Trio N O X, a Finnish group of classical musicians playing violin, viola and cello. The symphonic flair provided by the strings is probably the most distinctive aspect of the album that draws a clear distinction relative to its predecessor. The strings greatly contribute to the dramatic atmosphere of the record and provide a stark contrast with the rest of the electrified instrumentation. With all these elements in place, the album offers a near perfect combination of all the elements that Swallow the Sun have been incorporating into their sound for years now, from the sludgy tempos of doom, to the ferocity of black/death metal, to the romantic atmosphere of gothic metal, to the mellowness of post-rock and the sophistication of progressive metal.\n\nDespite the common lyrical and sonic themes, there is a great deal of variation across the 8 tracks of the album. The record opens and closes with what are the most intense and dramatic pieces of the whole LP. “Moonflowers Bloom in Darkness” is probably the best track here, opening with a sombre, disheartened waltz that suddenly explodes in a stunning blackened chorus where Mikko Kotamäki’s pained vocals paint an all too real image of the “fires of Misery” he sings about. Album closer “This House Has No Home” follows a similar inspiration and reconnects also lyrically with the opener. This is probably the bleakest and most forlorn piece of the record, to the point that it almost hurts to listen to it. “Woven into Sorrow” is another slow-burn piece that follows similar musical coordinates, accentuating the doom/death component of the music. Elsewhere Moonflowers softens its stance and lets the gothic undertones of the music come more to the fore. “Enemy” and “The Void” are the most accessible tracks on the album, with gorgeously catchy vocal lines and a sense of melancholy that brings to mind the best work of Katatonia. “All Hallow’s Grieve” is another beautiful and incredibly melodic gothic piece that represents the emotional peak of the record. The song also stands out for Cammie Gilbert’s (Oceans of Slumber) cameo, her soulful voice playing a perfect counterpoint to Kotamäki’s forlorn crooning. The guitars shine on this track too, from the stunning arpeggio that opens the song to the howling guitar solo that brings it to its climax. \n\nMeanwhile, on “Keep Your Heart Safe from Me” and “The Fight of Your Life” the band experiment with more complex, long-form compositions, alternating acoustic sections with heavier parts (big Opeth vibes here) and playing with subtle atmospheres and mood shifts, rather than relying on melodic accessibility. I’ll be honest – these tracks do not grab me as much as the rest of the album, to the point that I feel the record drags a bit through their combined 14 minutes. This is probably the main weakness of Moonflowers: despite all its splendour, the album does falter in a couple of episodes and its songwriting is not as homogeneously stellar as that on When a Shadow Is Forced into the Light. Strong tracks like “Moonflowers Bloom in Darkness”, “Enemy”, and “All Hallow’s Grieve” are counterbalanced by more inaccessible episodes, like the two songs just mentioned, but even “This House Has No Home” and “Woven into Sorrow” feel bleak and forbidding in comparison. \n\nThis unevenness underscores even more what is probably the true essence of this record: Moonflowers is no easy listening material. It’s dark, dense and desperate music, to the point that Juha Raivio himself confessed to find it hard to listen back to these songs after having recorded them. His pain feels raw and real and, as an outside listener, it almost hurts to be its witness. There is a raging fury smoldering underneath the album’s 52 minutes that has all but replaced the sweet romanticism of the material contained on When a Shadow Is Forced into the Light. On that album, the loss of the loved one was tempered by the remembrance of her love, Aleah’s spirit still very much present in every note. That presence is now gone, extinguished, and Moonflowers sings of absence, rather than of loss. The difference is subtle, yet dramatic and crippling. It explains why the music can sometimes feel so difficult, unadorned and barren. Therein probably lie both the greatest virtue and flaw of the album: the thick gloom and rage that transpire from Moonflowers can be intoxicating, but also taxing and emotionally draining for the listener as much as for the man who wrote the music, and while I just couldn’t get enough of When a Shadow Is Forced into the Light, I can only take Moonflowers in small doses, separated in time. \n\n[Originally written for The Metal Observer]\n",
        "\nIt might sound harsh but Juha Raivo's musical creativity had been pushed to astonishing limits after the tragic death of his partner Aleah Stanbridge, resulting in masterpieces such as Swallow the Sun's experimental single Lumina Aurea and the conceptual record When a Shadow Is Forced into the Light. Five years have passed since that tragic event and Swallow the Sun has now released a new output with Moonflowers. While the record has all the trademarks of its predecessors, it's however missing that desperate creative spark that made the preceding releases so authentic, experimental and unique.\n\nThe opening quasi title track ''Moonflowers Bloom in Misery'' is by far the greatest song on this output, meandering from atmospheric traditional doom metal to unchained funeral doom metal with energetic harsh vocals that send shivers down the spine. This is a song that should also appeal to any black and gothic metal enthusiasts and anyone looking for an authentic soundtrack for desolate autumn nights and cold winter days. This intensity is only achieved again in the closing ''This House Has No Home'' that has an even more disturbing atmosphere because the transitions between the different parts are more sudden and less fluid.\n\nIn between these two songs, the band often slows things down and flirts with depressive rock soundscapes reminding of the middle years of Paradise Lost or current outputs by Katatonia. ''The Void'' for instance has a hypnotizing, numbing and sorrowful atmosphere that might take a few spins to grow but has the greatest replay value on this output. Guest singer Cammie Gilbert of American progressive metal band Oceans of Slumber who has recently been performing on Ayreon's superb conceptual masterpiece Transitus, appears on soulful ballad ''All Hallow's Grieve'' that would have been all the rage twenty years ago when bands like Evanescence, HIM and Nightwish had their most commercially successful moments.\n\nThe main issue with this release is that some of the eight songs fail to stand out and are lacking a creative spark. They fail to leave a mark even after multiple spins. This is a flaw that weighs an album with only eight tunes down here and there.\n\nMoonflowers' highs are however remarkable and while it can't compete with its immediate predecessors and their consistent atmospheres, Swallow the Sun is still one of the most creative doom metal bands out there. Patient listeners will be rewarded since several tunes have the potential to grow as time goes by. At the end of the day, Swallow the Sun's Moonflowers is a very good album but a slight step down in the band's impressive career.\n",
        "\nThis album has never been the most popular release from this band. However, it is my favorite album from them. I have always loved Swallow the Sun's very intensively emotional slow and heavy metal. And I think this album is the slowest, saddest and the least commercial. But I can understand Ghosts of Loss is not for everyone. Many people have called it's lengthy slow sections boring but for me, they are perfect. The songs build up dramatically to the point where they are touching and intense at the same time. \n\nThe Giant begins the album with a combination of mournful clean parts and some of the heaviest riffs of the album. The song develops into these keyboard driven heavy and beautiful parts which build up into a very dramatic final. The opening track is a journey by itself and a classic Swallow the Sun masterpiece.\n\nDescending Winters and Psychopath's Lair are a bit faster and shorter tracks for Swallow the Sun. Many regard them as the best songs on the album but for me, they are the weakest. I don't mind them but to me, they're more like your average mid-paced groovy metal songs and if that is your thing, you'll probably like them.\n\nAfter the three first songs the rest of the album is absolutely beautiful. The songs are slow, mournful, very sad and epic. Instrumental parts meander without any hurry developing these melodic themes from quiet sections to these heavy and slow, almost funeral doom esque gloomy passages into the epic outros.\n\nOne thing I want to give attention on this album is Pasi Pasanen's drumming. His playing is very skillful and tasty. He is not overdoing it but he keeps the rhythms interesting while still playing like you would expect a doom metal drummer playing, slow and minimalistically accenting the glacial tempo of the songs.\n\nThis album is not a banger. It does not have a lot of energy and it is not very catchy. Its qualities are elsewhere, like in the composition and the atmosphere. I can recommend this album to those who want to explore the more atmospheric and slow sides of metal. Personally, I get touched by a lot of these songs (The Giant, Forgive Her, Ghost of Laura Palmer and The Ship have moved me close to tears).\n",
        "\nI found this CD in a pawnshop whilst my band was playing a string of dates in the Mid-West US. I had never been much of a Swallow the Sun fan, having seen them a few times live, opening for some larger acts like Amorphis; they never really caught my attention. This was one of those CD buys that were more about finding a metal disc amongst the common pawnshop drivel of rap and dance hits. It was a few weeks after getting home, that I finally got around to actually listening to the damn thing, and man! I was immediately mesmerized. \n\nThe first of two tracks, 'Silent Towers', is a short 4-minute song, that spends most of its time alternating between acoustic/clean guitar and distorted guitar passages with the vocals following suit with Mikko Kotamäki's awesome shifts between bard-ish cleans and sick guttural growls. The tone of the song reminds me of my fellow countrymen Woods Of Ypres, as well as Katatonia and Paradise Lost, while definitely crafting their own unique sound in general. The second song though, 'Cathedral Walls' was the one that sold me on Swallow The Sun being a band that I must pay attention to. Not to mention I bought the full-length right after listening to this single track. First and foremost I will mention that Anette Olzon (Nightwish at the time, The Dark Element now) crushes the chorus with her angelic voice. This song, being just shy of 7 minutes, starts off with an arpeggiated passage under a sombre guitar harmony, leading into a very Katatonia, very sorrow driven verse section, and breaking down to a My Dying Bride like doom. This is just a barrage of Mikko's grim growls and Kai Hahto's seamless transitions between rock beats, sludge, and tight double kick. Finally coming back to Anette's chorus, and some sinister doom to close it all out.\n\nI can't praise this single enough for opening my eyes to Swallow The Sun. I have since bought a good deal of their back catalogue, and that can be directly attributed to me listening to this single on repeat a million times. This is more of a collector's item, but the full-length, Emerald Forest and the Blackbird, contains both songs and is equally as stellar.\n",
        "\nI've seen it bandied about online that When a Shadow is Forced into the Light, the seventh album by Finnish death/doomers Swallow the Sun, is part of a clandestine trilogy of albums concerning the death of longtime StS backing vocalist Aleah Stanbridge, and when you think about it, it totally makes sense. When paired together with the previous two albums in this apparent trilogy (Hour of the Nightingale by Trees of Eternity and No Stars Upon the Bridge by Hallatar), When a Shadow is Forced into the Light absolutely feels like the conclusion to the \"story\" the albums tell, that story being primary composer Juha Raivio's attempt to come to terms with the loss of his lover and creative partner. There's a natural flow to the music on all three albums; Hour of the Nightingale is an exceptionally melancholic, sorrowful record, while still retaining an odd warmness to the proceedings, while No Stars Upon the Bridge is a bleak, hopeless, emotionally miserable, seemingly angry record, as if Raivio's sort of letting out his frustrations with the situation through the music. This is where When a Shadow is Forced into the Light comes into the picture, as it's kind of a mixture of the sounds and overall emotions of the preceding two records alongside elements faintly identifiable as Swallow the Sun, and it all works in tandem with one another in the most incredible way possible.\n\nIf we're viewing this record as part of a stealth trilogy with the previously mentioned records, it's only fitting that of the three albums, this one has the fewest Aleah handprints to be found. Not necessarily just in the fact that she had been deceased for nearly three years by the time of release and whatever creative remains of hers that were left behind are a finite resource at this point (she is credited with songwriting and lyrics on \"Clouds on Your Side\", but that's it), but also that, in the context of the emotional journey of the trilogy, Raivio seems to slightly, finally, be coming out of the haze that was suddenly losing a loved one. Don't get me wrong, every single second of When a Shadow... concerns itself with Aleah, but it's through a lens of recovering and starting to move past the tragedy rather than allowing it to envelope you every waking moment of the day as No Stars Upon the Bridge did. Chapter Three of Juha Raivio's musical therapy is a cathartic release of all the lingering feelings he has had towards Aleah's death and the uncertainty that comes with such an occurrence, a slight reflection on the events that led to this point, and this is most identifiable by the near complete lack of musical elements that made Swallow the Sun identifiable as such for so many years. This is the sonic outlier in StS's catalog, as it's more a much heavier and darker take on the style Trees of Eternity played than anything resembling past StS material. Gone are the chuggy guitars and noticeable melodic death metal elements, replaced by lush, thick chords and the most keyboards I can ever recall on a Swallow the Sun record. More than ever before, the keyboards and guitars work in near perfect tandem to create this lush atmosphere of wondrous majesty, akin to standing in a field at night and looking at the sky, with the pianos and strings complimenting the chords and lead lines behind Mikko Kotamaki's increased use of clean singing, which fits the music like a glove. His growl is still used throughout, and aside from the lead guitar lines is the most Swallow the Sun thing about this album, but it's only sporadically used, and some songs completely eschew growls in their entirety, such as \"The Crimson Crown\" and \"Never Left\". He's accompanied by harmonies and occasional lead vocals by keyboardist Jaani Peuhu, a welcome addition to the group who I hope gets to showcase his lush vocal tones more on future releases.\n\nThe songs are also the slowest the band have ever penned, aside from the Despair disc on Songs from the North, which is similarly sensible when you look at the album as being Swallow the Sun viewed through the eyes of Trees of Eternity. I'd wager to say that Despair was also something of an influence on the more downtrodden nature of this record, although nothing on When a Shadow... approaches that record's funeral doom experiment in terms of crushing slowness. The drumming here is still involved and full of flair, a common thread on every StS record from the very start, although Juuso Raatikainen is a bit more restrained than he was on Songs from the North's Gloom disc, which I'm sure is a symptom of the music being much less melodeath and more ethereal, kinda shoegazy doom metal. Still, while double bass is a rare thing to behold here and blast beats are nonexistent, he still shows character and exceptional skill in his playing, and that's more than acceptable for this collection of songs. The production quality stands up as the best of the band's career, with every element perfectly leveled and with just the right amount of effects to enhance, but not overpower, the experience. StS have always had exceptionally great sounding albums, with not a single one of their records except *maybe* New Moon sounding less than excellent, but this one takes the cake. One of my hopes for this record is that it becomes a blueprint for how death/doom records should be mixed in the future, as this is just about the most perfect sounding doom record of its kind I can think of. It's the logical production conclusion to not just where Swallow the Sun started on The Morning Never Came, but also the logical conclusion for death/doom production dating back to the renowned early Peaceville Three records of My Dying Bride, Paradise Lost, and Anathema. Every future Swallow the Sun record could be produced identical to this one and I'd be completely satisfied with that, especially since I'd love to see how this more spacious, massive production style works with a more standard sounding record they would potentially make in the future.\n\nThere's an existential question that exists in the heart of When a Shadow is Forced into the Light, and it's a question that's simultaneously quite simple, yet intensely difficult to even think of in the moment, and very relatable for anyone who has gone through a deep personal tragedy as Raivio has in the death of Aleah: How difficult will it be to move on? The attempt on his part to answer that question is the driving force behind When a Shadow..., and through the music we learn the answer to his plight. Moving on from your partner's untimely death is really, really difficult, and a seemingly insurmountable task at times, but it is entirely possible to begin to rebuild your future minus the presence of that which you were certain you'd have by your side forever. It's a scenario millions and millions of people throughout time have had to go through, and millions more will ask in the future. People die. It is a fact of reality. It happens every single day, hundreds of thousands of times a day. Who dies is up to the universe, and sometimes that person that dies is someone you love. That cannot be changed no matter how much we may want to go back in time and prevent it from happening. What matters beyond that is how one can regroup and make peace with what happened. For Juha Raivio, if When a Shadow is Forced into the Light is any indication, I hope he has found the peace he so clearly, desperately desired and can begin to move on, even if it's just through minor steps at first. This record was the apparent first step in his recovery. Where he and Swallow the Sun will go in the future is not musically certain, but what is for sure in this moment is that When a Shadow is Forced into the Light is the absolute triumph of Swallow the Sun and Raivio's careers, and topping this monumental, breathtaking record will be the steepest hill possible to climb. I have full confidence he can do it.\n",
        "\nThere's a certain emotion that very, very few bands are able to instill in me - a sense of pure wonder so powerful that I'm forced to drop everything I'm doing and just listen to the music in awe. It's the same profound fascination I get from staring at the stars in a night sky, a oneness with nature and the world around me. It makes me ponder existentialism in the best way possible, filling me with determination and reinforcing my goal to make as much of my life as possible. Since we're so insignificant in the grand scheme of things, we can forge our own purpose and get as much fulfillment out of our short time on Earth as we can. Ultimately, it makes me grateful to be alive.\n\nParadoxically, the only record to come out of 2019 that's evoked that feeling in me is probably the darkest of them all. At its core, the album is a harrowing expression of the emotions which followed the death of main songwriter Juha Raivio's wife. However, that's not all there is to it. Abounding despair shrouded every moment of the conception of When a Shadow is Forced into the Light, but rather than embrace the hopelessness as so many other doom acts would, Juha created the album as, in his own words, \"a weapon for myself, a burning torch, victorious and proud.\" So that's what this is really about. It's fighting back against the shadows that surround you, it's finding the hope in despair and the wonder in bleakness. \n\nAs personal of a concept as that is, though, it wouldn't have meant anything if it hadn't been executed well. Luckily, 'well' doesn't even begin to cut it here. The instruments create an otherworldly atmosphere unlike any other I've heard before while the lyrics create emotions ranging from despair and resignation in the brutal title track to the aforementioned existentialist wonder in The Crimson Crown. The vocals are brilliant all around - Mikko's blackened screams convey pain perfectly while his more mellow cleans can express a range of feelings, from solace to acceptance to longing. The guitars provide a strong foundation, a constant source of melody but also impactful heaviness. They control the pace of the album, either driving it forward or slowing down to allow moments of introspection.\n\nAdditionally, the lower end is really given room to breathe and shine. There's several sections where the guitars completely drop away and allow the subtle synths and bass to take the lead. As seems to be a theme on the album, this element is used in incredibly varied ways. The quiet sections in The Crimson Crown immerse you in a strange fantasy world; it feels expansive and makes me ponder the infinite reaches of our cosmos and what wonders there are to be discovered out there (an effect added to by the lyrics which tell a fantastical creation story - in fact the chorus of this song is where I first felt that profound, enlightened awe I mentioned in the introduction). This couldn't be more different from the quieter parts in Firelights. These are flawlessly designed to invoke unease, combining distorted bass, whispered vocals and the subtle integration of a bell tolling. It's once again completely unworldly, but this time you're not entering an oasis of wonder, you're trapped on an island in an ocean of nightmares. This world has only ever known bleakness and death, and it's up to you to fight back. To find the firelights.\n\nUltimately, I could sing this album's praises all day. I could dissect the meanings and subtleties woven into every track, but that'd make the review too long. There's highlights everywhere, too many to list, and the experience is in equal parts intensely heartfelt and painfully harrowing. The style stays consistent throughout but new elements are added just often enough to keep it varied, my favourite examples being the cellos and violins that come in on Stone Wings and the uplifting narration that ends Clouds on your Side. I'll be honest, the latter track had me in tears by the end. A softly spoken passage in the language of romance, a reassuring message of perseverance written by Juha's wife... it's beautiful. Here Aleah Starbridge's soul is living on through her words, shining radiantly to give her lover the courage he needs to face a world without her. Death may be stronger than life, but love is stronger than death.\n\nBefore now there were eight metal albums I'd ever deemed worthy of a perfect score. I've just found the ninth.\n",
        "\nSwallow the Sun are a band with a pedigree of grandiosity, melodrama, and atmosphere. This album lacks none of these, yet still finds ways to pale in comparison to earlier releases like Songs From the North, or the debut The Morning Never Came. It felt like the band was treading water for this record musically speaking. The melodies on this record are certainly there. They show up especially in the vocals on tracks like The Crimson Crown and Upon the Water, where lead vocalists Jaani Peuhu and Mikko Kotamäki interweave and harmonize well. Both are pleasant tracks and connected with me strongly at times. Another track, Firelights, has a similar vibe in its slowed tempo, melodic guitar passages and dramatic/introspective lyricism.\n\nThe production and atmospheric touches on the record also work for the most part. I never noticed any glaring detracting parts of the production. I would say that a main issue for me through multiple listens would be the lack of standout moments. The only exception to this would be the opening moments to the final track Never Left, the guitar build up felt pretty satisfying to hear, but it unfortunately failed to continue the momentum into the main body of the track. Besides that, each track flows into each other with similar structures and melodies, and the end product as a whole suffers for it. If you’ve heard the first track, you’ve kind of heard them all. The harsh vocals are hardly memorable, only showing up for a few lines throughout tracks, or as backing vocals. The context of the record, however, does put a lot of emotional weight behind the tracks and it’s lyrical content. Lead male vocalist Jaani Peuhu had lost his partner prior to the recording of the record which puts into perspective the heaviness of the lyrics and their delivery. It mixes a sense of mourning, despair, with a slight feeling of hope. It's an album about processing grief, perhaps taking one’s “Shadow” and “forcing it into the light” Is a metaphor for working through those difficult and harsh moments in our lives. I felt that lyrically as a whole the album spoke to me in that regard.\n\nPrevious Swallow the Sun records were not immune to the monotony issue that this record faces. Their previous record “Song From the North” was a triple album that was able to hide some of its flaws behind that fact, but had multiple tracks running into each other and blending together. Take away the novelty of the three disc project and you get “When a Shadow is Forced into the Light.” A powerful message about how one deals with and works through loss, grief, and emptiness, sandwiched between lackluster songwriting and song structure. It’s overall, not a bad album, in fact it will draw a lot of listeners in with the pleasant melodies, and easy to connect with concept. I just struggle with the record’s lack of memorable moments and feeling of “I’ve been here before.”\n",
        "\nAt this point in metal history Swallow the Sun doesn’t need any introduction, considering they’ve established themselves as a respectable melodic doom/death act with a consistent output. Back in 2005, though, they were still relatively unknown newcomers, who released Ghosts of Loss to rave reviews everywhere (I mean, as far as underground publications and websites go). It was a disappointing experience for me, however, as somehow I wasn’t feeling it. Yes, very aptly as this comes from Finland, there’s a bleak cold atmosphere wrapping all of their songs, so much so, in fact, that it was as if I was listening to them across a thick wall of ice. Neither the vocals nor the riffs seemed to come through and hit me as strong as did their fellow countrymen of Rapture, for instance, or their almost neighbors of Slumber, both melodoom bands who had also recent releases back then. So, now, 14 years later and feeling more mature, I went back to them to give them another chance... and I still can’t see the appeal!\n\nYou see, it’s not that Ghosts of Loss is bad. STS are a very talented band. I don’t recall even a single moment of cringe-induncing amateurish badness or of it causing me any hair-ripping annoyance, and everything here is well done, maybe even too well done—surely with songs this long, one of them titled “Gloom, Beauty and Despair” (I mean, seriously? this is like when My Dying Bride at a particularly uninspired moment named a song “The Blood, the Wine, the Roses”), accusations of trying too hard aren’t below them. As you press “play,” you’re greeted by the supposedly melancholy clean guitar intro of its 11-minute epic “The Giant,” together with dramatic clean singing. They both soon (and quite suddenly) give way to a heavy guitar riff and harsh vocals—which come in two flavors, either deep, hoarse shouting or, occasionally, black metal raspy style—to let you know that, yes, they’re that kind of doom band. As they go back and forth with this quiet and loud dynamic, by the time the heavy guitar is back around the 4th minute, they have already lost me. I don’t know if the riff is too uninteresting, if the guitar tone lacks power, the production is too clear or the clean vocal’s too monotone and incomprehensible (they’re harder to understand than the growls), but I’m not pulled in by this atmosphere at all, and trying to pay attention to it feels painful. And it’s not that there isn’t enough things happening, on the contrary, there’s maybe even too much at once sometimes—as the song comes to its 10th minute climax, you’ll have a Cult of Luna-style riff playing with growls over it, as the other guitar gives some melodious licks and the synths provide some extra texture. And yet... nothing. I feel absolutely nothing. Considering the consensus on the status of “The Giant” as one of the best songs here, this is a bad omen for my experience with the rest of the album.\n\nMy attention is piqued for an instant during “Psychopath’s Lair,” however. Its mid-paced main riff seems to come straight out of 1999-2001 era My Dying Bride, and the brief melodic lead during the chorus is exciting, but the whole doesn’t come together well enough for me to consider including it in my “songs I actively want to listen to” list. Maybe it’s the vocals? For a song about a psychopath (I don’t get it if it’s written from the point of view of the psychopath himself, who weirdly refers to himself in the third person, or if it’s an Igor-like helper who will drag the woman to this master’s lair), I surely don’t get much of a threatening vibe neither from these ethereal, languid clean vocals, nor from the equally monotone growls. The lyrics are a little goofy too (“Wash your hands (...) / I’ll serve you food”), which certainly doesn’t help.\n\nPast “Descending Winters” and “Psychopath’s Lair,” the fastest and shortest songs in an album otherwise devoid of much variation in mood or tempo, it’s a slow trip now to the end of the Ghosts of Loss, with songs clocking in between 7 and 9 minutes. Expect more “intense” moments with heavy riffs backing these monotone growls, twinkling clean guitars backing clean vocals, occasional simple keys and that thinny lead guitar flopping all over the place. The horribly titled “Gloom, Beauty and Despair” changes things a bit by starting with clean guitars under the black metal-ish vocals that sound so distant it’s like they’re coming from two blocks away, and it goes on for 3 whole minutes before it gets heavy—the heavy part then being so unrelated it’s pretty much another song altogether. Its denouement is the closest thing to a memorable part in this album, though, as the lead guitars actually go for a touching melody. \n\nYou see, for a melodic doom band, there isn’t really that much melody in the leads, especially when compared to other bands of their league, like Rapture, Slumber or Daylight Dies. Hell, there’s less melody than in just regular (that is, not labeled “melodic”) classic doom/death albums even, like Gothic. And that’s an issue because the lead guitar is the one carrying all the melodic weight here, considering both vocals are monotone and unemotional and the riffs are there merely for rhythm, rarely going for anything memorable. As I listen to this for the umpteenth time to write this review (you can’t accuse me of lack of effort), I see a comment on YouTube on “Descending Winters” that says this song played speeding up sounds like melodic death, and, by the gods, that’s true. At 1.5x speed, it’s a decent melodeath tune, which also applies to all other songs, but as doom, it’s all a complete bore to me. That’s a terrible insult one may lob at a doom band, but it exposes what’s perhaps the crucial issue here: one can’t shake the feeling these songs were written as melodeath songs slowed down.\n\nAnd so the whole the album goes plodding by. Again, there’s not a truly bad moment, but there’s nothing that shines either, the perfect example of doom elevator music. If you’re anything like me (and there’s one way I am alone here), I can’t recommend Ghosts of Loss at all. There is better stuff by STS later on their career.\n",
        "\nOccasionally, there are rare instances in which the cliché that great misery inspires great art proves to be true. Swallow The Sun’s seventh album ‘When A Shadow Is Forced Into The Light’ is one of those instances. Rhythm guitarist and main songwriter Juha Raivio lost his wife, South African singer Aleah Starbridge, to cancer at the much too young age of 39 and her absence is felt throughout the album. Being a Finnish doom/death metal band, Swallow The Sun was never the most cheerful bunch, but the beautiful melancholy on display here gives the album its unique character within the band’s discography.\n\nEven without knowing the story behind the album, one thing stands out immediately and that is the profoundly sad gothic atmosphere that defines a large portion of the album. There are still outbursts of extreme metal, but tracks like ‘Upon The Water’ and the gorgeous ‘The Crimson Crown’ are so full of arpeggiated clean guitar chords that they feel stylistically closer to Fields Of The Nephilim’s masterpiece ‘Elizium’ than to anything Amorphis ever released. In a way, the album reverses the process of ‘Songs From The North’ (2015), on which the band gave different discs to each aspect of their sound.\n\nBringing those extremes back together has really done wonders for the dynamics on ‘When A Shadow Is Forced Into The Light’. Mikko Kotomäki utilizes his deep, clean vocals for a majority of the album, but he is backed by electric guitars almost exclusively. These alternate between the aforementioned clean chord work and beefy doom riffs that are notably more spaciously produced than the guitars on the band’s earlier works. It helps that the riffs are significantly less chord heavy than on their previous albums; the single notes can really ring through with the intensity they should have.\n\nWhile an album like ‘When A Shadow Is Forced Into The Light’ is best listened to in its entirity to let the atmosphere carry you away, anyone into the darker spectrum of music needs to hear ‘Stone Wings’. The song is mainly carried by a Nephilim-esque eye-watering guitar part and has what is probably the most hauntingly beautiful chorus released this year. There is a more extreme middle section, but even that part of the song is quite melancholic. By comparison: the aggressive middle part of the otherwise sorrowful ‘Firelights’ is the closest the band has ever gotten to black metal. Elsewhere, ‘Here On Black Earth’ contains a surprisingly dynamic guitar arrangement.\n\nNo, ‘When A Shadow Is Forced Into Night’ is not an easy record to listen to. It is in the sense that it’s probably the most accessible album Swallow The Sun has released thus far, but the feeling of loss hangs over the album like a pitch black cloud. As a result, the album is not for the faint of heart, but it is in fact the best record the Finns have released thus far. Its superior flow helps too; many of their earlier albums were difficult to listen to in one setting, but once the piano and string laden closer ‘Never Left’ extinguishes, I have been captivated for 52 straight minutes. One of the better metallic releases of 2019. Highly impressive.\n\nRecommended tracks: ‘Stone Wings’, ‘The Crimson Crown’, ‘Never Left’\n\nOriginally written for my Kevy Metal weblog\n",
        "\nA breath of ancient air flowed through the crack as we finally opened the heavy door of the tomb. It carried an almost imperceptible scent of wilted flowers with it, and washed over us like a wave of cherished memories that were already changing their character. The artifacts, left where they were centuries ago, had been meticulously arranged into a most beautiful scene, and everything spoke of love long gone, but never forgotten. It was time to dust the items, catalogue them, and try to find the deeper meaning of it all.\n\nThe tomb had an inscription on the heavy slabs of stone forming its entrance. It took us a while to decipher the meaning behind the meticulously chiseled hieroglyphs, but it spoke of a Shadow, stepping into the Light, and as such, it held a measure of alien poetic beauty, the deeper meaning of which escaped us for the time being. And indeed, the interior of the hall was a work or art inspired by love undying, a testament to something of immeasurable value lost in the tragic and unyielding sands of time and eternal twilight. The intricate frescoes on the wall adorning the slow melodies of the hall with strings and choirs, the overarching feel of grand architecture laying the weighty foundation for the almost symphonic design, and the feel of memories etched into every detail of the songs all spoke to us. The words came from the bottom of a scarred heart, already healing, but also one that would never be the same again. It was all intertwined with folkish scenes and somber moments frozen in time, crafted to perfection, and left as an enduring memorial to loss, and the pain of healing.\n\nWe took our time to wonder at the beauty in front of us, immersing our minds in the scene before touching anything, for fear of spoiling the carefully arranged atmosphere. But it was our purpose there to read into the unwritten story behind the collection of art, and to dissect its inner logic, to read the wordless story behind it all. And that we did. The architect was a familiar character, someone who had designed other works of grandeur we had excavated in the past: his works were always thoroughly thought over and balanced designs of awe-inspiring echoing corridors, grand galleries that made us feel small and vulnerable, and humblingly massive façades full of beautiful details. But the last three had been different: they felt personal and heartfelt, yet also like the stories behind a soul worn raw and bloodied by fate.\n\nIndeed, where the first monument we found almost half a decade earlier, clumsily transcribed by yours truly as The Moment of the Nightingale, was a wonderful and soaring, yet sentimental and melancholic edifice with slender arches and a sky full of stars as its ceiling. It was the artistic interpretation of the nocturnal song of its namesake, and voiced with its soft tones the sorrows and fragility of existence. It was full of beauty and the first emotions after loss, and the woven tapestries that formed its lithe walls and cloud-like ceiling were almost translucent in their tearfully tragic mourning of the fleeting moments of happiness. It was a melancholic structure, but not dark or woeful, and far from expressing despair. It had hope and cherished memories as the mortar between its blocks of stone.\n\nThe second monument we unearthed, named The Bridge of No Stars as we managed to translate its coarsely hewn cartouche, was a raw and cruelly heavy colossus, brutally carved out of the jagged rocks on the bottom of the architect's ruined heart. It held no tapestries, and just a few flecks of beauty were ingrained in its textures, in the form of the mementos of the lost one's songs. The murals were mercilessly dark, painted in black and deep charcoal gray, and their shapes were painful for the eyes to witness. The unfinished rocks were obviously laid by a mind in the throes of deep sorrow, and they bore the imagery of lament too heavy to put to words alone. It bordered on the structural expression of the horrendous tradition of mortification of the flesh, expressing regret and grievous guilt. During the excavation, we felt the weight of the builder's lamentation and the passive aggression at the unjustified transience of life and love.\n\nAll three of the monuments are architectural wonders, and their significance ranged from the beauty of a new Taj Mahal delicate enough to appear suspended in air, through the ruined, cruel and eerie magnificence of the jagged remains of dark and colossal Luxor built of black stone, to the latest intact tomb of a love of a lifetime and the private and vulnerable private grief entombed in it. The newest find seems like the work of a mind that has passed the worst turmoils of sorrow, repenting and bewailing, and appears to finally be reaching a new balance and acceptance. A journey of trial and solitude seems to have ended. We can only hope that is the case.\n\nFor what would be the next thing we unearth, should the theme continue its present course? If the lament never ended, and the ancient architect never found another source of creative power? If he stayed the course, never let go, never found a path across the stony desert of grievance? Verily, there is a risk of a new ruin, a macabre continuation of a unrelenting drive at expressing nothing but new facets of the singular grief hammered already so many times into the enduring shapes of stone memorials. Through the finest private memories, across the morass of anger, guilt and lament, to the final likeness of acceptance and liberation from the shackles of sorrow, we have seen the journey of a wretched and wrecked, yet finally healing soul; the three monuments paint a trail of healing and open a possible new road ahead. Returning to the same thematic would surely turn morbid, tear open the scars once again, and expose a private pain, already perfectly expressed, to too many, one time too far. The Shadow had stepped into the Light from the third tomb it built, and if the Shadow was not completely erased by the rays of the Sun, what remained of it should have found a new purpose. Sorrow is endless, they say, but its ever so bittersweet nectar can turn sour if milked for too long. The magnificent trilogy of gravestones is perfect as it is. \n\nWe hope that our shovels and trowels hit something different the next time we strike them into the ground. The work here is done. At least it should be.\n",
        "\nHeartfelt loss can provoke great inspiration. This is certainly the case for Swallow the Sun founder and guitarist Juha Raivo who lost the love of his life under tragic circumstances and went on to release astonishing records with atmospheric doom metal band Trees of Eternity and funeral doom group Hallatar. Swallow the Sun's last single Lumina Aurea was one of the bleakest songs I have ever heard in my life but there was a natural beauty hidden in this drowning darkness. The band's new record When a Shadow Is Forced into the Light might be a first step back towards a more positive mindset. It might be the last step towards partial recovery of the soul.\n\nI'm not as pretentious to compare myself to the ordeal Juha Raivo had to go through. But I deeply empathize with him. A long time ago, a person I loved from the bottom of my heart unexpectedly left from one day to the other. It came as a complete shock and took me several weeks and even months to be in a positive mindset again thanks to the support of my family members and friends. This loss came at the worst possible moment during my most challenging year at the university, with my most important training just ahead and with two jobs I had to do simultaneously. Many people wouldn't have been able to face these challenges but I somehow managed to excel in my classes, passed the most challenging training I have ever had and performed very well in my two jobs. I even managed to write some of the most inspired texts back then. The terrible event had sparked my creativity and this inspiration helped me to rise from the ashes and become stronger than ever before. It also changed my view of the world as I became more relaxed, pragmatic and careful. Even though I could have all the reasons in the world to despise what that person did to me and especially how she did that, I decided to move on and forgave her.\n\nI can sense all these elements on this record as well. When a Shadow Is Forced into the Light still has a gloomy undertone but it sounds much more airy, melodic and relaxed than anything else released by Juha Raivo over the past three years. The opening title track amazes with enchanting clean vocals and uplifting melodies that make this track unexpectedly catchy. ''Firelights'' might be the softest song ever by the band but isn't shallow by any means as it was even supported with a music video and convinces with a dreamy neofolk atmosphere that helps the creator and listener to dream themselves far away. ''Clouds on Your Side'' includes songwriting ideas from the person Juha Raivo has lost and impresses with wonderful mellow symphonic elements and the recitation of French poetry that make this song particularly surprising.\n\nSwallow the Sun's When a Shadow is Forced into the Light still has some of the band's traditional death and doom metal soundscapes but is much more an ambient and neofolk record with airy melodies, dreamy symphonic elements and inspiring poem recitation. Even though it barely classifies as metal record, it's certainly Swallow the Sun's most personal record and probably also its best. This is the kind of album to listen to on your own in an empty room in order to unfold its profound magic as the listener can discover new fascinating elements with each spin. Don't be afraid and drown into the darkness to find your way into the light. As we all know, light can't exist without darkness and that's why one has to embrace both.\n",
        "\nHere it is, the new Swallow the Sun album. 3 ½ years after the monumental triple attack at the heart called \"Songs from the North I, II & III\". I was waiting for this, and the gap between these 2 albums seemed endless for me. In my review for \"Songs from the North I, II & III\" I mentioned that it seem impossible to me that Swallow the Sun could top it in any way because I think that \"Songs from the North I, II & III\" contain the essence of this band and shows its greatness in almost every thinkable way. But I also said I'm sure that they're able to hold this high level of songwriting, and that they're also able to progress even though it will just be shown in small details here and there. To sum it up: \"When a Shadow Is Forced into the Light\" is really on par with the masterpiece that is \"Songs from the North I, II & III\". A beautiful piece of art.\n\n\nBut this is not your usual Swallow the Sun album. It feels way more lighter, hopeful in some and cathartic in a other way. Songwriter and mastermind Juha Raivio seem to see light at the end of the tunnel again after the tragic death of his girlfriend Aleah, because \"When a Shadow Is Forced into the Light\" gives hope and is calm in a spiritual way. Juha seem to be able of letting go slowly. Somehow this album feels a little like the last part of a \"Aleah Trilogy\" started with the Trees of Eternity album \"The Hour of the Nightingale\" that consists of music by Juha and lyrics/vocals by Aleah. It was released a few months after she passed away. This was followed by an album called \"No Stars upon the Bridge\" by Hallatar, a band Juha formed to honor Aleah and release some of the last lyrics she wrote, and let flow his sorrow into this death/doom metal masterpiece. While \"The Hour of the Nightingale\" sounds atmospheric and warm but somehow sad, \"No Stars upon the Bridge\" was just complete bleak, soul-crushing and heartbreaking. \"When a Shadow Is Forced into the Light\" seem to be the crack in this blackened sky from where the first sunrays are shining through, where nothing is forgotten just accepted, and where peace finally rises. I can understand Juha's pain in every way because my Father passed away a few months ago and Juha's and Aleah's music is carrying me through this sorrow so far. This may be the reason why this music resonate so well with me, because Juha's music with Trees of Eternity, Hallatar and Swallow the Sun is born out of the same feelings that my family and I are forced to feel now. And \"When a Shadow Is Forced into the Light\" will help anyone out there who is forced to handle the pain of loss. It enlightens, heals and warms your soul. Let out your pain because no one is really gone. We are more than our physical body, trust me.\n\n\nThe album starts with the titletrack whose gloomy sounds gives a vague route to where this journey will take us: Beyond, into salvation. The bombastic introduction gives way to an acoustic part right before Mikko Kotamäki's voice appeared for the first time. His clean vocals reign supreme here, wonderful vocal lines pierce into the soul. The song floats on violins in the chorus and Mikko screams his lungs out with his significant black metal shrieks for the first time on this album. \"The Crimson Crown\" is similar to \"The First Cut is the Deepest\" in some way and manages to suprise with a grand calmness and a heavy atmosphere. A feeling of redemption is felt throughout the entire song. Mikko's vocals warms the soul and the instruments play their notes calm and soothing, it grands you a feeling of rest. Here shows a significant aspect that will run through the whole album, the growls are completely absent on \"The Crimson Crown\". On this album they were just used especially to give a song a special note or a new color. In fact for some fans who loved the death metal side of Swallow the Sun this album could sound very soft, but as I mentioned before, this is not a usual Swallow the Sun album. The best way to go into this album is to take it as it is, and you will love it even though you are here to hear death/doom metal. In fact 90% is doom metal and 10% is death metal.\n\n\nEach Swallow the Sun album has a hit, a hit single that won't leave your head. \"The Morning Never Comes\" has \"Swallow\", \"Ghosts of Loss\" has \"Fragile\", \"Hope\" has \"Don't Fall Asleep\", \"New Moon\" has its titletrack, \"Emerald Forest and the Blackbird\" has \"Cathedral Walls\", \"Songs from the North I, II & III\" has \"Rooms and Shadows\" and \"When a Shadow Is Forced into the Light\" has \"Firelights\". \"Firelights\" begins with typical single notes on guitar and a few whispered words by Mikko, in the chorus (that won't leave your head that fast!) his voice sounds so dramatic and soothing at the same time, one of the greatest lines I've heard in a long time from a band. Unique! In the middle the band bathes in black metal for a short time just to go back to the melodic chorus immediatly. A hymn to cleanse your soul! \"Upon the Water\" starts with meditative drums and melodies of melancholy. Here the black metal shrieks are way more present than on any other song of \"When a Shadow Is Forced into the Light\".\n\n\n\"Stone Wings\" and \"Clouds on Your Side\" are beautiful examples of doom metal with \"pop\" appeal. Don't get me wrong, there is no sell out or something, but this is so melodic and ear catching without losing its identity, and that is great songwriting! These two songs could play easily on the radio even though \"Clouds on Your Side\" contains some growls. \"Here on the Black Earth\" and \"Never Left\" are the last two songs, and they close this album so perfectly. \"Here on the Black Earth\" is so damn sad that it let me shiver everytime I hear it, and the same does \"Never Left\". \n\n\nSo \"When a Shadow Is Forced into the Light\" is a journey of salvation. Juha Raivio has created an album that can help to heal your sorrows if you just let it. This album marks a progression in detail and is on par with its predecessor in emotion and beauty. Mikko Kotamäki's vocals has improved alot again, this guy gets better with every album. For me this is one of the saddest albums ever. Try it, and let it heal your soul. I think that this album will be a important one in the discography of Swallow the Sun because it opens new ways without throwing its identity over board. I'm really excited about what future albums will sound like, but for now we have 52 minutes of healing music, these sounds have a soul. Hear it, feel it, live it, and let it heal you! Thanks for your time, my friend.\n",
        "\nI've never listened to a full album from Swallow the Sun before but I'm aware of what this one is about and of the tragic events that led to its existence. \"When a Shadow Is Forced into the Light\" is probably one of the most heartfelt, honest and genuine creations I've ever had the chance to experience and although I was expecting it to be a deeply emotional album and also a really dark one, the way it made me feel came as a massive shock. That being said, I don't believe that I am (or anyone else is) fit to judge the meaning or the emotional content of this album. It is a profoundly personal endeavor that almost makes me feel like a trespasser of Juha Raivio's emotions, like he's put his soul on the table for the whole world to see. I wouldn't dare to imply that I understand anything that this album expresses so instead I'll just shine some light on my experience listening to it.\n\nA blend of doom, death and black metal with the highest emphasis on the doom metal elements is probably an accurate description of the genres that come together in this piece of music. However, the sound is very polished and hi-fi, but not in a negative way. It is actually a crucial element in the album's overall atmosphere. The final result seems to me pretty unique and very unexpected. The main reason for that is probably that despite it being such a dark album, it doesn't feel to be conveying any negative energy to the listener. It is very immersive and has a really full and clear sound that somehow wraps you up and instantly captivates you. And while there is a lot of focus on sadness, pain and loss, to me it felt somewhat dreamy and peaceful.\n\nThere are primarily two different sounds that come together in this record, the \"soft\" and the \"harsh\". The \"soft\" is the blend of clean guitars with a very good delay effect, slow but deep sounding drums with a strange echoing feel, the bass coming through very clearly and Mikko Kotamäki's beautiful, clean vocals. The\"harsh\" is quite predictably the opposite. It's when the overdriven guitar kicks in and Mikko switches to his raw and cathartic screams or on some occasions to really deep low growls. And what makes the album so beautiful is the perpetual alternation between these two sounds, sometimes showing elements from one, placed into the other, like for example in the chorus of Stone Wings or Firelights where the heavy sound hits but Mikko stays with clean singing. \n\nThe album is overall very melodic. There is not one single part that seems only harsh, aggressive or noisy. The riffs are all written with a lot of melody incorporated in them and there are also some very soulful guitar leads that add to the depth of the whole sound. Then there's also the keyboard that blends everything together with some subtle choir aahs effects and also a very good use of violins and cello that at times may seem dramatic but are mostly used for extra intensity in emotion. However, despite all this sadness, emotion, melody and an ongoing feeling of longing and emptiness, the album seems to be working its way to a higher meaning. When the separate single Lumina Aurea was released (which I only listened to once and I think something died in me when I heard it), Juha Raivio stated that if he kept going down that road things wouldn't end well, and that instead this album is about how \"Love is always stronger than death.’ and that it is \"Victorious and proud\". And I somehow feel that when listening to it because in a most peculiar way, after listening to 52 minutes of sad and painful music I feel refreshed, energized and at peace. It sounds like working through all that darkness and coming out on the other side, like a rite of passage. I can't tell for sure if this is really what the album means but it is how I perceive it. Also the title and lyrics of the closing track seem to perfectly express that idea of love going across the boundaries of death. It's just so much to take in and try to understand but in the end, it seems of less importance to me to try to interpret the meaning of all this instead of just feeling it when listening to the music. So unless you've also gone through a terrible loss, in which case it's unknown territory for me and I won't dare to address the matter, I suggest you do the same.\n",
        "\nFour years after the release of their magnum opus Songs from the North, a triple album introduced in 2015, and after the tragic demise of Aleah Starbridge (the front man Juha Raivio’s life partner and Trees of Eternity’s lead vocalist) in 2016, the Finnish Death-Doom giants have returned with an album which leaves no heart untouched. A short while ago, late 2018, a single album was put forward which best depicted the dark depths of their sorrow: Lumina Aurea, a heart- wrenching blend of black and funeral doom with dashes of folk created by Einar Selvik of Wardruna.\n\nUpon listening to the single, one might fear they have lost sight of light in their career and that they might have given in to loss. However, what the new LP, so aptly called When a Shadow is Forced into the Light, does is that it turns the grief on its head and creates what could be claimed to be the most melodic and most emotive work of the band so far. It sure isn’t as grand and sizeable as their previous album, but it is indisputably just as courageous and estimable as it brings to surface the delicate, more nuanced side of the band yet keeping the recognizable, dominantly melancholy and doomy sound of the band. So not only does it not impair the image of the band, but it so graciously adds to the substantial repute of them.\n\nSwallow the Sun’s seventh studio album is everything dark: a dismal atmosphere, heavy death-doom riffs, throbbing piano notes, crushing drums, solid bass, wide-ranging singing styles and a concise use of orchestration. There is no rush to bombard the listener with metal, nor with words; everything has its chance to be presented in the most impactful way and to the maximal effect. Words are added when time is ripe. The band is in no hurry to start singing, they let the music sink in and pierce to the core and allow enough time for the anguish to settle and take effect. The rainy sky at the beginning of The Crimson Crown, for instance, is a testimony to the clever use of ambience to create the desired setting to begin the music and to further the impact, the instruments are given ample time to showcase themselves before the singing starts (approximately 2 and a half minutes into the song).\n\nBy the use of tactful diversity, both in terms of musical production and vocal delivery, this album has succeeded in crafting a work of art which is captivating in its entirety. Besides the musical elements (instrumentation and ambience), the second lead vocalist of the band, the new keyboardist Jaani Peuhu, has brought with himself a rather new sound, not a kind which would put the listener off, but a figure to enhance, even for a bit, the vocal experience of the listener, previously shouldered by the magnificent Mikko Kotamäki. The duo collaborates so finely to enrich the music of the band, from black screams to death growls to hyper clean vocals, even to whispers, a fair amount of each. \n\nAll this musical excellence does not overshadow the poetic prowess and the musicality of the lyrics. One reason that there is such an irresistible appeal in vocals could be that the words of the lyrics not only constitute the message and meaning to be conveyed to the audience, but also contribute to the overall sound of the music. There are dark themes such as loss and emotional barrenness, yet love and light are also expressed. This album is by no means a mere journey though wastelands of darkness; it is one from darkness to light and that is what singles this album out from the plethora of other works within the genre and they do it so well that they do not simply stand out, they stand head and shoulders above the rest.\n\nRating: \nLyrics: 9.5\nArtwork: 9.5\nMusicianship: 9.5\nVocals: 9.5\nOverall: 9.5\n",
        "\nFollowing the critical acclaim of their previous album \"Songs From The North I, II, III\", Swallow the Sun try to reach the same level of success by recording and releasing \"When A Shadow Is Forced Into the Light.\" Between its predecessor and this album, a few has happened for the band. Juha Raivio grieved the loss of Trees of Eternity fellow band mate and partner Aleah Stanbridge, and Swallow the Sun brought in two new members for the album Juho Raiha (Guitars), and Jaani Peuhu (Keyboards). It would also be difficult to reach the same success musical devotion and creativity as \"Songs From The North I, II, III\", but the band continues to grow with this album. In a way \"When A Shadow Is Forced Into the Light\" are the band's more melodic sounding album, but manages to still sound great beginning to end without losing their edge and creativity. While it's not as good as the previous album, and contains shorter songs from the band, this album is still a good follow up album.\n\nThe music for \"When A Shadow Is Forced Into the Light\" has some unique combinations of modern metal sounds, melodic moments, and the bands signature use of death-doom. From listening to some of the songs, I actually want to call Swallow the Sun a gothic metal band, but still manages to keep the bands signature melodic death-doom rather than moving away to other stylistic changes. It has some really dark sounding guitar parts, string instruments, soft depressing melodies with some actual good atmosphere like from songs like \"The Crimson Crown\", \"Stone Wings\" and \"Upon the Water.\" These songs were beautiful to listen to and shows a lot of sorrow behind its music through its atmospheric keyboards and vocalist Mikko Kotamaki. In fact, Mikko Kotamaki still manages to sound great through its clean singing much like in previous releases. He even does some nice squealing, and growling as well even if there wasn't enough of that in the album. I like that even though the tempo is slow and simplistic, it manages to reach out well, and shows some great highlights in the albums most aggressive parts. Though the complaints I had with the album is that there isn't enough heavier parts which is not a bad thing, but what made Swallow the Sun such a great band was its use of death-doom and making it more melodic. In Previous releases, Swallow the Sun did have melodic keys in its much heavier parts, but didn't bring enough heavier parts on most of the album. \"Firelights\" in particular is a solid song, but for some reason it sounds like a song for which the band is trying to reach for that \"Best Metal Performance\" at the Grammys. Despite that, the music of the album still sounds great, and still appreciates the fact that it's more melodic because it does give the band sensitivity and it adds a lot of texture to the album much like its previous release.\n\n\"When A Shadow Is Forced Into the Light\" also still retains it's depressing lyrics. I love how most of the songs kind of remind me that the lyrics are inspired by the death of Aleah Starbridge. Most of its lyrics are full of grief showing signs of emptiness, lack of hope, loneliness, mourning. It does show that that tragic moment gave inspiration to the bands lyrical themes as it manages to have more depressing lyrics than it is depressing music. There is a lot to read which also shows that Swallow the Sun never run out of ideas when it comes to songwriting. \"Firelights\" even has some great lyrics, I think just by reading them it shows passion much like the rest of the albums lyrical themes. The album's lyrics never get out of touch, it is coherent, and brings more depth to \"When A Shadow Is Forced Into the Light\" and it is able to maintain its consistency.\n\n\"When A Shadow Is Forced Into the Light\" was among my most anticipated records of 2019, and Swallow the Sun did not disappoint. The band still managed to make depressing death-doom music, but being able to have more melody in its singing, atmosphere and overall musical landscape. Even though it's not as good as \"Songs From the North I, II, III\", it is still a great successor album and continues Swallow the Sun's streak of good albums. No favorite track necessary, each Song sounded great.\n",
        "\nSwallow the Sun's \"When a Shadow is Forced into the Light\" is a rebirth for the Finnish melodic death/doom group. It is the addition of two new members, an evolution in their sound and most importantly, a musical way for mastermind Juha Raivio to process his grief after the tragic loss of his beloved Aleah Starbridge. \n\nA lot has happened since the band's monumental triple album Songs From the North. Sadly Aleah passed away, keyboardist Aleksi Munter left the group, followed by guitarist Markus Jamsen. While Juha mourned the loss of his partner, he released both the Trees of Eternity and Hallatar albums. To mark Swallow the Sun's return, they released the 14 minute funeral doom single \"Lumina Aurea\" along with the announcement of this album. Whereas that track blends folk, black metal, drone and funeral doom to create a dark and emotional journey, this album goes for the opposite. Juha knew he needed to write something more melodic and positive to help him on his journey, and thus this album is prominently clean vocals, with live strings and lots of melody in the guitars.\n\nUpon my first couple listens I did yearn for a bit more heaviness but it was not long until I was completely under the spell of this album's magic. Don't get me wrong, there are heavy sections to be found and Mikko's growls and screams are in top shape. But the expression presented with the stylistic choices, individual performances and the overall production is outstanding. There is so much beauty, yet also so much sorrow that it is overwhelming. It may not be the crushing doom that some genre enthusiasts will crave, and I have already seen people degrading the band and this direction. But in terms of feeling and the listening experience, this is pure doom from the heart. Every note is 100% genuine. There is no selling out here.\n\nThere are new types of sounds, different guitar tones, live strings, grand piano and most notably, co-lead vocals provided by new keyboardist Jaani Peuhu. This offers so many new elements to the band's sound and brings a lot of textures to the songs. Drummer Juuso Raitikanen and bassist Matti Honkonen have never sounded better in both playing and tone. New guitarist Juho Rahio delivers a couple great solos and teams perfectly with Juha. The guitar sounds are very rich in both the cleans and distorted tones. Mikko's vocals are at an all time best, again both in his clean singing and extreme vocals. It is a wonder to witness everyone's evolutions as musicians and songwriters. From a production stand point, this album is a masterpiece. I have no doubt that Juho, Jaani and Juha being a mix of producers, engineers and studio owners helped greatly beyond words in achieving the breathtaking soundscape of this record.\n\nIn summary, I would advise people not to be put off by this new direction but to have an open mind and follow the band on this journey. The music invokes sympathy, empathy, love, grief and so much more. I really can't predict where they will go from here but I am excited to see and hear what the future holds.\n",
        "\nReleased under the credo Death is stronger than life but love is stronger than death on the longest night of the year, Swallow the Sun's Lumina Aurea is probably the most bleak, experimental and mysterious track the band has ever released. Inspired by the tragic death of South African singer Aleah Liane Stanbridge and the months of suffering that followed, guitarist and band leader Juha Raivio has apparently struggled overcoming this tragic event until today. Trees of Eternity's sorrowful debut was released as her swansong a few months after her death. Juha Raivio's new atmospheric doom metal band Hallatar was also partially inspired by the sinister events. Juha Raivio might also be working on what was supposed to become Aleah Liane Stanbridge's solo album. The tragic circumstances have now also had an impact on Swallow the Sun. It might help overcome such a tragic event with the magic of musical projects and the final results are certainly very profound. However, one can't help but feel sorry and even sad for the Finnish musician.\n\nWhen bands release a single a few months before the next studio album, the release usually has the purpose to represent and promote the full length effort. That certainly isn't the case here. This single isn't even included on the upcoming album. The song sounds very different from anything the band has ever recorded. Upcoming record When a Shadow Is Forced into the Light is supposed to promote a positive message while Lumina Aurea explores the darkest depths of the human soul. Here is hope that Juha Raivio can finally close this bleak chapter and find peace of mind with the release of the new studio record in about one month.\n\nThe epic title song is essentially a plodding ambient track with minimalist instrumental work, modestly employed horn and percussion sounds by Einar Selvik and Latin poetry recitation by The Foreshadowing's singer Marco Benevento. The track is supported by a stunning music video shot in and around Lapland that deals with topics such as death, loneliness and pain in visually impressive images. The song doesn't have anything to do with Swallow the Sun's funeral doom metal style except for its gripping atmosphere.\n\nReactions to this release have been quite controversial. Some people understand the circumstances regarding the release, respect the band leader's necessity to free his soul from his inner demons and hail the song's profound atmosphere. Others claim the track doesn't vary enough, overstays its welcome and shouldn't have been released as a Swallow the Sun track.\n\nThe song is probably best enjoyed in small doses. It's an atmospheric, meaningful and surprising piece of music and soul striptease that is worth your attention, money and respect. However, it's obviously tough to digest and shouldn't be listened to by anyone who is feeling uneasy, depressive or suicidal.\n\nIt's incredibly tough to even rate this song. If you have any form of empathy, your evaluation should be positive. Giving a song with so much negative energy a perfect rating would however also feel inappropriate. Ultimately, Swallow the Sun's Lumina Aurea is great for what it is but should be listened to with care.\n",
        "\nThe Morning Never Came is absolutely, without question one of the finest doom metal records that has ever been released. This album is beautiful, melancholic, and utterly captivating. Swallow the Sun is such an overlooked band in the scene of metal. Their songs encompass such a wide range of style and sounds and its simply incredible. The Morning Never Came was the first release by them and remains my favorite to this day. It has an extremely heavy and depressive sound to it. Most of the tracks sound so sad and angry and it serves well to convey the emotion they were trying to communicate.\n\nFor a band's first full release The Morning Never Came is of unprecedented quality. The recording both in production and how well the songs were played is very impressive, given the band's size at the time of the release. All of the songs flow so beautifully within themselves and its a really enjoyable album to sit and listen to because of the changes. They manage to switch so seamlessly from slow, beautiful clean sections into heavy guitars and growled vocals. There is a haunting beauty to so many of these songs, whether it from the ethereal clean vocals to the beautiful piano and synthesizer parts in the background. The inclusion of guitar solos is another thing that sets this album apart from their others. They are several on this album and they are amazing, perfectly blending in and serving the song without being an egotistical wankfest.\n\nSwallow the Sun set the bar extremely high with The Morning Never Came. I cannot recommend this album enough to fans of any metal style. While the sound is clearly doom metal, the are traces of a whole host of other types of metal to be found. This album is truly beautiful and is a great record to sit down and listen to and be transported to the land of snow and sorrow.\n",
        "\nSwallow the Sun's Songs from the North I, II and III is beautiful, dark, depressing, melodic, heavy, atmospheric and nothing short of a masterpiece. As I write this review I am still in disbelief that one of my all time favourite bands had the courage and the creative energy to craft a 21 song triple album. I have the utmost respect for them (and their new label Century Media for backing the project) and am overjoyed that myself and all the other fans of this great band have so much new material to delve into. Though a triple album may seem daunting, it is my opinion that not one song on here is weak. The triple album format works perfectly, as each album shows a different side of the bands sound.\n\nAlbum I picks up where its predecessor Emerald Forest and the Blackbird left off. On that album the band ventured into more melodic territory than they had previously, and this disc continues on that path. Everything that this band does so well is on display here- crushing riffs, rhythms, atmospheric keyboards, brutal extreme vocals, beautiful singing and acoustic/clean guitar playing. For the first time for the band, every song here has clean singing (in varying amounts). There are lots of acoustic/clean guitar passages and melodic guitar leads/harmonies. If this album were to be released on its own it might risk some criticism of not being as heavy as previous albums. But in my opinion it totally holds up on its own accord, moving the band forward into new areas. There are plenty of heavy songs and moments, supplied by crushing, groovy and evil riffs alongside aggressive drumming and bass playing while Mikko Kotamaki's perfect death growls and screams belt out words of sorrow. My favourite songs from this part of the album are With You Came the Whole of the World's Tears, 10 Silver Bullets, Rooms and Shadows and Silhouettes. \n\nAlbum II is the band at its most stripped down and melodic. It is all acoustic/clean guitars and singing and the band shows just as much skill playing these kinds of songs as they do with the heavier stuff. An instrumental song (the first of two) opens things up, which is a nice surprise as the band have never done this before. It is a keyboard composition and Aleksi Munter sounds fantastic on it (as he does for all three albums). Another new thing that I found to be a nice surprise was the Finnish lyrics used in the chorus of the title track. That song is my favourite of this part of the album. It features Twin Peaks-esque keyboard work and some really sweet female vocals in the chorus. Mikko's singing is fantastic all around, the keyboard and guitar work are excellent and the rhythm section groove nicely without overpowering anything. \n\nAlbum III is the band's darkest and heaviest output yet, which is saying a lot. Though this part of the album only has 5 songs, since it is funeral doom it still comes out to be around 51 minutes. Every song on here is worthy of being called a favourite and they all crush your heart with their heaviness, atmosphere and sorrowful lyrics. Every song and every individual part are full of feelings of evil and doom. I cannot stop listening to this album and it is my favourite of the three. My favourite is Empire of Loneliness, with its depressing lyrics, atmosphere and a truly epic instrumental section making for a powerful listening experience. Early fan speculation predicted that album III would be many's favourite, and it is easy to see why. The band really tapped into some dark magic here and the results are stunning.\n\nEvery band member absolutely nails their performances all throughout the triple album. Mikko's clean singing is at its very best. His range has expanded and is even more emotional than ever before. As mentioned, Aleksi's keyboard playing is top notch, and like Mikko, this could be his best performances yet. Matti Honkonen's bass playing is terrific here. He has a gritty bass tone that adds a lot of heaviness to the songs and the basslines are definitely his best yet. Markus Jamsen and Juha Ravio are as consistent as always, and I mean that in the best way possible. These guys always deliver heavy as fuck riffs, beautiful leads/harmonies and lovely acoustic/clean playing and their tones are always impeccable. They are a fantastic team who play off each other perfectly. I have the utmost respect for Juha for writing every song on here (with arrangement help from the other guys). The creativity he shows here is incredible. Knowing how personal this album is to him, it is easy to see how he was inspired to write so much music. But it is really incredible to see that every single song on here is not just good, but great. Some bands can't go an 8-12 song record without filler, but here Swallow the Sun have crafted a 21 song masterpiece. Juha really is an underrated songwriter. Lastly, I would like to give special mention to the new drummer Jusso Raatikainen. I have to admit, when it was announced that Kai Hahto was temporarily stepping away from the band to help out Nightwish, I was heartbroken. Kai is my favourite drummer and brings so much to Swallow the Sun. However, Jusso pledged in his statement to the fans that he wouldn't let us down, and goddamn it he was right. He steps up to the plate in a big way and delivers the goods! One of the many reasons I love Swallow the Sun is that even though they are a doom band, they have never had boring drumming. This does not change here. Jusso pays tribute to Kai and makes his own mark and the results are fantastic. There are some drum fills on here that really blew me away. \n\nThe production throughout all discs is very good and up to the par set by the previous records. The band clearly did not have to sacrifice production quality in order to record so much material. All the instruments have the top notch tones they have always had and the mix is for the most part stellar. The occasional bass line or growled vocal gets a little bit buried, but in the grand scheme of things it really isn't a big deal. \n\nIn closing I cannot recommend Songs from the North I, II and III enough to Swallow the Sun fans, people who would like to check them out, doom fans, melodic death metal fans, anyone wanting some mellow acoustic music, hell anyone that is open minded enough to check this out. The band went above and beyond to deliver something truly special and unique. As a musician myself I can only imagine how much hard work went into writing, rehearsing and recording this album and having to negotiate with a label to release it without having to compromise their vision. I respect and love this band for crafting music this extraordinary.\n",
        "\nSwallow the Sun finally finally released a successor to their 2012 album Emerald Forest and the Blackbird. Or three successors should I say, as they decided to release a triple album, a pretty tricky move. Each album has a different style, and represents a part of their motto \"Gloom, Beauty and Despair\". We begin with album I (Gloom), a typical doom/death metal album in the vein of the previous ones though much softer, but we'll come back to this point later. Then comes album II (Beauty), a beautiful, fully acoustic album, featuring vocalist Mikko Kotamäki's clean vocals, which he massively improved, not that they were bad in the first place. And we finally end our journey with album III (Despair), a soul crushing trip into the dark world of funeral doom metal, with much more heavy tunes, and low, deep, haunting vocals.\n\nSo, let's start with album I. With time, Swallow the Sun tend to adopt a more and more soft sound, and use much more clean vocals than in the beginning. Emerald Forest and the Blackbird showed that pretty well, being the softest album they released so far, at least to me. Well, Songs from the North I keeps going this way, adopting once again a softer sound, highlighting melodic, light guitar lines instead of heavy riffs, and an extended use of clean vocals. This for sure won't please everyone, and those hoping for a return of old, heavy, pure doom/death metal style could be disappointed.\n\nBut don't let that prevent you from listening to that first album and enjoying it, because while it's much more melodic overall, it still offers its load of heavy riffs, most notably one in \"10 Silver Bullets\" that caught my attention straight at the first listening. Clean and harsh vocals are pretty well shared throughout the entire album, like in the latest works. Clean vocals bring a glimpse of light through this dark journey, but also their load melancholy, more than they ever did in any Swallow the Sun's album so far. Harsh vocals bring despair and heaviness in a beautiful way, like they always did. Highlights of this album : \"Lost & Catatonic\", and the beautiful final song, \"From Happiness to Dust\", which sent shivers down my spine during the whole song, and even brought tears to my eyes. It concludes this album in the most perfect way I could imagine.\n\nThen comes album II. A fully acoustic album, without any harsh vocals, highlighting the beautiful clean singing of Mikko Kotamäki, which, as I said before, improved massively. For those who liked \"This Cut is the Deepest\" from the previous work, this album is one hell of a trip through Swallow the Sun's most beautiful face that you will most likely enjoy. Guitar work is beautiful, and coupled with the best clean singing lines Mikko ever delivered, it definitely brings beauty, hope, and light into the almost 3 hours long trip that is this triple album. It allows you to breathe, and brings a bit of calmness before the storm that is album III, and trust me, you'll need those almost 45 minutes of tranquillity before starting the end of your trip with album III. Highlights of this album: \"Away\", the wonderful \"Autumn Fire\", and the title track \"Songs from the North\", featuring Kaisa Vala's beautiful Finnish vocals lines, bringing something unique to this song.\n\nFinally comes album III. Almost an hour long trip, into the pure heaviness, breathtaking world of funeral doom metal. It shows the heaviest, darkest, most hopeless face of Swallow the Sun. It's slow, very slow, and painful. Riffs are heavy, haunting. They echo and crush your mind in a way I couldn't even describe. Mikko's vocals are deeper than they've ever been, delivering pure pain and despair to the songs. They are punctuated by spoken vocals every now and then, highlighting the touch of despair, somehow. For those who like old school Swallow the Sun songs, this album should truly be an instant favorite, as it shows their old, gloomy face, but takes it one step further, to dark places they never yet reached. This is for me an album that should be listened to in it's entirety, to fully enjoy the trip through despair and pain that it offers to the listener. A truly unique one. If I, though, had to pick a highlight, I guess it would be \"Empires of Loneliness\", the music, the lyrics, and the narrative passages really move me everytime I listen to it.\n\nAs the last notes of the last album echoes while I'm writing these lines, once again, I'm left speechless. It's the fifth time I listen to the whole three albums in a row, and the fifth time I simply can't say a single word. Swallow the Sun delivered something huge. I was afraid to see what would such a big project sound like, but to my biggest delight, I wasn't disappointed at all. Songs from the North I, II & III definitely marks a turn in Swallow the Sun's career. I don't know how they will be able to write a successor to this album. I don't know what will happen in the future. All I can say is that this triple album is probably the most beautiful piece of music I've ever heard in my entire life. So now, take three hours of your life, put your headphones on, shut all the lights off, close your eyes, play this triple album, and enjoy this beautiful trip through Gloom, Beauty and Despair.\n",
        "\nSwallow The Sun never fall short of visionary ideas however it’s hard not to gasp at the sheer scale of ambition behind their sixth opus. Wisely, the band splits this languid journey into three distinguishable segments that each has its own conceptual vision. Even as a triple album each part could easily stand alone as an individual LP, “Songs From The North” is a commanding lesson in pace and dynamism. \n\nThe first album captures feelings of moroseness and gloom. ‘Heartstrings Shattering’ and the faster ’Silhouettes’ both have bleak and broodingly heavy riffs that ponder along shady roads of solemnity. The only accomplice in these dark times is an even darker voice. Mikko Kotamäki echoes around each chug with a snarling and pitiless attitude which increases a sense of self loathing within the music. However the record has a profound sense of balance whereby miserable doom forms a natural romance with tranquillity with touches of sombre accessibility. Mikko’s clean vocals in ‘Lost And Catatonic’ and additional female singing that could soften a heart of stone on ‘The Memory Of Light’ sound delicate and enchanting that provide a shred of hope to this grave beginning.\n\nWhen listening to “Songs From The North” in its entirety, the first disc diminishes any fragments of joy however the second disc is a refreshing replenishment of beauty. The majority of the songs are acoustic fashion and therefore require a different sense of power that embody Swallow The Sun. That power is portrayed through scenic and visionary scopes that place you in the band’s environment. Yearning strings and piano are a prominent feature throughout the second part of the triple album which join acoustic guitars to lull you into a dreamlike milieu in songs such as the instrumental “66°50'N, 28°40'E” and ‘The Heart Of A Cold White Land’. A glimpse of the band’s home and landscape is found in this triple album’s chilling title track where the radiant female vocals reappear but in the bands Finnish mother-tongue. It’s a tender song where the echoing instrumentation creates a spacious atmosphere where the music can drift around effortlessly with soothing effect.\n\nClearly the weight of carrying their sorrows this far is what makes the third part so exhaustingly slow. Swallow The Sun now drag themselves towards drone soundscapes in all songs here. Laboured riffs collide with merciful keyboards and condemning vocal work in ‘Abandoned By The Light’ and ‘7 Hours Late’ with elephantine prowess. Sensations of despair are felt during various tempos such as the outburst of furious tremolo picking in ‘Empires Of Loneliness’ which hearken abandonment, hopelessness and rage. The strenuous ‘The Clouds Prepare For Battle’ lacks the riff-driven gut-punch doom metal evokes however it’s the little nuances like the churchlike chants that restore to the emotional intensity.\n\nIn a strange way, the wholeheartedness of “Songs From The North” is the main issue. Swallow The Sun want you to experience this as a wholesome voyage. While this 154 minute voyage travels through seas of sorrow, tides of tranquillity and waves of woe, it runs the risk of leaving you either captivated or sluggish in, essentially, a tough endurance test. Swallow The Sun respect this risk, took it and consequently conquered it in glorious style.\n",
        "\nGhosts of Loss has always struck me as a unique entity in the discography of Swallow the Sun. Of course every album has its own feeling and is its own entity, however there is just a certain something to this record. While I must admit this is probably the album I listen to the least from this melodic death/doom band, that is by no means a negative comment towards it or the band. This is a very strong album and a worthy follow up to the much loved debut The Morning Never Came.\n\nAtmosphere is definitely a word that I would use to describe Ghosts of Loss and the songs contained within it. While the genre is supposed to be on the gloomier and darker side of life, there is a certain level of bleakness that is captured here that Swallow the Sun’s other albums have not reached before or since. The songs feel longer and sadder and while there are plenty of melodic sections, even those feel darker than usual. Parts like the instrumental interlude of The Ship and the long beginning of Gloom, Beauty and Despair showcase this ethereal feeling. The songs overall show a varied range. The Giant is a twisting and turning epic that opens the album. Descending Winters is a little more upbeat in tempo and Psychopath’s Lair hammers you with its groovy main riff. The majority of the remainder is full out melancholic doom, and they are mostly done extremely well. Ghost of Laura Palmer is perhaps the weakest track here but even that one grew on me after a while. Worth noting is the way the last three songs flow together, further adding to the grandiose epic feeling of the album. \n\nAnother reason this album has a more desolate feel is due to the production. The distorted guitars and bass have a drier feel to them compared to their other albums. The clean guitars have a wonderful tone as well. I really commend guitarists Juha Raivio and Markus Jamsen for the knowledge and skill in acquiring quality guitar tones. They always deliver sounds that help take the music a step higher.\n\nI can see this album being a bit of a hit or miss for listeners but if you enjoy this gloomy style of death/doom I would absolutely give this album a try. It’s best taken in with quality headphones, listening to it front to back and soaking in all the things the music is presenting. It’s a grand feeling and one that Swallow the Sun always knows how to deliver.\n",
        "\nNew Moon is the forth full length album from Finnish melodic death/doom metal band Swallow the Sun and in my opinion is their best release. It is certainly my favourite. This album contains all the band’s elements at their best and the songs are absolutely crushing.\n\nEvery song on this album is brilliantly written and performed. Although it may sound like an exaggeration, all eight tracks here are masterpieces. From the opening, sinister These Woods Breathe Evil to the closing bleak and brutal Weight of the Dead, everything is just breath taking. A couple of songs (Falling World and New Moon) head into slightly more melodic territory (most of the vocals on these tracks are sung as opposed to growled/screamed), but still retain a gloomy and dark atmosphere. The band also brings in some black metal to their sound. The epic Lights on the Lake (Horror Part 3) launches into blast beats and fast riffing after a beautiful beginning sung by guest vocalist Aleah Stanbridge. While this is certainly nothing unique, when it is put into the context of Swallow the Sun the results are stunning. I hope that they do something like this again in future releases. The aforementioned Weight of the Dead also contains some black metal atmosphere, keyboard work and more blasting. For what it’s worth, my favourite tracks here are Lights on the Lake, Weight of the Dead, and Servant of Sorrow.\n\nSwallow the Sun consistently delivers overall excellent performances and this album is no different. Vocalist Mikko Kotamaki delivers brutal growls and screams, but also showcases his lovely singing voice. Kai Hahto takes over on the drums from Pasi Pasanen and fits right in. His drumming is excellent, striking a perfect balance of taste and technicality. Guitarists Juha Raivio and Markus Jamsen are as reliable as ever, dishing out crushing riffs and beautiful melody. Keyboardist Aleksi Munter brings the atmosphere and his work on the album as stellar as always. Bassist Matti Honkonen is the only one I unfortunately can’t give too flattering a description, as his talents are not quite put to as good a use as maybe they could be.\n\nThe production is for the most part excellent. It has a unique atmosphere and feeling to it which really helps the songs meet their full potential. The tone of all the instruments is fantastic. The mix is for the most part great as well, my only complaint being the bass. I would love to see it brought up to let Matti’s bass playing come through more so. \n\nThe artwork is in my opinion the bands best. The cover is fantastic and the booklet is as well. Every song has its own illustration and I love the colour scheme and the liner notes.\n\nIf you are just getting into doom metal, Swallow the Sun is a great band to start with. If you love to hear well written melodic death and/or doom metal, odds are good you will enjoy this album. I cannot recommend this enough!\n",
        "\nI must admit, these Finns definitely know how to make one sad. It is of little surprise, of course, that Swallow The Sun's insignia of melodic doom/death metal quickly shot the band to the forefront of their musical alcove within just a few years. Some may call \"Emerald Forest and the Blackbird\" a towering magnum opus, or perhaps a creative descent akin to the backsliding interests of a disheartened soul struggling to break free from the tentacles of reality, but it's a Swallow The Sun album above all else. The girth within \"Emerald Forest and the Blackbird\" is surprisingly fertile and innovative; the band has a clear grasp on advanced songwriting techniques and the dark atmosphere needed to capture the whole picture of Swallow The Sun's method. A harrowing release touching a variety of angles at its best and an entertaining listen at its lowest points, I really can't protest the work of these doom/death metal harbingers.\n\nEverything here is remarkably fresh. I mean, a staggering number of the anthems retrace the same formula that widely represents most of \"Emerald Forest and the Blackbird,\" perhaps even most of Swallow The Sun’s discography, really. Needless to say, Swallow The Sun is still Swallow The Sun, and you can expect all the melodic passages, all the shearing doom sections, all the clean vocals, all the harsh vocals, and all the mournful despair compactly rolled up in that signature ball of Finnish grief. The interesting thing about Swallow The Sun is that they always keep the emotional atmosphere negative and daunting, but through a variety of musical mediums. For example, the whooping title track runs in a dramatic turn of events, quickly swaying from harsh, violent passages to mournful sections utilizing clean vocals and mighty atmosphere. They surprisingly have a lot of creativity hiding out in the record’s many chambers.\n\nThe second song, \"This Cut is the Deepest\" is an acoustic rocker leaning towards the Katatonia spectrum of depressing rock, and it lacks harsh vocals or aggression, making it the purest Swallow The Sun tune around. Very effective and powerful track if I may say so. They quickly counter the subdued semblance with \"Hate, Lead The Way,\" which is easily one of the most intense and brutal songs they've ever penned. We're all about extremes now, is that it? Anette Olzon Blyckert, former Nightwish vocalist, makes a credible cameo on \"Cathedral Walls.\" Not big on Nightwish, but her voice is an elegant addition to the somber instrumentation. The rest of the package churns out adequate pieces ranging from acceptable to downright sensational; they've done no ball-dropping here.\n\nAll in all, an album from Swallow The Sun which perfectly sums up everything they have to say in an artistic manner is the only absolute truth regarding \"Emerald Forest and the Blackbird.\" Maybe some of the sonnets aren't up to previous works, but they've still forged songs like \"Hate, Lead The Way\" or \"This Cut is the Deepest\" which provoke vast amounts of emotional color and atmosphere. That's the point of mournful music like this, right? If so, Swallow The Sun, pat yourselves on the back; you've earned it. If not, cherish \"Emerald Forest and the Blackbird\" for its balancing act between musical hatred and heartbreak, never discoloring the sadness that gave life to both.\n\nThis review was written for: www.Thrashpit.com\n",
        "\nTwelve years ago a mighty force of death and doom metal joined the massive list of Finnish metal bands to grace the world with their beautiful music. Swallow the Sun has released a total of five full length albums over the years, with their most recent being Emerald Forest and the Blackbird, released in February of this year. This album is a masterpiece of beautiful, droning and flowing melodic doom metal, with some death metal elements tossed in to create quite the delicious recipe for an album.\n\nThe album begins with an amazing ten minute long song, the title track for the album, “Emerald Forest and the Blackbird”. When I first played this album I could not resist this track. I spent nearly an hour focusing on this song, putting it on repeat and just relaxing. It’s got a great blend of spoken vocals and hard-hitting music, with moments of relapse and a hypnotic woman’s voice cooing in the background. Out of nowhere it explodes into harsh vocals, hard and heavy drums, and great string manipulation that manages to give me chills each time I hear it. This track is a great opener to define the direction of the album that follows.\n\n“Hate, Lead the Way” is a heavier track on the album with harsh vocals, faster drums and guitar work, yet maintains a heavy focus on the keyboard work, making this song a great blend of styles. “In this place we all die alone.” A bold statement is made with this song both lyrically and musically and the band should really be proud of this sound they’ve ended up with here. It’s extremely unique and quite the pleasant listen all around.\n\nAnette Olzon Blyckert, best known for her work as the more recent vocalist of Nightwish sings on track four, “Cathedral Walls”. I have never really liked her for the previously mentioned band, but with this tone of music, and singing alongside Mikko Kotamäki seems to be her element. This song is astoundingly beautiful, and both vocal styles really stand out. I can’t get over how talented Mikko is, with the ability to sing me to sleep then pull off a traditional death metal vocal style so flawlessly is such a rare find. This amazing ability can also be found in “Labyrinth of London”, a song that bounces back and forth from heavy to droning while maintaining its composure as a single sound quite well.\n\nTo sum things up here, this band has yet to disappoint. As an avid fan of all of their albums this one is quickly becoming my favorite and definitely most played. The softer elements, like the clean vocals and female singing, really put forth the true emotion behind each and every track. Even the heavier songs have a way of speaking to you that I haven’t quite experienced from another doom metal band. I am absolutely looking forward to where they go from here because I cannot seem to get enough of Swallow the Sun.\n\n[Originally written for metalholic.com]\n",
        "\nDisappointment? A subject that doom metal bands may write about, but it shouldn’t be felt by the listener about the music itself. But that’s exactly what happened when I first listened to Swallow the Sun’s fifth album. More specifically I thought ‘what happened?’\n\nJust to make it clear, I don’t think this album is a complete flop it’s just not as good as albums they’ve put out before. My main concern is that it’s just too damn soft in places. Take the second song on the album ‘This Cut Is The Deepest’ for example. Clean vocals only, acoustic guitars and a melodic, flowing, heavy-ish kind of atmosphere. It sounds a bit like where they were going with the ‘New Moon’ song from the last album, but where that song had a strong, catchy and emotional chorus this song just floats around never really going anywhere with no hooks to speak of. This is similar to the opening epic title track that is a bit of a formless mess; its quiet moments mixed with heaviness just don’t seem to hit home like this band’s prior songs. Opening with two duds is a serious problem for this album, and the cause of my initial concern on first listen.\n\nLuckily the third track picks things up: Hate, Lead the Way is a vicious song, with black metal style vocals and a churning melodic structure mixed with heavy guitars – a classic STS track basically and the best song on the album. Interestingly the shorter songs seem to be the best on this album – maybe STS want to head in a Katatonia type direction and make their sound more accessible. A song like ‘Cathedral Walls’ with its additional vocals from the Nightwish singer could suggest this, but I don’t know how well STS would fare without their heavy doom moments, stripped down to rock song type structures and vocals. Not well, I think. The track ‘Labyrinth of London’ proves that STS can still write brilliant mini-epics, equal parts extreme and lushly melodic, showing that in writing this type of song is where their strengths really lie.\n\nAdditionally, the vocals of Mikko Kotamaki are brilliant, as usual. He has always been one of STS’s key assets due to his mastery of multiple styles and voices; he alternatively uses monstrous death vocals, raspy black ones and clean singing and in doing so adds a lot of unique characters to the songs. The guitars, bass and drums are all fine and well played, creating the cavernous heaviness, but it’s the keyboards that really push things forward, making the songs sound huge with STS’s trademark melodic doom sound. \n\nIt pains me to have to give a Swallow the Sun album a less than amazing score, because I am a huge fan, but ‘Emerald Forest and the Blackbird’ just isn’t up there with their best work. It has some good songs and some poor ones but overall it is their slightly softer and more ethereal sound that trips them up. That’s a matter of opinion of course, some will love it, but to someone new to the band I would say forget this album and look to their back catalogue for some much better stuff. I personally will hope for some greater work from this normally amazing band in the future.\n\nOriginally written for: http://hauntingtheobscure.blogspot.co.uk/\n",
        "\nEmerald Forest and the Blackbird is the fifth full length album from Finnish melodic death/doom metal band Swallow the Sun. There are 10 songs here, totaling about 67 minutes. It is an album that will surely divide fans, as overall this is quite the departure from previous works. Some will call this a sellout album, the songs are mainstream sounding, or something along those lines. But if you keep an open mind, there is plenty to enjoy. If you are like me, you may find this album to be just as epic as their other records.\n\nThis is the band’s most melodic outing. There are acoustic guitars, 3 songs with female vocals, and most songs contain a lot of clean/acoustic guitar playing with Mikko Kotamaki singing as opposed to growling/screaming. A prime example of the new sound is the ballad This Cut is the Deepest. That is not to say that the trademark heaviness is not to be found however. Even the black metal influences that first appeared on New Moon have returned, i.e.- Hate, Lead the Way. Overall the songs contain a mix of the two sounds, for instance Of Death and Corruption, a song with clean verses and heavy choruses (as a side note, that song contains a really ripping guitar solo).\n\nFeatured on two songs is Aleah Stanbridge, who previously sang on Lights on the Lake (she has a side project with Juha Raivio called Trees of Eternity. Good stuff, check it out). She provides a vocal melody for the opening song, which is the title track. In my opinion one of the best songs on the album, it flows from one section to another to create an epic masterpiece. The other is the fourth part in the Horror series, a song called Labyrinth of London. She sings the chorus with Mikko. It is quite different than the other parts of the saga, and is a very solid track. The other guest is Anette Olzon, of Nightwish. She provides the chorus on Cathedral Walls, the first single. She gives a beautiful performance. The song was an excellent choice, as it is a good example of all the elements found on the album.\n\nIn terms of the sound, the production is stellar, overall clean/bright sounding. Every instrument has a clear tone and a good place in the mix (one could argue the bass’ presence, but that is a debate for every album ever made). The guitars have their usual (by that I mean awesome) crunchy distortion and clean tones. The acoustic guitars have a rich sound. Kai Hahto uses his new Pearl Reference Pure drum kit, and it sounds superb, as do the cymbals. The keyboards are amongst the best sounding I’ve heard from Aleksi Munter.\n\nFor performances, everyone puts out their A game. The standout member being Mikko. His singing is really strong here. And of course his extreme vocals are as good as ever. Aleksi tries some new stuff with his keyboard work, and it sounds excellent. \n\nThe album cover and cd booklet art are good. I really dig the illustrations and colour schemes. There aren’t any pictures of the band members though.\n\nTo summarize, Swallow the Sun went in a new direction here and succeeded, thanks to the always genius songwriting and some really good performances. Metallica and Morbid Angel could learn a lesson from these guys. My only complaint with the album is that the lyrics aren’t quite as good as previous albums, but otherwise, this is brilliant stuff. I can’t stop listening to it.\n",
        "\nSwallow the Sun's fifth full-length Emerald Forest and the Blackbird has come to me as an unfortunate disappointment. It's always a shame to see a band you've come to love and respect fumble, and it pains me to see one of the finest melodic death/doom metal bands to release something so... boring. \n\nI know Swallow the Sun have always been drawn out and in the past it has always been to their benefit, however here the band seem all too content to meander through softer acoustic guitar passages, and Mikko Kotamäki is all too happy to utilize his clean range, which while accomplished is featured way more prominently than before. It honestly feels like Swallow the Sun are trying to be more like My Dying Bride here, and to be frank, if I want to listen to MDB, I will.\n\nThe fact of the matter is, I look to Swallow the Sun for suffocating Finnish death/doom and with the exception of \"Labyrinth Of London (Horror Pt. IV)\" they don't offer much of what made them so special. I can understand the band trying to branch out, but this is just too much. Fuck, I wouldn't begrudge the band pushing out to new frontiers if it was demanding of my attention, but this is just so meandering, and almost crawling to the point of oblique.\n\nEmerald Forest and the Blackbird is well played, and I'm sure the absolute die-hard STS fans will find something special, but for me this just doesn't cut it. The album lacks cohesion, and a lot of the songs could be trimmed to better effect. For something so long and drawn out there isn't much to Emerald Forest... I could live with that if there were some cool crushing riffs to leave me dangling, but I just can't establish any sort of relationship with the music here. Stale, sterile, I hope this is just a misfire, as I would hate to see Swallow the Sun become an absolute snooze fest of a band. Poor form, guys.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nSwallow the Sun has consistently put out great albums and eps since 2003. After New Moon, it has been three years since Emerald Forest and the Blackbird, and what a letdown it is. Is this a \"concept\" album? Or an attempt at one combining various songs without direction thrown together? I believe the latter. \n\nThe title track is a roughly 10 minute watered down song that sounds like it was left on the floor from the New Moon sessions hat wasn't good enough to make it there. It is in typical Swallow the Sun style, i.e. deep growls combined with melody and heavy parts, to soft/clean vocals, bridging of verses and choruses, repeat. This style has worked well for them and they were among the best at it...until this album. The rest of the album follows much of the same pattern and becomes very predictable and just downright boring in all honesty. \n\nThis album also includes a fourth sequel or continuation of songs known as \"Horror\". The first being Swallow (Horror pt. 1) from the album The Morning Never Came. The song on this album is titled Labyrinth of London (Horror pt. 4). The lyrics are straight from a Jack the Ripper story. Bland, nothing new, and the music coincides with the same dullness. It is a disappointment that this song be included with the three great previous ones. It does not belong or do justice to the emotions and the continuation. Swallow the Sun should have stopped with Lights On the Lake (Horror pt. 3) from the New Moon album. \n\nOf course, this album is released on limited edition vinyl, as is becoming the trend. A white edition and green edition, both of which so far only available to order from Finland. Don't waste your money on the vinyl, let alone the cd version. Maybe in another 3 years they will put out a decent album.\n",
        "\nThe Finnish melodic death\\doom metal band \"Swallow The Sun\" is tainting all the walls of the doom\\death metal scene with the new record \"Emerald Forest and the Blackbird\". This album is a total aggression and depression eclipse, the existing of life is fully obscured by the aggression and the charming compositions and performance, The album is a cryptic poem and the members used their instruments to write its words and the vocals declare every word perfectly, absolute gloom of sixty-five minutes are enough to steal you from your world and get you trapped within this epic poem.\n\nThis is the fifth studio album after the successful releases (The Morning Never Came, Ghosts of Loss, Hope, and New Moon), a new direction has been made by the band with this record, and this release features guest vocals by Nightwish vocalist Anette Olzen, and she has done a great job in the track \"Cathedral Walls\" that has been released with a music video in the beginning of 2012. The artwork shows a Emerald eye surrounded by black feathers, with a scene of forest inside the eyes and with some taints around the whole figure.\n\nThe album opens its door with the track \"Emerald Forest And The Blackbird\" that contains a huge size of fast and slow riffs, this track features guest vocals by Aleah Stanbridge (she also did guest vocals on \"Lights on the Lake (Horror pt. 3) from the album New Moon), many passages of clean vocals parts and halls of aggressive harsh and vocals you will cross while listening to this track, Kai Hahto on drums did great efforts by making the drum line capturing the violence of guitar sounds, about ten minutes of a fascinating carnival ends with an acoustic guitar section by Juha Raivio. The using of the spoken vocals in the beginning of the song evokes many touching feelings and it also gives a good prediction about the direction of the whole song, the chantings of Aleah Stanbridge behind the spoken vocals and behind the total sound added more angelic sense to this amazing track. The song \"This Cut Is The Deepest\" is my favorite track title in this album, this track is one of the softest tracks in this record because it didn't contain any harsh or growling vocals, only clean and spoken vocals filled the atmosphere of the song. The track starts with a Strumming Guitar section, and as the clean vocals of Mikko Kotamaki sink deeper into this deep song, a vital bass work by Matti Honkonen appeared to complete the sound of the drums beat. Many feelings can be felt When the distorted guitars appear to add grimness to the structure of the total sound, and the lead guitar work completed this beautiful work with some fascinating melodies, making this song one of my favorite in this album.\n\nThe track \"Hate, Lead The Way\" is a violent piece of art, this song shows darker style and more aggressive direction than the other songs in this album, the amazing vocals work that Mikko Kotamaki has done in the Finnish black metal band (Alghazanth) has been summoned once again in this track, six minutes of roughness melted in a doomy taste, the guitar riffs cover the encircled drums-beats utterly fiercely, creating one of the darkest track for Swallow The Sun. The fourth song is \"Cathedral walls\", the majestic performance in this track speaks a million words, the delicious taste of depression and roughness is used here to write one hell of a song, every single melody in this song is a long story of flooding despair and hopeless life. Anette Olzon and her angelic voice was the completeness of this song, her melodic vocals range helped to beautify the performance of the band. The song \"Hearts Wide Shut\" faces its birth with a soft acoustic guitar section that has been followed by a slow drums beat and an essential bass line, and a lead guitar enters the field to make this song similar to the previous song, making this song \"Cathedral walls part two\", but this song has more vital melodic keyboards work by Aleksi Munter. The song \"Silent Towers\" is the shortest track in this record with only four minutes of length, more melodic clean vocals has been done by Mikko and the composition of this track reminds me of the Swedish band \"Katatonia\".\n\nLabyrinth Of London (Horror Pt. IV) is the fourth piece of the conceptual musical story \"Horror\" after the three tracks \"Lights on the Lake\", \"Don't Fall Asleep\" and \"Swallow\" from the previous albums. The song is drenched in thrilling melodies, a huge size of melodies are contained in this track and the band performed this song in a very talented way making it a highlight song, you will lose yourself easily inside this track as the keyboards work and the guitars are unveiling your anticipation. The song \"Of Death And Corruption\" starts with a growl and a charming mid-paced guitar riffs, and suddenly everything fades into the clean vocals of Mikko, and the growling starts after the end of the part with a very mighty keyboards work, this song contains a great lead guitar works and a guitar solo before the ending of the song. The track \"April 14th\" shows more main role for the drums and the keyboards, Kai Hahto (who also plays now with Wintersun) is one of the winning cards in this record because his work was really flawless and mighty, the spoken vocals parts in this song reminds me a lot of the English band \"My Dying Bride\", and the clean vocals also reminds me of \"Katatonia\", so this song is simply a mixture for two of the greatest doom metal acts in the history of the metal music. The final song in this record is \"Night Will Forgive Us\" and it presents a fantastic variations of styles, the using the acoustic guitar sections and the distorted guitars and the clean\\harsh vocals added this song to the same category of the other songs in this album. The general beautiful taste of Swallow The Sun remains constant until this track, no one single average track can be glanced in this record.\n\nThis album is a huge musical work, it's definitely one of the best doom\\death metal albums of all time, If you are a fan for this kind of music then this album must be capturing the first place on your library, and If you are not a fan for the doom\\death metal world then this album can be your gate to enter, this is truly one of the most professional metal albums.\n\nComposition: 10/10\nProduction: 10/10\nLevel Of Originality : 8/10\nLevel Of Ferocity: 8/10\n\nOriginally written for:\nhttp://www.jorzine.com\n",
        "\nI'm a bit surprised Finland's Swallow the Sun isn't a better known band by this point. There was a fair amount of buzz surrounding them when they released their first couple albums, but the momentum has seemed to dwindle over the years. The band has always released solid efforts, melodic driving doom metal with a mix of blackish/death vocals and a lot of atmosphere to propel the bleak emotions into the listener.\n\nNew Moon is their 4th album, and offers little in the way of groundbreaking material, but it's yet another consistent album which should satisfy fans of the better produced melodic death/doom. Think Shape of Despair, but a little more up-tempo and exciting, with a use of clean and harsh vocals, acoustics and keyboards to create meandering forays into the night. Most of the tracks range from 5-7 minutes in length, and there is enough happening to avoid boredom, though the slow pace and simplicity of the melodies can begin to grate if you're not in the mood. A few of the tracks that stood out most to me were \"Lights on the Lake\", with its superb, restrained use of female vocals, and excellent use of melody; \"Sleepless Swans\", a glorious crusher with some simmering organs haunting just the edge of perception; and \"Servant of Sorrow\", a crushing doom cruise which recalls the best of a band like Yearning or Isole:\n\n'Too late to leave, blinded by the last light\nToo far, too late, too deep\nTo escape from the hands of this night\nWinter has our hearts, it finally tore us apart'\n\nNew Moon boasts a steady, top of the line production standard and it's big, sad, stories should draw upon the strings of sorrow in any fan of the bands I mentioned elsewhere in this review, in addition to Opeth, mid-period Katatonia, and the like. It's a pleasant listen, though it fails to evoke any true feelings of despair and doom.\n\nHighlights: Lights on the Lake, Sleepless swans, Servant of Sorrow\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThe best way of describing this album I have read (and I think it's in one of these reviews somewhere) is that it is 'less sinister'.. it's hard to explain. If the metaphorical hearse has been speeding up starting with the lumbering giant that was \"Ghosts of Loss\" it certainly has reached top speed on this album. The pace has certainly picked up and it carries on more in the vein of \"Plague of Butterflies\" than \"Hope\" or anything before it. This isn't necessarily a bad thing, it's just different. It's certainly not brooding like previous works, but just about every song can hold its own fairly well. There are no stand out tracks to batter you relentlessly with doom and death like \"Doomed to Walk the Earth,\" and the songs don't quite have the epicly mournful feel of a song like \"The Giant,\" but they are all at least decent.\n\nIt seems they are moving more towards an artistic dark feel at this point. There is more melodic with less death and less doom. They never really have done the same thing from CD to CD so this seems like a fairly logical progression from Hope, which the primary difference again being that New Moon is more lacking on the thick doom. For a new fan or a fan venturing over from a different genre other than doom this may likely be the most accessible CD in their discography to date. If you are looking for some more brooding, depressing doom I would say start on another title. As a long time fan this is definitely not a disappointing release or route for them to go, but I would be concerned if they ventured much further down this road on upcoming releases. Solid, but not their best.\n",
        "\nFinnish melodic deathly doomsters Swallow the Sun come with album number four and no recent lack of promotional backing in an attempt to square their name alongside one of the legends of their (sub-)genre Katatonia who also have a new album out at almost exactly the same time. I'm reading that StS' new record does indeed share its' title with the new 'Twilight' movie but given I know nothing, and care even less, about that franchise I'm going to gloss over any potential similarities or coincidences that may or may not exist between the two products and go straight in for how well the more metal of the two comes across.\n\nIn what could also be construed as an excuse for lazy journalism \"New Moon\" is one of those albums that bears immediate and strong relation to it's influences and contemporaries right from the first listen, which from these a newbie to the world of Swallow the Sun could make a strong assumption of how the band sound without so much as hearing a note of music. The recipe of a more melodic and cleaner StS than ever before relies upon a mixture of Katatonia, Opeth, My Dying Bride, Paradise Lose and Novembers Doom - it's doomy and gloomy all right, but as would be noted by a fan of older albums like \"Hope\" and \"Ghosts of Loss\" not as sinister as the band once were.\n\n\"New Moon\", aside from being an album with clear Katatonia-isms to it also takes StS down the same road the Swedes have travelled in recent years, just a few stops behind. Whilst however Katatonia have gone too far for my liking, StS nail the dual needs for 'melancholy' and 'heavy' well, shown in a number of songs like the \"These Woods Breathe Evil\", \"...And Heavens Cried Blood\" and the excellent \"Lights On The Lake (Horror pt. III)\". \"Lights...\" it is that shows the greatest experimentation in nature due to the incorporation of the gorgeously fragile vocals of a lady named only as Aleah and a more developed song structure than any other. Showing an Opeth-ian tendency for wandering vast territories \"Lights...\" mixes Aleah's gentle vocals against a backdrop of raging, screaming black metal terror before getting the return bus all the way home again in a tune that feels significantly greater than it's eight allotted minutes.\n\nMikko Kotamäki utilises his sophisticated downbeat clean vocal frequently in the chorus of the title-track among others, moments evidential of where StS are likely to head on future releases. I feel it is these sections that will be the making or breaking of the band in the catchy, rising-to-a-peak formula that is becoming a greater part of their writing tendency, which being the realist I am is a sign of the band looking to expand their sound to grab the growing audience for some of the other acts I've mentioned thus far. That said, such choruses do make for an infectious and largely enjoyable listen.\n\nThe overall package here is one of utmost competency and dedication and symptomatic of a band that are on the upwards curve. The artwork contained within is sumptuous, the production is clear, layered and distinctly audible and the performance of no individual member can be rightfully dismissed, yet however I feel it is because of all of everything mentioned rather than a truly great album in this instance that will see Swallow the Sun's profile continue to rise. After many listens I have grown to like a number of songs but I must ask myself, does the album as a whole feature quite the delicate balance of melancholy and riffage that have made certain My Dying Bride, Paradise Lost or Katatonia releases the classics that they are? And the answer to that sadly is just a little bit short of 'no'. \n\nOriginally written for www.Rockfreaks.net\n",
        "\nAt first I didn't make the connection. I am not one to follow trends, so I didn't know what the new Twilight movie was called. Yes, it's embarrassing to have a Death/Doom album named after the chick flick of the century, but it would be more embarrassing to ignore a great album based only on the fact that it has a ridiculous name (think carcass). That is all I will say about the 'New Moon' issue.\n\nNow, onto the album. The first thing that needs to be said is that the sound is different. I choose to attribute this change of sound to new drummer Kai Hahto, who is now the main drummer in two of my favourite bands (ever heard of Wintersun?). With him, he brings his black metal-ish attitude into a Swallow the Sun that had only played with the idea. We must recall that Mikko Kotamäki is the lead singer in Alghazanth (a pretty epic melodic black metal band) and both Aleksi Munter and Matti Honkonen have been part of black metal bands. Yet it is with the addition of a prominent extreme metal drummer that this band finally dared to introduce their black metal influences in significant quantities. We are graced with dark, evil riffs, melodic yet unsettling, that create a tense atmosphere. Mikko also resorts to a much more regular use of his black metal screams, which are nothing but pure awesome. In the last track, Weight of the world, we even hear a blast beat introduced for a few moments.\n\nAfter hearing the change between the obviously death metal oriented Hope to a much more doomy release in Plague of Butterflies, I'm sure many fans expected New Moon to be an album that continues to demonstrate Swallow the Sun's path to maturity. I think Swallow the Sun has finally managed to carve a niche for themselves in which they can claim to be the best. Previous albums showed a lack of creativity from the guitar parts and clean vocals that were merely acceptable. Both of these problems have been eliminated for the release. When it comes to guitars, riffs are abundant and varied, and will always keep you on your toes. How the guitarists were suddenly overcome with a wave of creativity, I don't know, but I say thank you anyway.\n\nThe vocals deserve a separate paragraph in and of themselves. First, I have to say that I have always considered Mikko's deep growls as one of the best in Death Metal. They manage to have brutality, but also passion. And they are so incredibly deep! As I mentioned above, Mikko's black metal vocals are top notch as well (please listen to Alghazanth, you'll thank me later). So what about the clean vocals? Has he finally been able to pull off the 'singing' part of this band? The answer is yes and no, but both in a good way. The yes is that, for the singing choruses, the vocals are miles ahead of what they were in Hope, and somewhat superior to Plague of Butterflies. I have had the chorus for New Moon stuck in my head for about a week now. The no part comes when we see that the singing is performed less often, and the growls have an even larger part in this album than before. I think this is a good choice - if something sounds good, keep doing it. But a last addition to the vocal performance is the female vocals that appear every now and then in the background. They add a refreshing melodic feeling to the band without making the sound any less heavy, and I hope they keep the female vocalist for future releases as well.\n\nBut the reason I give this album such a high review is not based on the individual performance of the members or on the comparison to previous releases. The reason I gave this album a high review is because it achieves something that very few albums can. This is the kind of album that you don't just listen to, you experience it. It surrounds you and you can lose yourself in it. Please listen to this album, it will make your day (maybe even your week).\n\nHighlights: This is the kind of album that you need to listen to from beginning to end. Still, if I were to mention the tracks that really stand out, they would be: \"These Woods Breathe Evil\", \"Falling World\", \"New Moon\" and \"Weight of the Dead\". The rest of the album is just as good as these songs, but these were the ones that stood out to me most during my first listen.\n",
        "\nSo, Swallow the Sun has come back with a new album called New Moon. Firstly, I sincerely hope that the name, which is the same as the name of that piece of shit that is calling itself a movie, is a pure coincidence. But, be it so or not, the name of the album fits very well, since this really marks a new era in StS’s music.\n\nThere has been some changes in their music as well as in their lineup, as Pasanen quit on the drums and they recruited Hahto, who filled in during their US tour in 2007 due to Pasanen’s work problems. Hahto clearly is a skilled drummer (familiar from bands like Rotten Sound and Wintersun among others), so it was a pleasant surprise finding his name on the artist page. \n\nThe album kick starts with “These Woods Breathe Evil”, and one is instantly introduced to the new sound of StS. The biggest change is probably Kotamäki’s vocals, which has been diversified. Already on their Plague of Butterflies EP, we could hear hints of black metalish vocals from his side, but on New Moon, he really has given them space, which gives way to a much more varied listening experience. Also, you’ll notice pretty soon, that the vocals are not only death growls or black vocals, but Kotamäki’s also using clean vocals much more than on their earlier works.\n\nI don’t know whether they’re trying to get on the lists or what (well, spot number ten on finnish charts), but songs like “Falling World” and “New Moon” really is a different StS than the one I came to love. With mostly clean vocals and midtempo, they remind me more and more of post-2000 Amorphis, namely Silent Waters and Skyforger, than of Hope-era Sts. While Kotamäki’s vocals sounds really good, it’s not what I was anticipating, at all. It’ll be interesting to see them live, to see how he manages those clean vocals on stage.\n\nThe most interesting song on the album is probably the third part of the Horror-saga, “Lights on the Lake”, a doom masterpiece clocking in at almost eight minutes. It has guest vocals performed by a woman named Aleah. Her voice suits the song perfectly, as she whispers in the beginning, bringing goosebumps all over me. This is the first song on the album that manages to capture the feeling I was waiting for. The song contains everything – beautiful guest vocals, death growls, black shrieks, awesome keyboard melodies and even blastbeating. There’s a really fast paced passage in the song, where Hahto shows his skills. It sounds stupid, being on a doom album, but it actually fits really the song really good. At times, it almost feels like you’re listening to Catamenia.\n\nIf I can judge correctly, the tempo has also changed slightly, if you compare this to earlier works of theirs – there’s no almost silent passages in songs, like those found on Hope. Hahto also doesn’t play as simple as he maybe should sometimes. The only really doomy song on the album is the last song, “Weight of the Dead”, which with it’s nine minutes compares nearly to their maybe best song ever, “Doomed to Walk the Earth” from Hope. The ending has been criticized on boards, but I kind of like it, I feel like a fading end would have been so much worse.\n\nThe lyrics hasn’t changed from earlier StS releases, they’re dealing with familiar topics, like death, killing and generally despair. I also have to comment on the artwork, which is by far the best I’ve seen this year. The front cover is awesome, and the same style continues inside the booklet, with a small picture for every song. The owl picture for “These Woods Breathe Evil” is probably my favourite, also reflecting to the lyrics in the song:\n\n“The owls are not what they seem/they made me do it/am I a ghost among them?”\n\nOverall, the album is good, solid doom/death album with black metal influences, but the biggest problem with it is probably unmemorable songs. After 20 listens, I can’t really recall much from songs 2-4 and 6-7. This is not saying it’s not a good album, for that it certainly is. I just don’t know whether (all) the changes they’ve done has been done in favor for them. I’d cut down on the clean vocals (“New Moon” only has two growled lines, the rest is clean!) and alter the tempo back to the slower one. This is not selling out yet, but if it continues to develop in this direction, the next album will probably be something Ari Koivunen would put his name on. Being what it is now, I’m almost ready to call it something new, like blackened death/doom metal. What a monster of genre.\n\nTop songs to check out:\n* These Woods Breathe Evil\n* Lights on the Lake (Horror, part III)\n* Weight of the Dead\n",
        "\nSwallow the Sun has often been dismissed as a commercial band by its detractors, what rather surprised me the first time I heard this release. Of course I later got The Morning Never Came and, though I overall enjoyed it, the reasons why this Finnish sextet sometimes receives negative feedback became quite evident. However let’s give it credit for having switched from an upbeat, keyboard-laden debut to a gloomier, less audience-friendly, more intimate style, while most bands usually evolve the opposite way. Indeed, saying Ghosts of Loss isn’t funny would still sound like a euphemism.\n\nI won’t pretend Swallow the Sun’s probably most interesting release is a masterpiece by any mean though. In the realm of intensely crushing but still highly melodic doom, Draconian’s Arcane Rain Fell is a summit very unlikely to be reached again – not even by Draconian themselves I’m afraid, but that’s another point. Granted, the production here is perfect: it’s just as oppressive as doom can be, slightly misty, with the electric guitars sounding thick and the occasional acoustic ones chilly, while the keyboards have been largely turned down compared to the previous album. But the songwriting just appears a tad too formulaic and, I’m afraid I’ll have to say it, slightly boring. Juha Raivio undoubtedly knows his scales, but he still lacks this little something which can’t be transmitted by anyone – genius. The most attention-catching track is, probably not surprisingly, the only one reminding of The Morning Never Came: the faster Descending Winters. Amongst all these slow monsters it appears like both an intruder and a breath of fresh air.\n\nBut again, the true qualities of this opus are elsewhere. As its title suggests it The Giant is, well, HUGE. Of course the formula is nothing really novel: it opens gently on highly melodic acoustic guitars and clean vocals before suddenly exploding in all its doom might and glory as a superb opening to the whole album. The comparison with My Dying Bride circa The Dreadful Hours could be hardly escaped, and let’s admit The Dreadful Hours is more thoughtful, but there’s no need to be picky. However, trying to replay a successful trick has always appeared like a dangerous exercise, and with Gloom Beauty and Despair the band just failed it. While the crystalline acoustic intro of The Giant sounds disturbing, beginning a song by a three minutes long intro (more than one third of the track!) exclusively consisting in whispers and muffled down guitars is a perfect nonsense. Whatever the intrinsic musical qualities of the following song might be, and this one isn’t even particularly remarkable to begin with, such an opening would render it worthless for anyone. The doom lover may usually be patient, but too much is too much.\n\nThere’s no need to detail most of the tracks. Once The Giant has set the tone for the entire album, everything else saved Descending Winters is little more than variations around the same theme. Of course it may still be differentiated between a consistent, leaden track like Psychopath’s Lair and the pretty vapid Fragile, probably the weakest moment here. Of course the growls become rather monotonous after a while. Still as most albums supported by a carefully built atmosphere, this one deserves to be listened to as a whole and not as a series of individuals that, again, aren’t the most remarkable ever. I couldn’t prevent myself from singling out Ghost of Laura Palmer though, if only for the fact I haven’t seen it mentioned elsewhere while it might well be both the darkest and the best of the eight songs – indeed, better than the well-known Giant. Yes, the title is totally cretin, but after all little more than any other (Forgive Her? Gloom Beauty and Despair? Psychopath’s Lair?) and since when do you judge the book by its cover I may ask. Just realize that while some tracks seem to like a bit of structure or substance the main riff here is as elementary as HEAVY, I mean one thousand pounds heavy as every good doom has to be, and that it’s just the most obsessive, creepy track of the whole album, the culmination of what I called the act’s intimate work. \n\nI wouldn’t say it’s indispensable to get an album from Swallow the Sun. But if you have to get one, more than the a tad overrated The Morning Never Came, Ghosts of Loss should be the way to go. It might not be their most attractive at first glance (well, it has boobs on the cover though, that’s never negligible), but probably their most sincere.\n\nHighlights: The Giant, Descending Winters, Psychopath’s Lair, Ghost of Laura Palmer\n",
        "\nAfter checking out numerous youtube videos of this band and their blend of slow, doom-laden songs and brutal death metal flashes, I decided it was time to invest in an album. This, being their debut, was where I figured I should start.\n\nI believe I got this album for Christmas, so there I was on the eve of Christmas Day, that great atmosphere still around in abundance. I put this CD on for a spin, and I was taken away for its duration, to a dark land far away in my mind. This land may be dark, but it is by no stretch of the imagination dull.\n\nThe music here starts as it means to go on, dropping in with a thump after a short piano intro. The crunching guitars grind along slowly and fairly melodically throughout the album, churning out some memorable riffs. Nothing extremely technical, but it doesn't need to be to fit in well with the rest of the collective.\n\nThe drums and bass work well together, from what I can make out of the bass. The bass is, seemingly to me, quite low in the mix and buried often by the wall of guitars. The drums on the other hand, are very prominent, but not so much that it gets annoying. The stick-work here is very promising, slow tempos handled masterfully, driving forward in the mission of despair for the metal masses. When a flash of brutality is needed, the drums carry it out well.\n\nThe vocals on this disc are well placed and fit the music very well. Consisting of mainly low death growls and complemented occasionally with melodic clean singing, they are consistently good and never in the way. The lyrics deal with such things you might expect from a band named \"Swallow the Sun\", and indeed a band classified as \"doom metal\".\n\nRecommended? For fans of slow, brooding and atmospheric metal.\n",
        "\nLast year I was told of a band who produced wonderful melodic doom/death music. At first I was sketchy on the idea, as at the time I wasn't a big fan of Doom metal, Can't get enough of it now, When I heard of the band's name, \"Swallow the Sun\", I just thought it was kind of cheesey. So I obtained the albums, had a listen, and I loved their work ever since. I was stoked to find \"Plague of Butterflies\" in the store down here in little New Zealand, people from here will know why because of our shit stores, especially in the South. I had alot of fun with this release blasting through the sound system.\n\nChapter I: Losing the Sunsets. This chapter starts off with a nice melodic guitar piece for a couple of minutes when you get an almost sudden, powerful churning chords. The feeling of the bass was quite outstanding. The crashes of the cymbals ringing out. It was just heaven. Which builds to a steady tune. Which then dies out to another melodic piece with MIkko's clean vocals being at the front at this time. He is quite a great vocalist, nice clean voice, but can really lay down the low growls, and those almost black metal screech-esqe vocals. The lyrics fit well with the band and their music. Worthy of doom indeed. Feeling cold and lonely. How wonderful, eh? Curse you, Evael, Curse you.\n\nTowards the end of the chapter, you get a melancholic and atmospheric piece which dies to the blowing of the wind, followed by some neat keyboards. And then BAM! You get the heavy riffing and the screeching vocals into Chapter II: Plague of Butterflies. This sudden heavyness is probably my favourite quality of Swallow the Sun. The tune of the guitars is lovely, it doesn't have that droning sound and is really quite mellow, and the wails are simply superb. Once again at 19 minutes after some heavy doom riffing and technical drumming you get another atmospheric piece. Soothing, mellow and calm. The blowing of the wind and a quiet guitar tune that is really quite relaxing. And when you wish it would just go on, it hits you again. The riff, the drums, the bass, it all just kinda jumps on you. Which then gradually dies down to another melancholic piece. A fine ending of the second chapter.\n\nChapter III: Evael 10:00 kicks in with those guitars we love so much, but soon dies down, and we revisit Mikko's clean vocals. Sounding more dramatic than I've ever heard him before. Kicking into a guitar and keyboard melody which is fitting, with more harsh vocals, back down to the clean. The drumming is rather relaxed. If only double kicks could be incorporated into this somehow, how orgasmic that would be... But i don't see it happening, but then again Swallow the Sun doesn't need to do so. Pasanen always shows his skill and Plague of Butterflies is no exception. Leading up to the end of this majestic song... Lovely harsh vocals, a drumming pattern worthy of excellance, atmoshperical and melodic guitar/keyboard symphonies droning out to a keyboard finalé into silence.\n\nDuring the silence, I was just sitting there. Pondering what I had just heard. With almost seemed like a tear in my eye. That was one of the most beautiful pieces I have heard in my whole life. Coming close to My Dying Bride's \"For My Fallen Angel\".\n\nAlso included on this EP are the tracks from their unreleased 2003 demo \"Out of this Gloomy Light\" which just goes on to justify why Swallow the Sun are one of the greatest doom/death bands out there today. This one I do recommend to those into doom/death. And if you're not. Well why not start here?\n",
        "\nThis is a surprisingly decent enough band. They are categorized as melodic doom and death metal. But I don’t see how they are melodic; the music they play is just too slow to be considered melodic. It sounds like doom metal and I guess the harsh vocals could be considered death metal if you think about it but that’s about it for that part. Anyways, this isn’t your typical doom metal band. When I think of doom metal I usually think of some depressive dull type like My Dying Bride or that droning shit Sun O))) does. But they don’t sound anything like those types of doom bands, which I kind of like. \n\nThe first thing the do good and the best thing they do are setting up the atmosphere. They soothing piano play and the slow guitar riffs help out in this factor. Now the guitars themselves do nothing out of the ordinary, there mostly droning cords or slides if anything. There kind of just there in the background I guess you could say. But when the piano starts playing the atmosphere and doom feel starts to build up. The piano has a very soft and fragile sound to it, which is good for doom metal. Helps make the music depressing, which I like in doom metal. \n\nAlso, the harsh/clean vocals help when there in the mix of things. Switching from clean to harsh or vise versa is a good way to change the flow of the music, and a better way to improve the atmosphere of it all. The vocals themselves however are nothing spectacular, especially the harsh ones. Yet having the clean vocals over when the piano is playing sounds wonderful. “Hold This Woe” sounds great with the clean/harsh vocal switches. Although the guitar over the piano in the main verse kind of ruins it. It’s mostly played by holding the same note over and over, like they were going for a drone approach, but the guitar tone is too high unlike it is in doom metal, it sounds like melodic death.\n\nOk so what the band does well is they set up a sorrowful atmosphere, with some beautiful piano play and some nice clean vocal parts. Yet the guitar tone could have been lower like more doom metal bands, and the harsh vocals and just average at best. But what they do well they can do amazingly. If you want to hear a different style of doom metal I would recommend Swallow The Sun, for they are rather good.\n",
        "\nSwallow The Sun has maintained their consistency fairly well during their entire career, and even though the 2007 album ”Hope” had some disturbingly present modern metal influences and possibly somewhat lower overall quality than especially the debut album, ”The Morning Never Came”, all their full-length albums have been pleasant listening experiences with aspects both original and familiar. Whether crushing your ears with slow and heavy doom, or breaking your heart with melodies of melancholy and sorrow, their modern brand of doom metal has always been innovative and lucid at the same time. ”Plague Of Butterflies” sadly doesn't live up to their former releases at all: compared to the easily understood yet intense doom metal of their former years, this EP is in no way equal. It's hard to listen most of the time, and not really a rewarding experience. The melodies are sometimes quite generic and of a style already used more than enough by bands like Insomnium, Daylight Dies, Saturnus and Swallow The Sun itself. There are many other styles of metal here – none of them original or new anymore – but even so the nature of ”Plague Of Butterflies” is repetitive: the only things that this helps to create are inconsistency and lack of direction.\n\nThe over 34 minutes long song, ”Plague Of Butterflies”, starts with an acoustic intro typical to Swallow The Sun, but compared to almost any other of their songs, it's disappointingly unmemorable. Heavy guitars soon take over the stage, and while they sound good as ever, sound means nothing when the listener is offered nothing but chugging of a slow rhythm guitar and a failed attempt at creating a melancholic atmosphere, a bland melody that everyone has already heard at least twice before. As another positive note about the production, Swallow The Sun has finally got the drum sounds right: what used to be a downside in Swallow The Sun's music – the drum sounds – is now a positive element. The low-pitched growled vocals are doomy as ever, and the choirs of clean vocals sound quite good, though they offer nothing very interesting melody wise. Kotamäki's screams sound much more controlled and restricted than before and have lost much power, but despite being quite unmemorable, they aren't bad. Keyboards take a background position, which works for the good of the album. They help to make the simplistic guitar melodies more atmospheric and give an epic feel to the music, which guitars alone – on this album – certainly fail to do. As the part concludes, the music is, at its best, filled with atmosphere and delivers a great emotional impact to the listener. It isn't genius like ”Shape Of Despair”, but comparable to it: great effect with surprisingly little effort.\n\nAfter some silence, a piano intro comes, followed by a heavy and fast metal part with blastbeats that certainly brings variety to this EP. While a new thing for Swallow The Sun and definitely an exciting and unsuspected turn, it's almost complete Dimmu Borgir worship, starting from keyboard patterns, guitar riffs and even vocals, accompanied with some vague likeness of what the band is known for – what follows is like a melting pot of modern extreme metal styles. Haunting keyboards accompany the repetitive rhythm guitar chugging as the vocalist unleashes his death growls and Shagrath impersonations. To further elaborate this unoriginality, the vocalist uses growls and Shagrath vocals, in some parts, simultaneously, which is clearly a trademark of bands like Dimmu Borgir. The rhythm guitar goes on to play a dissonant riff, like a fusion of the aforementioned band and Opeth, with a pinch harmonic an everything, also waving goodbye to the little remaining originality this part ever showed. The lead guitar is gone – the band probably couldn't write a lead suitable for such a drastic departure from their real style – and overall, the appeal is minimal. Fortunately, this abomination is followed by an excellent and emotional part with a simple guitar arpeggio, melancholic piano, audible bass (for once) and a drum beat from Opeth's Damnation.\n\nDimmu Borgir leaves the stage and Swallow The Sun comes back with their trademark style, and manages to play some quite melancholic melodies. There aren't many innovation or new ideas, but Swallow The Sun creates some quite emotional interesting and sounds, reminiscent of My Dying Bride and early Anathema. ”Plague Of Butterflies” has an epic climax in the end, which is the proper way to end a song over half an hour long. It's emotional, epic and filled with atmosphere, and though it really looks up to the way Moonsorrow ends songs of similar length, it is quite tasteful and well written. Again, it doesn't sound like the result of hard work or like a brainchild of a genius, but it succeeds at ending the song in an appropriate way.\n\nIt's a shame that the album is extremely inconsistent in quality, and compared to Swallow The Sun's other releases, the lack of originality is remarkable. As a whole, ”Plague Of Butterflies” is really mediocre because of its inconsistency, but there are some quite good parts and the production is even better than before, making it mostly a worthy listen. Listening is indeed the difficult part though: this EP lacks direction to the point that it's hard to pay attention to when it doesn't progress enough. What increases the worth of this EP is that ”Plague Of Butterflies” also includes the 2003 demo, ”Out Of This Gloomy Light”. For demo versions of Swallow The Sun's legendary songs like ”Through Her Silvery Body”, and ”Swallow”, these are surprisingly good. Only the production is noticeably weaker compared to the album versions: the guitars lack punch and the bass drum sounds terrible. Kotamäki's screams are excellent here, much better than in the title track – this contrast elaborates the sad fact that the vocalist's abilities are apparently declining. All in all, this EP is one for the fans and collectors – one interested in the demo or the band's exploration of symphonic black metal territories, failed experiment or not, might find ”Plague Of Butterflies” worth the money, and as a whole, the EP will surely bring a Swallow The Sun fan a quality listening experience. Others are suggested to stick with the full-length albums of this band.\n",
        "\nGoing into dangerously ‘kvlt’ territory, only three copies were made of Swallow The Sun’s first demo, ‘Out Of This Gloomy Light’. If you aren’t one of the lucky and/or obsessive few who own one of these demos, this new EP slaps it into a nice shiny super-jewel case for you. While final versions of all these songs appeared on their debut full-length, ‘The Morning Never Came’, there is still a high quality to them. It manages to prove also that the band’s positively colossal sound is the work of the band themselves, and not a technically gifted studio lackey. The songs are fabulously well written, with excellent atmosphere and mix despite the clearly low-key studio job.\n\n... now that that’s out of the way, let’s talk about the main attraction of this new offering, the brand new 34 minute title track. Something of this scale is not all that unfamiliar in doom metal circles, however Finland’s Swallow The Sun have only ever recorded one song that extends past ten minutes, yet alone thirty. Of course, Swallow The Sun are not a band to disappoint, and ‘Plague Of Butterflies’ certainly doesn’t change that. It comprises three movements, yet retains a commendable continuity; where each part flows naturally into the next. Sonically, it’s the band’s established melodic doom sound, as crushing as ever, but this one sees some interesting new developments. At points some black metal influence can be heard, through the sympho-BM tinged keyboard work of Aleksi Munter or, more prominently, through a new vocal style that Mikko Kotamäki can add to his repertoire: A nice juicy black metal shriek that really works for those times when his clean voice and his absolutely stellar low growls aren’t quite perfect enough.\n\nTrees and other foliage that reflect the truly relevant dark sorrowful abyss that is my metaphysical being, you know the drill. All jokes aside though, the lyrics in ‘Plague Of Butterflies’, penned by guitarist Juha Raivio, are very good. As you may have guessed, they are of a doom standard, nice and dark, and very stylised without sounding half as pretentious as most bands that write this way. There is a story-like quality to the way that the three ‘chapters’ of the song unfold, tightly bound together yet still holding the individual identity that is established by the music. However, the vocals alone are enough to support any integrity that these lyrics may or may not have, and the fact that these lyrics are solid anyway is merely a bonus.\n\nAs a project that allegedly began as an attempt to write film music, ‘Plague Of Butterflies’ is a great success as a piece of Swallow The Sun music. Whilst it at times lacks some of the direct punch that the band’s usual shorter pieces have, it instead offers definitive proof that Swallow The Sun is not a one trick pony. Side by side, you can see the band’s very earliest output and their most recent, and you can see that overzealous genre hopping is not what ‘evolves’ a band successfully. What evolves a band is something like ‘Plague Of Butterflies’, which toys with development and progression enough to stand on it's own two feet, but also owes itself to previous work.\n",
        "\nI love when bands release EPs before an upcoming album. It gives you a preview of whats to come which is usually great. Of course there are some EPs that are made to warn you an upcoming album will be shit. (Looking at you In Flames)\n\nThe first song is an edited version of Don't Fall Asleep (Horror Pt. 2). While a great song when edited I highly recommend the full version which is also on this EP, as it's the full song and how it was originally supposed to be. Next up we have one of the greatest covers ever done. The original is done by some people who aren't important. The clean vocals are done by Tomi of Amorphis who has an amazing voice. The growling is handled by Mikko of Swallow the Sun who sounds better than ever. I really love the sync part they have near the end, singing with growling over it. \nThe final song is the full version of Don't Fall Asleep (Horror Pt. 2). Which might just be Swallow the Sun's best song ever. The lyrics really standout in this song and are some of the best that I have read from Mikko The guitar melody at 1:58 is also something to note down.\n\nAll in all this is a really nice little EP that shows us Swallow the Sun hadn't lost their touch just yet. If you're a fan of the band then you already have the album Hope in which case, you should get this EP for the amazing cover.\n",
        "\nThe album begins with the track entitled Hope which begins with a slow but quickly increasing in sound, intro that then turns into a heavy doom sound that make show immediately that the album is still as heavy as before, albeit having more clean vocals then their previous two albums. The vocals soon begin with Mikko Kotamäki utilizing clean vocals while the background is quiet and then once the guitars and drums become heavier he switches into the Doom Metal vocals that fit perfectly with the song. Plus, in the first segment of harsh vocals he says possibly my favorite line from the song which would be:\n\n\nCrush my mouth, for it still sings praises to you\nRun the blood out from my throat\nFor I'm still your's\n\nThe rest of the song is followed by more of a use on the harsh vocals whilst continuing the heavy guitars and drums. The keyboards are most likely the most important part to the song in my opinion, as they bring that signature Swallow The Sun sound that makes the band as amazing as they are.\n\nAfter that 7 minute song you're quickly thrown back into the doom with These Hours Of Despair and a quick pick-up in the guitar section and a sudden burst from the vocal department. Then the listener is shown into a more dark style of vocals but still a melodic style of guitar playing. It's the chorus and that seals the song for me and then to have the verse afterwards is just extra icing on the cake. After the chorus they introduce the third verse which is much slower and goes to back to the dark vocals that were shown at the beginning of the song. It's truly quite a masterpiece of a song for being only 6 minutes long.\n\nNow, the first and only guest appearance on the album is shown on The Justice Of Suffering which features Jonas Renkse of Katatonia reciting the chorus for the song. Meanwhile the rest of the song still has Mikko at the helm of the vocals while he performs the heavy parts in the song. After the chorus is performed for the second time the song is met with a more slowed down part and Jonas performing the next verse and Mikko concluding the verse with the dark vocals that have been showcased through most of the song. Then the song finishes with the chorus, once again sung by Jonas and ending the song in a slow, decreasing keyboard element.\n\nAnd now for my favorite song on the album, Don't Fall asleep (Horror Pt. 2) which features my favorite lyrics on the album and has more use of clean vocals from Mikko then the rest of the album. the repetition used in the guitars while the chorus is sung helps add to the effect of the song, not to mention the constant use of the line Don't Fall Asleep. And about three-quarters through the song you get quite the clever use of the keyboards and other instruments, interchanging to create an original sound that hasn't been on their previous songs. This song was also made into a video which uses an edited version of the song for the purpose of the video which can be seen below.\n\n\n\nHere is where the album transitions into more of a Doom Metal sound with the last four tracks being more heavier but transitioning in well to fit with the first half. Too Cold For Tears begins with the slow clean vocals and then alternates between those and the doom vocals that make up the latter half of the album. Plus the song features some harsh vocals that make the album have some Melodic Death elements which is good and bad at the same time. Nevertheless, it's still a Melodic Doom Metal song and is created with a sound not heard before. You would think that the song being nine minutes would mean that it would get boring eventually but STS manage to make it entertaining still with the crushing feeling that the guitars give and drums mixed together give and then the keyboards coming in to break long periods of silence as to show that there is movement still within the song and that it's building up to something big. In this case, it does actually build up to something which is good.\n\nThe next two songs The Empty Skies and No Light, No Hope are heavy as was built up to by the previous song but they tended to not be as entertaining as the previous songs for some reason. It might have just been that I thought it was trying too hard to be heavy when they could've maybe been better as slower songs. No Light, No Hope does however feature some catchy parts that showcase melody still. It just didn't overwhelm me like the rest of the album did.\n\nFinally, the album hits the final track, Doomed To Walk The Earth, which as an ending to the album, is great. It doesn't use clean vocals and it keeps true to the heavier side that they have been exhibiting for the last couple tracks. It still shows it has melody but remains the heaviest track on the album. It also has some female vocals that are more just a light noise in the background then anything else. It really doesn't require them but I'm not going to complain since female vocals are always a plus in my books. If you enjoy the song then you will most likely enjoy other Doom Metal bands as well like November's Doom. This song also was turned into a video and the video itself is a direct sequel to the Don't Fall Asleep (Horror Pt. 2) video. The video is shown below and features an edit of the song once again.\n\n\nOverall, the album is an amazing addition to any metal fans collection. It showcases all of Swallow The Sun's strong points and what has made them popular. It has some sections that aren't up to par with the rest of the album but they are easy enough to ignore due to the sheer amounts of awesome within the rest of the songs. It's definitely contending for my favorite album by these guys and they are set to release another album this September which I cannot wait for.\n",
        "\nI recently heard this single and was quite surprised.\n\nThe song Forgive Her... is a bit more melodic than their other albums. It adds a much more tranquil feeling to the music in its own way. The guitars create a gloomy atmosphere, however they are quite repetitive. The guitars are nothing special, it was a fairly unoriginal style that you could hear from many generic bands. The drums change tempos and beats throughout the song at times which is kinda cool. The song was well done but nothing special from these guys.\n\nThis single is creative though because they covered Candlemass' song Solitude. They used clean vocals throughout the entire song which was a change for these guys. The song was well done and it is enjoyable if you get past the \"emo-like\" lyrics. \n\nForgive Her... is not one of their better songs in my opinion.\nI would only recommend purchasing or downloading this for the cover song.\n",
        "\nThis band is in the business of being gloomy. They've been whipping the horses a bit since that lumbering behemoth Ghosts of Loss, and their hearse has picked up a bit of pace as a result. What's evident right out of the box is that these guys have been practising with their spit and polish - the arrangements, orchestration and yeah, even the individual playing has had the screws tightened in a big way. Miko Kotamäki's clean vocals are getting better with each release (though he's got some big-time assistance in the form of guest vocal perfomances by Jonas Renkse from Katatonia and Tomi Joutsen from Finnish compatriots Amorphis) and his growl's still that familiar full-throttle roar. Somehow though, there's still something holding it back from topping the quality of their debut - perhaps the added slickness and the hometown hero status they've attained since the early days have robbed them of the outright despair that most fledgling bands wear like a badge.\n\n\nMinor peeves aside, there's quite a bit here for those who like the death/doom formula. The title track and The Justice of Suffering pull off the mid-tempo catchy dirge angle remarkably well and Don't Fall Asleep, despite having to live with a totally defeatist name, is another high point, going through the flow between tranquility and the heavy sound in a smooth, pleasing manner. In fact, if not for the extreme growls and the occasional prohibitive length, a lot of these tracks could be considered radio-ready. Towards the end, Doomed to Walk the Earth evokes shades of their earlier gloomy brilliance, from the evil rumblings in the beginning, the creepy orchestral/piano bits worked into the middle and finally, the way it builds up to a hauntingly beautiful close.\n\n\nThe remaining tracks are alright, though they seem to have their fair share of filler here and there, and the album does seem to drag like an overloaded mule towards the middle. The songs that work, however, are worth the price of entry. So, for those of you who like the symphonic death/doom trip and don't have any hardline principle against occasionally skipping tracks, this is definitely worthy of your attention. Hope is a pretty appropriate title in that regard - there's still some of it left.\n\nhttp://kvltsite.com/\n",
        "\nThe title of Swallow the Sun's third studio offering is a paradox. The album, titled Hope, is anything but hopeful. It is an album of despair, melancholy and ache; a piece so emotional it may very well cause emotional people to tear up. This may not be the Finnish band's heaviest record to date, but what it lacks in pure heaviness it certainly more than makes up for in melody and sheer beauty. Do not be fooled, Hope is a very heavy record, but just like Swedish progressive metal masters Opeth, Swallow the Sun manages to be heavy and at the same time produce melodies that range from captivating to touching.\n\nThe album starts out in a pretty similar fashion to Ghosts of Loss. Hope is a song that starts out with clean guitars accompanying Mikko Kotamaki's clean vocals and then going into a heavier riff accented by his deep growl. The entire song keeps recreating the pace of the band's previous offering, which might misguide first-time listeners to feel a sense of Déjà vu, even though the song sounds considerably different and is much shorter than the appropriately-named The Giant. This feeling is immediately mitigated by the following tune, These Hours of Despair, which marks the shift towards the more melodic emotional impact that's the theme of this album. The beginning might lead you to think this is a relatively fast-paced song as it starts with a pretty intense riff and double-bass drumming which might remind listeners of Novembers Doom's latest, The Novella Reservoir. However, the song swiftly surprises us with a hypnotizing guitar riff so brilliantly simple the mind boggles; it's just one palm-muted note repeated several times in a rhythmic fashion, accented by the drums and excellent keyboard work – the entire song has a sort of hypnotic feel to it. From here on, the album just keeps getting more melancholic and impressive. The Justice of Suffering incorporates Katatonia leadman Johan Renkse's clean vocals in another chorus that encourages the eyes to close and the mind to lose itself in this sea of beauty. While Renkse's vocals are indeed excellent, they also overshadow Kotamaki's clean vocals, which often sound a little off-key.\n\nThese three opening tracks set the stage and once they're done listeners should know they're in for quite a ride. Hope isn't much of an album made of entire memorable songs, it's more of an album that consists of really memorable moments. Each and every song on it is spectacularly, marvelously moving with just enough of the emotional impact that a melodic doom/death band should create. However, it's the small moments that make each song memorable on its own. For example, on the album closer, Doomed to Walk the Earth, there are very subtle-yet-powerful female operatic vocals in the background of what is quite possibly the band's darkest song to date. Another good example of it is a song called The Empty Skies. This song, in my humble opinion, is the band's best, most-versatile song ever. The main melody in this song is moving to the point where it might interrupt whatever you might be doing while listening to it. As amazing as it is, it's not the main melody that gives the song such a punch. It's not even the ever-changing, almost progressive feel it creates with some excellent vocals and riffing. It's a moment of buildup where the song prepares the listeners, as if telling them to look out for the emotional punch it is about to deliver. And it does deliver. This portion of the song, played between the 04:10 and the 05:58 marks is one of my favorite musical moments of all time. It's really that powerful, words cannot really describe it.\n\nThe production on this masterpiece is excellent. The band has developed a certain sound that's instantly recognizable and fixed some of the problems that were apparent on previous albums, like a deep, unbalanced sound that understates the music. This time the instruments are well-balanced and none of them overshadow the others. Whether it's the drums, guitars, keyboards, bass or Kotamaki's vocals, everything is given exactly the accent it needs and the entire sound of the album benefits as a result. Speaking of Kotamaki's vocals, thankfully his varied growl is put to awesome use on Hope. One of the things that bothered me on the band's two previous outings is that the growls were pretty monotonous and there was a sort of squeak to them that occasionally turned me off. These problems were addressed here – he uses both his deep, menacing gurgle and his high-pitched, almost black-metal-ish screams, sometimes at the same time to create a powerful, demonic menace. There's no squeaking at all and the lyrics are easy enough to make out. As stated above, his clean vocals are still a bit off, though this isn't bothersome one bit. \n\nOnce the album is done and the room fills with silence, it's hard to fault Hope for anything, really. It's an album at least as powerful as a well-made drama, packed with emotional moments that will have the listener, as said, hypnotized for 57 minutes and even longer if you decide to purchase the special edition, which includes a Timo Rautiainen & Trio Niskalaukaus cover called These Low Lands [originally Alavilla mailla]) that comes with a complete translation to English. Either way, Hope is a marvelous record that should be owned by any fan of doom metal or melodic metal in general. This is definitely one of the, if not the, best doom metal album of 2007 and a successful step forward for the band that also marks its best creation so far. This album really has me pumped up for whatever material the band will release in the future, but they're going to have their work cut out for them – this titan is going to be a true challenge to surpass.\n",
        "\nI run into Swallow the Sun when I started to get into Finnish Metal scene. \n\"Ghost Of Loss\" is the second full length album. The first album \"The Morning Never Came\" was a bit more up tempo and had no funeral doom metal influences. \"Ghost Of Loss\" is the same dark music, but a bit slower and has slight funeral influences. \nSwallow the Sun writes powerful, and emotional and melodic music, using elements of doom metal, melodic death metal, and funeral doom metal. The structure of songs is very epic. They try to captivate you with heavy riffs, atmospheric keyboards, and dark melodies. Vocals are fucking powerful as well. Vocalist has quality clean voice, and deep sinister death metal voice, which is perfectly balanced throughout the songs. Album has no weak songs, however, the most powerful for my ears were: Descending Winters, Psychopath Lair (sinister fucking riffs and cool keyboards), and Fragile (dark and beautiful song). The only weakness is the luck of real guitar solos. In my opinion few real guitar solos would add elegance for songs. Also, the funeral doom metal sections were a little bit boring and too long. But it depends on the listener. I just do not enjoy funeral doom metal too much. Overall, I would recommend this album for people, who like death metal, doom metal, melodic death metal.\n",
        "\nFinland’s Swallow The Sun have been a Doom favorite ever since the release of their lauded The Morning Never Came and Ghosts Of Loss has long been a personal favorite of mine as well, so when I tracked down a copy of their 2007 full-length Hope, I was excited. However, my excitement abated when I realized that they hadn’t begun to top the previous two albums.\n\nSwallow The Sun play a melodic death/doom mix that has recently been gaining popularity within the metal scene and to their credit, they play it very well. They go back and forth between monstrous riffs and clean interludes regularly, giving each song its own feel and pacing, which in Doom is always a boon. The keyboards take less precedence on this album than their previous efforts, which is truly a shame as my favorite part of this band has always been their atmospheres. Few are as good as keyboardist Aleksi Munter at creating an overwhelming feeling of dread and despair through the use of his ethereal progressions. The guitarists also deserve a mention on this album, because they are one of the few elements that seem to be stepped up on a large scale. Both Juha and Markus trade off leads seamlessly and keep things interesting. The melodies are very dominate, but too often resort to the same minor harmonics and other painful clichés in any sort of melodic metal. \n\nMy biggest complaint with Hope is the vocals. Gone are the overwhelming guttural roars and raspy screams laden with desperation. Vocalist Mikko seems very subdued in his delivery and it sounds rather routine. The drumming is also a step down from their previous works, although that is most likely a product of the wimpy production this disc received. Doom needs to be bass heavy, and yet the entire bottom section seems to be missing. Older Swallow The Sun would make me jump when the heavy parts thundered in, but Hope doesn’t follow suit.\n\nThe lyrics are still as morbid as ever, with the predominate theme being love lost. The vocal delivery, as lackluster as it is, is still well timed within the context of the song and at times feels like another method of percussion. But again, due to a lack of punch and conviction, what could have been a major highlight for Hope merely makes an interesting side note. \n\nOverall, this is decent effort, but as I and many of their fans know, Swallow The Sun is more than capable of topping Ghosts Of Loss. Hopefully with their next effort, they take the time to work out production issues and bring back those factors that made them one of my favorite melodic Doom bands.\n",
        "\nSwallow the Sun has become one of my many favorite\nbands within the last year or so. A perfect combination of melodic death with doom/death Metal. I especially enjoy the versatility of the band to play more mid-paced doom ('The Justice of Suffering', 'Hope') as well as some in a funeral pace ('Too Cold For Tears', 'Doomed to Walk the Earth', [the end of] 'Don't Fall Asleep').\n\nThe lyrics are quite well written, though the story lines about haunting atmosphere, psychotic love and horror stories make for quite an experience. Vox themselves are surprisingly deep and powerful in the growls and the very creepy, on pitch singing makes for a winning combination. The guitars while not over complicated, are beautifully melodic, melancholic and orchestrated within the rhythms. The bass actually adds to the movement instead of taking away the tempo (taking the music further away from the funeral doom genre) and deepens the intensity of each chord it helps to finish off. The keyboards are very chill and well suited in the background of the music. I don't know how good the sound would come out without them actually. They seem to be the curtain behind the performance: remove them and you'll reveal the ugly inter-working pieces and processes behind the band. The drumming is really quite well placed on this album. The drummer manages to be complex within a doom pace and at the same time maintains a certain simplicity and flow. Almost as if calculating every guitar riff 4 seconds before it happens, the small fills and quick small cymbal work is impressive and could be considered a signature.\n\n\nAs we know, there is the song for which Jonas Renkse of Katatonia did guest vocals. It's not bad, kinda catchy at times. Did anyone pick up on that the riff at the :30 mark as well as at 2:24 seems eerily similar to the beginning of Murder (see: Brave *Murder* Day album)...? hmmm... Maybe I just smoke too much. ha. The Timo Rautiainen & Trio Niskalaukaus cover, released just 2 months after the official split-up announcement, translated to 'These Low Lands' (which seems ironic to translate by the way) fits nicely into the Swallow the Sun slow paced sound. Simplistic with incredible sound layers, like a gigantic storm front pushing it way through the sky, it also has a folky/melodic feel to it. Also we have the sequel to 'Horror' (see: The Morning Never Came album) being the single. When I first heard this record, this was my favorite song. It had everything; epic, eerie atmosphere, a catchy melody, an almost satirical breakdown (you would understand that better if you lived near my local scene), and powerfully brutal funeral march at the end. It really is what made me listen to this record, but during such, I learned to enjoy the real unique thing about this album. On further studious examination of this album I came to find that there were numerous memorable riffs, melodies and drum compositions (being a drummer myself). In every song (least though in 'The Justice of Suffering' and 'Don't Fall Asleep') there are NOT SO OBVIOUS little complexities that make this band so majestically solid and still fragile and dark.\n\nMaybe I'm painting a picture here that only I can appreciate, but give it a listen and you decide for yourself.\n",
        "\nRight. What we have here is a Finnish masterpiece when it comes to doom metal. I read one review of this album, and went off right away to buy it. I’ve never ever bought a CD that brings as much feelings up to the surface as this one. Several times, I found myself having gooseflesh all over, solely because of the unbelievable atmosphere StS manages to create.\n\nThe album starts with the song Hope, which is also the album title. Either the band is mocking the users, or they have a strange form of humour, since “hope” is mentioned in all songs but two, and I’ve never encountered a CD that radiates such hopelessness as this one does.\n\nWell, on to the music, then. As I said, Hope starts the slow, dark trip toward the hopelessness the listener will probably feel after listening to this record, if he/she isn’t completely emotionless. It starts with a nice guitar, that builds up slowly, then in kicks the drums, which, I think, sound excellent on this one. Pasanen has got rid of his usual style to do too much work with the drums, and now he manages to keep it simple when it fits in the song. Then Kotamäki starts to sing, with a beautiful, clean voice. He sings the first verse clean, but when the chorus comes, the growl starts. I like Kotamäki’s voice, he manages to even growl in a way that still makes it possible to hear what he’s singing.\n\nAll this, wrapped up in an emotion- and melody-filled song. The guitar is pretty clean, nothing to complain about here, either. And the lyrics – so hopeless it could make a grown-up man cry. All in all an excellent start for the album.\n\nRight after comes “These Hours of Despair”, a tad faster than “Hope”, and probably one of the fastest, if not the fastest song on the album, which still doesn’t mean it’s fast. I really like the drums on this one, especially in the tempo-filled beginning. Kotamäki starts his singing almost immediately, whispering this time, but soon turning it into the familiar growl from their earlier albums. Also, the guest female “vocals” on the track are worth a mention. She doesn’t sing, but is in a chore in the background, building up the emotion of the song.\n\nMany of you may now Katatonia, and Jonas Renkse. He’s starring on guest vocals on the third track on the album, “The Justice of Suffering”. It’s really a bit sad that Kotamäki and Renkse sound pretty alike when Kotamäki is singing cleanly. Of course, on this track he leaves the clean bits to Renkse and concentrates on the growling. Renkse wrote much of this tracks lyrics, and you can feel the difference in the song. He seems to steal almost all the attention from the original artist.\n\nOff then, to the single song of the album, “Don’t Fall Asleep (Horror, pt. 2). Maybe a little odd choice, if you ask me, to pick this a single, since this is the song on the album that sounds least like StS used to on the earlier records. The keyboards on this track is one thing you’ll notice, they’re not used too much, but still, they are an essential part of the song. Kotamäki’s clean voice lays a calm over the already calm song, and then, again, in the chorus part, hell breaks loose. The guitar sounds simply awesome on that part, really, really nice. Here, too, you can hear the female voice in the background, which adds a nice flavour to the song.\n\nThe longest song on the album, “Too Cold for Tears”, starts very slow, very calm and soothing, as if preparing for a funeral or something. Kotamäki manages to sound so hopeless again, that it almost brings tears to one’s eyes when listening to this. A little odd way to sing this, he sings the verse first clean, then repeats it growling. Not really one of the greatest songs on the album. The next, “Empty Skies”, ain’t so special, either. The lyrics are pretty boring if you compare them to the other songs on the album, and there’s nothing really special about it.\n\n“No Light, No Hope” has a nice bass in the beginning, and the main riff is worth a mention, too. This song is the only one under five minutes on the album, and it’s not necessarily a bad thing, either. I don’t think it would have been as good, had it been any longer than it is.\n\nThe second last track of the album is THE reason this album should be bought. “Doomed To Walk the Earth” starts really, really slowly, and Kotamäki makes some really good singing on this, maybe his best performance on the album. The depressive emotion that seems to spread from his voice takes a hold of you and refuses to let go before the track is over. From the beginning to the end, when he, with his heart-breaking, harsh growl sings “I am doomed to walk this Earth”, and again with the female singer backing it all up. Also, the music stagnates in the middle of the song. StS are not afraid to let everything drive to an almost complete halt, where there's only some faint melodies playing in the background. It's used to build up the emotion in the song and it works really, really well.\n\nIt should have ended with that song, but the digipack version has one bonustrack, “These Low Lands”, which doesn’t exactly impress me. Of course, it's not their original song, but a cover of the Finnish band Timo Rautiainen & Trio Niskalaukaus, so it's not really their style, anyway. Nothing wrong with the cover, though.\n\nThe lyrics is found in the booklet to all songs, but not the last. It’s a shame, really, to leave one track out. I would comment on the lyrics more, if I could find words to express how I feel them, but sadly I don't. They have to be heard together with the music, otherwise they'll lose their magic. Otherwise, the artwork is really great, and personally I prefer the digipack artwork before the original.\n\nIf you like doom, you almost surely like this. It doesn’t really get better. I have listened to this album ever since it was published, and I still haven’t got enough. It simply MUST be experienced. Go. Buy it. Now.\n",
        "\nThis album has been getting a lot of good reviews, so eventually I picked it up. I love all things doom and figured that this would keep me entertained for a while. While entertaining it is not nearly as good as some of the reviews I’ve read make it out to be. \n\nIn terms of sound I’m reminded a lot of both Opeth and Saturnus. However when broken down there are three main categories that all the songs on this album are based around, the vocals, the keyboards and the 4-string guitar. The bass is rare (for a doom metal album this doesn’t bide well) and the drums are reduced to a mere timing device.\n\nHalf of the tracks on here (tracks 1 through 3 and 7) sound like mere filler tracks, all of them lack any real power. Anytime something has the word melodic in front of it, I brace myself for something like this. Hope is no different; four outstanding tracks exist on here (which I will glorify later) then the remainder which just make the album long enough to be considered a proper full length.\n\nThe guitar riffs on here don’t sound difficult and the riffs blend right into to the melody so most people don’t give it a second though. However with several long songs the lack of any real change can get a little bothersome. “These Hours of Despair” sounds exactly like “The Justice of Suffering” and so on, same sounding riffs and melody, same keyboards; the only difference is the vocals.\n\nThe first three tracks follow along the same until things pick up with the very catchy “Don’t Fall Asleep”. This song sounds a lot in the same vein as the first three tracks, but the killer chorus seems to make it sit better. “Too Cold for Tears” picks up the pace a little and they finally get the epic parts to sound right. This track would have made a perfect album closer, because they really don’t recover beyond that. \n\nAs I said above “Too Cold for Tears” one of the few tracks where they get the keyboards to sound right, throughout the album keyboard melodies pop up and add more beauty to the sound. However keyboards usually just add flair to something and this album really doesn’t need that much flair. Several of the riffs (and a lot of the drumming) end up getting masked by them, which always ends up bothering me. \n\nWhile the concept of keyboard use can be debated by metal heads for hours (and some may disagree with the above paragraph) the lack of the bass sound on this album is a down right travesty. Matti got an easy job for this album; several of the tracks have an almost non existent bass guitar sound. I went nuts when I herd the bass intro for “The Empty Skies” because that is the only time this album really does sound heavy. \n\nThe drumming on this album sounds like a mere attempt to keep time, and the majority of the time sounds as non existent as the bass. If this is a mixing problem I can understand because I have seen it happen before, but the drum lines were written that way on purpose I really have no clue what the band could have thought that would accomplish. \n\nMikko does a nice job on vocals. His growl sounds very polished, and at times does get very tormenting. The clean vocals are really what add a gloomy feel towards them though especially on “Don’t Fall Asleep”. The almost whispered tone is very haunting and adds a glimpse of hope to the dreary nature of the songs. “Doomed to Walk the Earth” has backing vocals done by a choir as well which improve the epic feel that the band seems to create with there sound.\n\nDespite the overall lack of bass and drums I can still sit through this album. It’s alright, and there is hope for the bands future albums (they already sound like they got a good fan base). With all great albums someone eventually comes along and says it is flawed, so I would recommend previewing this somehow before you buy it. If you like Opeth, While Heaven Wept, or Saturnus you might get into this.\n",
        "\nThe first time that I heard of Swallow the Sun was through New York's Ballet Deviare, a ballet composed to heavier music. As soon as I heard them, I decided to pick up The Morning Never Came and Ghosts of Loss. I was instantly amazed by the feeling that came over me. A sense of despair and loss is always felt while listening to anything by Swallow the Sun, simply because the sad melodies and doom elements are too much for any metalhead to shrug off as a simple musical enchantment. To say the very least, Swallow the Sun's work is beautiful and well put together. They always create the exact atmosphere that they are working toward with their albums.\n\nHope is no different. I have been excited for this album for several months, ever since I heard of a new album in the works. I knew that it would be amazing, but I underestimated this album by far. The first track, the title track, had me instantly attached and captivated to the swirling soundscapes of guitar melodies, clean and harsh vocals, keyboards, and simple but unique drumming patterns. Kotamäki never fails to surprise me with his inherent ability to switch from clean vocals to deep, harsh growls. Both styles of voice mix well with the music, and add to the feeling of despair that is constantly looming over the musical atmosphere.\n\nRaivio and Jämsen both hold their own as metal guitarists, interlacing heavy open notes with soaring solos and chords that are higher up. Nothing technical or even that difficult is played. But hey, thats doom metal, right? I didn't hear too much bass work on Hope, but it's always there when it is necessary and needed. (which is a good thing once in a while).\n\nAleksi Munter uses the keyboard as more than an instrument. The beautiful sound of the keys soars high above the rhythmic undertones and adds even more to the epic atmosphere of everything. The constant atmosphere and looming sense of sadness add so much to the music. It makes this album so beautiful, and by far worth listening too.\n\nI recommend this album to a true metal fan, one who is prepared to hear something that's not a constant blast beat or an anti-christian bitchfest. The music is simple, but the atmosphere is far from it. This album is beautiful and definitely one of my all-time favorites.\n",
        "\nAfter being disappointed by Swallow the Sun's \"Ghosts of Loss\" album i thought it will be better to carefully check the new album \"Hope\" before it's officially released.\n\nDisappointement turned to admiration. Swallow the Sun changed for good, this is perfection in it's entirety, although the songs seem a bit monotonous, nothing really new but things are done so well in a unique style, each song attract you in a different way, hold you like no other.\n\nThe lyrics as usual: poetic, sorrowful and depressive (not for people in a good mental state) haven't noticed any changes, accomplish just what they set out to do and fit very well with the music.\n\nThe music itself being amongst the saddest you might ever imagine, it can be described as melancholic, very dark and emotional creating a depressive atmosphere, a typical doomy one.\nMikko Kotamäki vocals are simple, typical death metal but suit the music well, some rare changes in vocal styles mixing death with clean vocals. The keyboards parts sound convincing adding extra effects, not too upfront or too loud, mixed with melodic, heavy, distorted guitars, loud bass and raw drums catching attention quite often taking you to another level, another world of darkness and loss.\n\nThe most magnificent track is \"Don't Fall Asleep (Horror Pt. 2)\" a perfect example of the darkness of the album, dominated by slow, depressive clean vocals really inspire melancholy, while harsh vocals turns the atmosphere to a real horror and obscure one. This song is highly recommended for all doomsters and dark music lovers.\n\nOverall, an excellent album, a must for Doom/Death Metal lovers, this is a huge accomplishment the darkest work of the band ever.\nHighlights: Hope, Don't Fall Asleep (Horror Pt. 2), Too Cold For Tears, Doomed to Walk the Earth, mainly all the album!\n",
        "\nThe first time I heard the opening track from Swallow the Sun's debut I was just blown away: the gentle piano interlude turned into a mass of crushing riffage and after a calmer moment the unearthly vocals of Mr. Kotamäki were unleashed. Later on, when I proceeded to actually go and buy the album, I was a bit concerned on the superiority of \"Through Her Silvery Body\" and recalled the rest being little monotonous and way below it's excellence. I was wrong.\n\nThis is an act of emotional, guitar-ridden music with a varying tempo, which never actually reaches the deepest pits of funeral doom but neither goes to fast blast beats. The songs are around 5-9 minutes long with none of them reaching the 10 minute mark so often crossed by doom metal bands. They're not a very conventional doom metal band anyway, as the vocals are not the every day ultralow grunting but rather unique, raspy roaring that at least for me is familiar from Funeris Nocturnum's \"From the Aspect of Darkly Illuminated\", though the music is totally different. The percussion work is quite medium paced and works as a frame for the guitars and bass instead of taking the mainrole. There are some keyboards which are used in a subtle and scarce way, just to create the mood but not to dominate the music. The grand piano parts sound very convincing but when the synthesized violins are introduced the mood is instantly slain. Specially in the last track which is a bit longer and heavier-sounding Christmas carol oozing darkness the violins have a tendency of turning it into a mediocre goth song.\n\nThe most powerful tracks are the absolutely magnificent \"Through Her Silvery Body\" but also \"Swallow (Horror pt. 1)\" and \"Silence of the Womb\". Those ones have the most beautifully haunting guitar melodies which echo loss and death, especially \"Swallow\" because of the almost scary mood it sets in your head. In \"Silence of the Womb\" we get to hear some clean singing also which suits the track perfectly along with a cleaner guitar sound playing around as a mood-creator. The lyrical content on the album is a bit unclear because the lyrics sheet provides only a glimpse of the sung words in the form of a line or two but on their website lyrics to half of the songs can be found. As far as they go, they deal with death and loss, drug or poison addiction (in a darkly romantic sense, not in a junkie style) and eternal darkness, which all seem to fit this romantically inclined ensemble.\n\nOf course, nothing is flawless and that is true with this record as well. The songs seem a bit monotonous once in a while, in particular the ones I didn't mention above, and the absence of lyrics (how pseudo-artistic that might seem) is more than irritating and the synthesized violins just NEVER work. The overall impression after listening to this CD for dozens of times is that the music is beautiful and melancholic, if not a bit clichéd, and the powerful vocals in accordance with the melodic and crushing guitars keep this record way above the normal gothic doom metal acts.\n",
        "\nI discovered Swallow the Sun for the first time when visiting a local library. I checked out shelves that contained some metal albums and picked out StS's first album, The Morning Never Came. I listened to it and I loved it. When I heard that they were going to release a second album soon, I had quite high hopes for it. I still don't know if they were fulfilled.\n\nThree first songs, including the massive opener The Giant, the video song Descending Winters and my favorite of the album, Psychopath's Lair, are the strongest efforts on this album. On the first song singer Mikko Kotamäki proves that he can do decent clean vocals also and that his growls are deep enough. I don't know why, but I just love this guys growling. The video song Descending Winters is a nice piece of doom and includes nice melodies and tight riffing. Second best song of the album, while the next song Psychopath's Lair is the best. It's the shortest song on the album (5:11), but it is long enough to be a variable song. I just love the main riff. This one is the shiner of this album.\n\nUnfortunately rest of the songs can't hold into the quality of the first three songs. I can tell you that, since I have never been able to tell one song of another after listening to the album. These songs have of course some good parts, but I really can't listen to them without boredom. Someone else might enjoy them, but I don't.\n\nI can't recommend this unreservedly, the first three songs are good, with Descending Winters and Psychopath's Lair being extremely good songs, but the rest of the album always nearly lulls me to sleep. Listen to some song samples on their homepages if you are interested.\n",
        "\nFinland's doom metal band Swallow The Sun exists for 4 years, has released one demo earlier, debut album \"The Morning Never Came\" later in 2003 and it looks like they might be a new hope for doom metal. The perfection these guys managed to create on their first album cannot be described easily! \"The Morning Never Came\" features amongst the best doom/death metal tunes I have heard in a while. Slow and powerful riffs are carrying enormous strength, while keyboards are taking you on a long journey to a somewhat different world. So atmospheric, and so good played, without any lead parts - just staying there in the background, well hidden, yet playing very important part in the music. Dark aura that surrounds this album created really great and depressive atmosphere. Soft parts in their music are really soft, but the hard ones just blew you away. Just listen to songs like \"Out Of This Gloomy Light\", \"Through Her Silvery Body\", \"The Morning Never Came\" or \"Swallow (Horror Pt.1)\" - pure darkness! This album was released by (Finland's as well) Firebox Records, who have dozens of great bands under their wings. The production is awesome as well, I couldn't not say anything bad at all. Lead guitars remind me of Opeth in \"Blackwater Park\" / \"Still Life\" era. Swallow The Sun are not well-known yet, but I think things are going to chance soon. I can't wait for next album, and until then, the only thing to do is to enjoy in this masterpiece. Close the windows, pull down the curtains and enjoy until (if) the morning comes...\n",
        "\nScandinavian countries emerged in the Metal community and quickly established with success thanks to very strong scenes, where so many styles got continuously created and recreated by surprising acts. Doom Metal has its roots in Sweden, when Candlemass appeared in the 80’s with “Epicus Doomicus Metallicus”. Years later, already in the following decade, the Peaceville Records English trio My Dying Bride, Paradise Lost and Anathema started a revolution and became popular with their aggressive style that combined Doom with Death Metal. However, Finland can be proud of, today, being one of the most talked countries between the admirers of this genre. Swallow The Sun is just one more reason to continue like that.\n\nMelodic Death/Doom with slight Funeral Doom influences is a good definition for their sound; something like new Hypocrisy meets My Dying Bride, knows Shape Of Despair. Not really an accurate approach, but “The Morning Never Came” isn’t exactly easy to label, you get the impression you’ve heard something similar before but you will never realise what or who, they end up having their own sound. They use mainly deep grunted vocals, creepy keyboards and heavy riffs arranged in slow songs with many tempo changes that keep the album very atmospheric and interesting on each moment, in a depressive but enraged environment.\n\nIt was great that they included the songs from their demo because, first, I didn’t knew them and possibly would never be able to get that work, and second, because “Through Her Silvery Body” and “Out Of This Gloomy Night” are impressive and definitely among the best they have done so far on their still very short career, it would be a shame to leave them out. \n\nListen to this if you like extreme Doom Metal and expect just that. Swallow The Sun seems to be full of ideas and this album is really great.\n",
        "\nThe moment I pressed play on this CD and heard that intro that was it for me, I loved it. Truly beautiful piano melody that drops into guitars 30 seconds in or so.. The song has a great feel to it. This CD gets my vote for that song alone. Sure the rest of the Demo doesn't stick out so much, but the rest of the songs have a nice down tempo feel to them, played well. The vocals are simple, but suit the music well, some nice changes in vocal styles in the song “Swallow”. Good musicians, good CD.. A must for most Doom fans\n",
        "\nDepressing, bleak, disheartening, dismal, sombre, dreary, and dispiriting, are some of the words that can attempt to describe the mood set on The Mourning Never Came. Firstly, the production and instrumentation is top notch, nothing lacking in those departments whatsoever. The second thing that deserves mention, is that all the band members can be heard, nothing seems to outweigh anything else. This sometimes is not the case for a lot of doom bands, where sometimes the keyboards will be too upfront, or the guitars too loud or whatever. \n\nMost of the vocals delivered are deep and guttural, although there are some nicely written clean vocals lines in some songs, and sometimes they even delve into more mid-ranged vocals and even higher, pain-filled screams. I dont know what much I can say about the guitar, bass, drums and keyboards. They each have such a great sound, and all work together so perfectly, they really help the music to flow. The songs are long (nothing under five minutes here) and neither the individual songs, nor the album become boring. Even though the speed is generally slow there is enough innovative variation to keep the listener interested. The album, like I mentioned before, flows very nicely. An album of strong atmospheric doom...heavy, and gloomy. A fine debut - 85 %\n",
        "\nA surprising release from members of the super-fast Finnish black-death band Funeris Nocturnum. Swallow the Sun epitomizes the overall hidden talent of the band, and unleashes it in the form of a 4-song self-released demo of high quality straight-forward doom metal. Keeping up in the flood of Finnish doom metal we've seen over the years, STS just offer more reasons why their country still owns the scene. This is a huge accomplishment \nin my eyes and the band members truly shine on this demo.\n"
    ]
}