{
    "Band Information": {
        "Country of origin:": "Sweden",
        "Location:": "Gothenburg, Västra Götaland",
        "Status:": "Active",
        "Formed in:": "2021",
        "Genre:": "Melodic Death Metal",
        "Lyrical themes:": "Chaos theory",
        "Current label:": "Nuclear Blast",
        "Years active:": "\n2021-present  ",
        "Number of Reviews": 4
    },
    "Band Reviews": [
        "\nI immensely liked this especially since the members and ex-members of my favorite bands are in this. The likes of Dark Tranquillity, Gardenian and In Flames shined on here. They really kicked ass in this melodic death metal onslaught but mild, not brutal. I wouldn't call these members here as \"has beens\" they are top notch musicians. With those bands and the variety in the music (distorted/clean) guitars it's not for really extreme metal it's more of mild as previously stated. They really put together some great melodies with utmost emotion to the likes of that at least. I liked all the songs I thought that they were well thought out songs.\n\nI was waiting for this to come out and I wasn't disappointed at all. It's pure emotion in the vocals and guitars that are wholly experimental. The band did really good on here it's melodic death but not at all brutal. It's soft-listening. Kind of like the latest Dark Tranquillity 'Moment'. At least that's how they are on a lot of that release. They seemed to feel that the softer the better. I can understand that it doesn't resonate with every melodic death fan but it sure did with me. Jesper is still making music which is good because without him, In Flames took a turn for the absolute worst. It's good he's here.\n\nThese guys have produced good music with the guitars, vocals and keys/effects. It may get more negative press because of the tranquil songs wholly emotional but heart-felt. They didn't want something brutal in any aspect and that's apparent. They wanted something filled with diehard melodies and licks. Not a lot of lead guitars on here just harmonies and songs that kind of resemble In Flames-esque especially apparent on the In Flames 'Clayman' LP. That would be where Jesper steps in. But they all sound a mix of all three bands: Dark Tranquillity, Gardenian and In Flames. They just weaved melodic death into it and soared.\n\nI realize that a lot of what I've said is that this release is a positive mark in the melodic death community but just remember it's really not heavy or wholly intense. These guys are making music still, yes but there's absolutely no brutality here. They just wanted something that's mild and diverse. So don't be disappointed that it's not heavier than it is the way it's come out. It's just soft and melodic but diverse and peaceful. I liked it immensely. I wasn't disappointed at all. It's something I needed to hear and it's not all about hard stuff all the time. This release will remind you of that. Check it out!\n",
        "\nWhat do we have here? A melodic death metal supergroup made up entirely of ex-In Flames members. Considering the depths In Flames has fallen to in recent times, most people seemed to be looking forward to The Halo Effect giving them a good thrashing. I was looking forward to seeing that, even if the singles were largely disappointing. I suppose I really shouldn't be surprised that I don't see it now that the album is here, considering that Jesper Stromblad or any ex-In Flames member has not done hardly anything worthy of anyone's time or note since leaving In Flames and the other people in this band mostly had their biggest role to play in the non-classic In Flames period. This is such a bland and unexciting album. \n\nThe songwriting and structure is fine, I'll give them that. They vary tempos, keys, and vocal stylings enough at strategic moments to hold the attention for a while. But it's so easy otherwise to just hear background music here. I'll invoke the complaints of legendary Gothenburg disdainer UltraBoris and say that this album lacks riffs. There's a lot of strumming. A lot of start-stopping. But not much riffing. Not only that, for a band entirely made of ex-In Flames members, it doesn't sound that much like In Flames. The closest they get is Feel What I Believe and the title song, which, while recalling the power metal-inspired In Flames melodic licks of old, are particularly homogenous-sounding, to the point where when I heard Feel What I Believe come on a few songs after the title song, I did a double take and had to see if I had somehow skipped back to the title song. Again, it's not really a surprise that these two times sound like retraced steps, because Jesper's riff tank has been empty since he spent the last of it on Drenched in Fear, Disconnected, March to the Shore, and I'm The Highway from A Sense of Purpose. It's frustrating to hear these little In Flames bones being tossed to me and then finding no meat on them, like the extremely disappointing acoustic outro on A Truth Worth Lying For. Come on, Jesper. Stop dangling carrots in front of me, man. \n\nThe rest of the band performs admirably enough, for what little of them you can hear under the sterilized mixing and the sample-replaced drums that make the snare and bass drum sound like lifeless cracks and typewriter keys meeting sub hits, respectively. Peter Iwers' bass rumbles nicely, though, and Mikael Stanne still proves to be one of the most durable harsh vocalists in metal, as well as doing some very pleasant baritone clean singing in a couple songs. A welcome thing to hear in metal, where clean vocals are dominated overwhelmingly by tenor-range singing. In fact, when Stanne's singing appears, I welcome it a bit too much. I come to have disdain for his harsh vocals on the album. The more I weigh the music against his harsh vocals, the less they sound like they, as harsh vocals, belong in music that isn't very harsh at all. Even in sections where the music is softer, like the verse on The Most Alone, he still does harsh vocals. It doesn't fit. This entire album would have benefitted more from a wholly clean-sung approach, I think, and Stanne definitely could do something like that. Hell, he'll sing circles around Anders Fríden all day long. But hey, it's supposed to be melodic death metal, right? Even so, this one's still real light on the death. Real light on interesting. Real light on riffs. \n\nWhat a disappointing record. If this was released by anyone but a band of ex-In Flames members, no one would give two shits about it. After the initial buzz has died down, I predict that many people won't give two shits about it, and maybe the project will just fizzle. This album is typical of a pattern that projects of mainstays of metal and metal has-beens follow. Made long after the members made their greatest works, trying and failing to recapture that old energy, and even still people cling to the names of those who made it, like they even mean anything anymore. Mainstream metal media clings to exclusively reporting on legacy acts. New acts copy the old ones. Metal recording and mixing becomes increasingly homogenized. People don't change the process. Nothing progresses. We look to legacy acts to \"show the new kids how it's done\" even though they're out of ideas too. I'll repeat a common saying of mine: the worst thing about some legacy acts is they don't know when to hang it up. That goes for the fans too. Hold your legacy acts to some standards, don't believe the hype surrounding a name, and recognize when something sucks. The Halo Effect sucks. Not in a really unbearable offensive way, just a bland and has-been way.\n",
        "\nIn Flames are never coming back to their roots, we should all just move on. However, when I recently found out about former members of In Flames forming a new band together with Mikael Stanne, who did sing on In Flames' first album, my curiosity peaked. I have to admit, I had my doubts at first, but once this song started, the doubts disappeared. Finally! This is actual melodic death metal! This is what In Flames should sound like, but one thing at a time.\n\nLike I said, The Halo Effect features former members of In Flames, but that doesn't mean anything if the music is shit. Well, let out a sigh of relief, people, the music is anything but shit. In fact, this is really good. It reminded me of either Whoracle or Colony, so if you like those two albums, you're likely to like this song as well. It's energetic, well-written, well-played, and the lyrics at least make sense. You know what else is good? The fact that the musicians didn't waste time on a drawn-out intro, they went straight to the point. A huge plus from me.\n\nAll the instruments can be heard without issues, even the bass, even if it never gets to the forefront. The drums? Daniel Svensson doesn't go all ham on the drums, but it's such a relief to hear him play something that requires actual skill; I do hope that there will be at least one song on the upcoming full-length where he gets a drum solo. The guitars? Jesper Strömblad and Niclas Engelin are great guitarists, but their talents were wasted in post-Clayman In Flames (Niclas joined later, but that's not so important for the moment). In fact, on this single, it feels like they genuinely missed playing melodic death metal, so they really let loose as soon as they got the chance after so many years. I would've done the same if I were in their shoes.\n\nLet's cover the vocals now. Mikael Stanne is way better than Anders Fridén, no matter what he does. Mikael can still growl like a true professional, and the same goes for screaming and clean singing. This track is no exception. True, there's no clean singing here, but that didn't surprise me at all, not all Dark Tranquillity songs feature cleans either after all. Not that it would fit here anyway, but who knows, maybe Mikael's keeping it for the full-length.\n\nAre there any issues? OK, I'll sound like I’m nitpicking, but the song ends kind of abruptly. But other than that, no, I see no issues. Honestly, I'm looking forward to their first full-length. Until then, I can recommend this single. Feel free to check out their other singles, too.\n",
        "\nI speak for all In Flames fans and even most old school melodeath fans when I say that seeing the similar pictures (Each part of the same picture) on each member's pages days before the announcement of The Halo Effect's existence was one of  the  most hype-inducing things ever. It was a fever dream at worst and everything we could've wanted at best. Mikael Stanne with the classic In Flames lineup (And Niclas Engelin too)? That's all we needed to know. I know a ton of people were expecting a return to the glory days- The Gallery, The Jester Race, Colony, Clayman- but I never was. Those albums, particularly the latter two, were results of both the technology of the time and the mindsets of the musicians at the time. It's 20-25 years later, and the industry landscape is  completely  different than what it once was. You're not having amps set at 35 degree angles anymore (Even if that shit was fucking awesome for Clayman), and compression is something that is taken far more into account than it used to be, save for producers and bands not wanting to sacrifice loudness for reduced to no compression. What we got is more along the lines of early to mid 2000s Dark Tranquillity with a hint of mid 2000s In Flames with melodeath leanings, rather than metalcore leanings. That much is more along the lines of what I had expected, but even then, I didn't want my near-infinite hype nor my expectations of the sound to mar my enjoyment of what would come.\n\nThe guitarwork is fantastic. It's classic melodeath goodness, but more along the lines of the more mainstream take on melodeath. It's like mid-2000s Dark Tranquillity, but with fewer riffs and a greater emphasis on leads, which is a shame since it doesn't showcase Engelin's talents nearly as well as it should. He's great at making riffs, and while he laid a great foundation for the songs, it's Stromblad's harmonizing and additions that elevate the guitarwork above simply being competent. The soaring harmonized leads carry the song and make it feel like you're picking up right from where they left off with Clayman or Character. It all works really well and feels rather powerful here. However, the guitarwork overall is the greatest aspect that's far too safe through all of the band's singles so far, and given the talent we have, that's a massive shame. I won't be docking points for it here, but if I do decide to review the rest of the singles (Which I'm not sure that I'll do, to be honest, I'd just be reiterating the same points over and over), I'll dock points for it there.\n\nThe drumwork is adequate. Unfortunately, while Svensson is in my top three for favorite drummers (I can never decide between him, Brann Dailor of Mastodon, and Daniel Tracy of Deafheaven), his performance here doesn't represent his talents whatsoever. He can be an absolute beast on drums, that much has been proven through his entire run in In Flames and Sacrilege. He keeps pace well enough here, but he could be slotted out for any other drummer, and you'd get just as competent of a performance. As for the bass, the playing is pretty good, but nothing exemplary. It's a bit low in the mix, unfortunately, but it could be worse. I can kind of hear it, and I can be happy with that.\n\nThe vocals are the one aspect where nobody has complained, and I have to stick with the masses on that front. Come on, it's Stanne. You know what you're getting with his harsh vocals. Somewhat raspy (Not quite Lindberg levels of rasp though) mid-pitched growls. He has a cadence that sounds approachable for newer melodeath fans, yet still pleasing for veterans of the genre or more extreme music. I haven't heard anyone complain about the actual sound about his vocals when it comes to any of his projects, and that because he's just fucking great.\n\nI think \"Shadowminds\" is the perfect song to act as the lead single for the band, as it seems quite representative of what we'd get. It's awesome, it's something that's easy to get lost in, but it's also rather safe. In fact, that's my biggest problem with The Halo Effect so far. I love what we have, but it's  far  too safe. I'm not going to hold that so much against \"Shadowminds\", as it was the first song they put out. I know it's from the same batch as everything else, but I can be quite happy with how safe each song is in a vacuum- It's when you put all of these songs together that the cracks begin to form. Three of the four singles have been four minutes long and 100 BPM, all but confirming the qualms people have with it feeling same-y, seeing as how it really can be compared to mid-tempo modern DT material with less emphasis on synths and no clean vocals, which I'd actually be happy to have at this point. While \"The Needless End\" is easily my favorite of the four singles so far, each one's release subsequently makes me worry more and more for the album overall. The title track is the only song that hasn't been completely safe so far, with only \"The Needless End\" providing any sort of 'risk' with a nice little guitar piece reminiscent of \"Zombie Inc.\" from Colony or something from Clayman at the very end of the track. The musicians here are all incredible, and I think what we have is awesome- But none of the members' creativity ever shines whatsoever here. I'd still argue that Days of the Lost is my most anticipated release of 2022, but that is quickly sinking with each new release, making me begin to think that the only variety we'll get is each of the remixes of the singles, with this song getting a remix from fucking  Ihsahn . Now that is fucking mind-blowing. Unfortunately, I have no way of listening to any of the remixes at the moment, so fuck.\n\nOh well. I won't be holding any of that against this song, it's simply my fears of what'll come of the album. The track is awesome, with it leaving me wanting more in both a good and a bad way. I hope that the band proves me wrong with the full album, but man am I worried. Cheers, though. The reunion of all parties involved will at least be the realization of a pipe dream we've had for a long time.\n"
    ]
}