{
    "Band Information": {
        "Country of origin:": "Germany",
        "Location:": "Berlin",
        "Status:": "Active",
        "Formed in:": "2000",
        "Genre:": "Progressive/Atmospheric Sludge/Post-Metal",
        "Lyrical themes:": "Abstract, Philosophy, Globalization, Modern Age",
        "Current label:": "Metal Blade Records",
        "Years active:": "\n2000-2018 (as The Ocean),\n2018-present ",
        "Number of Reviews": 27
    },
    "Band Reviews": [
        "\nWho’s up for some geology metal? When it comes to weird concepts to base your music on, Germany’s The Ocean Collective probably takes first prize. Not only have they chosen to write their music about geological aeons, but they stuck with it for an entire discography and keep making it work. Their latest release “Phanerozoic II: Mesozoic | Cenozoic” is the continuation of their previous record, which was actually my introduction to the band, and while that was a phenomenal record, I am pleased to say that this one surpasses it in every way.\n\nBeing labelled anywhere from sludge, to post-metal and progressive metal, The Ocean create an unusual and impressive blend of styles that sets them apart from just about any other prog band out there. I feel the production and sound textures themselves play a huge role in delivering what The Ocean is all about, sounding raw and natural but incredibly well defined. The crushingly heavy, yet somehow steady pace of their riffs evokes a phenomenal mixture of energy and strength that makes the music sound very well structured and solid but also volatile enough to allow powerful contrasts and changes in movement to occur.\n\nThe progressive nature of their compositions, based on complex time patterns enables the listener to go through a song multiple times just to keep uncovering new things and peel off multiple layers of details. But the use of repetitions and their talent to infuse certain ear-worm melodies or grooves in an otherwise highly eclectic and intellectual sound, allows them to also grab you from the first spin and make sure that you will be enjoying the album every step of the way. The bass presence is incredibly valuable, standing out beautifully into the mix and playing a huge role in creating the powerful and penetrating sound that defines this band’s signature. The drums are also quite unique and surprising, complementing and enhancing the movements and energy of the songs. Whether we’re talking heavier patterns or softer, atmospheric soundscapes, the drum part always plays into the vibe and becomes a part of that, sounding very musical expressive.\n\nMy favourite thing about this album would have to be the sense of cohesion and continuity that it gets when listened to as a whole. The songs are clearly separated but each song somehow seems to pick up on the aftertaste of the previous one and then start shifting that mood into a subsequent phase. This gradual evolutionary pattern is what makes the album keep you engaged and focused from beginning to end and prevents any sense of monotony to sink in, even though this sort of music actually presents a high risk of that happening. They are very diverse and versatile musicians and that allows them to stay on the scientific topic for 51 minutes but to always hit you with something fresh and exciting.\n\nThe first song “Triassic” is pretty heavy, dynamic and very groovy, and constantly oscillates between clarity and harshness, softness and aggression, melody and riff. But the true potential for destruction is actually somewhat contained. It is only unleashed to the fullest in the second track, the monstrous 13-minute creation taking you through the Jurassic and Cretaceous eras. Though this composition makes consistent use of atmosphere, it constantly builds tension and momentum, until it builds into a relentless wall of sound with blistering double pedals, roaring guitars and sprinkles of blasting. Vocalist Loïc Rossetti does a phenomenal job with both clean and harsh, contained or unleashed vocals and on this one, he is also joined by Katatonia’s Jonas Renkse for a few verses.\n\nWhat surprises me so much about The Ocean is how they manage to make their music expressive and meaningful while also connecting to the topic. No one would ever tell you that a geology lesson could be bombastic or intense but these guys found a unique way to do just that. The music doesn’t directly deliver emotion, as that wouldn’t fully fit the concept, but it somehow evokes the sense of natural phenomena unfolding before you. The vocals release massive amounts of energy at times and can also be very calm, warm and peaceful, but all these vibrations are suggested through a somewhat impartial attitude that could be interpreted as if the earth itself is speaking to you.\n\nFrom ‘Jurrasic|Cretaceous’, we move on to the ‘Palaeocene’, which keeps the heavy energy going but seems to slow down the hectic sense of entropy in the previous track to a more steady, groovy pace, allowing the album to then flow into a softer phase with the ‘Eocene’ allowing clean vocals and melodies to take hold of the sound and ‘Oligocene’ turning full instrumental. This one is actually one of my favourite moments in the album as it gives some time to really slow down and take in a calming vibration. The keyboards really breathe into it and convey more of a meditative atmosphere with a sense of stillness.\n\nHowever, the drums still move forward with smooth, detailed and gentle groove and soon we venture into the ‘Miocene|Pliocene’ which starts a slow upward dynamic from a moody and somewhat menacing sound, into a larger, fuller soundscape. The energy then keeps building into the ‘Pleistocene’ which also picks the tempo back up and eventually grows into an almost black-metal styled part of blast beat and shrieky, high-pitched screaming vocals. Then almost as a calm after the storm, the final track welcomes our current age, the ‘Holocene’. This one is more like a dark post-rock, somewhat dynamic but also ambiental song, and as a final addition to make the closing special, a reprise from the Triassic is used, only with more sombre, menacing tone, as if it heralds yet another storm of extinction. Where will our current times lead us?\n\nSome goodies to top off the experience are guest vocal appearances by Katatonia’s Jonas Renkse on ‘Jurassic|Cretaceous’ and previous The Ocean vocalist Tomas Hallbom on ‘Palaeocene’ and superb use of cello on the final two tracks. I am amazed by this band’s capacity to bring so much charisma into such an intellectual and challenging topic and compositional approach. The album is truly a masterpiece of creativity and expression and it works great on its own as well as a continuation of “Phanerozoic I: Palaeozoic”. It is diverse and complex but fluid, cohesive, coherent and kept on track. Many things are striking and unexpected but nothing is overdone and the flow of the events described is never shaken, making it one of the strongest progressive metal releases of the year.\n\nOriginally written for The Progspace\n",
        "\nNovember 2018 saw the release of “Phanerozoic I: Palaeozoic”, an impressive release by The Ocean Collective and one that would introduce me to a band unlike anything I heard before. With a concept about the first part of the geological eon known as the Phanerozoic, and a powerful impressive sound, this unit would be the first, and to this day the only band bearing the sludge tag that would catch my interest. The Ocean’s moody and dark sludgy sound combined with gargantuan heaviness and a great sense of rhythm and progressive structures has the capacity to grab and hold the attention of even the most impatient of listeners. And with the sequel “Phanerozoic II: Mesozoic | Cenozoic”, they don’t only deliver further elite sludgeoliciousness, but they complete their geological eon, into a double album of monumental proportions. \n\nWhat I love about The Ocean is how cathartic their music can be, either through rage or through soothing moods. Their sludgy texture to the sound, and the preference for slow tempos are perfect for creating dark brooding atmospheres and a sense of calm, patience and melancholia. This asset is beyond expressive considering the long time spans and vast spaces represented in their songs, especially on this record. However the majesty of mountainous riffs and hard hitting drum patterns gives an imposing titanic aura to their music, and a roar that feels like it comes from the very depths of the earth. These dimensions alternate on “Phanerozoic II” depicting both the natural beauty of life, as well as the disastrous cataclysmic events of the second and third eras of the Phanerozoic.\n\nThe sound on this record is prog sludge at the core, but also encompassing some psychedelic flavors and even a few moments of hectic aggression in the vein of black metal. The guitars offer the aforementioned slow heavy dragging riff feel on the heavier tracks, of course quite often dashed with rhythmic intricacy. The lead guitar resorts to themes and variations recurring within the songs, emphasizing that feeling of millions of years passing by, and on the softer end, the clean guitars still maintain some grit to the tone. A key aspect of the music is of course the bass, very prominent all the time, but also being a central focus instrument through the less aggressive parts, where distorted guitars go silent. The murky texture to its sound and the far low end reached (7 string guitars also play low a lot) is one of the main features that attract me to The Ocean’s sound. Then there's the drum performance, one that on the heavy tracks and through the progressive parts gets really hard hitting and the main source of colorful dynamics in such a theme oriented record. It’s also stylistically diverse and can further reduce to repetitive grooves on the more subdued tracks, playing a functional role beneath the ambiance. \n\nAn aspect of the band’s sound that until very recently I didn’t pay attention to is the use of orchestrations and samples. It’s hard to say how much of it is programmed and how much is delivered by real instruments. But however subdued and often easily overlooked, the atmospheric use of string sections, effects and even some wind instruments is crucial in maintaining the immersive atmosphere of the music. And of course, the feelings of loneliness, danger, power and might, or even comfort so effectively supported by orchestrations, are mainly delivered through Loïc Rossetti’s distinct vocal style. He always encompasses a slightly nazal feel to both the singing and the screaming, and his expressive range from corrosive harsh vocals to clean vocals, both powerful or soft has always been impressive to me. It’s very unusual and can be an acquired taste to some, but it’s masterful regardless.\n\nStructurally, the album traverses the Mesozoic and Cenozoic eons in a chronological order, which in turn gives a beautifully cohesive evolution to the tracks. The lengthy opener “Triassic” presents the hot and dry atmosphere of the dawn of the Mesozoic, and the emergence of the first dinosaurs. It’s a slow patient song, alternating between heavy and soft, and including some beautiful oriental influences on the guitar themes. Joined by Jonas Renske of Katatonia, we move on to the Jurrasic’s monumentally heavy aspect and progressive structure as continents slide and life booms, and further to the Cretaceous, where the rulers of the world reach their apogee before they are reduced to ashes. Thus through the longest and heaviest track ends the Mesozoic, the age of reptiles, giving way to the Cenozoic, the age of mammals. Different climates and life forms shift through the shorter periods of the Cenozoic. The following songs are then shorter, more homogenous and not quite as heavy. “Palaeocene” is still rather aggressive and showcases Tomas Hallbom’s guest vocals, pertaining to a different vibe much fitted for a post extinction earth. Then the going softens through the “Eocene”, “Oligocene”, and “Miocene | Pliocene”. This last one offers some more of those tasteful oriental melodies, this time through the vocals. The album gradually picks up steam again through “The Pleistocene” better known as the Ice Age, as the earth is faced with several glaciations. Some of that black metal feeling can also be noticed in the second half of the song. “Holocene”, the current age of humans closes the album, with more of an electronic fuzzy tinge, and beautiful tragic violins, perhaps suggesting the evolution of technology and perhaps impending doom that is to face the current rulers of the world.\n\nYou can probably tell that The Ocean Collective works differently from your average metal band, merging scientific knowledge and deep emotion with a peculiar yet strangely captivating sound. As I did when I found the band, one might then wonder if the lyrics would turn into a high-school lecture, but in my perception, the different eons are brought to life through music expression, as if the earth was sharing its life experience, and hence even breathing out a moral tone at times. Particularly the end of the Cretaceous seems to associate the instant disappearance of dinosaurs with what future extinction events humans may bring upon themselves. But regardless of whether we will thrive in peace or if our extinction looms, you can experience what either outcome would feel like by looking in the past, through this band’s sonic mastery. “Phanerozoic II: Mesozoic Cenozoic” is out September 25th through Pelagic Records, Metal Blade Records, and Bandcamp!\n\nEnjoy!\n\nOriginally written for The Metal Observer\n",
        "\nThe Ocean has always put out music that does something to push the boundaries. While being sludge metal at heart, The Ocean’s experimentation with influences from various genres and unconventional song structures are what set them apart. This experimentation mixed with creative and emotive songwriting makes for some stellar output.\n\nAnthropocentric is the second half of The Ocean’s 2010 double album, with the first half, Heliocentric, impressing me with its songwriting, vocals, drumming, guitarwork, and its avant-garde leanings. Anthropocentric manages to build off this, and is in my opinion, of higher quality than the amazing Heliocentric. The guitarwork is amazing, with melodic clean and lead guitars shimmering over heavier, sludgier riffs. Some songs focused more on heaviness factor such as “She Was the Universe”, while others focus more on creating an ambient atmosphere such as “Wille Zum Untergang”.\n\nThe vocals on this album are just as amazing as on Heliocentric. Most songs have a catchy vocal hook of some sorts such as “Heaven TV”. The vocal melodies are beautiful and are often accompanied by the aforementioned guitarwork that complements them perfectly. Rossetti’s harsh vocals are also great, lashing out at you with the oppressiveness of the heavy riffs. The guest vocals on “The Grand Inquisitor III: A Tiny Grain of Faith” are great, and help to create a very eerie and uncomfortable atmosphere, especially when the violin kicks in near the end,\n\nRhythmically, The Ocean dominates here once again. Luc is an amazing drummer who knows how to share the spotlight with the other instruments, without hogging it, or getting lost in the background. His drum grooves and fills are amazing, and he utilizes frequent use of his cymbals and hi hats to relieve tension during climaxes. The bass on this album is also great, pairing very well with the guitars and drums. The bass tone is top of the shelf, and it actually stands out in the mix, and doesn’t always just mimic the guitars so that it brings something interesting to the table musically.\n\nEvery song in this album is strong, and the brilliant musical ideas are very well organized into cohesive pieces of music. To take it a step further, the album is brilliantly composed, and this is an album clearly meant to be listened to in its entirety. When treating this album as one song, it is even more enjoyable to listen to with the title track acting as a perfect intro, a few heavy sections, a few ambient sections, and plenty of emotion evoking riffs, melodies, and rhythms, and the last 3 tracks putting in an ideal ending to such a moving album.\n\nPrior to relistening to this album, Heliocentric was my favorite The Ocean album, however this has now surpassed it. Everything in this album is so well thought out and organized with several memorable moments. This album ranges emotionally to sheer joy to pure anger and it’s just fantastic. This album is also fairly accessible, even for those not into metal, so I’d really recommend it to anybody.\n\nFavorite tracks: all besides “He that Wavereth”\n",
        "\nThe Ocean has quite an impressive discography boasting several high quality releases. It seems to me that Heliocentric is often overlooked by fans because it was the follow up to the massive Precambrian, one of the most highly praised albums of its kind. Heliocentric is also the first The Ocean album to have a consistent album without having several guest musicians.\n\nThe main building block of this album are the massive riffs that are absolutely crushing, groovy, and still retain some melody. Every guitar driven song opens up with amazing riffing, my personal favorite being the opening riff of “Firmament”. The drums on this album are another highlight, sometimes using odd time signatures, and sometimes keeping it simpler, but always supporting and elevating the music. There are also many excellent drum fills, showcasing Luc’s technical ability and craftsmanship behind the kit.\n\nThe song structures on this album are simple, but this isn’t necessarily a bad thing since they make it work well. The verse chorus verse song structure is the main song structure on this album, with occasional instrumental sections added such as around 4:07 on “Firmament” where an ambient atmospheric section is added which leads to another climax in the song, and the beautiful outro to “The Origin of God” to close out the album. The main compositional highlight of the album however is the piano solo in “The First Commandment of the Luminaries” adding a new texture to the music and delivering a healthy dose of melody to the song. The band still makes use of atypical instrumentation with strings, horns, and the aforementioned piano solo providing plenty of melody and emotion for the compositions. \n\nThis album is, without doubt, The Oceans best album vocally, with their new vocalist delivering both furious and unique sounding growls and some great cleans as well. These 2 vocal styles provide nice dynamic, and make for some damn good choruses throughout the album on songs such as “Firmament” and “Metaphysics of the Hangman”. The only disappointing vocal performance is on “Ptolemy was Wrong”, which is honestly the only bad track off the album unless you count the somewhat pointless intro track. Even the soft and short “Epiphany” is an enjoyable listen, even when isolated from the album. \n\nI honestly don’t care for lyrics 99% of the time, but I do think the theme and album cover of this album suit this album very well, and I can appreciate the band making logical criticisms of Christianity rather than trying to be as blasphemous and offensive as possible like many black metal bands do.\n\nUnique and emotional, The Ocean has delivered with their follow up to Precambrian, which is considered to be their magnum opus. Giant and well though out riffs, stellar drumming, odd and varied instrumentation, atmospheric sections and the best vocals I’ve heard from any post metal band make this album close to a masterpiece, but not quite there yet because of a few weaker tracks which drag the album down to the point where it just misses masterpiece status. This album is a fine slab of post metal and worth several relistens.\n\nFavorite tracks, “Firmament”, “The First Commandment of the Luminaries”, and “Metaphysics of the Hangman”\n",
        "\nThe Ocean is a very original progressive metal band with serious longevity. I wonder how come I haven’t heard of them until now. I have only started listening to this band because they had a concert in my country so I can highly recommend you go see them live if they come near you. They are very dynamic and energetic on stage. But they have earned my respect with the studio work as well. The latest album is a journey back in time through the first half of the Phanerozoic eon (the current geologic eon) with every song representing a period of the Palaeozoic. That’s a lot of time to cover in 48 minutes of music. But I have no hesitation in saying that these Germans have given our planet’s history justice with their last creation.\n\nThis album is dominated by a sound that is heavy and powerful yet atmospheric and sludgy at the same time. The sound of the guitars seems purposely tuned to be a bit blurry and muffled, and in combination with the keyboards it really creates an ominous atmosphere, taking you back to the beginning of life on Earth. The intro track, representing the Cambrian explosion is very suggestive of that primordial soup of emerging organisms, with some digital effects, a piano theme and some really deep low frequencies from the bass. I especially love the way it flows into the opener “Cambrian II: Eternal Recurrence” which is an absolute monster of a song. Overall I find the connection between the concept and the music to be the main element that gives this album its own footprint. With such concepts it’s very easy to go haywire and sound overly pretentious, but this band has succeeded at keeping the music and lyrics on track to not become ridiculous.\n\nThe sludgy element of the album is sometimes annoying and dragging, really testing your patience such as on the song “Devonian: Nascent”, but the guys have balanced out their atmospheric influences with serious riffs, blasting aggressive drums and harsh vocals. Also the more dynamic songs in the first half are very complex and experimental, always surprising you, so when the more repetitive songs come afterwards, it really doesn’t get excessive. Despite having a crush on complex music, I find the final track of the record “Permian: The Great Dying”, to be the best song on the record. It is a two-faced track with a constant shift from soft to heavy sections, thus bringing a lot of juicy impacting changes. But it also spins around only a few recurring melodies and relies on the bipolarity of the harsh and clean vocals, so you will actually find it ringing in your head after just one listen. If you want to start listening to this band, I highly recommend it as a first song. \n\nI want to throw some special comments about the vocals, drums and bass. Firstly, I would have been convinced that the clean and harsh vocals are from two singers because there’s such a huge difference between the two that you can’t imagine those sounds coming out of the same person (..until you see him live). Also the fact that the keyboard player brings some back-up clean voices means that you get lots of cool overlapping vocal melodies. Secondly, the bass is probably what keeps this album from becoming a drag. The composition is varied and creative, but alone it would not save this album from falling too far into sludge territory. The bass is not over the top impressive but the sheer depth and impact of the sound is constantly keeping the songs from becoming sleep inducing drags. Granted, I must also mention the ballistic drum patterns for this. \n\nThis is definitely an album that fits into the ‘weird prog’ category, so you need a sweet tooth for avant-garde and experimental stuff if you expect to enjoy it at first spin. It is niche music, and has a very unusual topic for a metal album, so it takes some patience as from a more thrash or death metal oriented person, but there are a few infectious melodies that will have you coming back, regardless of your music preference. From a random listener’s perspective, it does come across as an acquired taste, but trust me, it’s a taste that is worth acquiring. \n\nEnjoy!\n",
        "\nThe Ocean's \"Phanerozoic 1: Palaeozoic\" has just introduced me to what is known as sludge metal, although this isn't \"regular\" sludge as it has a very powerful progressive and atmospheric component. Being new to the genre, I can't really judge if they do it justice or bring something new to the table but from where I'm standing, they seem pretty original and this is certainly a strong record. What really caught my attention when I heard of this band was their concepts. They actually try to illustrate the geological earth eras in their songs. Now that's next level weirdness but what's even more surprising is that they don't come off as science nerds by doing so. The music has a lot of energy and personality and at least in this album, they have succeeded at conveying that evocation of a prehistoric, primordial world. Now, I'm not going to dig deeper than that into the concept as it requires a certain degree of knowledge in the field and could make an entirely different topic. \n\nThe musicianship here is solid and brings a good blend of heaviness, progressive patterns, atmosphere and a big load of weirdness. It's not exactly vivid or engaging music as the songs are long, complex and not very fast. However, don't think for a second that this will feel monotonous or dragging. It is maybe pretty difficult to get into but they offer a lot of variety and their songs have a very cohesive flow of evolution. And although the music isn't fast as a whole, they have a thing for fiddling with details in such a way that even if they keep a pretty steady riff or melody, it doesn't get repetitive. The drummer has very creative way of building a groove and filling in the gaps and the guitars create a very full and heavy but also balanced sound. The vocals are also very good, especially the harsh vocals. The clean singing works well but when the screams kick in, it always takes the song to a new level of energy. Honestly, it took me a while to get into the vocals as they're pretty dirty and not very musical at times but they fit very well into the instrumental and are balanced out very well by the high quality mix. The production also plays a big part in fitting all the instruments together without making any one of them inaudible and also giving a very consistent and powerful sound to the whole. \n\nThis album is actually just the first part of a whole concept and that makes it feel incomplete. That's not exactly a negative as it actually is incomplete so it's only natural to feel that way but the really abrupt ending bugs me a bit, in contrast to the very tasteful intro and the good flow of the album from one song to the next. The songs however, stand well on their own and can be listened to as just one song. They are pieces of a whole but they don't feel ripped out of context when just hearing one. They also have different personalities. The first song \"Cambrian 2: Eternal Recurrence\" is the heaviest and most punchy, \"Devonian: Nascent\" is the most atmospheric and keyboard oriented, and the others are pretty much in between. \"Permian: The Great Dying\" is probably my favorite, bringing a good blend of heavy, atmospheric and groovy. Listening to the whole album works best for me though, and I'd advise you to do the same if you want to get into this band. They seem quite unique and even if they don't strike you too much, I'm certain you'll find something in there that you can enjoy!\n",
        "\nOver the years, Robin Stap's The Ocean has been experimenting with concept albums about the creation of the world and theological theories. For their latest effort The Ocean plunges into the depths of (ironically) the ocean, and the human conscienceness. I feel safe to say that this album must be the most solid release the band put out to date.\n\nWhat impresses me the most about this album, is the fact that The Ocean plays all these different genres so naturally. Whereas some tracks on Heliocentric and Anthropocentric sounded a little clumsy and unnatural, Pelagial sees the band blending a broad variety of styles with sheer perfection. They rip out blistering fast riffs, progressive passages and doomy sludge destruction all with real comfort.\n\nWhether it's the Neurosis-like bonebreaking track Demersal or the Mastodon-ish Bathyalpelagic II, this album never ceazes to amaze me. The first few verses of Mesopelagic even remind me of Pain of Salvation from time to time. All these styles are blended into a new Ocean-sound that was founded in the previous two albums. But on Pelagial the band has perfected their new sound.\n\nRobin Staps really writes progressive metal in a way that does not bore the listener with overexaggerated technical wankery. The songs are throwing the listener from left to right while gradually dragging him or her down to the very bottom of the ocean. An absolute must-have for any progressive metal fan out there.\n\nOn Mesopelagic we can hear Loïc Rosetti singing 'from here on there's only one direction: down!' I really hope this doesn't count for The Ocean. In my opinion they have recorded the best metal album of 2013, but what´s harder than successing such an amazing record? \n\nHighlights:\n- Abyssopelagic II: Let Them Believe\n- Mesopelagic: Into the Uncanny\n- Bathyalpelagic II: The Wish in Dreams\n",
        "\nAfter The Ocean released their experimental metal masterpiece \"Precambrian\", bandleader & guitarist Robin Staps finally settled on a consistent lineup for the group, notably deciding on Loic Rosetti for vocals and changing the collective into a standard metal band. Along with this shift in band philosophy, a shift came in overall sound for The Ocean. Immediately after monster-length crushing symphonic tracks in \"Precambrian\", fans were treated to softer, more accessible works in \"Heliocentric\", followed by \"Anthropocentric\", which improved this sound but still contained issues with presenting an album with consistently strong quality tracks. It seemed after two albums that were not quite as strong as their past efforts, The Ocean's best had already passed them.\n\nPelagial takes that idea and throws it out the window. Quality Ocean material is back. Again, they provide a concept album, with the idea of going deeper and deeper into the zones of the ocean as parallels between interpersonal struggle, all backing some impressive epic progressive sludge songwriting. The tracks flow from one to another effortlessly reinforcing the concept. It lacks the more experimental surprises found in their earlier albums, but replaces them with symphonic structures, varying song sections, and a multitude of energetic, epic riffs.\n\nThis is evidenced in the first actual track, \"Mesopelagic: Into the Uncanny\", where a winding guitar melody builds, drums drop in more and more, distortion becomes more a factor, the vocalist becomes louder and louder until Rosetti's vocal melodies charge in for a triumphant climax. This description likely brings to mind lots of post-rock ideas, and post-rock is definitely an element of The Ocean's music, but the song is definitely of a more progressive metal variety, with lots of high energy that would be perfect to begin a show. These sort of dynamics are all over the place, notably in the 9-minute \"Hadopelagic II: Let them Believe\", which begins with a rather alternative-sounding 6/8 jazzy groove, contains beautiful piano, but often twists into pounding sludgy riffs and sharp guitar lines.\n\nDynamics are never more prominent than in \"Bathyalpalegic I: Impasses\", which begin with harsh growls and crushing guitar sounds, until everything but a sole piano drops out, which Rosetti uses to come in and deliver a few rather personal emotional vocals. Cymbals and guitars suddenly crash in and drone on the beautiful melodies, which cues once again another driving, groovy metal section.\n\nThere are many parts that finally recall the more beloved older Ocean material. \"Demersal: Cognitive Dissonance\" is a lengthy, symphonic track that would fit perfectly in the second Precambrian disc, while \"Bathyalpalegic II: The Wish in Dreams\" is a highly energetic mosh- inducing song reminscent of the first disc. The final track is an absolutely crushing drone doom track that represents the absolute black, cold seafloor at immense pressures. Despite this description, the production is very clean and modern for a sludge metal album. Often the sound is very comparable to Mastodon's \"Crack The Skye\", though without the psychedelic and progressive keyboard influence. The story of that album is much clearer than the more abstract concept found on Pelagial, but the comparison remains.\n\nOverall, while this doesn't quite reach the peaks found on Precambrian, Pelagial is a beautiful progressive sludge metal masterpiece. If one were to define modern Ocean as heliocentric onward, Pelagial is likely to be the masterpiece of the modern Ocean. The concept is well executed, the songs develop masterfully, the riffs are strong and heavy, and all put together it is a testament of what the Ocean is still capable of. Definitely best for fans of sludge, and will likely bring back those who walked away from the band in the past.\n",
        "\nYeah, it’s more of the same.\n\nJust figured I’d come right out and say it up front instead of taking four paragraphs to get to it. But like the old saying goes, if it ain’t broke, don’t fix it. And fix it The Ocean don’t.\n\nThe concept behind Pelagial is that every song is named after the different layers of the ocean (descending from Pelagial all the way down to Benthic) with the tuning and lyrical content drifting on doooooooowwwwwnnnn while occasionally becoming appropriately violent. It works for the most part, but I think it might go over a lot of listeners' heads if they weren’t either A) informed ahead of time, or B) an oceanographer. Betcha know which one of those I was.\n\nInstrumentally, Pelagial don't seem to stray too far from the usual formula of Mariana Trench scraping bass lines and wispy, progressive riffs with a mixture of ADD-addled drum work versus slow and jazzy fills and thrills. Like I said, nothing really new here. \n\nBut the fact of the matter is it don't amount to shit when it’s as good as this. The progressive side of The Ocean always seems to outshine the sludge/core aspect. This has been true from Fluxion to Anthropocentric and remains to be just as true in Pelagial. The addition of an instrumental version of Pelagial is a nice touch, albeit a useless one since the “normal” version is superior due to Loïc Rossetti's mastery of the hardcore bellow and mild clean vocals.\n\nIt’s powerful, massive, rolling, deep, and constantly changing while ultimately staying the same. It’s The goddamned Ocean.\n",
        "\nVast, deep and powerful are only three of the infinite adjectives that can be used to describe 70% of the Earth's make up. There is a scope to the world's oceans that is hard to wrap ones mind around. They are their own universe within the world in which they cover. At any given time, seas of soothing calm can transform into explosive vistas unharnessed by mankind and depths of which are still unexplored. Fittingly enough the same can be said of Germany's Ocean Collective.\n\nFounded in 2000 by guitarist and creative force, Robin Staps, The Ocean has created some of metal's most unique and genuine soundscapes. Throughout it's existence, the band has been comprised of various musicians of the highest caliber, and have released progressive, post-metal works of ingenuity and sheer talent unlike any of their peers. The Ocean are raw, beautiful, and deep with passion and unbridled in their ability to create. Recently, the band as whittled itself into a group of five core artists still led by Staps. Three years after releasing their last full length, Anthropocentric, The Ocean have re-emerged from the depths with Pelagial.\n\nPelagial is a prime example showcasing this band's sheer musical capabilities and emotional depths. Originally, it was conceived to be released as a purely instrumental album after singer Loic Rossetti had taken a hiatus from the band. Gradually, it was decided to feature singing on only a couple of songs but, in the end, morphed into a full album complete with vocals. Pelagial was released as a double album with the vocal performance and the instrumental version.\n\nCutting to the chase, Pelagial, is just simply amazing, not only in execution, but also design. The record plays forward with the theme of being on the surface and gradually descending into deeper realms as it continues on. There are no breaks in the duration of the record as each song ebbs and flows into each other seamlessly creating an atmosphere of how big of a work the overall album is in scope. It does not, however, feel like one long song as the transitions are subtle and gentle while the bulk of the songs themselves are powerful enough to give them their own definition. This is credited to the band's amazing ability to envision and produce.\n\nThe intro song, \"Epipelagic\" sets the tone and begins the journey with a meditative feel featuring aquatic sound samples, piano and harp loosely played with a faint orchestral background which leads us into the bulk of the album as it blends into \"Mesopelagic: The Uncanny\". The Ocean guides the listener through a smooth sounding, groove inspired introduction with clean singing before quickly giving way to the band's signature heavy post-metal sound and yelled vocals. As the album progresses, the band very nicely balances the passages of mellow and heavy, never straying from a fresh and innovated sound that continually commands the listener's attention. \"Bathyalpelagic I: Impasses\" is an album highlight and one of the best songs The Ocean has ever composed as it is filled outright with a beautifully intense passion ending with the question, 'How much control do we have over what we wish for?'. All aspects of this release are stellar from the musicianship to the packaging. Pelagial entwines superb compositions with elements of progressive rock and metal performed with top-notch talent, thoughtful lyrics/themes all wrapped in an ingenious production worthy of any music lover's appreciation.\n\nThis is a very hard review to write as trying to encapsulate the greatness of this record is nearly impossible. In the end, The Ocean's performance on Pelagial is fully embodied and masterful. On their forward path of progression, the band continues to perfect their music much to the amazement and awe to those who listen. Pelagial is The Ocean's strongest release to date, a pinnacle for the band and a masterpiece. However, just as the same goes for the Earth's vast and powerful seas, there are constant movements and depths yet to be discovered.\n***Originally written for and by www.deathportal.net\n",
        "\nIn a time when the post-metal boom is reaching its ebb, bands generally considered its flag bearers have chosen either to jump ship (Pelican), break up (Isis, notably after stating they achieved everything they could) or stick to tread ground (Neurosis). It seems the art of post-metal itself, after a glorious period of pushing every conceivable boundary, is coming to its logical end as a progression. The sole exception to this general trend being the brazen and earth shaking innovation displayed by Cult of Luna on Vertikal, but that's for another review.\n\nSo how would The Ocean, a band that generally embodied excess and innovation with its double album assaults in a genre already violently innovative face up to the trend? Essentially, what they've done here is conceive an album that reconciles both schizophrenic sides of the band and aim for a more streamlined sound characteristic of post-metal. While this might be seen as anathema to the band's ethos itself, they really proceed with it in such a way that they don't lose any of the bells and whistles that made their sound so compelling. What it really is, is an economy of style - in consolidating their sound, The Ocean says much more with a lot less at their disposal. Commendable, and perhaps owing in part to the devolution of the collective into a regular five-piece band.\n\nNow it is my contention that The Ocean, despite their extravagances were a band sonically more of the Pelican mold than Isis. The band, at the heart of it, very much retained conventional sludge-isms, rather than making it a subset of their more expansive stylings like Isis. You could easily liken The Ocean at their heaviest to say, Mastodon whereas that would be fairly impossible to say of the likes of Isis. Considering that, the album at many times actually sounds like what could have been if the style Mastodon's 'Crack in the Skye' was put in far more capable hands. Don't let the understated, melodic bits lull you into thinking otherwise - this has riffs that could hold its own with the heavyweights. But as with the genre itself, its really the contrasts that make it what it is. There's some genuinely sublime parts that blend in seamlessly with their heavier counterparts, highlighted most with tasteful flourishes of the piano which regretfully become less common as the record progresses. Even when a track such as 'Hedopalagic II : Let Them Believe' (Gaudy titles aside) rolls in and stays clean for most of its 9 minute duration, it hardly ever fails to capture and keep your attention. \n\nI've read that the album was initially written to be completely instrumental and the vocals are a cosmetic addition. Well, hearing this, you really couldn't tell either way - and the vocals do much to accentuate the strengths of the band's instrumentation. Some would be averse to the overt clean stylings of the vocals at times - but I see such criticisms as incredibly myopic and hardly deserving of consideration at best. No band should be pigeonholed into straining every growl to earn kvlt kiddie points from the audience. Of course, there's always the instrumental version. Coming to the concept itself, the maritime theme of the entire album - though you'd think a band called The Ocean would have come to this a whole lot sooner - I find Isis' Oceanic a far more compelling evocation of the same theme. Though that does little to detract from the album itself, unless you're bent on listening to the album hoping for a whale song to somehow force its way into the music. The lyrics, as with any other Ocean release, are fairly thought provoking and worth the read. All in all, the only real fault I can find with this (besides needless nitpicking) is that it only lasts 53 minutes. But restraint is what makes this album what it is - and its hard to see how the band could come up with a more concise and effective rendition of their sound. Highly recommended.\n\nHighlights - Honestly, the album is only entirely meaningful when heard as a whole. Dissecting it track by track would be doing a great disservice to it. Set aside an hour for this, you won't regret it.\n",
        "\nThe Ocean have never been ones to rest on their laurels; mastermind Robin Staps has always striven to explore different concepts and musical types within each of his albums. Pelagial, their sixth full-length release, continues in a similar vein. The album comes packaged in two versions: one with vocals and one without. For the purposes of this review, I will only be mentioning the version with vocals.\n\nThese German wunderkinds have been hard at work for the past three years since their last effort, the twin albums Heliocentric and Anthropocentric, which are an examination of mankind's less than stellar relationship with organized religion. For this latest release the band has looked inward and down... way, way down.\n\nThe theme of this album is, on the surface, about the ocean. Now stay with me for a minute. At some point the Ocean (band) had to do this; I mean come on, it's their name and there are few things quite as immense as the ocean (body of water.) However, this album isn't only about a journey to the abyss below, but also into the psyche and the wants, wishes and desires we neither know about nor physically act upon. The album, much like the ocean, starts out very smooth and light, but as we go deeper into all of the oceanic zones (mesopelagic, bathyalpelagic, abyssopelagic, hadopelagic, demersal, and the deepest of them all, benthic) we're taken on a sonic journey that creates an understanding of the utter blackness, crushing pressure and claustrophobia of not only the deepest layers of the ocean, but the deepest layers of our own selves.\n\nThe music itself mixes a lot of different metal sounds together with varying degrees of success. Throughout the album there are shades of Mastodon, Opeth, Meshuggah and more, but, as is customary with the Ocean, their trademark sound is never washed out and they always end up sounding like themselves. The album is only split up into tracks for tradition's sake; the music is one long composition with several different movements throughout. Epipelagic, the beginning of the experience, opens with ocean sounds, harps, stringed instruments and piano, all of which combine to create a rather soothing and pleasant experience much like you might hear from a new-age artist, but fear not, for things quickly take a turn towards heavy once we leave the surface and journey below. As I said before, we're going all the way to the bottom, and as such with every movement the music becomes heavier, louder, more spaced out and, towards the end, churning and apocalyptic to match the bleakness and unbearable pressure at the bottom of the ocean.\n\nThe first few minutes of this album are sonically similar their previous release, with a more emotional core and hard rock-oriented sound; Mesopelagic spends its first two minutes building in speed and heaviness until Loïc Rossetti's vocals enter, where the song takes on a much more straightforward structure. It isn't until we enter the Bathyalpelagic zone that the Ocean's crushing guitar and Loïc's guttural screams become a more important part of the music. Part I, this movement's highlight, includes Loïc's sweeping and powerful vocals and an extended riff that is undeniably influenced by Meshuggah's style. As we sink deeper into the Abyssopelagic zone the music becomes more ominous and foreboding, with strings, more samples of ocean sounds and sparse bass strumming to emphasize the quiet and depth, minor key guitar picking with mournful vocals overlaid, and a final swelling of the music until we sink even further into the Hadopelagic zone, which includes the highlight of the album, a nine-minute movement that takes its time to unfold and progress, but includes everything but the kitchen sink in terms of the Ocean's musical repertoire. When we finally reach the bottom, the Benthic zone, the music is at its slowest and most crushing.\n\nEach member of this band is playing at a superior level; Loïc Rossetti, who I already knew had an impressive set of pipes, truly shows out on this album with a clean singing range and power I never knew he possessed, and screams that range from staccato barks to angry screams and powerful growls. Robin Staps, the sole songwriter and composer on this album, is in top form both playing guitar and writing music, as well as Jona Nido, his other guitarist who has some impressive licks in store. The rhythm section, consisting of drummer Luc Hess, departing bassist Louis Jucker and newcomer Chris Breuer add an impressive anchor for the melody. The bass is an ever-present rumble with complex musical passages that are interesting and entertaining, but it never makes itself too apparent nor falls into obscurity (thank the mix and mastering for that.) The drums are also complex and fun to listen to, and Luc Hess never consigns himself to simply keeping the beat, adding fills and different patterns here and there. Speaking of the mixing, it's what you should expect by now from an Ocean album; Robin Staps chooses not to get caught up in the loudness wars, which is a very good thing for the dynamic range of the music. The vocals and guitars are squarely on top of the bass, while the punchy dynamics of the drums keeps you in the moment with the music.\n\nAll of that said, there are a few things that prevent this album from reaching a level similar to that of Precambrian, the Ocean's very best release to date. The main problems are that the Ocean's sound has evolved somewhat, but it is still firmly rooted in the Heliocentric days; however, much of the more slow, classically inclined passes that Heliocentric and Anthropocentric possessed are either blended into the run of the album or eliminated altogether, so no more slow songs out of left field. Also, in some areas of the Bathyalpelagic movement it seems that Staps tried to experiment with the sound but ended up with some more-or-less tacked on passages; Meshuggah figures heavily in two key areas, and there is also a strange Mastodon/Opeth hybrid sound going on at one point, which, while different, isn't bad; it's just that it feels very tacked on. These things should not deter the hardcore Ocean fan from picking this album up. As one listens to the album over and over the music opens itself up and different things are noticed; things which may not have been the first few times around, so there is definite value in repeated listens.\n\nAs things stand, Pelagial will not topple Precambrian from its spot at the top of the Ocean's discography, but in terms of their new sound and era as a stable five-piece band it seems they have begun to find themselves. If this pattern of progression continues, then I expect more delightful things to come. Pelagial is an excellent listen and I trust it will find a good place in your collection. I hope you enjoy your trip to the bottom. I'll be sure to meet you there.\n",
        "\nFogdiver marks the first non-demo release by atmospheric sludge mammoths The Ocean. This German based collective, lead by Robin Staps, has delved into many interesting ideas over the space of their career. This EP not only lays the groundwork for what will come, it remains one of The Ocean's most interesting works - all with the omission of vocals. While there is no man behind the mic for this release, this is certainly not to the detriment of the music. The music is undoubtably strong enough to stand on it's own, and unless the vocals matched the caliber of the music, their inclusion may have resulted in the marring of an otherwise fantastic release. \n\nMuch of the success of this release lies in it's lush atmosphere. The album is produced in such a way that it sounds both clear and full. As their name might suggest, this release evokes images of the sea. Not being as violent and confrontational as some of the band's other work, this still has it's share of crushing riffs. These riffs remain relatively simple and to the point, but the band only puts forth their best ones. The riff that reoccurs in the second half of \"Isla De La Luna\" remains one of the most memorable The Ocean have ever written. While they still would be very effective, if put in a different context, the heavier riffs might not fully have had the same crushing effect. What makes them seem particularly devastating in this case is their contrast between the lighter sections. These lighter sections, while certainly not an exercise in minimalism, do contribute much of the album's atmosphere. \n\nWhile this release is consistent in terms of having a lasting fluid atmosphere, it is comprised of many distinct ideas. While the main feeling behind the music remains relatively congruent, there is an abundance of different timbres, instruments and dynamics. The classical stringed instruments not only enhance the atmosphere, but on multiple occasions become the main driving force behind the music. The exotic piano in \"The Long Road To Nha Trang\" is a welcome inclusion, conjuring images of Old World Eastern European coastal villages. The more tribal oriented drumming parts in \"Isla De La Luna\" create a feeling of depth. This release does not seem decidedly dark as many lighter, more hopeful passages make up a fair bulk of the music. The hopeful yet vaguely melancholy melody that starts off \"Endusers\" may remind some listeners of Pelican. This melody is beautiful in a bittersweet way, providing a wonderful contrast of emotions. Dissonance is also often used for the purpose of contrast, creating a compelling clash with the fluid forward motion of the EP. It is especially interesting when they play a more hopeful guitar line under the lens of dissonance. \n\nOne of the main reasons that the inclusion of vocals may have been an intrusion is that it could have resulted in the release feeling cluttered. There is a lot going on here, from the occasional psychedelic clean guitar tones to the well-placed voice samples. From the deep, rolling bass lines to the recurring crawling dissonant guitar lines, it becomes apparent that this release would not have faired as well without room to breath. The addition of vocals may have suffocated this need for air. This is an album of varied dynamics, timbres and instrumentation and the intricate and often changing way the songs are composed would have made it hard to figure out how and where to fit vocals in. Although vocals are indispensable to many of The Ocean's releases (with the band having used a nearly absurd number of vocalists throughout their career), Fogdiver is astounding as it is. \n\nFogdiver is a composition of many diverse layers. With the success of a good number of their full lengths, most notably Precambrian, this early EP is often overlooked. It would be wrong to assume that this is just a rudimentary early release by a band still struggling to find their sound. This couldn't be further from the case. This is a fully developed exploration of the more progressive and atmospheric side of sludge. This exploration was no doubt a great success. \n\nOriginally Posted At:\nhttp://ifthisishellthenimlucky.blogspot.ca/\n",
        "\nBefore I get into the rest of this review, I'd just like to say that this is probably the closest I'll ever come to giving something 100%. This album is not \"perfect,\" but it's just about as close to perfect as anything made by humans could be.\n\nIn Precambrian, the Ocean's third release, we see them really grow artistically. The first two albums (Fluxion and Aeolian) were both great in different ways. Fluxion was great for its incorporation of sludge with progressive music and its grandiose and progressive, sometimes orchestral vibe. Aeolian was great for its balls-to-the-wall, in your face heaviness. Precambrian seems to combine all of these qualities, while also adding so much more. This album is essentially a double album, or even an album with an EP tacked on, as the first disc lasts about twenty minutes and some change and contains five songs, while the second disc lasts about fifty-five minutes and has nine songs. These two discs are radically different in style.\n\nDisc one, entitled \"Hadean/Archaean,\" is similar to the Aeolian album; very fast and heavy, lots of screaming and heavy riffing, but there's enough going on musically that it's interesting. Hadean starts explosively, foreshadowing the sonic assault that is to come. It's a fast, no frills rocker. Eoarchaean's undulating riffs are perfect headbanging material, and Neoarchaean begins almost like a bluegrass jam, before becoming heavier and heavier, and then running away and into overdrive like a racecar driven by a drunken sixteen-year-old. \n\nVery suddenly, however, the tone shifts as the second disc, entitled \"Proterozoic,\" begins. The first song, Siderian, is simply a prelude to album-best Rhyacian, a ten-plus minute colossus that contains everything you could ask for in a progressive metal song, and blends them together seamlessly. Other highlights are Statherian, which begins with a slow, hypnotic guitar picking and increasingly builds into a juggernaut, adding layer upon layer of music and increasing the speed throughout until we're left with a fast riffing climax, and Stenian, which builds into a grooving mid-tempo riff, impressive drumwork and a cathartic chorus section. The entirety of the second disc is filled with slow-building progressive songs, but the musicianship is just as impressive as in the first disc, even more so. It's obvious that Robin Staps, the band's frontman and the man responsible for most of the musical composition, as well as lead guitar, has meticulously crafted this album. It contains string sections, a small orchestra, and layer-upon-layer of harmonized music. There are few albums this complex that don't come out seeming pretentious or being completely incomprehensible, but this is one of them. The production is crisp and clear, with the guitars being loud, fuzzy and nicely distorted, without being grating. The basslines are easy to hear and, instead of simply following the guitars or adding a bottom to the sound, actually complement the music. The singers also sound great. Each guttural death growl, wailing shriek or passage of clean vocals are audible, and the drums are punchy and rhythmic. The piano, strings and orchestra are all absolutely necessary to the music, and are played skillfully. In all, the musicianship and production are great and leave very, very little to be desired.\n\nTo be honest, I have no complaints about this album. Some may find the length of the songs tedious, and some may be overwhelmed by the complexity of the music, but those same people also may not enjoy progressive metal, since those are often defining characteristics. However, the music is so well written and executed that I cannot imagine most progressive metal fans turning away from this album. This album takes the Ocean's earlier work and turns it on its ear, with great results. There are very few albums I enjoy as much as this one, and urge those of you who are interested to go out and get this album now. This is the Ocean's best album, and it will be very difficult for them to top this. That's not to say, however, that they couldn't.\n",
        "\nFluxion, The Ocean's first LP, helped to solidify the Ocean's sound and showcases thiss collective's (nearly forty musicians in all) musical ability. However, probably most deserving of praise is one Robin Staps.\n\nThis German wunderkind wrote the music and lyrics for this album singlehandedly, and an aura of meticulous calculation comes through in this remastered version, which was originally meant to be released alongside Aeolian as a double album. Remastered and reissued because Staps and the rest of the group were never quite pleased with the final product the first time around, the sound comes through much clearer than on the original. The overall mix is loud, but never deafening. Bass and guitars command almost equal presence, which give the sound a nice, chunky feel and a nice bass rumble. The different vocalists go through shrieks, shouts, death growls and clean vocals; they sound crystal clear and are never buried in the mix. The drumming is punchy and full, but can sometimes end up a little bit drowned out, especially the treble of the cymbals and the lower-pitched bass drum. The snare and toms are easily heard and never suffer from tin can syndrome or similar sound board woes. It helps, too, that these guys know what to do with their instruments. While not gifted with virtuoso talent, they are good nonetheless. No fumbling, no mistakes, everything is tight and nicely played.\n\nThe album is generally split into three different types of song: long, drawn-out builder (The Human Stain, Isla del Sol and The Greatest Bane fall into this category) fast, heavy thrashers (Comfort Zones, Equinox, Dead on the Whole) and instrumentals that mix quiet and heavy movements, such as Nazca (which serves well to set the mood, as well) and the titular track. Loopholes is really not worth mention; it's nothing more than a brief ambient interlude to divide the album in two.\n\nFor the most part, the songwriting is solid and well-done. The Human Stain could probably have built to its conclusion a little more quickly; after a heavy beginning, everything slows down and it seems to take forever to build again, albeit to a worthwhile conclusion. Isla del Sol suffers from a similar problem. Once it starts, it takes forever to get anywhere; unfortunately, it tends to meander about for ten minutes before reaching a conclusion. While there are a lot of nice spots to headbang and sing along, the build never really seems worthwhile. \"What I've been searching for does not exist,\" as the chorus goes, which is strangely apt, as it's probably the weakest track on the album, Loopholes notwithstanding. Equinox is another weakness. The song, while fast and heavy, consists of mostly a few different power chords strummed over and over. The main riff is sort of ho-hum, and while not verse-chorus-verse, it has a similar feel about it. Sort of an \"A-B-C-A-B-C-repeat\" feel, if you catch my drift.\n\nThe rest of the album, though, is pretty nice, and even the problems I cited are mostly subjective and minor. Fluxion is nowhere close their magnum opus Precambrian, but this will definitely have something worthwhile for both longtime Ocean fans and those new to the band. Album highlights Dead on the Whole, with its infectious, almost Meshuggah-like groove and powerful ending riff and repeated grunted vocal \"WE SET THE STANDARDS\" and The Greatest Bane which contains multiple intense, well-crafted passages and a powerful climax are fine examples of a fledgling band learning to stand on its own feet. Go get this album.\n",
        "\nThe Ocean is back with its follow up to this year's Heliocentric, an album that may have surprised the lot of you due to its emphasis on the more orchestral side of the band as well as its lack of heaviness. If you were one who assumed the second half of The Ocean's latest concept would return to the heavier side of things, you are correct. Mostly.\n\nTo say The Ocean has a knack for releasing double LPs would be an understatement, considering it's the only thing they've ever done as far as their full-length albums go. Fluxion and Aeolian were both meant to be released as one album, as well as Heliocentric and Anthropocentric. The most perturbing aspect of this ongoing concept (with the exception of Precambrian) is the fact that the band's attempts to release elongated, two-part concept albums are a bit lopsided. I do credit The Ocean for managing to display a wide array of different sounds and approaches to metal, but it's difficult to not assume that some of it is filler. Therein lies the catch 22: The Ocean's willingness to experiment is what sets them apart, but it's not what makes listening to their music enjoyable. Fortunately, quite a few of the songs on Anthropocentric are pretty damn enjoyable. I know...I'm getting to that. Please pardon the parallel between the long-windedness of this review and the amount of time it took me to comprehend The Ocean's latest Sunday school science lesson.\n\nThe Ocean has quickly returned to its sludgier ways, as Anthropocentric immediately leads off with its crushing ten-minute title track. If there's one thing the band has mastered, it's how to write incredibly catchy hooks. Although Staps and other guest musicians help make up the album's vocal tracks, Loïc Rossetti has proven himself to be a marvelous vocalist. Whether his punishing screams are accompanied by the sound of a tuned-down guitar or his clean vocals dance alongside a softer, melodic chorus, Rossetti's vocal passages (especially during the clean segments) are non-obnoxious and share the same caliber as Linus Jägerskog of Burst. Aside from the opening track, \"She Was the Universe,\" \"The Grand Inquisitor II,\" and \"Heaven TV\" are all examples of how The Ocean's beautiful guitar melodies, carried by the dirtiness of crunchy, distorted chugging, lead perfectly into each chorus. Although each of the aforementioned songs has a fairly accessible structure individually, they all follow fairly different patterns and take some getting used to. With time, you'll be happily singing along to them in your head. The only problem with Anthropocentric is that the same can't be said about the remainder of the songs. A few of the heavier songs are far from memorable and contain little variation, while the softer ones are annoyingly similar to every decent post act you've ever heard. Don't get me wrong here -- utilizing a few minutes of space on an album such as this to play some softer jams is certainly more desirable than 70 minutes of arid guitar meandering with no vocals, but it feels too much like filler. Not to mention, didn't The Ocean already give us an entire album of softer songs anyway? A few string instruments and bizarre keyboard effects spice up Anthropocentric's lighter moments, but they don't really maintain a big enough role to greatly enhance the album.\n\nRobin Staps, the mastermind and only remaining founding member of what one was once The Ocean Collective, has made a considerable amount of changes since the release of the group's 2007 meisterwerk, Precambrian. Oceanland, a former World War II aluminum factory turned recording studio and living quarters for The Ocean has since been seized by Berlin officials. Additionally, Staps has stated that the band is now an official five-piece (plus a permanent sound manager) with guest musicians. Although a touring band with thirty or so members (some of whom have become lost to alcoholism, have been severely injured on stage or have merely disappeared en route) sounds frighteningly exciting, Staps has made a step in the right direction as far as the band's lineup is concerned, because I personally don't believe The Ocean's plethora of guest musicians or explorations into uncharted metal territory is what makes Anthropocentric worth listening to.\n\nNow for the challenge: release a 70-80 minute LP, condensing all of their desired sounds into one cohesive, coherent album that is enjoyable and doesn't require so much fucking time to listen to. A dainty portion of mixed greens is fine on a side plate, but the meat and potatoes are really what we all look forward to. If The Ocean can serve more of it, I'd be willing to bet their best is yet to come. \n\nOriginally written for MetalReview.com\n",
        "\nBeing a newborn to The Ocean after discovering \"She Was The Universe\" on a Youtube suggestion, I am not well versed in the history of The Ocean. However, I couldn't think of a greater album to kickstart a love affair with the German prog metal band. A 10 track CD loaded to about 50 minutes, it varies greatly in song lengths. Ranging from 9 minutes, down to just shy of 2 minutes.\n\nThe first song, \"Anthropocentric\" hits hard and straight away, which initially does take some time to get used to, but easily becomes a selling point for the harder of us. This song is by far the most roller coaster of all the songs on this disc, it goes from heavy riffs (and heavier vocals) to a clean mellow prog section 2-3 minutes in which spreads right down to the end of the song, however this does very little to spoil the song, infact it works perfectly to Loïc's vocal abilities.\n\nAs I am stuck inside a musical box my tastes for this album didn't venture far past the 6th song, \"The Grand Inquisitor III: A Tiny Grain of Faith\", as from there it does start to slip off the beautiful chain that The Ocean had carried through the start to middle of the album. For the heavier bastards of us, you can't miss listening to \"Anthropocentric\", \"The Grand Inquisitor I: Karamazov Baseness\", \"She Was The Universe\" and \"The Grand Inquisitor II: Roots & Locusts\" and \"Sewers of The Soul\", as they very effectively carry the shredding riffs and powerful vocals one would expect from The Ocean.\n\nDisregarding (the sometimes extreme) variations in tempo, this album is amazing and is a must-have for any fanatical atheists with a taste for well crafted prog-metal. Which brings me to a final point. The vocals.\n\nWhile clean and beautiful at times, and others harsh and deadly, the lyrics are very strong and 'directive', showing a clear distaste for Christianity. And while this can easily be overlooked for the Christians amongst, it does become a bit abusive and nitty at times. However it hasn't put me off the album at all, it simply creates a more technical and detailed image.\n\nThis could easily be recommended to fans of Dream Theater, Mastodon's \"Crack The Skye\" album or Opeth fans looking for something a bit darker.\n\nAnd is best played very loud! Enjoy!\n",
        "\nAs the first in a two part companionship album revolving heavily around religious critique and a humanistic (and quite often negative) study of the Christian faith, 'Heliocentric' represents the beginning of a new era for Germany-based post metal act The Ocean. While I had listened to 'Anthropocentric' (the second half) before this one, I was already a fan of this band's complex and intelligent music from the 'Precambrian' days onwards, and my expectations were high for the next album. This band has always been prone to take on the most ambitious topics ('Precambrian' revolved around the creation of the Earth itself) and 'Heliocentric' is no exception to this rule. A deeply thought-provoking concept by all standards, 'Heliocentric' does ultimately disappoint my high expectations however. While the album is graced with some brilliant moments and lyrics that will surely upstart more than a few existential debates, the band's new direction does feel basic and less effectively executed than some of the great albums they have released in the past.\n\nWith a new vocalist here, the sound of the band is obviously changed a fair bit. While the abrasive growls are the same as they have always been (that is, a mixed bag), the introduction of Loic Rossetti is one of the more skilled singers the band has seen through its revolving door of musicians. However, while 'Anthropocentric' shows the singer's talent in an excellent light, 'Heliocentric' feels as if it stretches the vocalist's style in the wrong direction, usually towards a more abrasive direction that could vaguely be compared with the harsh style of Metallica vocalist James Hetfield. Ironically, many aspects of The Ocean's music have actually become much more melodic and harmonious since the atonal and unsettling sounds of 2007's 'Precambrian'. Even going as far as to have a piano-driven ballad like 'Ptolemy Was Wrong', 'Heliocentric' does see the band going in a slightly less complex direction with their music, and that did often feel to me like The Ocean's greatest strength; their meticulously crafted arrangements. Songs like 'Metaphysics Of The Hangman' are driven by chorus structures, and while this doesn't necessarily mean that the music will be worse, in The Ocean's case, it does. Mixed results on Rossetti's new vocals,some inconsistent writing, and a more accessible direction? Doesn't sound good, but the album is far from being poor, and still sports a good deal of strengths.\n\nFirst among the positive aspects of 'Heliocentric' is the lyrical content and concept. On an even calibre with 'Anthropocentric' here, the lyrics generally revolve around the Church's resentment towards science, as well as to debunk Creationism (a theme further developed with the second part) and question the existence of a divine entity. While this will offend some Christian listeners surely, the lyrics are written quite tastefully, touching upon the subjects through a poetic, often metaphorical language that really becomes the highlight of the album.\n\nThe Ocean's 'Heliocentric' is certainly one of the weaker points of The Ocean's career, especially considering when the band has had such success with releasing absolutely phenomenal records. in the past. However, tracks like 'Firmament' and 'The Origin Of Species' and a few others provide a great listening experience typical of the band's output. While the album did not reach my expectations however, it would pave the way for 'Anthropocentric', which is the real masterpiece to be spawned from this project.\n",
        "\nWith 2007's 'Precambrian', German post-metal group The Ocean (also known as Ocean Collective) came out with a two disc concept epic concerning nothing less than the turbulent creation of the planet Earth. To follow up something so vast, 2010 witnessed the band now releasing two companion albums, each dealing with such topics as the creation of man, the idea of god, and religion. Suffice to say, The Ocean are never short of ambition in the projects they choose to take. While the critique of religion and faith is as ripe a concept as any for a metal album, 'Heliocentric' did end up being a bit of a disappointment. Luckily, the second installment in this chapter of The Ocean turned out to be quite a return to power for the band. With 'Anthropocentric', The Ocean releases one of their most potent efforts yet, with a concept and lyrical content as profound and fiery as the music it is driven by.\n\nWhen speaking of the sound of this album, there is definitely a more conventional melodic sense here (like 'Heliocentric') than there used to be, in no small part due to the addition of new vocalist Loïc Rossetti, whose clean singing is featured quite prominently here. However, unlike 'Heliocentric', very little of the heaviness and experimentation is relinquished, and there is a very good balance between the heavier vocals and lighter melodic singing. With many of the songs, the clean vocals make some pretty catchy and memorable hooks, but luckily don't feel superficial by doing so.\n\nThe title track leads off the album in full force; a nine minute episode of sludgy heaviness, mixed with rhythmic experimentation. While the track begins in a very typical, atonal style for The Ocean, the differences and developments start to be heard when the clean vocals come in, three and a half minutes into the album. In direct contrast to the brute growls, the vocals are often beautifully harmonized, although some of the more stylized singing of Loïc Rossetti can get a tad nasal at times. At least as far as the first track is concerned, the highlights reside in the beautiful mellower moments, where The Ocean gets to properly show their new grasp for great melodies.\n\nAnother highlight of the album is the single-worthy 'She Was The Universe', which is a memorable powerhouse from start to finish, despite being highly rhythmically irregular. Along with many of the songs here, the chorus is kept quite melodic. Other noteworthy songs include 'The Grand Inquisitor III', which is the most 'out there' track on 'Anthropocentric'- an electronic trip-hop acid tweak of an interlude- and 'Willie Zum Untergang', a very post-rockish track that showcases the band's more ethereal nature. The only song here that isn't excellent is 'Sewers Of The Soul', which keeps a relatively up- tempo, rock vibe without showing the same compositional complexity and intricacy of the rest of the album.\n\nLyrically, the material here is bound to cause some controversy, especially among the more religiously-inclined listeners. As was true with 'Heliocentric', 'Anthropocentric' is a harsh, to- the-point critique of Christian fundamentalism and hypocrisy. Philosophical opinions aside, the subject matter is intregated well into a sort of intellectual and thought-provoking poetry that's sure to stir up some debate amongst metalheads.\n\n'Anthropocentric' may very well be a rival of 'Precambrian' for The Ocean's greatest work to date. Despite having one or two songs that feel a bit less inspired than the rest, 'Anthropocentric' is a true definition of the 'thinking man's metal'; highly complex and frenetic sludge metal, mixed with a truly ambitious scope. An imperfect album, but The Ocean's mastery of aesthetic and innovation is readily evident in spades.\n",
        "\nGerman heavy-hitters, The Ocean, return from the drawing-board with possibly the most intricate music in their sixth full-length album \"Anthropocentric.\" This release is a cumulation of all the music these guys have made in the past, and I have to say - It sounds amazing. You may be wondering, \"what sets this album apart from their last full-length \"Heliocentric?\" Here are all the juicy details:\n\nThe Ocean has always been a band that you could see progression in musical style and skill throughout their releases. Some aspects took longer to improve on than others. I'll be honest. By the time \"Heliocentric\" came out, I was still not completely impressed by the clean singing that was being recorded on the albums. While I felt that the vocals always fit the music, I always found myself frustrated in the fact that the clean vocals were always inches away from the line that distinguishes the good clean vocals from the great clean vocals. I'm not sure if the vocalist got better with his voice, or the band got better at making the vocals blend with the music more, but, regardless, the cleans have crossed the metaphorical line, and truly sound great. This new found vocal beauty gives \"Anthropocentric\" the most mature and distinguished release in The Ocean's repertoire thus far. For the most part, the screams have transitioned over from the last album, which is a good thing. Once you've got a solid growl mastered, there is little to no reason to change it. The growls on \"Anthropocentric\" as deep, full growls that match the other instruments well.\n\nInstruments wise, this album is a gem as well. Though The Ocean has had a pretty consistent sound throughout most of their albums, the riffs and beats of this album are fresh, catchy, rolling and sluggish at the same time. Though this formula is more than familiar, the band did a great job at not letting that restrain them from writing tracks that are reminiscent of older tracks, yet completely new at the same time. My favorite track off the album, \"The Grand Inquisitor II: Roots & Locusts,\" is the epitome of my last statement. With style similar to the track \"Metaphysics of the Hangman\" off their last album, the track blends heavy, whipping riff-action with a fast-paced chorus that sticks out as the high-point of the album. The only difference is \"The Grand Inquisitor II\" is a far better track.\n\nIf you haven't noticed yet, The Ocean isn't in the bizz for making a few decent tracks to stand out from an otherwise bland album. Quite the contrary, they are in the bizz for just making whole albums into experiences. This is done through using the tracks of the album as vessels for carrying the overall mood of the album through it's duration. This is precisely what The Ocean does on this release. Through stellar pacing, and an atmosphere that could, well, fill an ocean, the band creates more than just an album on \"Anthropocentric\" - They craft a fine-tuned atmosphere that works in complete unison. \n\nThough this album has many areas in which it demands high praise there was one place that kind of dropped the ball for me. It spans from the sixth track on the album, \"The Grand Inquisitor III: A Tiny Grain of Faith.\" While the track sounds cool in it's own respect, it features a female guest singer (To whom I don't know a name), and doesn't hold much musical content other than a fancy violin section, and a spacey tonal passage. In short - The track seems like filler to me. It was a huge let-down, and frankly, the more I listen to the album, the less I like the track. It wouldn't have been such a let-down if the rest of the album weren't so damn good. But to have such a rolling album come to a halt for this one outcast song was a major disappointment on my end.\n\nLuckily, this one song wasn't nearly bad enough to ruin the album. If you're a fan of any of The Ocean's previous works, I highly recommend you check out this one. Combining all aspects of past releases, it delivers a punch so hard that it comes up just inches behind the bands magnum opus \"Precambrian.\" This is not an album you want to miss out on.\n",
        "\nThis album is also a fairly important one in The Ocean’s discography for two reasons. First, it’s the follow up to the band’s critically acclaimed and superbly high quality “Precambrian” album. Fans were no doubt chomping at the bit to hear how this album stands up against its predecessor. Second, this is the first album where The Ocean has a stable lineup instead of being comprised of Robin Staps and everyone in his phone book. Because of this, “Heliocentric” is much more unified in sound than “Precambrian”. The lack of guest vocalists also puts the spotlight directly on newcomer Loic Rossetti, and his performance will have a major impact on how this record is received.\n\nAnd his performance is as good a place to start reviewing the real content of this album as any, so here we go. Rossetti, like just about every metal vocalist these days, does both harsh and clean vocals. His harsh approach is a hardcore shout akin to Aaron Turner from Isis, or the vocalists from Cult of Luna. They’re nothing too distinctive or memorable, but they fit the music and are performed adequately. His clean vocals are far more likely to cause a stir in the metal community. Rossetti has a gritty baritone voice with a noticeably thick accent that certainly makes his voice stand out in the crowd, but sound a bit funny to native English speakers. His choice of vocal melodies is far from standard metal fare. At times, like the beginning of “Firmament”, he recalls Maynard James Keenan of Tool while on tracks such as the head scratcher “Ptolemy Was Wrong” he veers into pure pop territory. Sometimes this works like on “Epiphany” other times it doesn’t.\n\nThis development is accentuated by the new approach to songwriting that the band has taken. The majority of these songs are extremely vocal centric and even feature fairly simple verse-chorus structures, a far cry from the elaborate compositions of Precambrian. Even more surprising is how almost all the verses are soft, and almost all the choruses are heavy. Coming from such an ambitious band, this conventional songwriting is jarring. On top of this, most of the orchestral elements and the heavier hardcore influences have been removed leaving the songs as either straight forward post metal songs, or somewhere in the territory of Thrice and other post hardcore bands. While none of the songs in this new style are bad (except for Ptolemy Is Wrong) their strongest moments are when they break from the formula, like the piano solo in “The Fist Commandment of the Luminaries” or the spacey reverb filled middle section of “Swallowed By the Earth”.\n\nHowever The Ocean Collective are still just flat out better at more linear compositions, which there still are two of on this album. The first is “Firmament”, a song built around a syncopated riff that leaves plenty of open spaces. The song also features an excellent bridge that recalls Isis circa Panopticon or Cult of Luna at their most subdued. The other highlight is the closing suite of ‘The Origin of Species/The Origin of God”. While separated into two tracks, this song works as a single 11-minute piece. The song ebbs and flows better than any other song on the album, hits as hard as “Precambrian” and features more orchestral elements (the violin melody in 17/16 and the ending brass section are my two favorite moments) then the rest of the record combined. They also have the most thought provoking and interesting lyrics, which bring us to a major concern with the record.\n\nAs the title implies, this record focuses on how the heliocentric theory, the idea that the earth revolves around the sun, impacted Christianity. While this was one of the most important turning points in the history of science, holding it against Christianity now seems a bit like calling the Italian government immoral because the Roman Empire used slaves. At this stage in history every sane person knows that the earth revolves around the sun, so championing this cause isn’t going to convert too many listeners to atheism. The ‘Origin’ songs on the other hand are far more effective as they address the hot topics of evolution and the source of complexity. Both songs make liberal references to the writings of Richard Dawkins and the dramatic and powerful music does a great to make these wordy lyrics work. It’s always refreshing when a metal band actually uses reasoning and logic when attacking the church instead of resorting to name calling and childish satanic buzzwords.\n\n“Heliocentric” is not as good as “Precambrian” and it’s likely that nothing The Ocean ever do will be. However, the shift towards more accessible song structures and less aggressive material doesn’t make this a bad album. Tracks like “Swallowed By the Earth” show that given time, The Ocean might grow to excel at this new style, and “Firmament” is sure to please older fans until they get there.\n",
        "\nNow this is a well-done split. The bands here, Sweden’s Burst, and Germany’s The Ocean might not sound exactly the same, but they share a great deal of influences, aesthetics and positive qualities. Both bands blur the line between hardcore and metal, as well as progressive metal and post metal. Both bands are technically skilled, but use those skills to focus on atmosphere and mood rather than extended instrumental workouts. They also rarely come to America, which gives them a sense of mystery and magic to a yank like me.\n\n“Flight’s End” is one of the more laid back tracks from Burst’s “Origo”. It spends a great deal of it’s runtime in a soothing and contemplative mood, and when it does pick up in volume it sounds more fun than threatening. The opening chords for example sound positively joyous by metal standards. These upbeat moments are juxtaposed against loud abrasive hardcore vocals. The vocals will always be a divisive issue for listeners of this band. If you’re coming from a more melodic prog background this blatant punk influence is going to be pretty grating. Luckily Burst have excellent clean vocals, used here over the softer harmonized guitar passages, building from a single voice to a three part harmony that drives the second half of the song to it’s highest point. There aren’t too many riffs in a traditional sense in this song outside of the Opeth-esque 6/8 ending section. For the majority of the song the guitars focus on large washing chords or twinkling guitar harmonies. This isn’t the best Burst song out there, but it’s a good representation of how far from the norm they can get.\n\nWhile Burst covers the soft side of this style, The Ocean’s contribution pulls no punches. Right from the get go this song resembles a more harmonically inclined Meshuggah or a less spastic Dillinger Escape Plan. To my knowledge there is only a single part of this song that’s in 4/4 (the slower chord progression at the end of the song), and there’s very little attempt on the band’s part at hiding this fact. But despite all of the rhythmic twists and turns, the song never makes you lose track of the underlining chord progression or the over arching direction. The song moves through three main sections, each getting progressively more melodic and harmonically grounded but never lets up on the intensity. Of course each of these parts is made up of smaller cycles of riffs, so needless to say this is a fairly complex composition. While this song doesn’t stick out much on it’s home album, “Aeolian” due to most of the material doing exactly the same thing, it stands out here as a nice contrast to the more sedated Burst tune.\n\nThere aren’t too many copies of this, so you’ll have to do some searching on eBay to find it, but these are both solid songs by two great forward thinking metal acts.\n",
        "\nBlasting out extreme and experimental sounds is a tough challenge especially for Robin Staps' The Ocean Collective who has members from Converge, Cave In, War From A Harlots Mouth, and even has performers from the Berlin Philharmonic, doing the orchestral work. That's a lot of responsibility for a dude to handle and absolute props for his previous efforts and this 2007 opus, Precambrian.\n\nGiving a main concept to the natural land of mother Earth millions of years ago and having music with music to heavily back up the concept is just plain effective as Hadean can be imagined as a pool of lava flowing and flooding the hostile planet. This sense of evil exists only for almost a half hour but the execution of harsh progressive metal, hardcore punk, and sludge metal makes every listen of the first disc enjoyable until the end blast where it's time to get introduced to atmosphere, oxygen, and life.\n\nDisc 2 is where Staps' mastery exists as the abrasive sounds of disc one and their previous album, Aeolian mix with the atmospheric characteristics of their first album Fluxion. Having the NeuroIsis touch but having a sound all their own flooded by sequentially proper background effects of unconventional instruments (glockenspiel say much?). In support of vocalists like Nate Newton, Dwid Hellion, Matt Beels, Nico Webers, the awesome Meta giving agony and elegence to the philosphical lyrics of the likes of Nietzsche and Trakl. Heck Kevin Spacey appears but as a audio rip from The Life of David Gale (still great though). All of these sounds processing impressively through songs like Ectasian and the epic Rhyacian is nothing but mind blowing.\n\nPrecambrian is over ambitious but when all else misses the mark for success, The Ocean hits it dead on like a big bang, excuse my Earth history joke.\n",
        "\nThe Ocean is a German extreme metal band that’s been kicking since 2000 and has released 4 albums prior to 2007's Precambrian. The band is essentially the vision of one Robin Staps who is the chief songwriter and along with the band uses a variety of guest musicians and vocalists to create some of the most inspiring music I’ve heard in a while.\n\nThe Ocean has been meaning to release a double album for a while now and the last two albums, Fluxion and Aelion were meant to be released as one double album till the commerce of music got in the way and the two discs had to be released separately. Precambrian though is a double album and with the backing of the label has come out like the band intended it to. The first disc titled Hadean/ Archaean and the second titled Proterozoic. There is a concept tying in the whole geological ages with the evolution of human conscious or something like that but it’s a bit complicated and will involve some reading of the booklet (which in a related aside is quite gorgeous). \n\nSo basically, Disc 1 or Hadean/ Archaean is the heavy disc. Coming across like a slightly slower melodic Meshuggah/Gojira hybrid the band pound their way through 5 dense, layered and incredibly heavy songs. The band is technical and possesses a wide array of chops which is impressive but what makes this music so captivating is the layer upon layer of music that is present on each of these songs. At first listen it’s easy to dismiss Disc 1 as yet another exercise in atonal tech-metal riffing done before by Meshuggah and Gojira but that is just the surface. It’s the subtle electronics, the grooves, the insanely tight rhythm section and some very tasteful guitar playing that makes these songs a bit special. The songs are all mid-paced with grooves that sound like a drunken giant slowly lurching towards to you. There’s an atmosphere of menace on these songs. Lyrically Staps uses poetry by Charles Baudelaire and Comte De Lautreamont (considered to be the founder of surrealistic poetry) along with his own lyrics.\n\nDisc 2 or Proterozoic showcases the relatively lighter side of the band. Siderian is a short instrumental that opens the disc sounding almost like Ulver on Perdition City with its mellow sax and almost tender guitar lines. Next is the superb though lengthy Rhyacian which is all about building atmosphere as the song explodes for a brief moment around the 7 minute mark before again being content to sail along with subtle electronic and drum and bass workouts. I suppose I could call this doom metal because it’s mostly slow and heavy and quite superb. Orosirian is a crawling lurching monster of a song almost like slowed down Gojira with melody and a sense of despair that most doom bands would give their left nut for before slowly mutating into an acoustic workout that somehow deviates into a violin and vocal piece with the female vocals buried deep in the mix. Slowly the heavy elements come back into the frame as the song once again builds to the doom metal of old. Awesome.\n\nThe highlight of the disc though is the instrumental Statherian. Again the band just builds things up slowly and in such a leisurely pace that is captivating. The Ocean is in no hurry to go anywhere and if any proof was needed that sometimes the journey is more fun than reaching the destination itself then this is it. A single guitar line starts proceedings at a gentle and sleepy tone before other instruments start to come into the picture till it culminates at around the 2 minute mark with a superb keyboard melody that drives the song further. The build up from soft to heavy is superbly carried out and the song uses the cello, the viola and the violin to startling effect. For trivia buffs it also uses the Kevin Spacey speech from his 2003 film The Life Of David Gale.\n\nThe music is for the most part slow and can get incredibly heavy at times but is also very dynamic in that the interplay between the heavy and the soft, the interplay between the classical cello/ violin workouts and the electronics is brilliant. This is a songwriter who is utterly fearless when it comes to experimenting and creating a soundscape unlike any other in metal today.\n\nI suppose The Ocean could be classified under the doom metal genre or use the band’s own description of ambient soundtrack doomrock but for music like this all pigeonholing is an insult. It is music that has a foot in metal and borrows ideas and themes from the genre but if ever there was a case of a band transcending genres then this is it. In fact this album transcends musical genres to become a valid and dynamic piece of art all on its own. This is complex, layered, complicated and utterly captivating music.\n\nOriginally written for http://www.kvltsite.com\n",
        "\nI first heard of this band from watching the Metal channel on TV. I heard \"Hadean\" and desperately wanted to hear the rest of the album.\n\nThis is the kind of album that grabs you right off the bat and doesn't let go until the final track on the second CD is over. It's a mix of several different styles, sounding most like a combination of Meshuggah and Mastodon (taking the best qualities of both bands and pretty much leaving out any weaknesses). You'll hear other styles, with some keyboards, a string section and even a cello. It's all done perfectly well, and the music flows very well from track to track.\n\nThe first CD is only about 22 minutes long, and is actually on a minidisc. The design of the disc itself is really cool. There's a plastic rim around it so that it's the same diameter as a regular CD, and you can hold it by that rim without worrying about screwing up the delicate part of the disc.\n\nAs for the music, the first disc (Hadean/Archaean) is pretty much pummeling metal fury, combining progressive, thrash, death metal, and some other shit that's hard to classify. If I had to describe the overall sound of this album, I'd say it's progressive with a very heavy edge to it.\n\nThe second disc is quite different. It's longer (about an hour); the songs are longer (one is about 11 minutes, a couple are over eight). In general it's lighter (the first track is a very, very mellow instrumental), but it does have its heavy moments, and when those come, they kick it up almost as hard as they do on the first disc. There are strong classical influences in some songs, creating moments that are truly awesome.\n\nThrow in some lyrics heavy with intelligent social commentary, and you get one excellent album. The vocals vary, since they're done by different people, as are the other instruments (check the main band page for the current lineup). Most of the time there's a demonic death roar thing going which sounds great.\n\nExtra points for the sick artwork. I didn't even get the European version which supposedly has even better art, but the version I have has some incredible pictures.\n\nHighlights: Hadean (the intro is so badass), Mesoarchaean, Ectasian, Cryogenian (the song titles are names of periods in the Precambrian era). Take note of the fact that there isn't a single track on the whole two discs that doesn't rule, however. \n\nI'll be seeing this band on May 26th. After hearing this album and Aeolian, dammit I can't wait.\n",
        "\nI'd heard a lot of good things about The Ocean. Problem is, they didn't have fluxion, so I bought this one instead. While FLuxion might be the prog sludge/death thing I thought these guys where, in this album, the songs bring to mind a scarier, more drawn out version of Meshuggah.\n\nYou can tell how damn heavy it is by the first song. The City by the Sea starts off with some Mechanical, downtuned riffing that is almost overwhelming. Herein lies the problem to the rest of the record though.. The riffing doesn't change much in feel for the whole record, the guitarist content to do mostly Mid Tempo riffing, though speed is used in a few good places though, like the unsettling beginning of the epic Austerity, or the punk riffing that kicks off Une Saison En Enfer. A quick look at the cd booklet reveals tonnes of different vocalists.. and this is used to fairly good effect, though it would have been good to get a bit of all vocalist at once action. It's a pain all the vocalists don't tour with the band..it would be great to have 7 guys screaming all at once on stage.\n\nSO... There's tonnes of heavy riffs, and lots of guys screaming. Why only 65% then? Because.. that's all it is. I've always been one to think that loading up on nothing but extremely heavy riffs is always doomed to failure, so you put\nin the occaisonal but awesome mellow bit/interlude to keep the interest. Most bands realise this.. Whether it's Nile doing some egyptian mood piece, or Meshuggah dropping in some strange quiet guitar stuff. While Ocean do actually do that once in a while, it's never all that good, and proves this band is a bit of a one trick pony, though admittedly there is a very effective use of a piano in the last few seconds of Necrobabes.com. \n\nIn the end then, it is worth getting? That's the question everyone wants answered. I'm sure people who enjoy 'really heavy all the time' would dig this record. It's not a bad record.. There's good riffs with great thick production. But it's just a monotonous record, that drags on for ages.\n",
        "\nThe Ocean have came up with a sludge album that can stand up to the massive Mastodon sweeping the metal world. This German 8 piece has released powerhouse CD’s back to back\tthat have absolutely crushed listeners. Aeolian being my favorite of the two, I have decided that it is high time they get a hail for their amazing work.\n\nThe CD starts out with a battery of drums and solid bass and guitars synched to perfection. The vocal attacks on this CD are so brutal I would rather classify the vocals as Death Metal, but they fit the onslaught very well. The time signatures in some of the songs have a very Meshuggah feel to them, but while keeping the sludge feel to the whole CD. The guitars throughout the CD are very technical and at times just old school heavy as hell, skull crushing chords. The bass is very clear in all the tracks so you get that Crowbar, Down, and Pantera feel that categorizes Sludge Metal. \n\nThe CD is very chunky and heavy, but also picks up speed and gets fast and heavy like Mastodon’s “Remission” and “Leviathan” albums. Which, in my opinion, is important in this genre of metal today since Mastodon have pretty much taken over the metal scene. This album also contains visual attraction, the CD booklet is very beautiful and captures the feel of the CD for the listener while they read through it and listen to the CD. \n\nI recommend this CD to any fan of Mastodon, Crowbar, Pantera, and Down. This CD is a must buy for all fans of Sludge Metal as well as Metal in general. This CD has the heaviness and the technicality that all great bands need to have in their music. Metal Hails to The Ocean and Metal Blade for releasing this awesome work of art.\n"
    ]
}