{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Baton Rouge, Louisiana",
        "Status:": "Active",
        "Formed in:": "2005",
        "Genre:": "Sludge/Drone/Doom Metal",
        "Lyrical themes:": "Despair, Revolution, Societal collapse, Death",
        "Current label:": "Sacred Bones Records",
        "Years active:": "\n2005-present ",
        "Number of Reviews": 31
    },
    "Band Reviews": [
        "\nIt would seem that A.L.N. has been quite busy this year. We had the (somewhat disappointing) Wit’s End EP back in February, and now he has collaborated with none other than Thou for their most recent project, and the topic of this review, Myopia. The two bands got together and dedicated a set to it at Roadburn Festival, and ever since I caught wind of it I’ve been waiting for a proper release. And as is tradition by this point, I’m fashionably late to covering it, in part due to having to take my time and appreciate its excellence. Turns out it’s an effortless blend of both bands’ styles, as well as one of this year’s finest releases so far.\n\nMusically, the two groups complement each other nicely, adding something extra to each other’s sound, while at the same time finding some common points which they build upon. Using feedback-laced drones as a base, Mizmor and Thou add their own flavour to the mix, be it through intense tremolo riffing such as the one that inaugurates the album on “Perfect”, or sludgy grooves like those on “Drover of Man” and “Indignance”. The two parties add another dimension to each other’s sound, leading to a very complete and well-rounded work in which both bands have managed to leave their own signature. It honestly makes me wonder why they didn’t collaborate sooner.\n\nThe main selling point of this release though is doom, the type that smothers the listener with its crushing weight on all levels. Although this release is exceptionally heavy, the effect is not achieved solely through low tunings and sustained chords, but also the excellent use of melody throughout. Not in a sappy way mind you, every note carries a mournful tone, the potency of which is carried by the stark minimalism that permeates Myopia. There’s nothing in the way of bombast, things are kept simple and are put together in a very purposeful manner, with every composition flowing naturally from one point to the next. The aforementioned tremolo riffs are also quite simple, yet effective in their use and tone, releasing the tension that’s being built up over prolonged periods of time. Even the acoustic sections that appear on occasion don’t feel redundant, their hollow nature only adding to the atmosphere presented here. Special mention goes out to the riff that shows up at 6:50 on “The Root”, that one is just pure beauty and I can’t get enough of it.\n\nThe production is also perfect, though truth be told that’s to be expected from Mizmor and Thou at this point, seeing as they’ve become masters of obtaining an organic, yet powerful sound. The guitars’ crushing and sludge-laden tone is front and centre here, casting a veil of doom over the proceedings. Despite that though, its massive weight doesn’t swallow the other instruments, which have their own place in the mix . The bass in particular is something I appreciated, despite it just adding more weight to the riffs with its fuzzy rumble. As for the drums, they’ve got a good amount of punch to them, the cymbals specifically adding a lot of flavour as they cut through the mix, without becoming too abrasive.\n\nAs for the vocal performances, they’re also on top form. A.L.N. does his usual mixture of howls and screams, having regained the energy and power that was seemingly absent from Wit’s End, while Bryan Funck’s raspy screams provide a more intense and in-your-face presence. Both of them appear in equal measure throughout the album, spewing lyrics that tackle both personal and worldly issues, ranging from bearing memories of the past and improving on oneself, to questioning those who reign above you and wanting to cure the world of evil. These topics are especially relevant in today’s turbulent times, and seeing artists shine a light on them is always a pleasant sight, especially when it’s done tastefully.\n\nI really don’t have much to complain about with Myopia really. Sure, I’d have liked for there to be a few more tremolo riffs to further satisfy my (rather short) attention span, but I can’t help but turn a blind eye to it when the rest of the music is as good as it is. This project marks a very welcome change of pace from Mizmor’s last project, and serves as another addition to Thou’s lengthy list of successful collaborations. Any fans of either group are probably already all over this, rightfully so might I add, and anyone who loves extreme doom metal definitely owes it to themselves to check this out. \n\nHighlights: Perfect, Drover of Man, Myopia, The Root\n",
        "\nRoadburn Festival in the Netherlands is where Emma Ruth Rundle and Thou first teamed up. To be quite honest, their styles aren't that disparate and a full length collaborative album was kinda the next logical step. Emma Ruth Rundle's signature has been to brood over considerable seas of dreamy yet dark stacked guitar melodies....and Thou? Well, Thou is Thou. They are pristine sludge at its finest. ERR's last album \"On Dark Horses\" did see her explore doomier territory albeit in the ultra-alterna sense like if Smashing Pumpkins' dreamier qualities jammed with a less prickly Neurosis. I have never cared much for Thou but I concede they are wonderfully intense and primal - a thoroughly functional band. \"May Our Chambers Be Full\" bristles with so much competent songwriting and even when some of the material doesn't sound fully realized, at its core, there's a knack for knowing how to utilize the best of the artists' strengths that's undeniable.\n\nThere's a distinctive lack of sludgy torment-filled riffs that Thou dabbled in way back when and in their place we get a ton of darkly lush passages that cushion the priestly vibe of Emma consistently. Andy Gibbs is the main songwriter and his desolate grooves tower over and circle the bulk of the songs with Tyler Coburn's strong drumming elevating everything. There's also a lack of catchiness to this outing that could be detrimental with just how easily this earns its fans. The songs seem to mean something deep and intangible given how much emphasis the vocal layering is given. What is meant is never really told though and lyrically there's an over-usage of burdensome imagery and non-sequiturs. Bryan Funck's hateful rasps sometimes gel well with Emma's more anguished stances and sometimes they don't. When they work as on the opener \"Killing Floor\" and closer \"The Valley\", it is majestic.\n\n\"Monolith\" opens with a dizzying riff pattern that is not helped at all by Tyler's drumming. The vocal partnering of KC Stafford and Funck is also rather jarring but things get better when the riff dips out and lets the song breathe. Thou craft lovely ambient and droney tones that fully complement (and compliment) their riffing. \"Out of Existence\" is the heart of the album with Funck's scope of hatefulness almost entirely expressed over a shifting riff that seems to pass through only the most wretched eras of time. Emma's priestly pronouncements bring forth the doomiest lines of 2020; \"The Song of All Things Burning. This one is predetermined. This one will find no favor. This one is weight unburdened, dragging down our lives. This one is predetermined we all know just what comes next.\"\n\nAt 36 minutes, this is a concise and rather tight work. Some songs like \"Magickal Cost\" and \"The Valley\" stick better landings because of their folkier attitude and they play well into ERR's pocket of sound and influences without sacrificing the bleak harshness Thou is known and loved for. A successful endeavor all in all but it doesn't seem to offer much need for a follow up and its brazen lack of catchiness may turn off some.\n",
        "\nI think it's safe to say that Steve Albini is a fucking OG of the independent music scene. His unique production techniques (used most famously on bands like The Pixies and Nirvana) have had a profound impact on alternative rock, post-hardcore and, yes, indie. However, the type of indie he is associated is very much more something that developed organically out of the more down-to-earth punk and rock scenes, and not the type of ultimate-commodification-of-rock-music indie you might see on an Apple commercial. He also leads the incredible punk/noise rock/post-hardcore/whatever-the-fuck-else-you-want-to-call-them band Shellac. The incredible slinking bass of noise rock/punk song \"Wingwalker\" and the downright hilarious nature of \"A Prayer to God\" makes them pretty good bets to cover. \n\nThou play it surprisingly close to the original. They sound more like a grimy 90s rock band that came out of the punk scene than a sludge group. And that's ok - they do a really good job with it. It may not be that far removed from the original but it's very enjoyable to listen to. Just like the original, that awesome bass line proves to be the standout of the song. The split is rounded out with Great Falls' version of \"A Prayer to God.\" This one does not play it close to the hardcore-rock of the original. It's a big filthy sludge track inflected with near-constant bursts of feedback. It comes off like a very rough Weedeater demo or something with its groggy slow and heavy, but also accessible and bouncy, groggy sludge riffs. The harsh vocals are pretty good, and it's instrumentally it's well performed. The humour of the original song is not completely lost. However, Great Falls find themselves overshadowed by Thou. \n\nSteve Albini actually does have a connection to the sludge scene - he has recorded every Neurosis album since 1999's Times of Grace. I'm not too surprised there's a sludge tribute to his band. A sludge mainstay and another sludge group I've admittedly never heard of do a good job at paying homage to a legend. Thou's cover might be cut too close to the original, and Great Falls not quite as memorable, but it's a good effort. (P.S. please bring back your cooking blog, Steve. It was actually pretty awesome, but seems to have been offline for a while.)\n",
        "\nWhile to call them a crapshoot would be the understatement of the century, splits can be a really cool way to find new bands. I came for Thou and left utterly disappointed on that front. However, Black September was a neat little surprise and I'm glad I checked this out just for them. They mix a plethora of heavy styles in a cohesive way that feels totally natural. \"Smoke Pigs\" is a top candidate for worst Thou song I've ever heard, but what can you do? \n\nBlack September put in a really good effort for \"Under the Rising.\" The song starts with a take on blackened hardcore that is surprising atmospheric - I can't help but envision smoldering embers in my mind's eye. Most of the blackened hardcore I've heard has been violent and raw, making this an enjoyable change of pace. While still leaning fairly hard on hardcore, later in the song they let their sludge influence fly and even throw in an atmospheric passage for good measure. It's a cool song, and I'll definitely be checking out more of Black September. \n\nThou on the underhand - what the fuck? They're one of my favourite sludge bands and I get that this is an earlier recording of theirs, but \"Smoke Pigs\" (such a clever song title, guys...) just flat out kind of sucks. They put forth a very muddy and grime-speckled stoner-sludge song that falls somewhere in between Eyehategod and Bongzilla. The production is kind of shit, the riffs and songwriting are whatever, and the whole thing kind of feels like a mess - and not in the good way that can often apply to raw sludge. The wildly tumbling toms that emerge later in the song might have sounded cool if not for the absolute shit drum tone. I know it might be a bit silly to rag on the lyrics for a song like this - but god damn guys, put in a bit of effort. The lyrics are essentially one of those angry ACAB Facebook rants where the person is typing faster than they can think. Police brutality makes me angry too, but if you're going to focus on political messages in your song at least put a bit of effort into it. These don't even feel like lyrics, it's just angrily reciting your political opinion. I feel like if you have a political message in your song and you just beat the listener over the head with it with no attention to quality of lyrics, no cleverness and no attempt to weave it into something more than an angry 3am internet rant, you have kind of failed as an artist. \n\nSplits are a real mixed bag, and Thrive & Decay is exemplary of this. I love you Thou, but this \"Smoke Pigs\" wasn't even worth releasing and I feel like just crapping out such a dud is unfair to Black September who have clearly put a lot of effort to craft a song that is both atmospheric and crushing. This wasn't a complete waste of time, though - I discovered a new band that I'm eager to check out more of.\n",
        "\nThou have an impossibly vast discography outside of their full lengths, and while generally at least solid, results still vary. Their trio of EPs leading up to Magus were wonderful explorations of different facets of their sound. Something like this, however enjoyable it may be when its on, doesn't have an abundance of replay value. This is a serviceable showcase of two sludge bands doing what they do, but it's a world away from Thou's more memorable work (for Haarp I can't really expound on where it fits into their overall discography, because this is the first time I've ever heard them). \n\nThou goes for the slow burn here, and it just doesn't pan out like it does on a lot of their stronger material. The wandering burnt-out wastelands vibe is really cool, but that's most of what the song has going for it. The riffs are incredibly slow (even by Thou standards), and I feel like they wouldn't amount to much of all if stripped of the massive simmering production. That isn't to \"Black Steel in the Hour of Chaos\" is a bad track, it just feels a bit style over substance. I don't remember any of the riffs and nothing sticks out to me about the songwriting once I turn it off. \n\nHaarp gives us some burly sludge that skews hard towards hardcore. I'm not sure I'll come back to this (although I may check out one of their albums at some point), I did enjoy this more than Thou's side. They do a great job at twisting simple riffs and giving them an off-kilter feel. The riff that starts just after the first minute feels like blindly stumbling down a never-ending staircase. The brawny barks are powerful and the drummer sounds like he's having a lot of fun and definitely knows his way around a fill or two. \n\nThis is one of those side-discography things where it's fun to jam once, but I doubt I'd ever come back to. It seems like this Thou song was thrown in because it couldn't make the cut on their bigger releases. While not jaw-dropping or anything, Haarp was genuinely really interesting and I reckon I'll give one of their albums a go one of these days. You can skip this one, but it's serviceable enough to be decent while its on.\n",
        "\nWhat do I look for in sludge metal? As Crowbar most famously put it, I’m curious about finding “the brown note”, which was Kirk Windstein’s way of saying that he would like to locate the single heaviest, most punishing guitar tone that would make punters at Crowbar gigs lose control of their bowels, thus allowing the band to seize a merchandising opportunity to sell branded diapers. As a result, I’m actually just as interested in the weight and tone of the sludge that I listen to as the compositions. This places me in kind of a dilemma regarding Thou’s most recent full-length Magus, because some of the songs here are deliberately dissonant and misshapen, while others almost locate that famous sonic boom. Lucky I’m listening with headphones and not on the stereo, or this could get embarrassing.\n\nYou’d better believe that 75 minutes in this style seems really fucking long, sort of like being sat on by an obese hag during night terrors that last an entire winter of hibernation. Magus becomes a bit unwieldy at times, though I have to recognize that the blending of pure heaviness, interesting songwriting techniques, and a few experiments makes for a good mix. ‘Inward’ welcomes listeners with most of those elements during its 10 minute runtime, crunching down on riffs and exhibiting the sick blackened screams of Bryan Funck’s vocals, which were my main inspiration in labelling Thou a hag a few lines ago. As the album lurches onwards, however, the band’s preoccupation with melody grows more and more evident, ‘Transcending Dualities’ utilizing both guitarists to counter fat chords with haunting backing, mostly in the form of snatches of clean playing or ringing motifs. They don’t usually play leads, though both 6-stringers draw the listener’s attention on most songs.\n\nThat formula sounds intriguing, yet I can’t advocate any band playing five 9+ minute songs at such an even tempo as Thou do. The drumming itself isn’t bad, Josh Nee scattering fills into the simpler sections and adding more intense beats when Thou occasionally pick up into blackened style, but try the following experiment and you’ll see what the problem is. Skip ahead to any section of the album and count the rhythm: every time I promise that you’ll be within about 15bpm of the section you just left. With a more hypnotic style, Magus might get away with a lack of change-ups in pace: with deliberately ugly vocals and plenty of counterflowing second guitar, it risks losing impact. Of course, variety is available through some clean female vocals during ‘In the Kingdom of Meaning’ and the squalling, swampy fuzz of ‘Greater Invocation of Disgust’, I just feel that more was necessary to attempt such an involved album.\n\nFor fans of nasty sludge like Cough and Eyehategod, more punishment might be a good thing, so the encompassing filth of Magus could seem endlessly appealing. For brown note devotees like me, Thou don’t do quite enough with riffing to attend to my prepped diaper, only really satisfying at length on the opener and rather more booming ‘Elimination Rhetoric’, while the songwriting generally proves nuanced but overdone, owing largely to excessive song lengths and monotonous pacing. Using interludes like ‘My Brother Caliban’ to bridge longer compositions was also unhelpful, seeing as it just turns the long songs into an even longer piece without any noticeable breaks for relief. Magus is by no means a poor effort of extreme sludge, though it’s not really for me.\n",
        "\nThou and Kowloon Walled City (best band name ever?) doing a split together makes all the sense in the world. They're two of modern sludge's best acts after all. Sludge holds on to a rock connection that much of metal has shed long ago, and what these sludge bros choose to cover actually makes all the sense in the world. I've always felt like sludge and grunge were weird step-brother genres or something. Both owe a lot to the Melvins, and are dudes who got really into Black Flag and Black Sabbath taking it in either a more rock or a more metal direction. Anyway, both bands do a stellar job at paying homage to the rock they grew up on. \n\nLow is a band I used to fuck with a bit back in the day, but kind of dropped off listening to them for whatever reason. I recently revisited I Could Live In Hope and was left completely floored. Talk about just about a perfect album. The interplay between male and female vocals is wonderfully pulled off, there's a subtle genius to their songwriting skills and as far as tones and production it really is the top of the line. Although Things We Lost in the Fire is an album I still need to revisit, \"July\" is a really good ballad that manages to be simultaneously dour and uplifting. Kowloon Walled City brings in a guest female vocalist for the cover, and she does a hella good job with it. The band makes the song heavier, but it doesn't really break the barrier into becoming a metal song. It's a nice middle ground between the band and the band they're covering. I kind of wish they'd also use some hoarser male vocals in the song, which would be a cool take on the interplay between the vocals in the original song. \n\nSoundgarden's grunge anthem \"4th of July\" is one that needs no introduction. It's also one that makes perfect sense for a sludge band to cover. The '90s were truly a strange time for mainstream rock music - it's pretty crazy in hindsight that a band this heavy with such a muddy sound was able to skyrocket to commercial heights. Thou keep their cover closer to the original, they just turn up chunkiness and make it a bit sludgier. Honestly, the original Soundgarden song is about as close to sludge as rock gets, so Thou are as happy as pigs in shit here. The Chris Cornell impression here is great, and I kind of wish they just left out the harsh vocals. The screams just come off as kind of silly here. Oh well, they don't ruin it and it's still a cool cover. \n\nFor whatever reason these two sludge heavyweights came together to do a July-themed split, I'm happy I did because they put a really cool spin on two good rock bands. The heavier, weirder, more atmospheric etc. rock of the 90s and early 2000s have had a huge influence on sludge metal, and this is a super fun homage to those influences.\n",
        "\nMagus caps off Thou’s hyper-prolific summer of 2018 in stunning fashion. Leading up to their latest full length, Thou dropped 3 EPs over 3 months. Those EPs largely felt like Thou experimenting with styles that are usually relegated to being undertones in their sound. Rhea Silva felt like Thou doing grunge and atmospheric rock. Inconsolable felt like Thou goes acoustic. Magus simply feels like Thou doing Thou. It ends up being not only one of the best metal albums of 2018, but one of modern sludge’s finest hours. \n\nMagus is surprisingly concise for an album with such a sprawling length, and for a band that’s known to have a penchant for bells and whistles. There’s the odd interlude for breathing room, but Magus is largely a behemoth of lumbering sludge and little else. The band has talked about their mutual love for the grunge music they grew up on, and while this isn’t blatantly obvious in their style, it makes a lot of sense in their song writing. Despite the length of some of their songs, they trim a lot of fat and only keep in what makes sense in the flow of the song. It makes a lot of sense that rock music is informing their song writing. The production is heavy enough to crush a city block, and honestly the best Thou have ever had. It’s heavy enough for the riffs to have no problem bludgeoning you into oblivion, but well produced enough to let subtleties like an reverb-laden clean arpeggio worming its way under the riff to slowly get its hooks in you. \n\nThe slow burning melodies are such an integral part of this album’s success. They produce an excellent counterpoint to the punishing weight of the nastier sludge riffs. The melodies function in a very subtle way; they unfold slowly and possess a bittersweet cathartic feeling. There’s a nice nod to black metal in “Transcending Dualities.” Thou actually thought about giving this album a heavy infusion of black metal, and while they didn’t go that direction, aesthetically a lot of this fits in very well with that style. The vocals are a forceful, filthy rasp that could work just as well on a black metal record. They add a dimension of desperation and amplify Magus’s miserable vibes. He breaks out some subtle clean vocals in “In the Kingdom of Meaning”, which provide some nice variation to a relatively samey record. Speaking of clean vocals, Emily McWilliam’s eerie vocals in “Divine Will” are a super cool touch. As for the rhythm section, they put in a really good effort. The drumming does really well – the guy knows how to keep a slower pace interesting and really knows his way around a war-like tom-beat. There’s not much in terms of standout bass parts, but the dude really helps keep the album sounding beefy. \n\nWhile Heathen was more about visceral themes and the will to survive in the natural world, Magus turns the focus inward and focuses on cerebral themes and the will to survive your inner world (while Summit was more a middle ground between the two). Funck (love that last name lol) has said a lot of this has to do with self-criticism. I have to admit, a lot of the lyrics are very opaque and obscure, and I didn’t always connect with them to the point that I thought I would when I was just picking out key phrases. Although I reckon I’d agree with Thou on a fair amount of political issues, I can’t say I’m much of a fan of the running an id pol essay through a thesaurus approach some of these songs take (seems to be something really popular with politically minded metal bands lately, and at least it’s better than the yelling at you how to think approach of the average crust band). I guess my minor disappointment is due to thinking the lyrics would focus more on the relatable everyday struggle sort of stuff that works so well with this kind of sludge sound. When Funck breaks down and screams a lyric about inner turmoil like “behind the mask, another mask” and “I can’t help myself, don’t talk to me” it easily becomes an album highlight (this sort of thing reminds me of Charlie Fell repeatedly screaming “hoisting myself out of myself” in Cobalt’s “King Rust”). \n\nMagus is easily one of Thou’s finest moments, and one of the best sludge albums of the last ten years. In a lot of ways, it is a continuation of Heathen’s sound, but more immediate and with less bells and whistles. The fact that they managed to keep such a long and samey album engaging is a true testament to their skills in the song writing department and their ability to craft gargantuan riffs. Magus is a must hear for anyone who’s even mildly interested in sludge metal.\n",
        "\nThou's Magus proved to be one of my favourite albums of 2018, and I firmly believe that it's one of moderns sludge's best efforts. Besides Magus, I am mostly familiar with Thou's full lengths. Most of their dauntingly massive discography is not composed of full albums, and it's hard to know where to start when delving deeper into their catalogue. I just ended up choosing an older EP at random and here we are. \n\nThe style on display isn't very surprising. This is to-the-point nasty lumbering sludge and there really isn't much in the way of stylistic divergence. The two songs on display are very similar and end up bleeding into each other. To Carry A Stone brings up Old World imagery of dark woods and brimstone. While decidedly sludge, Thou never really puts their hardcore influences on full display. The closest we get is a faster riff (in the context of this release - it's still pretty goddamn slow) at the start of \"The Road of Many Names.\" Most of the riffs are comprised of thick, lumbering power chords. This is a decidedly miserable release, and Thou don't provide any room for light to shine through. \n\nWhile stylistically this sounds like the Thou I know and love, it's the substance that's the big difference. This sludge is serviceable, and well above average. But it doesn't stack up to Thou's bigger works in terms of songwriting and riffs. It may be a lot narrower in scope than the towering Magus or the classic Summit, and that's fine. This is a perfectly good sludge EP, bolstered by absolutely massive production. It may not be particularly noteworthy in Thou's discography, but it really scratches that miserable sludge itch.\n",
        "\nA way to quickly repel my interest is to start talking about a band that classifies themselves as drone/sludge metal, as I seldom find anything in that genre that remotely interests me. But man oh man, was I ever surprised after listening to Thou’s EP titled Rhea Sylvia. Perhaps the shorter dose of this is what makes it easily digestible, and being in the right mood definitely helps it out. But this is actually pleasant and a little bit soothing at times.\n\nYou can get a bit of a blackened feel just from the vocals alone and how grainy the overall output is. But seeing that this is based around drawn-out riffs that make Pentagram look like speed metal, it’s pretty far removed. The longest track “Unfortunate Times” grabs you by the ear and fills your head with proverbial sand, feeling like you’re stuck in a super dry trip. “Restless River” is also stacked a mile high in layers and achieves exactly this in a shorter amount of time. You can pick up cleaner licks underneath the thick atmosphere.\n\nAmazingly, clean vocals come in on “Deepest Sun,” which is where most of the soothing aspects are buried. But even beyond that, the bassy presence and calm flow of everything gives a settled feeling. Not sure if Thou were aiming for that, but it happened regardless. Obviously, there isn’t gonna be much in the realm of variation, so it’s hard to pick out other standout moments besides “Deepest Sun.” So I recommend hearing it as a whole.\n\nIf Rhea Sylvia were any longer (as I’m sure the full-lengths are), I probably wouldn’t be able to stick around the whole time. You also need to be in the right setting and not aiming your focus on other things, since this will tug at your attention. But as someone who usually dislikes anything drone-related, I recommend giving it a spin. Perhaps this is a good gateway release for the style.\n\nOriginally written for Indy Metal Vault\n",
        "\n2018 is a good year to be a Thou fan. They dropped three different EPs over the course of the summer and then for good measure threw in the best sludge metal album of the year. One might think such a prolific output in such a short time would ultimately mean the EPs were littered with outtakes and b-rate material, but Thou astonishingly maintains quality throughout all of them. Rhea Sylvia is a dreary and atmospheric EP. While it doesn’t bludgeon to the same degree as their new album Magus, it’s great at what it does.\n\nThou has talked about this being their Alice in Chains EP and I sort of see it. While most songs don’t actually sound all that much like Alice in Chains, a lot of it does have that bummed out rainy day vibe to it. Most of the EP is ultimately really gloomy atmospheric sludge. There’s some subtle post-rock influence and subdued psychedelic influences in the mix that help give the softer parts some character. The riffs are drawn out and cathartic. There’s some really awesome deep clean vocals in “The Only Law”, but the harsh vocals are definitely what really help set these apart from the next atmo sludge band. They have just as much to do with black metal as sludge, being a slow tortured rasp where you can hear the pain of existence in every syllable. \n\n“Deepest Sun” is by far the standout song of the record and is where the Alice and Chains references are really warranted. It totally sounds like the more metal-leaning bands associated with the grunge explosion, with Soundgarden also coming to mine. The vocal performance is excellently executed and falls somewhere between the two aforementioned bands. It’s really cool how they can take on a rock song and wipe the floor with most actual rock bands. I also love how they take a song that you could totally sneak on an alternative rock station and add a harsh vocal section and somehow have that feel totally natural. Reminds me of “Venus Blue” by Acid Bath in that respect. \n\nThe Crowbar cover is the other song that diverges from the pack here. As far as I’m concerned “The Lasting Dose” is the best traditional sludge song and Sonic Excess in its Purest Form is the best traditional sludge album. A sludge band isn’t going to be able to come in and out-Crowbar Crowbar here, but that doesn’t mean a cover isn’t worth trying. Primitive Man covered “Suffering Brings Wisdom” and it turned out great. “The Lasting Dose” aches with bittersweet melody and is such a perfect lament for the struggles of everyday existence. Thou slows it down even further and aided by a great vocal performance, the emotional impact is still there. \n\nRhea Sylvia is largely songs Matt has written for acoustic guitar fleshed out by Thou, and this really shows in the song writing. The songs feel surprisingly anchored for atmospheric sludge. With the wildcard of the Alice in Chains type song and a Crowbar cover to boot, Magus certainly isn’t the only Thou release worth hearing from 2018.\n",
        "\nInconsolable is an extremely unlikely album to have been written by Thou, generally a raucous and noisy sludge metal band from Louisiana. But, despite the bizarre nature of this release within their discography, they have pulled it off with tremendous skill and nuance. The record is completely devoid of what make Thou Thou, and I like it all the more for it.\n\nFor a band whose music is almost wholly bereft of melody, they pull that off incredibly well. Each and every track has a melodic hook that evokes such emotion, ranging from tranquility and calm on the opener \"The Unspeakable Oath\" to unease and uncertainty on a track like \"Into the Scourge Pit.\" Additionally, from what I can tell, each track has a guest vocalist and they all do an impressive job. One of my absolute favorite vocal moments on the album is the chorus of \"The Hammer.\" That part gets me every single time.\n\nThe musicianship and overall songwriting on this album is also not to be overlooked. The instrumentals behind the beautiful vocals are honestly sometimes even catchier than the vocals themselves. Production is top-notch and the guitar takes center stage, with only sparse use of drums and other instruments.\n\nOverall, Thou have piqued my interest for the upcoming full-length, Magus (which I've had pre-ordered since the day I knew of its existence). Apparently, that album is going to be a culmination of the three EPs they've released in the months prior. Even if that album sucks (which it won't), this EP is still probably enough to tide me over until they release something else that is at least as equally as stunning as this one is.\n",
        "\nAccording to their Bandcamp, this is the first in a series of EPs leading up to their next full length, Magus. And after first listen, it makes sense. This EP reads as the band working through a series of production experiments and techniques. It is notable as much for what it isn’t than what it is. Here, Thou’s undercurrent of post-rock melodicism is vaporized to reveal a sound that is entirely raw and very, very angry.\n\nThe album’s tracklist follows an ABAB pattern, with tracks alternating one after another between tense, atmospheric experiments and tight, classic Thou-style metal. Each track leads into the next, so the album plays out as a single piece. \n\nThe musical pieces loop and drone single ideas into structureless movements of anxiety. The most notable is Birthright, which blurs the line between guitar buzz and a choir sustaining one shaky note. The result is an uncanny blend of beauty and existential dread, like a composition by Georgi Ligeti. \n\nThe tracks are also unified by the style of production. Demo-chic drums smack up front in the mix throughout like your roommate rehearsing down the hall. And in their effort to stay competitive in the guitar tone arms race, Thou here process their axes thoroughly with harsh noise. This recalls the synthetic vitriol of their collaborators The Body. On vocal tracks, Bryan Funck does not stray from his signature proselytizing lyrical delivery, and his voice is given the same intimidating treatment as the guitars. On Premonition, Funck channels Khanate-era Alan Durbin with an accusatory snarl, and on the stunning album closer Malignant Horror, he repeatedly screams a despairing mantra, his voice so thick with noise that it blends in with the nearly industrial onslaught of the band.\n\nThe three scheduled EPs (this along with the upcoming Inconsolable, which will feature acoustic performances, and Rhea Sylvia, which will explore grunge) serve to build a buzz leading up to the next album. For Thou fans, the most exciting aspect of this recording will be the decidedly harsh tone. On Thou’s Obama-era album, Heathen, Funck led imaginary red armies with lines like “We are the stone that starts the avalanche.” Likewise, they infused a sense of wonder into their music throughout with aching orchestral passages. But here, Thou recedes from the triumphal procession for a sound that looks inward, hammering out ten terse tracks that are focused in their claustrophobia. It will be interesting to see if and how many of these ideas make their way into Magus, or if this EP served as a singular outlet for this aggressive sound.\n",
        "\nThe recent explosion of sludgy/blackened/death/drone/doom bands has been quite baffling, especially for a sound that seems to be inherently limiting due to the specifics of the genre. But perhaps this limitation isn't all a bad thing. Much like the burgeoning black metal scene in the early 90s, this new-but-kinda-self-referential genre seems to allow the best at the game to rise to prominence and force newcomers to experiment only minimally with the formula; the results based more on riffs and noise rather than trying to find new sounds altogether. This would be bands like Lord Mantis or Indian, who seamlessly blend crushing sludge riffs with very hash noise sections, giving the albums a hyperviolent feel to it, even if the mechanics are superficial. But, a band like Thou manages to be violent and intense without blurry noise passages and needless feedback loops. \n\nNope, what you have here is simple, straightforward, sludge. Each song found on Oakland Singles more or less sounds like the song before it, with little variation in between. Indeed, much like the late Pete Steele's manly parts, what lies betwixt Thou's legwork is meaty, heavy, long and goes deep. Each song pummels you with each guitar stroke, leaving one's musical cervix a bit worse for wear after the encounter. Songs like \"Rats and Mice and Swarms of Lice\", and \"Smoke Pigs\" (my favorite Thou song of all time) blend hardcore and stoner riffing with excellent pacing and variation to leave even the most promiscuous of doom listeners sore in all the right places. \n\nEven more so like Mr. Steele's wobbly bits, one is pleasantly surprised with the curves one finds. \"Their Hooves Carve Craters in the Earth\" starts off with a melodic moment more reminiscent of gothic metal than sludge before quickly moving into a discordant nightmare of a song, lurching slowly forward, resembling its title, stomping and grinding bones to dust in an almost atonal wake, resembling the angry baby of post-hardcore and death metal. Then there's \"Here I stand Head in Hand\" which intertwines the closest thing to a \"clean guitar\" sound that Thou has (a foreshadowing on the moments on Heathen), before hurling mammoth doom/death riffs towards the listener in a barrage of very memorable riffs that are all bordering on the melodic doom a la Esoteric or Ahab. \n\nCouple that curve with the thickness, and you've got an album that hits all the right places. Of course, with anything of this nature, there's bound to be those who think it's too much, and will come away a groaning rather than moaning, but for the seasoned, it's exactly the right length. Honestly, these singles are probably Thou at its tightest, most compact - without the context and grand concepts of their albums. If you want to know what this genre was doing before the giant boom of the last few years, this is an excellent place to start - very solid indeed.\n",
        "\nHumanity as a whole seems to be asleep at the wheel, hurdling toward annihilation on a hideously destructive path. Thou’s latest LP ‘Heathen‘ is a cry to wake up. This is a record nourished by pain and disgust, yet that energy is alchemically transformed into something elegant and immensely potent. Despite the fact that Thou is invariably releasing new material, creative integrity is never sacrificed. They are ever-evolving and with ‘Heathen‘, have actualized their most expansive and well balanced album to date. The dark and the light are embraced completely and are merged purely, resulting in a wondrous composition and listening experience.\n\nThe first and longest song on the album ‘Free Will’ serves as a definitive initiation into ‘Heathen‘. A microcosm of the macrocosm foreshadowed within. Beginning with a gradual ascension, elevating into an orchestrated maelstrom, ceasing decent until all is dismantled in its wake. The duration of the record progresses in a similar pattern. With very natural and earthly recording, riffs are mountainous and the current of melody flows deeply. Often, serenity precedes stunning devastation. Pastoral interludes create an enchanting ebb and flow between the unfathomably heavy passages.\n\nBrian Funck’s harrowing rasp delivers the most compelling aspect of Heathen, the lyrics. Those who encompass an inherent impulse to seek truth and wisdom will find this album resonant, as will those who are dissatisfied with the current paradigm. The motifs are rooted in the quest for existential fulfillment. They touch upon our relationship with nature, the illusion of time, and the phenomenon of inhabiting a vessel in the material realm. A profound realization of how little is genuinely known is expressed and a proclamation is given renouncing all deception, fabrication and fallacy from the past. A new path must be forged avoiding repetition of previous blunders.\n\nThis is an album done properly, by a band that is in it exclusively for the correct reasons. Thou’s prodigious DIY ethic, advocacy of equality and rigorous touring schedule exemplify their altruistic nature. This is doom and sludge in its most ardent form. Impressively, Heathen manages to attain being both a timeless record and record that precisely illustrates the pandemonium of being here and now.\n\nScribed by: Mick Schrier\n\nhttp://www.thesleepingshaman.com/reviews/album-reviews/t/thou-heathen-cd-lp-2014/\n",
        "\nHell and Thou, two of the best sludge bands today, present listeners with a solid offering of scathing sludge/doom metal. While neither band is at their peak on this seven inch, the material from each band is still quite excellent. Co-released by Gilead Media and Pesanta Urfolk for the Gilead Media Festival on white vinyl with all-white packaging and embossed lettering, the artwork is striking and it is clear that the labels put a lot of effort into creating a high-quality package.\n\nUp first is Hell’s track, “Sheol,” which follows in the vein of the material on their second full-length by incorporating both harsh sludge riffs and clean guitar interludes. The vocals are delivered in a harsh scream piercing through the wall of distortion created by the guitar and bass as they pummel the listener with incredibly heavy and low sludge/doom riffs. One thing that stands out about the production on this song is how the bass is discernable from the guitar, and doesn’t just blend into the distortion. The plucking of each bass note is audible and serves to create another texture in the riffs, adding a layer of heaviness. Roughly midway through the song it changes direction, transitioning into a clean and melodic guitar line. However, there is nothing nice about this clean guitar, its eerie melodies keep the suffocating atmosphere created by the heavier parts of the song before transitioning back into the style of sludge riffing presented at the beginning of the song. This track is crushing and dark, which is what any good sludge song needs to be, and the use of clean guitars to change up the style while still retaining the atmosphere built up as the track progresses.\n\nThe second half of this split is Thou’s “Ordinary People,” which, while being the weaker track of the split, is by no means a bad song. “Ordinary People” is a more straightforward song that clearly falls into Thou’s style of droney sludge, and while I am a fan of this style, the reason that “Ordinary People” falls short of “Sheol” is that it simply isn’t as interesting. Thou’s riffs are still high quality, and the transitions between more mid-tempo, chugging riffs and slower, more droney riffs works well, but overall, the atmosphere they create is not as strong as that Hell created on the first side. The vocals are the usual howls utilized by Thou, and are well-preformed. However, this song just falls flat for me overall. There’s nothing specifically wrong with it, it is a solid song, but it’s just not as interesting when compared with Hell’s material and Thou’s other material.\n\nOverall this split is definitely worth a listen, especially for Hell’s side. And if you are a fan of Thou, their side is worth a listen too, but it is not their strongest material. If you are a fan of sludge/doom, you will probably enjoy this, as it features two excellent artists and solid material from both of them.\n",
        "\nThis split is one of my favorite metal releases ever. Thou and Leech unleash monstrous material each, together making this split a monumental release. While Thou have had a very prolific career so far and have put out some stunning doom/sludge, Leech has flown under the radar, but their brand of atmospheric black metal is gut-wrenching and emotional, and is some of the most powerful music I’ve ever heard.\n\nThou’s side of this split is devastating, from the quiet intro of acoustic guitars, to the scathing doom that comprises the bulk of their compositions, to the melancholic piano/feedback outro. The guitars on this side of the record are immense, unleashing massive sludge riffs. The guitar tone is super thick and sludgy while still having enough definition to be absolutely crushing. “Rats And Mice And Swarms Of Lice” is a perfect example of their guitar sound, the waves of immense riffs roll over you repeatedly, crushing you into the ground. The screamed vocals are the perfect harsh compliment of such riffing, and add to the overall heaviness of the music. The outro, “The Defeatist’s Lament” is a beautiful way to end such a harsh side of music, with fuzzed-out guitar feedback, female clean vocals, and a somber piano line that serves as a perfect finish to Thou’s side of this split.\n\nLeech’s side of the split brings forth one beast of a track, clocking in at 20 minutes in length, and consisting of powerful atmospheric black metal of the highest caliber. Leech’s guitar riffs are simple and melodic, but very well composed, giving off anything from a melancholic to an almost epic feel. One thing that really separates Leech from a lot of black metal bands is the bass, which is simply amazing during parts of this song. The bass does not always tremolo pick and follow the guitar, but at times plays very melodic bass lines that add a great foundation for the guitar work. The vocals employed by Leech are completely indecipherable screams that add greatly to the atmosphere of this song. All in all, this is a stunning track from an overlooked band.\n\nThis split is a truly awesome piece of music, from two incredibly talented bands, and it’s a shame that this release is the last we’ve heard from Leech whose demos and splits have all been great release, but who deserve a full-length album. We Pass Like Night, From Land to Land comes with my highest recommendation.\n",
        "\nAs hard working and prolific as a band can by, not many stand up close the the skill and over-workedness of Thou, who in their mere 6 years of being a band have put out 24 releases including EP's/Singles/Compilations/Splits and two full-lengths each with no less than 4 songs tracking in at over 10+ minutes long. All of that aside, I lead you into a newer release by the band pleasantly titled 'The Archer and The Owle', an almost fairy tale likened name that brings to mind thoughts of olden times when things were spelled with extra 'E's on the end to make them old timey and suche. \n\n\nDon't be fooled by the whistfulness of the title, this album carries a heavy emotional burden not only on the one writing out the lyrics, but the one listening to them pass ear to ear. Track number 1, 'Voices In The Wilderness' opens with a happy, almost content guitar that no doubt fools a first time listener into the true dispairity in the songs themselves.\n\n\"The death throes of daylight set the sky ablaze.\nSilent pyres are heaped with the bodies of the meek.\"\n\nThe opening lines of an otherwise joyful sounding EP, soon turn your thoughts to its black and churning background, written with hate, sorrow and the revenge towards the societal wrongdoings of the modern world, although cliche still an evergrowingly sad truthful way of the world. A cover is the second track, 'Something In The Way' by Nirvana, covered in the style Thou know how to rip the best; sludgey sorrowful. Not like said track wasn't already in the first place but the desperate screams and cries of vocalist Brian Funck create an otherworldy sound on our thisworldy favourite track. A mellow brass accompaniment follows, to once again lul the reader into a false sense of security.\n\n\nTrack 4 out of 6, 'Bonnet Caire', opens with the slow churning, sinking riffs that bands of this genre have been likened to, what makes it different from most other bands like this is the fact that Thou can add a touch of melodic melancholy to bring a sense of depressing hopefulness. Dozing through at a gaping 10 minutes long, this song does not forgive in it's entire length, never showing signs of letting up on the anger forced into it. Track 5, 'Cold World', (a Pygmy Lush cover, as is track 6) a slowly swirling and swiveling mass of crusty guitar and sludge laden strings fermenting over the listener, for the entire duration of the song almost hypnotizing one broken by the subtle yet delicate piano behind the monolithic riffs. \n\n\nAnd finally, bringing the EP to a close, track number 6, 'There There', almost like the last word in a fight out of nowhere vocalist Brian unleashes his anger upon you;\n\"All as if you were alone.\nNobody left you, but you're always not better.\"\nquaking through your veins and driving you to the same feelings of frustration brought upon the songwriter, until a break in the song breathes a whimsical guitar twanging, almost something of a 50's western movie duel, as one knows in such a fight that there will be blood drawn through the efforts and acts of another mans doings, and before you know it the track opens fire and finishes you off with a death marching repeating buildup of drums and guitar, your final moments before the closing sincerity of the guitar, leaving you lifeless.\n\nThat was 'The Archer and The Owle' by Thou.\n",
        "\nIn the 2 or so month wake of Thou's latest full length, Summit, I think I've finally arrived at an opinion. I'll shelf my personal recollection of Thou's back catalog and get right to it.\n\nIt comes to me as a paradox as the album is coherent and well constructed, yet incomplete and long.\n\nThe album itself doesn't offer amateurish leaps from mood to mood, or anything too avant-garde and misplaced, rather it's something I don't know how to really approach or pin-point. To play it safe, I'd say it feels as Thou are holding back with this release. One track shines, and another doesn't really do anything for me. \"By Endurance We Conquer,\" \"Prometheus,\" and \"Another World Is Inevitable\" are shining examples of Thou at their best. Maybe moreso than before, Thou showcases detailed, complicated, and moving songwriting as each of these three bleed sludgy sophistication. But on the other hand, I tend to skip \"Grissecon\" every time i spin the cd, as well as \"Summit Revisited\" and \"Voices In The Wilderness.\" This is a real shame as that makes up for 2/5 of the album.\n\nThe first track, \"By Endurance We Conquer\" is a winner, although I kind of dislike the synth or whatever effect that is around the end. This song, and the one after, I think sum up my view on the album perfectly. Starting off and being great throughout, \"By Endurance We Conquer\" closes like some pre-war ritual; a preamble if you will. Unfortunately \"Grissecon\" loses the vibe and just widdles around for 8 minutes. There's many different things in the song, but nothing that really grabs me; call me spoiled.\n\n\nWhatever complaints aside, the album is about the 4th track and the 4th track alone. \"Another World Is Inevitable\" is a typical Thou styled lesson in tension, climax, melody and emotion. Just 2 seconds over 10 minutes, \"Another World Is Inevitable\" works it's way through heaves of tar and viscous fluid until finally erupting around the 7 minute mark as constant bass drum beats merge into the measure like troops ranking into a final formation. The outcome is uplifting, trance inducing and awe-inspiring as Bryan screeches \"A new world springs from the corpse of the old,\" and eventually \"This will be the day.\" With the shift towards more dynamic and sprawling composure, the lyrics seem to match as they're optimistic and more demanding (fortunately, lyrics are a strong point of Thou and always have been;so this isn't such a stretch). Needless to say, I end up playing this track a lot.\n\nWhen the muck boils away what's left is that I'm not thoroughly satisfied with this album.\nThis isn't as good as Tyrant, I don't know if anything could be. It's similar to Peasant as there are stellar songs but also some that are less. Where Peasant had \"Work Ethic Myth,\" \"Burning Black Coals And Dark Memories,\" and \"They Stretch Out Their Hands;\" Summit has its three as stated earlier.\n\nWithout question it's worth a purchase (as is everything this band seems to touch). That being said, Thou is dynamic enough, heartfelt enough, and invigorating enough to be the only band that matters now, and even though Summit has it's rough edges, there's plenty of strong footing.\n\nOriginally written for http://chainsawjustice.blogspot.com/\n\n-F\n",
        "\nThou have been releasing material constantly. They are one of the hardest working bands I know of. Constantly making splits, eps and playing hundreds of shows. Any praise they receive they wholly deserve it. They’ve worked extremely hard to get the amount of fans that they do now. \n\nTheir third album “Summit” is an album that marks new doors being opened for Thou. They explore different sounds and genres that they have tinkered with a bit in previous releases. On this album though they bring it all together to make an excellent, bludgeoning doom driven sound that will make you come back for more. Some changes in the music you will notice are the black metal influence on some songs. The drumming mainly is very black metal influenced and sounds great. It makes the music more interesting than most other doom metal bands, which don’t do a whole lot with their drumming. The first song on the album “By Endurance We Conquer” is a prime example. It starts out slow and gloomy, and then picks up with fast drumming from Josh Nee. A few seconds in comes in the vocals which are different on this album from most of their material. The vocals sound muddier and more black metal sounding. On their first album you could really hear the hardcore influence on his vocals. This has disappeared on this album though. These are black metal screeches and growls. The music on this album is much slower and drawn out than any other album/ep/split of theirs. This by no means is a bad thing, but rather an excellent thing. You get to witness much more of their musical prowess. The guitar tone is sludgy and muddy sounding. The guitars are probably the best thing on the album and hardest to describe. They sound like a combination of black metal, sludge metal, doom metal, drone, indie and shoegaze. It’s wonderful. I enjoy ever second of each song. Another new element to Thou is the song “Summit Revisited” which has horns playing. It’s an instrumental (the only one) this song is very moody and atmospheric. “By Endurance We Conquer” also has some horns playing in parts of it. The horns add a whole new element to the music, pushing the atmosphere further. \n\nAll in all this album is a must get. If you love shoegaze, indie, doom, drone, sludge or sloooow metal you will love this album.\n",
        "\nBoth Thou and Sabbath come under the rather broad category of 'bands I enjoy/respect but can never be arsed listening to', I dig the former's take on sludge, and Sabbath have a few songs that I really enjoy (and they're very influential, and Iommi is god!!! Dio! Geezer! etc etc etc.). Well OK, i basically just play Electric Funeral, After Forever and Children of the Grave about a million times each and then just put on another band. Anyway, you only need to be a casual fan of either band to look at this EP and go \"Really? Why?\".\n\nI mean sure, if Thou wanted to pay tribute and stuff I certainly wouldn't blame them for playing a bunch of Sabbath stuff at a gig. Some of it would fit well, and this EP would probably sound at least OK at a really massive volume. Cranking it on headphones though leaves one rather puzzled. How is this an improvement on the originals? Why would Thou waste time/money and go into a studio and record this?\n\nPut simply, this is basically a very distorted take on the originals, with the singer screaming (sounds really bad on Black Sabbath- the song) instead of Ozzy's vocals- I always thought it'd be hard to make the vocals worse on an Ozzy era cover, but here I'm proven wrong. What is the point of this, seriously? These songs do not work as sludge songs! I'm sure there's one or two examples elsewhere that would prove me wrong, but you can't just grab a song, put heaps of distortion on it, scream on it and call it a day!\n\nI know I'm stating the obvious here but this really sucks, if you're a big Black Sabbath you'll probably be really offended and if you're a big Thou fan then they've done much better stuff elsewhere. This EP doesn't need to exist and I'm surprised it does.\n",
        "\nThis doesn't set my world on fire but I can't deny that it's a pretty cool sound Thou have got going here, some sort of down and dirty sludgyness with a bit of atmospheric influences- to be honest I'm surprised this isn't a lot more well known, as it sure as hell sounds like these guys did some market research. \n\nThe vocalist is the biggest drawcard, I reckon. The band supplies a lot of real heavy, simplistic, perhaps vaguely EHG-ish riffs, but it's that real beefy feral yowl of the dude behind the mike that really makes it. He sounds like he means it, but conviction aside it's just his tone that I love. Real pissed, has a real bite to it, it's good shit. All in all those last two sentences could sum up most of the band really- not all that technical or complex, but good, lowdown riffs played simply and with conviction. The production plays into this- raw but still well mixed with some good tones. Love them or hate them, it's hard to deny that these guys have their sound down pat.\n\n'Course, like many a band out there these days Thou pull some sort of \"transcend ma genrah\" card with a bit of atmospheric tomfoolery mixed in with the rest of it. I dunno, works well, the big melodic riff/coda in \"Out of the Mouth of a Fool\" is pretty cool, but overall these parts do seem a little bit tacked on. Could've been developed more, or alternatively dropped for a few more massive riffs, either way would've been a bit of an improvement. No biggie though, songs still flow, riffs come and go in a manner which is pleasing to my ears. It's no surprise though that the best track here, the rather brutal closer, is best because it's just two or three riffs repeating over and over while the vocalist repeats a simple and catchy line over and over again.\n\nYeah, so this is pretty good, but it's not brilliant. Overall the whole thing is competent and I enjoy it, I get into it, but it's not the best shit in the world. Still, those with a liking for music that is slow and heavy would be advised to give their discog a bit of a look and see what they find.. I'm pretty keen on getting a full length or two, myself.\n",
        "\nThou are a sludgy droney doom metal outfit from Louisiana. They decided to come to my city and I decided to go because I love doom metal and a bunch of doom bands would be there besides just Thou. All of the bands at the show slayed but Thou blew my mind. So I decided to pick up their first album over at the merch table. \n\nThe tour version of the album came with two bonus songs one which is good and the other which is awesome. \"Acceptance\" is an instrumental but is one of the best tracks on the album. It's a very deep and moody track that will send emotions soaring. It's not a doom song by any means but seems more light and happy. This is a good thing after all the doom that just pummeled your ears for 47 minutes. It's more of a shoegaze, atmospheric, sludge kind of song. It's a beautiful thought provoking song, great to listen to on a long dark drive at night. \n\n\"What Blood Still Flows From These Veins\" is the longest song on the album and is slightly different from the non-bonus songs. For about 4 to 5 minutes into the song it sounds like the rest of the songs but starts into a chant or speech if you will. It reminds me of something Satanic Warmaster would do at the beginning of the song \"True Blackness\". It's a nice touch I like it, after that bit of excitement the rest of the song is droney ambient drum noises and stuff. It's not boring but not terribly exciting. \n\nThe main songs on the album are true sludge/doom metal songs to the core. They're slow and filled to the brim with despair and a sense of dread. The feeling you get listening to the songs is of slowly spiraling down and down until you can not get back up. These songs are your typical doom metal songs except perfected. \"Monstrance\" has some killer riffs in the song that make it a tad more upbeat than the rest of the songs in my opinion. It's also probably the best from the main songs. \n\nOverall Thou will crush you skull with their thick, distinct riff after riff formula and atmosphere of pure fucking doom. They've taken doom to a different place a better place. If you ever have a chance to see Thou go do it, you will not be disappointed they put on an energetic show.\n",
        "\nMy second doom/drone/sludge band of the day and, thankfully, this one are a lot better, though still fairly mediocre. Thou are a United States based band who have surprisingly been around for some time now. To me they still feel like a fairly young and inexperienced band, but five years together and lots of material later, they actually have a lot more experience than I give them credit for. ‘Peasant’, the sophomore full-length, which has seemingly been obscured by the amount of split albums Thou have participated on, is a lot like I would have expected if I had no previous knowledge of the band other than what genre, or hybrid of genres in this case, they play in. The sound is a mixture of all three genres, though mostly doom and sludge, in my eyes, with a very thick guitar sound and vocals that match them up by rasping more so than anything else. This album is excruciatingly heavy and given the three genres it attempts to mesh together into one cohesive movement, would you really expect anything else?\n\nThe aim of the day is to be as heavy as fuck and try to forge some catchy melodies beneath the heaviness to keep the crowd interested. Thou do this, but with such a simplistic and heavy-minded style, I cannot help but feel a little bit bored with the depiction. To me, this style was made interesting by musicians like Justin Broadrick by placing cleaner vocals over the top and dreamy atmospherics. Thou tend to live up to the standards of the three genres, rather than pushing the envelop to try to find new territories with which they can exploit and, at the same time, forge themselves out a unique destiny. The material present here on ‘Peasant’ is soaked in tar and is as sludgy as possible. There are no grey zones, this is blacked out tar. The style isn’t all that adventurous but, particularly songs like ‘The Work Ethic Myth’, they’re quite well written with lots of melody to scream and shout about, as opposed to a wildly improvised feel which can come attached to bands of this nature.\n\nThe drums do give off a feel of improvisation with heavy use of double bass and the hi hat, but the rest of the instrumentation is cautiously brought together, as on songs like ‘An Age Imprisoned’, especially when the song negates the vocals and really slows down to an agonising crawl. The material reminds me of lazy Sundays, which today is, quite conveniently. The songs has a quicker tempo to begin with, though its never played at a blistering pace, but as soon as the vocals disappear, the instrumentation drags and drags with epic use of distortion and feedback. The capacity of the song to showcase emotion is heightened by the slower dirge like pace, but the sorrowful overtones aren’t enough to fend boredom and uninteresting atmospherics away as the distortion begins to dominate and the good work of the melodies, particularly on the previous song, take a back seat when Thou really should have sought to push that style to the forefront rather than allowing it to fade with time. This is a real shame because the opening song is terrific. The vocals don’t exactly enhance proceedings, but they don’t affect the clarity and positivity of the melodies. The cleaner side of the band is also affected by the haphazard yearning of heaviness and this could have been a side which made Thou more unique than they eventually became.\n\n‘Belt of Fire To Guide Me, Cloak of Night To Hide Me’ has a very poetical name, but its rather jazzy opening is destroyed completely by the torturous vocals. I don’t think it’s a coincidence that the atmospherics tend to suffer when the odd vocal display comes into play. The vocals would be better suited to a black metal display, not this type of fuzzy doom and sludge. I find that the longer the album goes on, the less the melodies have a voice to showcase their talent from. The opening song deals well with the melodies, pushing them to the foreground but, after that, they fade away into the background and the heaviness takes over and deals a tremendous blow to the soul of the band. The heaviness is fine, but there needs to be a back-up plan to support it. The melodies did that on the opening song without compromising the heaviness factor, but Thou haven’t seemed to realise that. There is a distant post-metal influence that affected the beginning of the song (as well as the monumental and sorrowful beginning to ‘Burning Black Coals And Dark Memories’) but it doesn’t last long enough to get to grips with the albums atmosphere, or structure. A rather disjointed affair too concerned with being heavy than being worthy.\n",
        "\nNOLA's most hardworking band Thou put out their fifth release of the year with The Degradation Of Human Life. Here we see Thou's swampy gloom coupled with Mohoram Atta (a new band for me) who does an excellent brand of His Hero is Gone/Cursed hardcore with a touch of black metal. As with all Thou releases expect only the utmost quality here. Beautiful matte jacket with more of the excellent imagery you'd expect from them along with a matching innersleeve.\n\nThings start off with a bang as Thou surges at a midpaced punk beat. Production's pretty much the usual jig, heavily distorted guitars, thundering drums and the voracious vocals clear and audible; if anything the overall production sounds a bit thinner, while the guitars sound a bit heavier, if that makes any sense. Thou plays much more traditional sludge with this, although as noted \"Don't Vote\" is pretty up tempo and even has some double bass work. Competently executed and well done, Thou maintains a level of quality many bands pray for, but if there's a fault to be had it lies in the lack of variation as this release depicts Thou staying safely within the parameters of sludge and it lacks the post rock touch that has always been the icing on the cake for them. Although my complaints are pretty moot as \"Shorties With MP 40's, The Personal Is The Political\" jumps from slow, to sludge slow and really peaks around the end displaying a powerful and great song. There's even a Minor Threat cover (Screaming at a Wall) which is excellent and the band rightfully proclaims in the liner notes \"Punk lives.\" As we all know, metal bands embracing punk is a favorite of mine so this was great to hear. Also, on a side note I love Thou's lyrics and beyond that I love their imagery and politics. My favorite thing has to be the Black September fold out \"Speak to cops the only way they understand\" and has an M16: excellent.\n\nWhile Thou pours a lot out on their side, Mohoram Atta really do an awesome job. As mentioned earlier, Mohoram Atta's a new band to me, but they play a pretty dismal and heavy brand of melodic hardcore a'la His Hero is Gone. The tonality and the production is very reminiscent of mid 90's Norwegian black metal and creates a powerful atmosphere, something I had always wished HHIG would've done more effectively. The last track sounds like Darkthrone covering newer Envy (Jpn) and it's easily my favorite part of this split. Oppressive and dark, the track fades out and signals a powerful emotive effort from the band and makes me zone out in enjoyment. Employing blast beats, a variety of vocals (including mass shouts), sludgy to black metal like riffs throughout their sound, Mohoram Atta display a plethora of skill. Defiantly a band to look out for Mohoram Atta's brand of dark melodic hardcore is right up my alley as there's slow sludgy parts, heavy midpaced head nodders, d-beats set to razorfast riffing and melodic black metal like riffing that makes me all giddy like a girl scout.\n\nBuy it, as all Thou releases seem to be infallible and of limited quality, this is no different.\n\n-F\n\nOriginally written for http://chainsawjustice.blogspot.com/\n",
        "\nMy excitement aside, this release offers a handful for collectors, enthusiasts, and even the casual listener. Packaged inside a small jet black box (roughly 4x4x4in.) you get three cassettes, each with a thick plastic like paper covered with beautiful grey/black artwork, a pin, a sticker, a patch, a vial of pine needles/cones, a small booklet with lyrics and pictures all on a bed of moss; quite the package, no?\n\nThe music contained in this beautiful little package is all of Thou's work from 2007-2008, not including their first two demos. You get two full lengths (Tyrant & Peasant), The Retaliation of the Immutable Force of Nature EP, To Carry a Stone EP ,We Pass Like Night, From Land to Land(split with Leech), Thrive & Decay (split with Black September), and Malfeasance-Retribution EP. There's a lot to take in, but it's all excellent. You can really appreciate a band when they don't have a single bad song.\n\nHaving heard most of this stuff on vinyl/mp3 I can say it sounds excellent here. I heard the Peasant album in my friend's car in mp3 format and we both commented how overproduced and weak it sounded, not here; the tape sounds excellent and carries that filthy heavy sludge sound that's damn near perfect.\n\nSo as far as the music's concerned I'll break it down by singular release.\n\nTyrant\nBeing the first release I heard by Thou I was an instant fan. Songs like \"Tyrant\" and \"Fucking Chained to the Bottom of the Ocean\" are stellar highlights (listen to that buildup around 6minutes in \"Tyrant\" holy hell that's awesome). With the previously mentioned songs we see vibrant sludge mixed with beautiful post metal sections (soaring guitars, build ups, huge sound). The more Eyehategod like sections are excellent mid-paced crashes of heavy riffs and monstrous drums all accompanied by venomously powerful vocals. In terms of the vocals, they sound much more like black metal vocals than anything else, yet they're still decipherable. Thou excel at what they do because they seemingly manage to mix that ugly, filthy, drug ridden vibe that we associate with sludge and mix it with the celestial sound that comes to mind with bands like Pelican and Caspian. Easily one of the best sludge releases I've ever heard.\n\nThrive & Decay\nAn excellent release in it's own right, as Black September plays an awesome brand of death metal akin to older Bolt Thrower, but here it's just Thou (as with the other split material included). The song from this release has a great movie clip at the beginning and the song carries out in a similar violent manner. Much more like Eyehategod (I hate to keep comparing, but it's true). Awesome song title as well, \"Smoke Pigs.\"\n\nWe Pass Like Night, From Land to Land\nFour Songs here, previously from the split with Leech. Things start softly with a calming acoustic intro which leads to the spacey and serene \"Here I Stand, Head In Hand\" which explodes into a brilliant cascade of emotive force, embodying itself in thick walls of distortion ravenous vocals and seeping bass. A much more atmospheric a offering from Thou. Much like the first track, \"The Defeatist's Lament\" ends with waves of distortion and clean guitars, as well as those ethereal female vocals present on \"Here I Stand...\" A very \"whole\" feeling ep, more like a mini album.\n\nMalfeasance-Retribution\nThe two songs from the ep are phenomenal as we'd expect. Here they're sandwiched in between the Black September split and the Leech split. You gotta love the song titles, \"The Severed Genitals of Every Rapist Hang Bleeding From These Trees\" (although on the actual ep it's \"bleeding genitals...\" I don't know if this is a typo on Peasant Magik's part or not). Powerful and driving, both songs are full of rich textures and drift from pounding sludge, to rhythmic changes, to harrowing atmospheric passages. A bit more sludgy, but brilliant nonetheless.\n\n\nTo Carry a Stone\nMore of the same; first \"They Stretch Out Their Hands\" carries on a midpaced sludge affair until it breaks down to a harrowing slow section which it never seems to dig itself out of. \"The Road of Many Names\" begins with the ominous feedback we're all used to and dives in with a super thick and artillery heavy riff. The little haunting clean riff around the end really works well and is quite creepy. All in all I'd have to say this is thou's weakest work, but that's like saying \"The Return\" isn't as good \"Under the Sign;\" we're all winners.\n\nPeasant\n\"The Work Ethic Myth\" kicks things off perfectly, as it's one of the best tracks on the album and depicts Thou's sound perfectly. Peasant, an album which I'm not as well versed with as Tyrant, is still magnificent but doesn't hold the same place that Tyrant does for me. Sections like 5:10 into \"Belt Of fire To Guide Me Cloak Of Night To Hide Me\" and the first real riff of \"Burning Black Coals And Dark Memories\" are great and make up the weight of quality for this album. Not as strong as Tyrant, but remarkable nonetheless.\n\nThe Retaliation of the Immutable Force of Nature\nTwo songs again here. \"What Blood Still Runs Through These Veins\" crawls at a snail's pace yet carries a hippo's weight. The sound is giagantic and the guitars are as thicker than any football linebacker you can think of. They achieve a huge sound here and juxtapose the sludgy thickness with beautiful leads and powerful riffs. The track peters out to distortion and leads way to \"Acceptance\" which is one of my favorite songs. It's a post metal instrumental done better than any post metal band. The beautiful guitars weave back and forth in between lapses of reverb and accompanying drums. It all builds to a monumental crescendo with some of the most enthralling guitarwork I've ever heard around the six minute mark which luckily continues until around ten minutes. The progression and delivery is simply breath taking and proves that Thou are an exceptional band.\n\nBeyond the excellent music, Thou create wonderful lyrics and have an absolutely magnificent image in their artwork and merchandise. Little epigraphs here and there on various releases depict a well read and versed band, as well as establish the morose atmosphere of the band. With all the releases I own of the band, each one was well worth the money as they all come with something special and have great artwork, Kingdoms is no different. The quote on the first page of the booklet,\n\n\"She used the ancient, long-forgotten \"thou\"- the \"thou\" of the master to the slave. It entered into me slowly, sharply. Yes, I was a slave, and this, too, was necessary, was good.\"\n\nTaken from Yevgeny Zamyatin's book \"We\" is a powerful epigraph to this impressive body of work. The boxset is only $20 and well worth it; I'm a very happy camper with this one.\n\n-F\n\nOrignally written for http://chainsawjustice.blogspot.com/\n",
        "\nThere is a strange trend when it comes to metal reviews for the writer to go completely batshit insane when describing their favourite album. Admittedly I'm close to doing just that right now but I can assure you, that I am trying my hardest to refrain from such abhorrent behaviour. I have a modicum of class and a reputation to defend of course.\n\nThou's 'Malfeasance-Retribution' is a concentrated effort that summarises their sound and as such becomes their greatest work due to its ability to convey itself so effectively and succinctly. Fifteen minutes and fifty-two seconds of menacingly violent sludge metal that never slumps, keeping the listener's attention with expertly timed shifts in song structure to maximise their impact. The music itself is definitely derived from the Eyehategod school of sludge but with the pentatonic scale thrown out the window in favour of more drone-doom influences generating a more apocalyptic and bleak atmosphere.\n\nThe opening track, \"Their Hooves Carve Craters in the Earth\" is the slower of the two and brings to mind what the tracks off 'Peasant' would sound like if the guitar tone was less muted and the songwriting approach had a more visceral and untamed edge to it. It never reaches a pace that could be considered fast, or even mid-paced really but this doesn't stop the guitars from moving through a solid selection of riffs that are so decimating and dense it's hard to believe the sound can physically defy gravity for long enough to reach your ear drums. The drumming is also noteworthy, shifting its beat appropriately to support the music and lend even more weighty to the granite-like riffs.\n\n\"The Bleeding Genitals of Every Rapist Hang Bleeding From These Trees\" is definitely the best track of the EP; managing to skillfully alternate between funereal dirges to more traditional doom metal riffing into mouth-foamingly rabid crust/hardcore punk eruptions. The vocals are particularly vicious and raspy, albeit not quite in the black metal vein with a bit more thickness and growling present in the technique used. Overall the track advances and recedes with such calculated precision it's hard to find the right words; you could say clockwork but the music never feels mechanical or stiff. It's quite organic and never jarring, flowing with an unerring conviction into the each section without making the listener think the musicians are off their fucking meds again.\n\nI could gush for another three or four paragraphs because this is some immaculately crafted sludge metal and should be mandatory listening for everyone, regardless of musical preference. It's an exercise in efficient, controlled songwriting that proves it is possible to produce music without the need for augmenting the attributes of your music to ridiculous extremes. Sublime.\n",
        "\nIt’s all about the riffs here. This shit is slow and heavy. It also has a good Louisiana metal sound to it, which reminds me of Crowbar. Most Crowbar songs have more upbeat, hardcore sounding parts, and then the slow as fuck sludge metal parts with the sweet, crushingly heavy riffs. Thou’s first demo is like all the slow parts of Crowbar put together to form songs. The whole thing is really heavy, and it can be boring if you don’t like that kind of thing or if you’re not in the right mood for it.\n\nEvery once in a while you can hear some singing on here. Slow, mid-range vocals that fit the music. This is before Thou got their singer, and I have to admit I have not heard a lot of their later stuff. The reason for that is that the vocals on the later stuff I do not like. On this demo, one of the guitar players provides sparse vocals that fit the music and don’t sound bad. They are “clean” vocals, meaning that he sings in a regular voice. Thou’s later stuff has a singer who sings in a very harsh, monotone style. I prefer Matthew’s vocals.\n\nThis is definitely what I would call sludge metal. It’s fucking slow. The riffs are heavy, the drums are slow, and the vocals are rarely heard. There are also some pretty parts. If you like that kind of thing, this is worth hearing.\n",
        "\nReview originally published at http://www.teethofthedivine.com by Erik Thomas\n\nHot on the heels of the bands recent 2008 release, Peasant, Gilead Media gives us a CD digi-pack re-issue of the this Louisiana sludge band\u0081fs 2007 LP only debut, originally released on One Eye Records.\n\nI love everything about this band; their simple name, their logo, their artwork (the new artwork even seems to match the artwork of Peasant), their crawling, sludgy, blackened doom, their lyrics, and the fact they are from Louisiana. With obvious nods to Eyehategod as well as current sludge acts like Cough, Highgate and Negative Reaction, and even some Autopsy, Thou are a simple, icky sludge act with little deviation from lengthy songs of oozing, feedback laden riffs straight from the depths of the Bayou. Even with a few tangents of hacking Southern ambience and bluesy sometimes post rock acoustic respites, Tyrant comes across as a festering, sore ridden and painful metal reminder of the post Katrina carnage that left the area a barren, scarred wasteland of human misery and refuse.\n\nI heard this album after Peasant, and when you compare the two, Tyrant seems to be the better release. It has a bigger, fuller, nastier production as well as a slightly more unique \u0081eswampy\u0081f feel, as opposed to pure droning sludge. The seven tracks, in their hour duration deliver tangible moments of skin picking paranoia mixed with some surprisingly introspective segues of malaised beauty. The end result often comes across as Goatsblood meets Isis having a voodoo ritual.\n\nFrom the opening scrawl of the title track, to the aptly named, heaving \u0081gWith a Cold, Life Extinguishing Elegance\u0081h, loping menace of \u0081gFucking Chained to the Bottom of the Ocean\u0081h, rending and almost melodic doom of \u0081gI Was Ignored and Judged and Cast Down\u0081h, to the crawling filthy \u0081gMonstrance\u0081h and closing duo of the corrosively epic 13 minute \u0081gWhat Still Flows From These Veins\u0081h and surprisingly elegant 11-minute instrumental \u0081gAcceptance\u0081h, Thou are absolute masters of this style and in my opinion one of the best and nastiest sludge bands around. (On a side note for you vinyl nuts out there the album\u0081fs last two tracks are also both available from Gilead on a Blood Red Vinyl 12\u0081\u008d EP).\n\nIf you enjoyed Peasant, Tyrant is a must have as it is the superior release, though Peasant is awesome also. Tyrant just seems to have a bit more variety and ambience amid the gnarly, tooth gnashing sludgy throes.\n",
        "\nThou. A good name for a band like this. Singular, impersonal, archaic, and vast. Exactly the sort of one-syllable utterance that you want representing monolithic dirges of sludge-driven, drone-infused, ambient-laced heavy metal that implant themselves in your mind with all the subtlety of a sledgehammer to the left temple. In the spirit of newer sludge/doom artists like Minsk, Thou's style of music is a blend of Isis-style post-metal leanings alongside black and misanthropic tides of Goatsblood-inspired cruelty. The result of this combination is almost something out of an early Type O Negative album in structure: great, vast soundscapes of ugliness and misery broken up by sharp, aching fragments of beauty and melody that are starkly reflected by how barren the rest of the music is before being smashed to glittering pieces by the barbaric hammers of power chords, thundering war drums, and throat-searing screeches that would make Mayhem fans cower. And really, who can't get behind that?\n\nAll hideous pretense aside, though, this is really good. As previously stated, this is a pretty solid blend of the more melodic and more hateful breeds of sludge, not at all unlike Pelican meets Buzzov*en or something. It's refreshingly devoid of stoner leanings; not that those are bad, but they wouldn't fit here. There's no stoner groove to this music, nor any of the simple catchiness that you'd find in a Sleep album. Similarly, there's none of the hardcore leanings of a NOLA sludge band either; it's not music for Crowbar fans, really. If you dig a lot of the stuff coming out on Southern Lord lately, though (that is, you dig the music and not just thirty different colors of vinyl), you'll probably appreciate this. Thou manages to fuse the bleakness of bands like Winter with highly melodic, shimmering passages that benefit from the almost unbearable tension produced by almost agonizingly slow, thunderous chords and vitriolic screams. It doesn't ever go completely into Pelican territory and clean itself up; there's no clean vocal passages or particularly happy sounds (apart from some of the uplifting riffs at the end of 'I Was Ignored. And Judged. And Cast Down.'), and there's far more Khanate-derived plod than there is airy lead guitar.\n\nA comparison to Goatsblood is pretty apt in some of the more minimal sections, with a similarly tortured and obscure tone emerging from the murky riffing that dominates this LP. While Thou lacks that band's propensity to grind, they do have some more uptempo passages from time to time, though they never really claw their way past 'moderately quick' and up to Dragonforce levels of alacrity. It does add a bit of variation to otherwise still compositions, though, and probably goes far to make this mostly uncompromising music more digestible to the unseasoned doom listener. And this is a doom album, there's no way to deny that; beyond Black Sabbath or Candlemass, this is essentially the essence of modern sludge/doom, and if you dig that style, you'll love this. It's not at all surprising that this LP is getting repressed by Southern Lord; it fits right in with their roster of slow'n'low artists. It's just that Thou is better than almost all of them.\n\nIn short: excellent sludge/doom that any fan of the genre would be encouraged to give a listen, particularly for those who like the modern breed of the style. If you love Minsk and other blenders of majesty and misanthropy, you'll feel right at home listening to 'Tyrant'. A great debut from a band that will likely only impress more and more for years to come.\n",
        "\nI have never heard doom metal like this before. Not because I don't know what's up, but in truth because there does not exist doom metal quite like Thou. This is some genuinely refreshing music. It's riff, after riff, after riff, after riff of absolutely killer, doomed out, blackened, psychedelic sludge/drone doom metal. There's even parts that draw considerable post-metal inflluence, hell, post-rock even, but they're so much more grim that you can't really compare the two. \n\nThis is very dark music. It's also very, very beautiful. The intense psyched out melodies lead the way into some really epic, intense dirges. I know post-doom really doesn't work as a description.. it just conjures up something too weak. Which isn't even to say that post-metal (or post-rock. I highly enjoy both genres) bands are weak, either, but just that this band is very simply fucking brutal. And it's just that I can't find myself saying that about any post-rock or post-metal band I've ever heard. The same rifts and valleys of the parts from collossal peaks to the fucking slowest, dirtiest sludge you can imagine, all with some of the most painfully evil vocals you've ever heard, mixed with doomed out riffage from every other sick and filthy sub-genre you can imagine, garnished with a doom/death aftertaste. And then, at the same time (of course) there are parts that Godspeed would be proud of. Hell, envious of. It's really really good post-rock.The dreamy, melancholy-but-still-somehow-happy jams are all here. And they're still grim the entire time. And definitely metal. \n\n\n\nWhen this band turns up the frostbite it can produce some genuinely creepy music, while, again, at the same time the beauty in the melodies is simply and utterly awe-inspiring. It's totally on another level entirely. Lyrics/vocals, as well as the song titles; the whole aesthetic these guys have going is fucking intense, and really really great. For some reason the song \"Fucking Chained to the Bottom of the Ocean\" I think fits the entire band perfectly. That title is exactly what this band conjures up every second of each track on this record- Complete and utter fucking despair, hatred, desolation and void. The total absense of light, clean air, and hope. Pitch, nihilistic darkness. The riffs tower like huge monoliths of the ocean floor wrenching free of the crust's continental grip and these colossal come crashing down, standing miles tall going onward into the black abyss forever overhead. The weight of these collums of the earth's crust is enough to completely shatter the seafloor for a hundred miles around. Entire ecosystems are wiped out as these ancient monuments drop. And yet somehow, we have only just begun to see the blackness of the abyss' violent rage, and even more so (an most importantly), only a mere fraction of it's immense, passionate beauty. \n\n\nI have no idea how to get a copy of their lp other than catching them on tour, which is the perfect excuse to take the time to go find them and see them in your town at all costs; Just wait until you witness this live. \n\n\nSeriously people, I cannot fucking praise this band enough. Highly, highly, recommended.\n"
    ]
}