{
    "Band Information": {
        "Country of origin:": "Australia",
        "Location:": "Blacktown, New South Wales",
        "Status:": "Active",
        "Formed in:": "2006",
        "Genre:": "Deathcore",
        "Lyrical themes:": "Misogyny (early); Anti-religion, Violence, Murder, Politics",
        "Current label:": "Nuclear Blast Entertainment",
        "Years active:": "\n2006-present ",
        "Number of Reviews": 39
    },
    "Band Reviews": [
        "\nI'm going to start this review by saying, that I enjoy the music Thy Art Is Murder usually produces. 'Holy War' and 'The Adversary' are probably two of the finest deathcore albums ever released. 'Dear Desolation' was much clearer with the view of the musical direction the band wanted to continue. Few good songs to begin with, but halfway to the album it pretty much flopped. It just didn't strike to me as effectively as 'Holy War' did. But it was 2019 and we got another album by these deathcore-titans. And to my disappointment, this album is exactly what I feared it'd be. It even triggered Chris Barnes of Six Feet Under for its name, Human Target, so you know it's going to be absolutely priceless.\n\nNow let's start by breaking down a few of the songs in the album. First song we're going to talk about is the title track, Human Target. The song starts well with their signature chugging riffs and CJ's mid-low shouts. Although the play-through of the song is quite drawing, the structural parts get points from me. They build up the sound little by little throughout the song and their new drummer, Jesse Beahler brings in some solid drumming. At the end of the day, the song doesn't offer pretty much anything new to the catalog, except a tired attempt at trying to bring in distantly familiar technical riffs that almost could be trademark of old school Decapitated. The song overall after a few listens falls to the victim of its own lack of creativity and feels a bit held back. \n\nWe are going to pass a few songs here on the way. For example, 'New Gods' isn't really even worth mentioning, nor is 'Make America Hate Again'. Drawn out, boring and cheap riffs all the way through these songs, not even fun to listen to. We pretty much get something exciting in 'Death Squad Anthem', one of the highlights on this album. It has a little more punch and more death metal-ish sound to it. Closing in on the halfway of the album we get a treat called 'Eternal Suffering'. It starts the same way as Dear Desolation's song Death Dealer. The song has a little different vibe to it. The slow chugging riffs keep the song going, which is getting really out of hand boring at this point. CJ's vocals on this song are absolutely on point. They aren't all that basic mid-shout all the way through, he does a bit more variation. The song keeps dragging with the second guitars atmospheric play-through, which we got to hear a lot on 'Dear Desolation'. Now we get two almost exact same songs after one another, as 'Welcome Oblivion' plays next. The song structure is pretty much the same as in 'Eternal Suffering', it just offers less as a song to the listener. Same atmosphere, almost the same breakdown parts.\n\n'Atonement' and 'Voyeurs into Death' give out more of a energetic kick, which the band is mostly known for. Atonement falls short by not offering anything particular that a listener could latch on to. Drawn out riffs and mid-shouts, once again. 'Voyeurs into Death' briefly reintroduces the good old low vocals of CJ, but the fun ends there. The song structure is as boring as ever and it has no replay value for the fact that it comes off as generic deathcore-song with chugging riffs, mid-shouts and blast-beats. \n\nAll in all, what do I think about the album as a whole? It is an album filled with a bunch of half or less decent songs. The songs offer really poor replay value, nothing new to latch on to. I mostly feel disappointed by this release. The sound of the album is very tiring, boring, uninspired and definitely holds no place in my record collection. Despite the few decent songs on the album, the entirety of the album is very lacking. You can't go on with the same chugging riffing and the same mid-shout and think that you can get away with it forever. This is a terrible effort done by the band. I suppose the scoring on this album gives away the quality of it. This is brutal honesty from a long time fan.\n",
        "\nWith the advent of the new millennium, the world of metal was shaken from its foundations by the breakthrough of mostly-american newborn musical movements, earning, on one hand, an extremely wide variety of younger listeners and a lot of mediatic attention, while on the other being the favourite target of the critics of a great number of detractors and old-school metal fans. While certainly some of the aforementioned critics appear definitely sharable in certain cases and contexts, it's undeniable that the \"new wave of American heavy metal\" generated a large number of interesting subgenres and acts. Deathcore, in particular, is definitely one of my favourites, but I have to admit that it's one of those \"love it or hate it\" kind of things. Indeed, among this niche, we have, on one hand, bands that deservedly earned praise and respect, thanks to one or more excellent or at least solid and enjoyable releases (Whitechapel, early Suicide Silence, All Shall Perish...), while on the other we have a far larger amount of stale, senseless and ridiculous wannabee bands trying to emulate the most succesfull acts. \n\n\"Thy Art Is Murder\" are a quite unique case in the deathcore scene: they're hailing from Australia, precisely Blacktown, New South Wales. Thy Art Is Murder started as a rather solid, but generic, deathcore act: the band members are all insanely skilled when it comes to playing their instruments, but at the beginning of their musical journey they were also not that brilliant when it came to writing memorable material. Nonetheless, the band immediately distinguished itself from the rest of the deathcore scene, quickly evolving and maturing, and crafting more and more valid releases, taking influences from a lot of contemporary giants of the extreme metal scene. With their latest album, 2017's \"Dear Desolation\", I can say withouth doubt that these young musicians have finally found their way, perfecting their writing skills and creating a unique, personal, mature and most importantly uncompromising sound, making an opus that confirms them as one of the best and most valid contemporary deathcore bands.\n\nWith \"Dear Desolation\", the Blacktown deathcorers found the perfect formula that includes and beautifully amalgamates all of their characteristic features and influences in the correct proportions, instilling them with experience, musical taste and artistic maturity. Sean Delander and Andy Marsh prove to be two unrelenting riff machines, providing a crushing performance and taking elements from bands like Behemoth and Lamb of God, while being perfectly capable of amalgamating said elements in Thy Art Is Murder's sound without trouble. Black metal features like tremolo picking, haunting chord progressions, dissonances, tritones, dissonant arpeggios, octave chords are widely and masterfully employed to create one hell of an album, as each song contains plenty of memorable, extremely technical riffs and unrelenting guitar work from the beginning to the end. Tiny bits of melody are incorporated here and there, to make the album even more varied (just think to the fantastic, haunting soloing adorning a wide number of tracks); the hardcore elements are still widely present, but they are reduced to give more space to the extreme metal ones, and they're used with skill and taste, mainly in the devastating breakdown sessions, featuring complex rhythm patterns, and pleasantly inserted to suddenly slow down the pace after the faster sessions, creating a crushing and extremely heavy effect.\n\nLee Stanton provides an amazing performance, proving to be one of the best extreme metal drummers of the contemporary scene: he can make already aggressive parts sound apocalyptic and insanely violent thanks to his inhuman blast beats and the skill with which he masters the double bass pedals, especially at the highest tempos; he can manage complex tempo changes like nothing, shifting from breakneck speeds to slow-and-goddamn-heavy, pounding breakdown grooves; not to mention the fantastic and technical fills he uses to embellish the already excellent music. Vocalist CJ McMahon is back. meaner and stronger than ever, having found a distinctive singing style centered mainly on mid-ranged, powerful growls, but capable at the same time of employing a wide variety of different vocal techniques, such as pig squeals, low gutturals, high-pitched screams or also black-metalish shrieks. The only member that goes almost unnoticed is bassist Kevin Butler, the bass taking the back seat being a problem common to great part of the modern death metal scene. \n\nThe production, on the other hand, is nothing short of amazing, and I expected nothing less from Nuclear Blast: the vocals sound haunting and powerful, the overlayering is perfect and handled being carefully not to make the singer sound artificial even in the slightest, the drums have a perfect tone and the guitars are justly polished, crunchy, distorted and filled with destructive, almost occult energy.\n\nThe volume values are excellent, everything is perfectly audible without resulting annoying or too loud. Praise to the producer. Finally, the lyrics: my god, I assure you I've never listened to a deathcore record with such magnificently written lyrics, save maybe \"The Price of Existence\". The hatred against religion, the references to occultism and mythology/demonology, the studied and poetic words adopted, the metaphores: really, it's beautiful, and it doesn't sacrifice the music's brutality at all. Yeah, there are still some \"F-words\" here and there, but they're used intelligently and without exceeding even in the slightest.\n\nHighlights? Well, although every song on \"Dear Desolation\" is top notch level, I have to say the first half of the album is possibly even better than the second. \"Slaves Beyond Death\" is crushingly heavy and full of aggression thanks to the guitar work of the drop G# tuned guitars and the ferocious drumming, while managing to retain catchy hooks, mainly thanks to the main riff and the instantly memorizable chorus. And when the breakdown starts, ah! Pure eargasm. Back to drop A tuning with \"The Son of Misery\", which is clearly Behemoth-inspired: just think to the main riff redundant of \"Ov Fire and the Void\", and to the black-metal sounding dissonant arpeggios. The songs stays haunting during the stanza to explode during the chorus with bomb blasts and tremolo picking. Spot on the melodic yet evil solo and the breakdown that ends the song. \"Puppet Master\" is one of the most technical tracks, featuring an amazing, groovy riff during the chorus, an interesting variation of said riff during the stanza and a pre-chorus that's absolutely thrilling and violent, emphasized by well-studied choral arrangements. Not to mention the once more crushing breakdown, announced by the line: < . \n\nThe title track combines all of the above elements, mainly tremolo picking, groovy riffing, dissonant arpeggios, and a destructive breakdown after the chorus, once again emphasized by blood-pumping lines. The solo is this time really fast and technical, contributing to make up for another spot-on track and showing the shredding skills of the axemen. The second half of the album emphasizes the \"core\" elements in songs such as \"The Skin of the Serpent\", which is not a bad thing at all to be honest, as the songwriting doesn't suffer from this at all and the album retains its coherence. The aforementioned track, for example, is once again incredibly heavy, and although it features really a lot of breakdowns, they are so well-studied and integrated with the general mood of the song that they are a pleasure to listen to. \"The Final Curtain\" (a title perfectly fitting for the last track of the CD) ends the show in triumphant and haunting fashion, thanks to the sinister atmosphere created by the masterful usage of octave chords and dissonances.\n\nWhat else can I say? If you like deathcore this is an obliged listen; if you like extreme metal in general, this is a must; if you want to approach the genre or the band for the first time, this is a perfect place to start from. Combining and amalgamating their extreme metal influences with hardcore elements, both in the right measure, and infusing the whole lot with experience and maturity, Thy Art Is Murder have given birth to their best effort to date, and have finally found a unique and balanced sound. One of the top albums for the year 2017.\n",
        "\nSo ill be honest, I'm a big fan of core music. I'm also a big fan of traditional metal music. I like both worlds quite a bit. In both worlds from what I've seen, very little comes close to this behemoth of a record. With 11 tracks and a runtime around 40 minutes (37:28 according to Metal Archives) it's not too long of a record but not ridiculously short. Which is good, as non-core fans will be able to put up with this one. For the simple reasons i will state coming up later on. And 40 minutes is not a very long time.\n\nAs you can tell from the title this is my favorite deathcore album. This is heavy and it has breakdowns. It will hit core fans in their soft spots like usual. But this one highly appeals to non-core fans too. With technical guitars, sweeps, drum fills, guttural immense vocals. Very clear elements of death metal and not the usual hardcore aspect you hear in most core music. It's a breath of fresh air breathed directly into the deathcore genre. For the reason being that it's quite unusually technical and more organic than most deathcore albums. Which is really saying something considering all the hate the genre gets.\n\nSo whats good about this album opposed to their Thy Art's and other core albums? Let's start with the guitars. Gary Markowski is the lead guitarist for this band. It's sad that he was (reportedly) stealing from the band and got kicked out. Because his guitar playing is phenomenal. Amazing riffs, technical sweeps, ball crushing breakdowns and guitar solos. Very memorable ones. Sean Delander is working in the background as the Rhythm guitarist. Keeping things going as he should, and does a pretty good job with it as well. Neither seems to drag any of the songs down with really annoying breakdowns all over the place and instead makes them feel organic and sound good.\n\nNext the drums. The drums are good. Fast, blast beats and intriguing drum fills. Nothing too groundbreaking here, i'd say its more on the technical side of deathcore drumming. Again there are a ton of moments where the drumming sounds like death metal and not deathcore. So if you enjoy fast paced death metal or deathcore drumming, you will definitely enjoy this aspect of the album. As Lee Stanton obviously knows what he's doing on this record. Drumming is always on-point and doesn't ever feel like its out-of-place or not keeping a proper beat. \n\nThe vocals. Monstrous delivery by CJ per usual. The vocals of his seem to improve with each album. However he has something different about this album, and that is the brutal death vocals. (Check Laceration Penetration around the 2:17 mark) he doesn't seem to use these on other albums, if he does they are rare. You can find these a few times on this album. While others only once or twice for a very brief period. I for one really enjoy these. They go together well if they're placed carefully, and not an entire album sounding like this. In this case they're done well. Only problem being his pronunciation. Which a lot of people complained about, but got better with each release. \n\nSo whats bad about this album? Not much really, for a deathcore album there is usually a glaring flaw that's obvious to most people. Here there isn't much. But nothing is without flaw. The bass on this record is hard to hear. I always love to hear this bass on metal records whatever they might be. But here you cannot hear it well mostly due to how it was produced. Not that the production is bad per say. But it's just not the best. The production seems to enhance the guitars, drums, and vocals quite well. It just minimizes the bass because the other instruments just completely drown it out. Pronunciation is another issue with this album as I stated earlier. CJ is another thing. I like being able to understand vocals and I'm actually quite good at it I think. But with this record it is damn near impossible to understand his vocals unless you have the lyrics right in front of you. So unless you get picky about pronunciation or the bass not being very audible then there is really nothing bad about this record.\n\nGo buy it. It's their best and probably always will be. This is worth anyones time if they enjoy heavy ball crushing riffs, drums, and vocals. Which is really what this kind of extreme metal music is about. This album is a 95% for me because the bass is inaudible and the pronunciation is again as I said before quite lacking.\n",
        "\nQuite interesting that these three big label bands decided to put together a split. How unfortunate that the music itself isn’t really as interesting as the sole fact that this exists. Every band pretty much continues the sound of their latest effort on this record. There isn’t much that connects these tracks, except the fact that the lyrics are kinda grim. Let’s go in chronological order.\n\nThy Art is Murder starts the whole thing with their trademark “blackened deathcore” shtick, which is basically an inferior nu-Behemoth with breakdowns, marketed to a younger audience. Guitars plod away with slow, chordy riffs, usually accompanied by a faster percussion. The latter sounds extremely clicky, as if the engineer set parallel compression busses too loud. While this does indeed make the drums cut through, it’s annoying as hell. It doesn’t help that the performance isn’t particularly interesting, though capable. An OK track overall, with catchy lyrics. Even if it’s cliché, edgy and kind of try-hard, I like the rebloggable phrase “I’m not afraid to die, I’m afraid I’ll survive”. Satisfies the 16 year old scene kid in me.\n\nThe Acacia Strain is my favorite band of those presented on the split, as a whole of their artistic output, but here, they perform the worst. “Sensory Deprivation” is an extremely chuggy, mushy, slow, predictable, repetitive and boring track. Sounds like a reject from the Coma Witch album, which wasn’t all that great either. Their gimmick seems to be what sounds vaguely like doom metal mixed with their usual hardcore and a tidbit of death. A formula perfected on Gravebloom, but being in infancy on this record. There’s not much to say – this one blows.\n\nFit For an Autopsy come in with “Flatlining”, a touching, melodic number. It sounds similar to what Thy Art is Murder presents, but superior. The vocalist is far more versatile than any of the previous screamers, being the only one who can sing. His anthemic vocals might be off-putting with those with a low bullshit threshold, but I’ve come to like them. They could use more power, but have enough to keep me listening. All performers are capable, but I feel that they underplay on this. It could be all more intense. The composition sounds pretty, and it’s a shame that shyness puts it down. Production is weak, making the final breakdown underwhelming. I’d love to hear a re-recorded, re-imagined version.\n\nAnd the covers… Oh, the covers… I’ll comment this with a simple “roflmao”. I hope that this isn’t an honest effort from the bands, but something that the labels forced down on them. Simply, it’s cringeworthy. That’s not how you do it. Seems like something done just for novelty, as I can’t really hear the influence of any of the bands they’re covering in their music. Generally, good covers are a difficult thing to do. One of the rare examples I found well-done is The Future of the Past series by Vader. It’s best to pick something that’s at least remotely close to you in style. Deathcore bands aren’t famous for their imagination, so they should stay away from doing anything else than metal(oids?). Even when walking that familiar territory, they often manage to ruin it (just lol @ Carnifex covering Slayer), so I’m convinced that deathcore bands should just forget about doing covers altogether.\n\nProduction is terrible on about everything here, being completely unfit for a cover. These “efforts” are closer to parodies, akin to listening to Jared Dines or “Hammer Smashed Face” in major key. Can’t tell if there’s a hidden camera there somewhere. Needless to say, I thousandfold prefer the original versions to these early morning farts of record label executives suffering from hangover. Just listen to the snare on “Du Hast”. Every time I hear 2:42, my face turns into something in between an “X” and a “D”. Pop plomp bump bop. Is this Fisher Price? Who the fuck mixed this? Will Putney? Must’ve brought a kid for an unpaid internship, then fucked off for 45 minutes to eat avocado toast like Rick Rubin. Or was that tofu? Whatever. This record is just as tasteless as the latter, and would ruin your pockets like the former. Unless you’re a Californian millennial that eats, drinks and shits deathcore. Then you wouldn’t buy it anyway, because it’s up on YouTube. Skip everything sans the Fit for an Autopsy track. Feel free to skip that terrible Nine Inch Nails cover, too.\n",
        "\nThy Art Is Murder have come a long way in their career. Despite their generic beginnings on their debut EP, Infinite Death, they made a massive step upwards towards their tech-death inspired debut, The Adversary. Their second release, Hate, was unfortunately another piece of generic deathcore, but that was once again rectified on 2015's Holy War, which took the ideas presented on the predecessor and implemented more unique elements, the most prominent being use of ambient sections and more technical riffs. In a way, Holy War seemed to be that one album where Thy Art finally found their niche, establishing themselves as a standout band to lead the modern deathcore scene.\n\nAs one of the genre's most popular bands today, Thy Art attempt to defend their title with Dear Desolation. The first song release, \"Slaves Beyond Death\", proved to be a promising single that gave us some accurate insight as to what Dear Desolation was going to be all about. The song had a very similar sound to what was heard on Holy War, namely the title-track of that release, but with more focus on blast beats than breakdowns. As usual, drummer Lee Stanton has wowed me with his incredible precision, creativity, and double-kick patterns that rival many of his contemporaries (Aaron Kitcher, George Kollias, etc.). And of course, vocalist CJ McMahon triumphantly returns with his famous roars heard on Holy War. Many fans are disappointed to realize the abandonment of the deep, guttural gurgles of The Adversary, but I personally feel that CJ's standard mid-ranged growl works excellently, as it provides that higher level of aggression to match Thy Art's relentlessly brutal riffs and heavy-as-hell production.\n\nThe first half of the album is certainly the heavier side of it all, where most of the breakdowns and deathcore elements occur. \"The Son of Misery\" and \"Puppet Master\" are clearly all-out core songs, but nonetheless much more enjoyable than what you'd hear on newer releases from Whitechapel, Chelsea Grin, or older deathcore bands who're trying desperately to be the 'cool kids' again amongst the modern superstars (Slaughter to Prevail, A Night in Texas). Instead, Thy Art don't attempt to reclaim their old sound, nor do they try to sound like the modern-form. Rather than that, they've created a very unique style of modern deathcore that pulls influence from classic death metal bands such as Deicide, blackened bands like Behemoth, and classic 'almost-deathcore' bands such as The Red Chord. Now, this doesn't by any stretch make Dear Desolation a progressive album, and in no way is this classic death metal. But through very organized song structures and use of well-written riffs does Thy Art play a style that they own and boy, do they play it well.\n\nAfter the title-track and \"Death Dealer\", some of the more outside influences start to take prominence, in the same sense that Holy War was written. In this manner, it almost seems as if Dear Desolation is a sequel to its predecessor. Each song from track six to ten seems to increase in speed and technical-ness, while still retaining the atmospheric/melodic moments that add a special flavor to keep things interesting.\n\nThe real issue with Dear Desolation, however, it that it sounds as if Thy Art tried to hard to live up to Holy War. Through comparing the two albums, there hasn't been very much progression. More or less, this album seems to simply be a 'rearrangement' of the former. I very much enjoy the uniqueness of Thy Art's new sound, but in terms of their personal development, Dear Desolation is neither a step forward nor a step back. And it's certainly not nearly as technical as Holy War. The songs do tend to blur a lot, many of them unable to sound different than the last.\n\nIf this is truly Thy Art's permanent niche, I would love to see the deathcore elements decrease in the future. This is a band whose potential has existed since the beginning, and now that it's finally come to surface, their best option would be to continue to develop their style and possibly even grow out of deathcore. Dear Desolation is a good album, but in a way is kind of a placeholder. Not all the way there, but definitely a very good display of what might come to be.\n",
        "\nFirst off, their Infinite Death EP blew my mind back in the day. Extremely solid deathcore that was technical, catchy, and respectable, among the genre. Their first full release, The Adversary, was enjoyable. 2012 brought Hate, which was a step in the right direction for their sound to mature. Holy War was just not my cup of tea. Felt like like they hit a wall after Hate. Now that brings us to Dear Desolation. I totally respect them for trying to remove more the hardcore elements and refine it to more death metal sounds. Unfortunately they do not do it as gracefully or as interesting as, say Job for a Cowboy. Granted there is still one unabashedly deathcore moment in each song. Usually around the 3/4 mark.\n\nThe band is getting tighter together, which I really appreciate and are structuring the songs well, but for the most part their efforts end up rather bland. There are a few songs that stand out, but for the most part end up sounding generic and boring. Pretty much, they really seem to put most of their effort in the deathcore parts and float through a lot (not all) of the straight-up death metal parts. If they can learn to write interesting death metal sections, their next release will be a lot better, and much more appreciated by me.\n\nThe drums are varied in certain spots and tight when they need to be. The bass never comes out to play. The guitars chug and tremolo low. For the most part it's all pretty average. The vocals get annoying to me by the end of the album, though. Also, is that album art a lamb sucking a wolf's dick? Maybe it's supposed to be nursing, but it looks dumb, either way.\n\n\nBest Tracks:\n--The Son of Misery\n--Man is the Enemy\n--Puppet Master\n\nTechnical Skill: 35% Song-writing: 36% Structure: 54% Originality: 42%\n",
        "\nLet me just say that my deathcore library isn't as big as my death metal one, but Thy Art Is Murder, Make Them Suffer, Aversions Crown, and Winds of Plague are my favorite deathcore bands, with Thy Art Is Murder being my absolute favorite in the subgenre. Their albums are AWESOME, even though I'm mainly referring to Hate and Holy War, but this EP was terrible. Let me explain why.\n\nFirst, the cover art. It looks shitty, almost like the band was trying to be death metal. It's pretty cheesy with the creature on the front eating someone, since there are NUMEROUS album covers that display creatures of some sort, most of whom are brutally killing their helpless victims. (I'm looking at you, brutal slamming death metal.) The band logo looks awful, too. It definitely looks more brutal death metal than deathcore, but it's still one hell of an eyesore to look at.\n\nAnyway, on to the instrumentation. My GOD is it terrible. The vocals are just whiny high-pitched shrieks and I was literally about to classify this as screamo, the genre that is to blame for the common vocal stereotypes of metal in general. It sounds like a combination of Chuck Schuldiner with Vladimir (the former vocalist of Abominable Putridity) and with the pitch turned way up. Or it sounds like the screamer was using helium, but either way, it's a terrible flaw with the instrumentation. The guitars are EXTREMELY cheesy, employing the common deathcore riffing, but it's as if a 12-year-old was doing it. What a FUCKING DISGRACE.\n\nThe bass is in there, thankfully, but it's just as bad as the rest of the instrumentation and it doesn't save this piece of shit. The drums don't help either. Half the time, I'm laughing at how awful the drums sound, sort of like what I did on my review of the worst brutal death metal album of all time (*cough* Slaughterbox). The drummer was probably just bullshitting his way through it. Certainly sounds like it to me! The production and mixing are decent, and there are times where even though the overall instrumentation is shitty, it lines up pretty well, making it tolerable to listen to.\n\nOverall, I have NO earthly idea how this EP sold when it hit. It's a waste of potential in deathcore and every fan of Thy Art Is Murder should forget about this. I'm glad I don't really listen to this, if at all.\n\nRating: 2/10\nRating: 15/100\n",
        "\nIrony is something of a tricky beast, often manifesting itself in an album that inspires the same reaction as its namesake would suggest, though obviously not in the manner that said LP's creators had intended. One might chalk it up to the curse of success, but the sophomore outing of the Australian deathcore disseminating act Thy Art Is Murder did elicit something of a backlash in some quarters, perhaps owing to the exodus of guitarist Gary Markowski and the shifting role of Sean Delander from guitar to bass, which essentially revamped the band's entire arrangement. The result that coincided with these sizable shifts in personnel is an interesting one where the band's entire approach to balancing their style's death metal influences with the progressive groove quirks and hardcore ones has been inverted, which gives some clue apart from the commercial success that followed as to why there is a degree of hate directed at Hate.\n\nGetting past the bizarre visual that adorns this album's cover (essentially a three-headed demon answer to a SyFy channel monster movie featuring key alumni from the Police Academy franchise), the approach taken here is fairly impressive, albeit a bit stylized and stripped down compared the preceding works of these Aussies. Essentially the focal point of this new approach is the breakdown, resulting in something that is less chaotic and, at times, almost cold and mathematical in its demeanor. This isn't to say that the technical factor has been downplayed, as newly recruited lead guitarist Andy Marsh is actually a superior shredder to Markowski with a lot of Petrucci influences oozing from his concise yet auspicious solo sections, but rather that the pacing is a bit moderate in character as the blasting and thrashing segments are a bit less frequent and the production quality has a more processed character.\n\nThere are some clear moments of absolute brilliance contained within this largely well-rounded and formulaic endeavor. \"The Purest Strain Of Hate\" shares a greater degree of stylistic affinity with the more chaotic feel of The Adversary and has more blasting moments and ornamentation during the breakdown points, although it starts on a decidedly mid-paced stomp. \"Dead Sun\" and \"Gates Of Misery\" are arguably the closest to full out forays into death metal brutality, forgoing any atmospheric intro or grooving prelude and launching right into overdrive with riff that would be reminiscent of Slayer if it were not so heavily down-tuned and obscured with brazen machine gun drum work. Much of the remaining work found on here tends to hover more in breakdown-happy territory where climax points are a bit more measured, but out of said pack \"Immolation\" stands out as the most unique and gripping, due to a greater depth of atmosphere thanks to some tasteful keyboard usage and a masterful display of virtuoso guitar soloing out of Marsh over one of the few overtly thrashing sections of this entire album.\n\nTo a degree, the hate that this album received among fans of the pre-2012 version of Thy Art Is Murder is understandable given that this is a pretty pronounced departure. However, while the author of this review prefers the wilder and more ephemeral character of The Adversary, this is a rock solid album that makes the most of the plainer and more streamlined approach to deathcore that is, admittedly, far more popular and manages to throw in enough technical twists to keep things interesting. Often times this style is dismissed as a canned version of extreme metal reserved for hacks who splice together a lot of differing ideas in a random order with hopes of appearing progressive despite have little technical prowess, but Hate is a bit different than the typical Whitechapel or early Job For A Cowboy album and takes an admittedly contrived formula and spices it up quite nicely. Nevertheless, it is a fairly predictable listen from start to finish that would have been more of a trailblazer had it been recorded four or five years earlier\n",
        "\nWhile still remaining a deathcore band, Thy Art is Murder made drastic sound changes between Infinite Death, The Adversary and what I'm reviewing right now, Hate. They started out as average Suicide Silence worship with Infinite Death and moved to a more technical death metal based sound that was reminiscent of bands like Cryptopsy and Necrophagist with The Adversary. However, with Hate, while they are still technical, they went with a completely different sound that I'm going to explain now.\n\nThis album has a pretty dark and evil atmosphere to it that I enjoy and I think they pull it off pretty well, especially on \"Vile Creations,\" \"Shadow of Eternal Sin\" and \"Immolation.\" The riffing on this album is less technical than on The Adversary, although it's still pretty technical as it is. The riffs are more groovy this time around than they were on The Adversary and there is also a good amount of chugging. I generally prefer the riffing style on The Adversary, but the riffs on here are pretty awesome as they are. The soloing on here is on par with The Adversary, which is definitely a compliment because that album had amazing soloing. It's the drumming on here is more or less the same style, with lots of blast beats, double bass and fills, but it's still pretty damn impressive. Unlike The Adversary, there is actually a lot of breakdowns on this album. Every song has at least 3 breakdowns, aside from \"Dead Sun\" and \"The Purest Strain of Hate\" which only have 2 breakdowns. Some of the breakdowns are kind of long (also unlike The Adversary, which has pretty short breakdowns that end before they get boring), like the first one in \"Reign of Darkness\" and the first breakdown in \"The Purest Strain of Hate\". However, I find the breakdowns to be very enjoyable and they manage to keep them interesting, except for the first breakdown in The Purest Strain of Hate, which is really boring.\n\nEven though I enjoy The Adversary more than this album, I will admit that there are a couple of advantages this album has over that album. The production on this album is better. This album is ridiculously heavy, heavier than The Adversary. The vocals have also improved, having a bit more power behind them than before. CJ McMahon, already being a really good vocalist, sounds even better here. While screams aren't as common as before and he uses growls more, the screams are still there. He also doesn't do nearly as much double-layering as he does on The Adversary. I would've actually liked to hear more double-layering on this album, as I really enjoyed hearing that, but oh well, it is what it is. There are also a few instances where CJ does some style of shouting, like on Reign of Darkness and Infinite Forms, which sounds pretty cool. There are also some guest appearances from the vocalists of War from a Harlot's Mouth (Dead Sun) and The Amity Affliction (Doomed from Birth). These are the only times I've heard these vocalists and I don't feel like I would enjoy these vocalists in their own bands or any other cases (I'm not normally a fan of the style of vocals these vocalists use), but oddly enough, I actually enjoy them here and they go well with the instrumentation. These guest spots actually give me chills whenever I listen to them.\n\nThe lyrics here are pretty cool. The lyrics are mostly talking through the first person point of view of a demonic being from Hell, which I think is pretty interesting. There are also some instances of nihilism, such as \"I can't wait to die\" at the end of Dead Sun and the chorus in Doomed from Birth.\n\nOverall, while not quite as enjoyable as The Adversary, this album is pretty damn awesome as it is. This album was definitely a grower for me, as I didn't think it was that great when I first heard it, but now I absolute love it. While it's still my least favorite out of all of Thy Art is Murder's full lengths, that's not saying anything bad at all.\n",
        "\nWhat a hell of an album! Prior to this, Thy Art is Murder was a band that I found good, but not great, with The Adversary being an exception that I hold to a higher regard. When I heard that Holy War was announced, even though I wasn't the world's biggest fan of these guys, I was still moderately excited, since I still liked them. But when I heard the single \"Light Bearer,\" my excitement raised TREMENDOUSLY. I loved that song and found it better than anything off of Hate (my opinion on Hate has raised since the first time I heard this album. While I like Hate more than I used to, I still think Light Bearer alone is better than a good amount of the tracks on that album). Now that I heard the whole thing, Thy Art is Murder brutally raped me with this album. I was actually wanting this album to be The Adversary Part 2. Did I get what I wanted? Well, no, but I still love this album and it did more than just satisfy.\n\nOut of all the sound changes Thy Art is Murder went through, this one is not very drastic. If anything, the style is similar to Hate. But I personally believe that with this album, they improved on the formula they used on Hate for the most part. The darker atmosphere is still here, but I find it more effective this time around. Hate was already a ridiculously heavy album, but they managed to increase the heaviness here. There is still some groove on here, but it's lesser in this case. The instrumentation is more technical than it is on Hate and while it isn't exactly as technical as The Adversary, it's up there and still pretty damn impressive. The riffing and stuff is normally fast or mid-paced, but there are slower sections on this album too. While there is definitely still chugging, it isn't as much as you'd probably expect. There are some great solos on here. In my opinion, the solo in the title track is the best solo the band has ever recorded. The solo is melodic, beautiful sounding, atmospheric and really chilling to me. There are also a few clean guitar segments that sounding really beautiful and cold, like in \"Emptiness\" and \"Naked and Cold.\" The drumming is kind of what you'd expect from a deathcore band (a lot of blast beats, double bass and fills), but the drumming is fantastic for what it is and Lee Stanton is an extremely talented drummer. The number of breakdowns is reduced, but all of the breakdowns on here are insanely crushing (the breakdown at the beginning of \"Fur and Claw\" being a personal favorite of mine) and there aren't any breakdowns that I feel overstay their welcome. \n\nCJ is an amazing vocalist who has a wide range, but honestly, the vocals are the one thing I actually think that Hate has a general advantage of over Holy War. It's not that the vocals have lost any sort of power this time around, because they haven't, but it's the fact that despite his range, the vocals on this album are mostly just mid-ranged growls. His high screams are nearly absent and while the lower growls are used a bit more often than the high screams, they still aren't nearly as often as the mid-ranged growls. However, when he actually does highs and lows, they sound fantastic. I would've liked if there was more vocal variation on this album (especially more high screams), but since I love the sound of CJ's mid-ranged growls, it's not something that bothers me and it's not something I feel is worth deducting points for.\n\nIn terms of lyrics this time around, they've decided to write about things that are currently ruining the world, such as animal cruelty (Fur and Claw), religious bullshit (the title track, \"Child of Sorrow\") and corrupt political leaders (\"Deliver Us to Evil,\" \"Violent Reckoning\"). I feel that these lyrics are their best yet and are more mature than on their previous albums (not that I think their previous lyrics are bad, but still). The title track and Child of Sorrow have anti-religious lyrics, but they're done in a more mature fashion here than they are on The Adversary. In those songs, they're talking about the types of horrible, unnecessary horseshit religion causes, like holy wars (bad pun intended) whereas on The Adversary, in short, they were basically just saying \"hail Satan, fuck Jesus.\" The lyrics are even better when you hear them through CJ's delivery. Reading them on their own, the lyrics are already chilling, but when combined with CJ's vocals, it just adds to it.\n\nOverall, this is a fantastic album and I believe it to be the best deathcore release of 2015 (hell, the only album of last year that stops it from being album of 2015 on my list is the Black Dahlia Murder album that was released that same year). Sadly, around the end of 2015, CJ left the band and the music business in general. However, I am glad that they released this album before he left the band. I hope that the next vocalist that joins the band is a great one and that they continue to release awesome music.\n",
        "\nHate is one of the few deathcore albums I have had the pleasure of enjoying. Being a lover of demonic growls, there really isn't much I could say against deathcore as a genre despite the fact that it is well, core, and some other bands under that label have done a piss poor job. But on Hate we immediately see what Thy Art Is Murder can bring to the genre.\n\nHate immediately bombards us with a demonic veracity that blasts your speakers with hellish brutality. Vocals are astoundingly deep and demonic and pack a real punch, the band did right in signing this new vocalist because his growls are enviable. The lead singer does an incredible job, vocals are aligned well with the guitar and drums and flow smoothly. Many songs utilize the vocalist's fantastic growl range; able to switch from satanic bellowing to demonic shouting at a moment's notice, with some unclean vocals sounding like borderline metalcore shouts (This is deathcore after all). The guitar simply lingers in the background, playing the same riff at different pitches in almost every song and is mostly just background noise. There are a few solid moments when the guitar gets time to shine and it can be a welcome change to the drum and growl routine that permeates the majority of the album (and breakdowns in general). The real winner here is the drums, which slam away perfectly in tune with the vocals and guitar. Standard deathcore drums are present with your typical blast beats in tow as well. Production quality is excellent and overall the band is saved by their vocalist, otherwise many songs are boring and really don't change anything up from track to track, but if you're looking for something to mosh too or need some death growls in your life, this album cuts it.\n\nReally this whole album is just good mosh material, and I imagine the band mainly gets its kicks out of live shows. The whole album basically sounds like a giant breakdown section, so if you like those ultra heavy breakdowns from metalcore, you found the right band. Reign of Darkness is a great single, and really has some awesome moments that are pulsing with anger and brutality, any fan of death metal or growls will feel right at home. Besides the singles, the album really starts to let down in quality. Every song is just a similar sounding version of the last, but this isnt horrible. Thy Art is Murder nails the deathcore sound well, although some variety is desired, it is not necessesary, and we are delivered a well done album, as far as deathcore goes.\n",
        "\nOh, Infinite Death... The debut EP for the Australian deathcore band we all came to know and love known as Thy Art is Murder. I personally love Thy Art is Murder and I think they are one of the best bands in their genre. Sadly, this was not always the case...\n\nInfinite Death is just an okay EP. They started out as some good, but just average at best Suicide Silence worship on this release. The vocals are one of the reasons why. Brendan van Ryn's vocals don't sound exactly like Mitch Lucker's. It's not too hard to tell that this isn't Mitch Lucker doing the vocals, but it's also not too hard to hear a bit of influence. I think Brendan sounds like a suffocating witch when he screams, but oddly enough, with that comparison, I don't think his screams sound that bad. They're actually decent and I can find more enjoyment in them than most people can. His growls are nothing you never heard before, but they're decent enough for what they are. He did pig squeals on the demo they released a year before they released this and thankfully, they're not used here.\n\nThe lyrics, for the most part, are misogynistic, except for \"Breeding Bacteria,\" where Brendan is talking about how much he \"hates humanity in general,\" not just how much he \"hates women.\" There is also \"I'll Show You God,\" which isn't just talking about killing women but also how \"God isn't real.\" I find the lyrics to be decent and I don't mind that they are what they are, except for four exceptions. One exception is \"look in my bloodshot eyes and feel the presence of Hell\" from I'll Show You God, which I think sounds pretty awesome. The other exceptions are \"you bitches gonna get it\" (Whore to a Chainsaw), \"humans shouldn't fucking breathe, they steal my oxygen\" (Breeding Bacteria) and \"wash my feet with the moldiest blood from the dirtiest one\" (Parasitic Autopsy), which all sound silly and unintentionally hilarious. The line I just mentioned from Parasitic Autopsy sounds like something a 5 year old would say if they attempted to write gory lyrics. I can see why some people hate the lyrics due to how misogynistic they are, but I don't really mind them.\n\nI said earlier that this album is average Suicide Silence worship. The riffs are another reason why this is. The guitar riffs are very Suicide Silence-esque, except they are more technical while Suicide Silence's riffs are pretty simple. If these riffs were more simplified, they wouldn't sound out of place on The Cleansing. It's a lot of chugging, which is common in deathcore, but they are decent for the most part. This record is devoid of solos, so don't expect to find any here. The drums are very good. The drummer can go pretty fast and he can do blast beats and double bass with no trouble. He slows down at some parts and still puts on a very enjoyable performance. There are also some solid fills, like the one at the beginning of I'll Show You God and the one before the second breakdown of Whore to a Chainsaw. Then there are the breakdowns, which I think are the worst aspect of the instrumentation. There are a lot of them too. I think there are some pretty great ones like the final breakdown in I'll Show You God (even though it's kind of long), but there are also boring breakdowns like the first breakdown in Whore to a Chainsaw (due to how the guitars sound, this one is also pretty annoying), the \"BITCH, YOU'RE DEAD!\" breakdown in the same song and the long, boring breakdown at the end of Breeding Bacteria. The guitars are also doing slams during some of the breakdowns, like the final breakdown of I'll Show You God. I'm not going to mention anything about the bass because my ears cannot detect it.\n\nSo overall, Infinite Death is a decent EP, but it's nothing special. It's nothing I'd come back to and if I do, it's not going to be very often. I did come back to it today and this wasn't only because I like the music (which I do), it was also for the sake of writing this review. I didn't like it anymore than when I first heard it, but I didn't like it any less either. Thankfully, after this EP, Brendan van Ryn is no longer in the band and they get a new, far better vocalist by the name of CJ McMahon. When he joined, they moved far away from the technical Suicide Silence worship and they released two deathcore masterpieces known as The Adversary and Holy War (I know they released Hate in between these albums, but I don't like that album enough to rate it that high), which contribute to why I love this band so much. Chances are, if Brendan was still in the band and they continued releasing stuff like this, I'd probably still like Thy Art is Murder but not as much as I do now. My favorite song from this album is probably I'll Show You God or the title track.\n",
        "\nOf all the TAIM releases, The Adversary easily takes the cake. This is one of the most brutal and technical albums you could ever find. Deathcore and even death metal fans alike would praise this album. And as much as I love Infinite Death, changing the style and direction of the band was a great decision.\n\nFirstly I'd like to go to my favorite part, being the guitars. The riffs are absolutely evil as fuck and there are plenty of solos and sweeps employed in EVERY song, excluding the intro. They aren't being technical just to show off, but they are showing what they can do to fit the style, and the result is outstanding. As far as I know, all the guitars were written by former lead guitarist Gary Markowski, who in my opinion was a pure genius. The sound and style he had in mind worked perfectly. I was sad to see that he wasn't in the band anymore, because I highly prefer the sound of The Adversary over the sound of any other of their releases, mainly Hate.\n\nSecondly, the vocals are just as crushing and were most definitely a major part of the album. CJ's vocals sound monstrous, powerful, and sickening. His highs are full of rage and ferocity, while his lows are deep and full of anger. He also occasionally uses deep gutturals which aren't used quite as often but still maintain the same amount of power as his other vocal styles.\n\nNext is the drums. Considering he was the youngest member of the band, Lee Stanton proves himself to be one of the fastest, and most consistent drummers in metal. The incredible speed he utilizes and his constant blast beating is very impressive. He also pulls off some very fast double bass kicks. Even if he wasn't so young, I'd still be just as impressed with Lee's drum work. His drums beats hit extremely hard and absolutely crush whenever they come. \n\nSadly, there is no bass to be heard on this album, which is a shame because having bass would make this album even better than it already is. CJ also tends to do lows more often and sometimes not fully utilize his range. Another minor con is that all the songs seem to have the same general structure and pattern, and tend to be repetitive. Usually an just blast beating, vocal lines, breakdowns, and solos. That's not to say that it is bad however, it is all amazing, but the songs could be a bit more varied, that's all. Speaking of breakdowns, there are half as many on this than on your average deathcore album, and when they come, they absolutely fucking deliver. The intensity in the drum hits and the heavy tone of the guitar fits perfectly together. There are some songs that are more memorable than others because certain songs are just more appealing. For me, the first six songs are all fantastic, I get a little bored around the next three songs which are overall just less interesting but still very solid, don't get me wrong. And the final two tracks end the album off perfectly. One being a powerful instrumental which pumps you up for the final track.\n\nAll in all, TAIM put out nothing but a solid, amazing album with a ton of effort, talent, and hatred poured into it and out came one of the best deathcore albums to exist. I wish they held onto this sound because it puts everything else to shame. They improved very well after Infinite Death and I was hoping they'd improve even more afterwards. Still, this album is a work of art, and is very underrated. Out of all the TAIM albums, this album is given the least credit and is looked at a lot less than their other records. If you love technical or melodic death metal like The Black Dahlia Murder or The Faceless, then you will probably like this just as much minus the breakdowns. If you are a fan of deathcore, you will love this album no matter what unless you prefer very simple, more chugged deathcore.\n",
        "\nThy Art is Murder is a band that I find to be good, but not great. Infinite Death is okay. Hate is good, but not great. However, The Adversary, the record I am reviewing right here is downright awesome. I would even go as far as to say it's perfect. I can't find anything about this album to complain about. It tops Infinite Death and Hate by a long shot. I think Hate is a bit of step down, but it is still a good album nonetheless.\n\nAs you can see, they got a different vocalist on this album. Brendan van Ryn, their previous vocalist, left the band. I'm kind of glad. Brendan is a decent vocalist but CJ McMahon, their current vocalist, is so much better. I think CJ is one of the best vocalists in the genre right now (not the best, but one of them). He makes Brendan look like a 9 year old. The vocal styles CJ uses on here are growls, screams, screams layered over growls and gurgles a couple of times on \"Laceration Penetration\" and \"Engineering the Antichrist.\" All of these vocal styles sound awesome and don't give me anything to complain about.\n\nThe guitars are pretty technical with interesting and memorable riffs. They are fast and there are also guitar solos which I personally enjoy. The bass, as expected, is inaudible. Then again, this is deathcore. This shouldn't be a surprise. I've gotten used to inaudible bass and it really bother me. The drums on here are triggered but they are pretty solid. They are fast and powerful with blast beats and double bass. Since this is a deathcore album, it is obvious that there are breakdowns. However, you're wrong if you were expecting a shit storm of them. There are breakdowns in every song but they aren't frequent. This album has more riffs than breakdowns. The breakdowns that do occur are great though.\n\nNot only is CJ a better vocalist than Brendan but he is also a better songwriter. I didn't mind the misogynistic lyrics from Infinite Death. I found them alright. But I prefer the anti-religious/Satanic lyrics on here (the track off of Infinite Death known as \"I'll Show You God\" is dealing with anti-religious topics but still. The lyrics present here are better). These lyrics interest me more than those of Infinite Death. If you're someone who happens to enjoy anti-religious or Satanic lyrics like I do, then you will like these lyrics. The album gives off an evil vibe that I happen to enjoy. The evilness of this album makes me want to worship the almighty horned one and burn down every church on the planet (well, not really. But you get what I mean).\n\nSo overall, this album is amazing with brutal vocals, solid drums, fast and memorable guitar riffs, great breakdowns, interesting lyricism and an evil atmosphere. I would recommend this album to deathcore fans (more specifically fans of bands in the genre like Whitechapel and Carnifex) and even more open-minded death metal fans. It gets a score of 100/100 (10/10) from me. Standout tracks for me are Laceration Penetration, Engineering the Antichrist and Coward's Throne.\n\nOh, they are also releasing a new album this month called \"Holy War.\" I'm actually excited for that album and I want it to be awesome. Though I hope that for that album, Thy Art is Murder makes it sound more like The Adversary than Hate.\n",
        "\nAlright, time to hate on some Hate. This is fucking excruciating. I must say though, I liked this band for a while. I had that 2 month phase of swagging around with my snapback and Whitechapel shirt, thinking that TAIM was actually cool. After the 2 month phase, you begin to think otherwise. This is one of my most noted chuggy chuggerfest bands out there. This list includes Whitechapel, Emmure, that kind of shit. This band to me is just like Carnifex. You want to respect them for a while, but you have to work with what you're hearing. This whole album is just one of those \"Rage, uh, I'm mad\" kind of albums. It's a \"djent-chug-hack-slash\" album through and through. I saw these guys at a concert, and it is what you would expect. Pencil thin guys with fucking gigantic gauges and Asking Alexandria tank tops. They moshed hard, but does that really make up for being a complete tool?\n\nYou can't say these guys have degraded too badly though, they've seemed to always be like this. I just can't accept or respect the lack of effort I hear. These songs appear to have structures you would make up in like 2 and a half hours. The solos are mediocre, but I never expect mind-blowing solos from deathcore bands. I also hate the special appearance from the fruitcake in The Amity Affliction. TAIM are just injecting more mediocrity into their blend of mediocre, time wasting shit. Don't buy this, because if you buy this, I will respect you as much as I respect the people who bought Whitechapel's Our Endless War. The only reason this is getting 2% is because of the cover art. It makes it look awesome until the music reaches your ears. This is similar to Annotations Of An Autopsy's method. Thy Art Is Murder is a dime a dozen band that proves time and time again to make dime a dozen deathcore. This album is worthy of nothing, and all copies need dropped into a pit of fire, or into some \"Hate-Mosh-Kid's\" DC backpack. Sad excuse for music by a saddening deathcore band.\n",
        "\nI have been a fan of Thy Art Is Murder for a few years now. I chanced upon this album quite unexpectedly in a JB Hi-Fi store recently. I had to get it, as its becoming increasingly hard to find the early releases of these young deathcore bands. Enough ranting, though.\n\nTo fully appreciate Infinite Death, as an album you have to break down all the parts of it and rate them as individuals.\n\nThe vocals in Infinite Death are definitely derivative, being relatively similar to Suicide Silence, Chelsea Grin, and even Whitechapel at times, but nonetheless, I really enjoy Brendan's enthusiasm and passion in his vocals. It's evident that he gives it his all, really screeching into the microphone when he sings, but of course judging on enthusiasm alone is cliché. Brendan has shown that he can support a few different styles of vocals, ranging from high- pitched screams to guttural pig squeals, however in Infinite Death, Brendan's pig squeals are completely absent (apparently being a feature exclusive to the track This Hole Isn't Deep Enough For The Twelve Of You). I like Brendan's vocals, however. They do sound derivative, but I won't deduct any points from the overall score as it is very difficult to bring something new to the table in terms of metal vocals.\n\nThe guitar work in Infinite Death was very impressive. The line-up for Infinite Death featured Josh King as the bass and Sean Delander and Gary Markowski as rhythm. Josh King definitely contributed a lot to this album and I was disappointed to see him (and Brendan) vanish from the metal scene after the release of Infinite Death. The bass wasn't overpowering, but definitely gave the album a very consistent and well-paced feeling. Gary Markowski and Sean Delander were pretty much accountable for the majority of the band's overall brutality, performing catchy and very technical breakdowns that were overall just fun to listen to on repeat.\n\nThe drumming in Infinite Death (and all of Thy Art Is Murder's releases) is the only feature that I've heard consistently praised for its quality and brutality. Lee Stanton is the only drummer Thy Art Is Murder has seen since its founding. Its no mystery why, either. Lee has consistently shown that he can perform both slow, mid, and fast paced drumming, which is one of the things I enjoy most about Infinite Death. In the title track, 'Infinite Death', the drumming is performed at a fast, almost frantic speed save only for the few breakdowns scattered around, but the drumming slows down the pace dramatically in songs such as 'Whore To A Chainsaw' and 'Parasitic autopsy'. He definitely gives the band a brutal and diverse set of sounds.\n\nThe one potential (POTENTIAL) flaw of this album were the lyrics. I wouldn't go so far as to call them contrived, however they did seem very overly misogynistic and misanthropic. I wouldn't say that this kills the band's credibility (as I found the lyrics humorous and even quite enjoyable at times), but it definitely gives people who dislike deathcore more of an ability to type cast Thy Art Is Murder as 'gay-ass screamo garbage'. How I detest people with so little insight, but it is true that Thy Art Is Murder definitely fell awfully close to bands like Whitechapel, Chelsea Grin, The Black Dahlia Murder, and The Red Shore, lyrically.\n\nMy personal favorite song of the album was 'Whore To A Chainsaw', being the first song I heard (and the one I use to shock my pop-listening female friends with), but I found it catchy and the end breakdown very fun.\n\nI greatly enjoyed Infinite Death and would recommend it to any deathcore listener.\n",
        "\nWhenever I feel like ripping something to shreds I turn to Thy Art is Murder, and lets face it, they always deliver. This Australian band is one of the worst deathcore bands I've ever heard, and although The Adversary is being lauded as a commendable deathcore release I personally don't see it. Okay, so it's not as annoying as Infinite Death, they got rid of the old vocalist and hired a new one so it seems like they're actually trying to do something with their sound. There's far less random technical noodling on display here which would be a good thing if the rest of the music was actually, you know, interesting. \n\nThe Adversary is boring, unbearably so. Songs follow the same structure, there's an abundance of breakdowns and palm muted riffing. Vocals are tolerable, the high screams are thankfully more bearable than those found on Infinite Death, but they lack character and sound weak. The low growls have more power behind them but they too lack character, he sounds like plenty of other deathcore vocalists and he adds nothing to the music. \n\nVocals are never the most important aspect of an album, so I'll focus on what matters the most; the instrumentation. The guys in Thy Art is Murder can handle their instruments well, that's pretty obvious, but they can't write cohesive material at all. Breakdowns are placed frequently and randomly within the music, there's no flow between each riff with each transition being rough and unpolished. The lead work ranges from technical leads, solos to palm muted riffs. Each one is uninteresting. The technical leads are well written enough but each one sounds the same, there's no variation between each riff and thus the whole album blurs together. The breakdowns are by far the worst part of this album, being frequently used, they add nothing to the music and make me hate it a whole lot more. There's easily more than 2 breakdowns each song, always popping up in the most predictable places. That sums up the whole album perfectly; predictable. Each song follows the same format of technical lead, breakdown, solo, another breakdown, rinse and repeat. \n\nNot much of anything happens on The Adversary, the riffing is diluted and sterile, vocals lack character and the breakdowns are among the worst I've ever heard. Infinite Death was atrocious but at least it had more character than The Adversary. What this is is a pathetic attempt from a band trying to gain some credibility after releasing an absolute shambles of an ep and completely failing in the process. The fact that I've reviewed this album means I've listened to it all the way through, twice in fact, and I will never forgive myself for that. Avoid at all costs.\n",
        "\nGood lord, I've heard some poor music in my time but this just takes the cake. Thy Art is Murder are one of the worst deathcore bands I've ever heard and Infinite Death sums up everything I hate about them perfectly. The music is a mess, with completely random technical fills which don't fit at all in with the context of the songs, there's way too many breakdowns and the vocalist is horrific. And although I wish I could leave the review at that, the rules require me to expand further so here goes.\n\nInfinite Death is bad, really bad, the guitarists play a series of completely random technical fills with no structure or thought put into them with an over abundance of breakdowns. Breakdowns in themselves aren't inherently a bad thing, some bands pull them off better than others and when done right they can compliment the music. However, breakdowns need to be used sparingly and the band needs to ensure that they're kept interesting enough to prevent the music from becoming monotonous. When much of your music is comprised of breakdowns however, then the whole point of them becomes lost. The technical leads are laughably bad, there's too much sweep picked lines that don't mix well with the context of the music which is incredibly simple despite what others might say. The guitarists can handle their instruments I'm not denying that, but there's a difference between being good musicians and being good song writers. The technical musicianship doesn't seem to exist for any other reason except for the fact of showing off.\n\nSimilar to every other deathcore band on the freaking planet, this gets boring, and fast. There's no variation between songs, each song follows the same formula of technical lead followed by breakdown; rinse and repeat. The vocals are beyond awful, whilst the low growls are competent enough, they lack character and sound weak. The highs are really what bring it down, they're incredibly whiny, annoying and when mixed with the ridiculous lyrics it becomes comical. Unfortunately, the music is highly vocal driven with them leading the music much of the time, as is the case with Whore to a Chainsaw. \n\nWith deathcore, I try not to hold it to the standards I hold other music to and thus I have very low standards for this kind of music. I try not to get worked up about deathcore because the very nature of it prevents me from taking it seriously. By deathcore standards Infinite Death is bad, it follows the usual formula but does it in a way that is much worse than what other bands have done. It's like Suicide Silence for a number of reasons, the vocals are similar, with Brendan trying to recreate the distinctive high screams of Mitch, and the lyrics seem to deal with typical subjects. The musicianship is certainly more technical than the aforementioned band but it's also a lot worse, the music is nowhere near as catchy with Thy Art is Murder struggling to write anything that can be called cohesive. If I hold this to the same standards I hold to other music then this is pretty much the worst thing ever, there's no coherence, guitarists don't know a lick of musical theory and just play whatever, vocals are grating and the lyrics are obnoxious as hell. There's really nothing to enjoy about this, and although it's a deathcore by the numbers release, they manage to make it a whole lot more annoying than what I would have thought possible. Avoid at all costs.\n",
        "\nLet me make one thing clear about this right from the start: Thy Art Is Murder have not abandoned the style of The Adversary in favor of copying Emmure, as some would have you believe. Hate does not solely consist of chugging, neither does it include any of the new-metal antics that have made Emmure famous. \n\nWhile Thy Art Is Murder started out as somewhat of a Suicide Silence ripoff and were only able to emancipate themselves with the more tech-death approach of The Adversary, Hate arguably sees them partly returning to their roots - yet this is not actually fully owed to the songwriting, but rather to the overall production of the album. The technical death-metal riffing is severely overshadowed not only by the very frequent use of breakdowns, but also by the extremely loud drums. The sounds of the snare drum in particular would fit some moshcore band a lot better than Thy Art Is Murder's brand of technical deathcore.\n\nYet the overtly modern production is not the only huge difference between Hate and its predecessor. Where The Adversary was strongly focused on memorable guitar riffs as hooks, Hate is focused on memorable vocal patterns as choruses. This goes hand in hand with most of the choruses focusing on groove rather than strong riffing, which is a trait common among many deathcore bands. Breakdowns are used as choruses and vice versa. While not necessarily a bad thing, this approach has Thy Art Is Murder's music lose some of the edge it had on The Adversary. The songwriting on Hate always leads to the breakdown/chorus and as such is a lot more tightly arranged, which may be the factor why the music seems to lack in ferocity.\n\nStill, Hate is not a bad album. Yes, it is at least slightly reminiscent of a dumbed down version of The Adversary. But on the other hand, it is a very potent album when it comes to simply venting anger and frustration, meaning that it was very much written for a live environment. Songs such as \"The Purest Strain of Hate\", \"Reign of Darkness\" and \"Defective Breed\" are focused on functioning during live shows, meaning that the \"extra baggage\" that its predecessor featured with its immense amount of technical riffing simply would not do in this case. While The Adversary was the more interesting and versatile album, Hate still measures up to its title and does it more than satisfactorily.\n",
        "\nThy Art is Murder, a technical deathcore band from Sydney, Australia, gained much exposure and critical acclaim with their debut EP “Infinite Death”. And I must ask: “WHY?!” This EP fails at a lot of things it tries to do, and while there are moments I find tolerable, this whole thing is just a mess.\n\nI have pretty mixed feelings about the musical aspect of the EP. The actual riffs here are actually pretty decent. They're groovy, catchy, and have some pretty nice leads, too... well, not the needless technical wankery (I'll get to that later), but the actual melodic passages that help add a little bit of memorability to the riffs. Unfortunately, they just had to ruin it by adding a breakdown every 30 seconds. As an example, let's use the 2nd track “Whore to a Chainsaw”. It begins with a pretty neat intro riff. It's heavy, groovy, and has some pretty good hooks... and then it transitions into a monotonous and poorly executed breakdown. From there, it's decent riff, breakdown, decent riff, breakdown, rinse and repeat. Not only that, but on every breakdown on this album, they try to add “substance” to them with random sweeps and other technical wankery. I feel the guitarists are just adding in these licks for the sake of showing off. WE GET IT! You're technically proficient on the guitar. Now try to add some intricacy and emotion to it.\n\nThe bass is inaudible aside from the drops that transition into the breakdowns, so let's just skip that.\n\nThe drum work here actually isn't that bad. Lee Stanton actually adds some pretty neat fills and rhythms (as opposed to spamming blast beats) to save the music from being completely boring. Unfortunately, he always ends up playing a breakdown after 30 seconds, so his performance is still quite monotonous.\n\nThe two biggest flaws, however, both have to do with the vocalist. Brendan Van Ryn's voice is quite awful, even on the demo, which was pretty decent for a generic deathcore release. His lows are not too bad, but they sound too forced and lack emotion. His highs have a little more character, but goddammit, he sounds incredibly whiny. He sounds like Alex Koehler on helium. His lyrics are also quite bad. They are awfully misogynistic. It could have been a decent concept, but the writing was so awful for these lyrics that it comes across as the diary of a teenage boy who was fucked over by a bunch of his exes. If anything, I'm glad Brendan left the band. Chris “CJ” McMahon is the superior vocalist by far.\n\nOverall, it has some decent moments, but those become quickly overshadowed by the high number of breakdowns, the needless technical wankery, and the god-awful vocals (not to mention the lyrics). If you're a scene kid who likes music that deals with teen angst that somehow also likes decent guitar riffs and lyrics about gore, then this is the EP for you. Otherwise, stay the hell away from this garbage.\n",
        "\nIf you like Slam/Brutal Death Metal or Deathcore this is definitely a must album to listen to. If you're a fan of Devourment or Rings Of Saturn this is definitely an album for you, it has technically brilliant riffs and solos, brutal vocals and superb drumming (minus the triggers). The album doesn't have the atmospheric qualities found in their later album 'Hate' but it does have redeeming technicality and original song writing. If you come to this album to look for quality lyrics, you're in the wrong place. The lyrics in my opinion are \"try hard\", they don't have the brutality found in most Death Metal, and don't have the typical Deathcore lyrics but a failed mix up of both. But who here cares that much about lyrics? Certainly not most of us Brutal Death fans!\n\nAdding a new vocalist was one of the best decisions the band made, they are now brutal as all fuck with some of the best highs and lows found in Deathcore. Some of the over laid vocals work, but than some don't and become to much at once. I feel as if the vocals have had some heavy effects put on them. The song writing is a lot better than on the previous music and is not as repetitive as on their latest album. The guitars blaze through the album with insane riffs and have some beautifully melodic yet technical solos that show that not all Deathcore bands are just Chugga Chug. The drumming is awesome but some of the triggers let it down slightly, sadly the bass guitar isn't prominent enough and takes a back seat compared to the rest of the instruments. \n\nIn comparison to their older work it is definitely a major step up and the album can be appreciated by Death Metal and Deathcore fans alike. Sadly only one track stands out to me and this is 'Cowards Throne', the rest of the album to me is great but personally none of the other songs are as memorable as this one. The breakdowns in the album are tasteful and brutal, unlike quite a few of the Deathcore bands out there now. The album gets stale and most songs are very boring in comparison to a lot of other Brutal bands out there.\n\nI personally prefer 'Hate' over this album purely for the vocals being far better and crushing atmosphere it holds, but from a musical and technical standpoint this album is far superior.\n",
        "\nWhy did I not review this album earlier? I can tell you right now The Adversary is not only one of my most favorite extreme metal albums ever, but also probably the best deathcore release of 2010 coming from a year filled with the likings of the insanely great Hell Chose Me by Carnifex along with other contenders including A New Era of Corruption by Whitechapel, Desolation of Eden by Chelsea Grin, Proprioception by And Hell Followed With, America's Most Haunted by King Conquer,  Malevolence  by I Declare War and numerous others. But if I could pit any of those up against this record, it would probably have to be Hell Chose Me, I enjoy that album to a big extent. However, The Adversary is just... too damn good. Everything that should be deathcore is this album and they couldn't have done this better. Not only did they acquire a better vocalist who suits the band much more and putting Brendan van Ryn's overly whiny deathcore voice aside, but also upped the death metal influence by about 5 times, leaving the metalcore on the backburner (although still peaks in the music sometimes i.e: breakdowns and screamed vocals). \n\nEvery song on the album feels like it has its own memorable parts, I can easily distinguish each track from the other and they never blend in or sound tedious which is the most amazing part when hearing an album in this genre. I can enjoyably listen to this record all the way through on a regular basis. The songs, while usually fast, all have their own trademark parts, interesting moments and fun magnitudes to their own respective gratitude. Also the lyrics have also ditched away the misogynistic and pointlessly violent theme; this time focusing only anti-religion. Yes I am aware this was a topic covered in one song on the band's Infinite Death EP on the song \"I'll Show You God\". But here, it feels a lot more captivating and better put; more mature than that of anything lyrical spoken on the EP. Take it like this, would you have some kid screaming at you that God isn't real, or have a grown man give you numerous points to his own perspective on why he has no faith in any religion whatsoever and that it's destroying the world? I'll just leave that question to you. \n\nAnother topic I wanna cover is the drumming. One of the sweetest and sickest things on this record is Lee Stanton's absolute sick skinswork. He was ONLY 19 ON THIS ALBUM FOR FUCK'S SAKE; the youngest member of the entire group and he's just as talented, if not more talented than the whole band. The ferocity of his blasts in-combination of the aggressive and shredding dual guitarists creates this whirlwind of brutality which I can modestly say, is death metal done right. But this isn't even a death metal album; it's deathcore! A lot of death metal bands alone can't even master this type of ruminative eccentric teamwork, but yet a deathcore band can? Surely shows the haters of the genre what they're missing out on. Speaking further; the breakdowns on this album are never overdone, everything breakdown is maybe once or twice a song and placed almost perfectly. Never any forced \"throwdown mosh\" parts anywhere here until it totally feels like it should be done. Also guitar solos are a very frequent thing here too, heck, the band even throw in a Nigel Thornberry SMASHING instrumental piece right before the final track entitled \"Requiem\" which is technically just one big 2-minute solo. \n\nFinally the vocals; I already spoke of these in-contrast to the band's original vocalist but I just have to say it again; McMahon is simply so much better than Brendan van Ryn. He's best suited and described as a real death metal vocalist that I would even compare to Frank Mullen or Ross Dolan, just with a slight Aussie accent on the overtone. His growls are not only ferocious, but he also alternates this vocal style with of course the screamed vocals (usually almost always dual tracked with a growl) and of course the insanely deep gutturals which are about as brutal as they are completely understandable in contrast to his usual growl which actually remains pretty understandable sometimes without even the need of reading the lyrics.\n\nAll in all, this album is a near-perfect deathcore album. Everything you liked about Thy Art Is Murder previous to this is here but on steroids and grown up. Gary Markowski's laster-fast sweeps, Mick Low's bass rumbles and Lee Stanton's blast beats are all here but this time fronted by an even better vocalist. This album is amazing. That's all I need to say.\n",
        "\nI have no idea what the fuck deathcore has been doing with itself for the past two or three years, I seriously don't. It's like trve metal-worshiping gnomes are infiltrating deathcore bands everywhere and scrambling the minds of their songwriters so that their subsequent musical output will sound like total SHIT. It's baffling: within two years' time, from 2011 to 2012, we get not one, not two, but no less than four famous deathcore bands ripping up their nice little formulas before gluing them all back together with nu-metal and modern hardcore mixed in between. For exactly one of these bands (Suicide Silence) this did not end in shambles, and even then it substantially weakened them in comparison to their pure deathcore works. Thy Art Is Murder is one of the other three.\n\nI'm honestly not entirely sure who actually wanted to hear Hate since it's weaker in practically every aspect imaginable. Well, no: the production is a lot heavier all-around compared to The Adversary, with the guitar tone in particular being particularly vicious, loud, bassy and well-defined. The vocals have a lot more impact as well, being louder and more clearly defined in the mix. Even the drums feel a bit more prominent, though they're a bit buried by the absolutely massive guitars.\n\nThese would all be good things if the guitars, vocals, and drums used their newly-found heaviness and clarity to improve upon the formula laid down with The Adversary, but they don't and IT SUCKS. In a word, Hate is stupid - nauseatingly, unequivocally, and irredeemably stupid. The material here is essentially The Adversary with a breakdown-to-riff ratio of, say, 3:1 instead of that album's 2:3, which would be nice if TAIM's breakdowns didn't have a record of being horribly boring and interchangeable amongst themselves (especially in terms of melodies - holy shit, TAIM, did you know you can integrate melodies into your breakdowns? Really, it's quite possible, ask Waking the Cadaver!). These are breakdowns that don't really go anywhere at all, the kind that bands use when they're stuck musically (you can just sort of listen to them and get the feeling that they're not going anywhere); but the album is chock-full of them, as if the band just made a handful of riffs and padded them out with breakdowns, then called it a full-length album. Even when TAIM aren't in breakdown mode, they still primarily chug, sounding like a crappy Emmure knockoff mixed with boring mid-paced, rocking hardcore beats, and little hints of technicality that have more-or-less always been a part of Thy Art Is Murder's sound. The band can occasionally muster enough of a metal hard-on to play a blast beat for ten or twenty seconds at a time, but even these riffs, which were stellar on The Adversary, sound dumbed down with poorly-integrated nu-influence here, being based less around technical death metal and more around watered-down Pantera grooves mixed with deathcore chugs and stereotypical weedly bits; and the neutered end result is just as annoying as the breakdowns which are littered around the album's length. \n\nNone of these elements are helped by the vaguely djent-influenced \"atmospheric\" leads which like to wash over the guitars indiscriminately in an attempt to make the music come across as a lot less retarded and simple than it actually is. They're not beautiful, they're not particularly melodic, and they sound like they were added with the reasoning \"if we have low notes, but then have high notes playing at the same time, we'll sound 'epic' and 'majestic'!\" Well, at least you kind of realised that that was a concept, TAIM, so good on you; but what you did here was more-or-less equivalent to those 400-pound landwhales who try to burn off their six daily Big Macs by running a quarter-mile every week, and exclaiming with satisfaction as they dig into a bonus seventh burger as a reward for a job well done: \"Welp, that's taken care of! I'll be skinny in no time!\" If you refuse to put effort into these sorts of things, it's really best just to go without them, not leave them sitting there, half-assed and poorly-constructed.\n\nThe vocals haven't suffered as much of a vertical drop in quality, but they're definitely on the way out. The growls here aren't as deep as they were on The Adversary but still manage to sound withered and bored even with the lost depth in account, and the screams (which also sound a lot more tired and hoarse) are almost entirely eradicated except for a handful of uses where they're layered on top of the growls. (This album doesn't use as much double-tracking as its predecessor, but considering how the vocals sound, would you really want it to?) Hate also sees the addition of some absolutely atrocious yelping hardcore shouts to Thy Art is Murder's music, which sound equally tired and bored in addition to embodying the annoyingly try-hard tough guy sound that most hardcore shouts intrinsically exhibit. The band seem to be convinced that half of all the breakdowns (particularly ones that were judged to be extra-br00tal) need to be introduced by an effect-laden vocal-only section in the music. This is the sort of thing I usually deem to be tolerable about once in a deathcore album; Thy Art Is Murder probably do it over ten times on this album and each time it's used, it just gets harder and harder for me to resist just shitting on the rug in frustration like a distressed dog.\n\nThis has a couple moments to its name - \"Defective Breed\" has a couple uses of a Portal-like black metal riff that makes some fine use of subtle dissonance; \"The Purest Strain of Hate\" has a cool, stop-starting, oddly melodic chuggy section that sounds like something Immolation could come up with on one of their better days; \"Shadow of Eternal Sin\" features just about the only section where the \"atmospheric\" nonsense makes a decent melody, instead of stupid amelodic whining on the higher strings; and the solos seem to have still retained some semblances of quality - but you've gotta be shitting me if you want me to dig through a bunch of banal, shitty breakdowns, nu-metal riffs backed up with generic weedly sweeps, and hardcore shouts to hear a Portal riff when I could just fucking listen to Portal. There is no logical explanation for Hate except for the possibility that Thy Art Is Murder simply got tired of not sucking balls, and took their next studio session to fully indulge in the practice of ball-sucking. This is unbelievably stupid, and if you give the band money to hear it, then you are exhibiting one of the most damning symptoms of mental retardation. Don't be a retard.\n",
        "\nThis Hole Is Not Deep Enough for the Twelve of You — the first release by Aussie extreme metal five piece Thy Art Is Murder holds a tad distinct sound from this band, especially considering how young they were at the time of these songs. This is indeed a deathcore release. Yes deathcore, that controversial metal genre which recipes death metal and metalcore together. But here of course, we see metalcore showing dominance over the death metal side of the genre unlike Thy Art Is Murder's later works where death metal holds the much larger ratio in their sound.\n\nFirst song on this release \"Like a Face to a Blender\" features a sound unlike many other songs in the library of Thy Art Is Murder; groovy and in-your-face without relying on speed or slams. Its 4 and a half minute run time contains an alright shine and feeling a young deathcore band. Gary Markowski's technical guitar work puts a varying emphasis on their sound as it does on their later songs and eventually becoming a trademark for the band. Here as he adds in a few of his signature sweeps every now and then, especially during the track's second or so breakdown. It isn't as major as his later riffing as a part of the band, but little things like this keep the release out of the vast sea of deathcore clones. \n\nAfter this song, we take a look at the early version of \"Parasitic Autopsy\" where there is a noticeable fair amount of changes within this version than on the Infinite Death version. First off the pig squeals and inhale growl reverbs that Brendan Van Ryn used at ease in this version were removed in the later version along with some of the ferocity. And by ferocity, I mean the production and vocals of this song, which were definitely put at a rawer level than they were on Infinite Death. I believe the best thing about this track that shines the most is (again) definitely the vocals of Van Ryn and not only that, but on this EP as a whole. He sounds better. At the point in time of this release, his voice wasn't as whiny and his screams weren't as shrieky. By the song's climax, it reaches a pretty fancy guitar solo which is then followed by a build up for a heavy breakdown; which is thankfully a part that is still kept on the Infinite Death version.\n\nFinally the last track \"This Hole Is Not Deep Enough\" opens up with a power chord before bringing upon drums and flows along normally as a TAIM song before bringing along some melody by the first verse. Fair amount of changes come and go in this last track such as melody and Van Ryn double layering his vocals — you know the whole technique that you've heard before where vocalists would dual track their screams over their growls. This track as well contains a solo, yet displays a resemblance to that of the solo in \"No Pity for a Coward\" by Suicide Silence. Typical deathcore song really. \n\nAll and all; not a bad first release at all for these young extreme metallers, especially considering how it was done completely independent. When it comes to songwriting on a first release, you'd usually expect something much more dull but this is definitely not the case here. Kudos to this band delivering a catchy, brutal and very fun release so early in their career.\n",
        "\nSo here we have the new album by Thy Art Is Murder, titled simply \"Hate\". I was a huge fan of their debut album, \"The Adversary\". It's my favourite deathcore album and maybe even one of my favourite albums full stop. The natural reaction when I hear a band who made a record I loved that much is making another is to get very excited. Very, very excited. Unfortunately my expectations haven't been met, to say the least.\n\nOkay so the solo work is fucking awesome as expected. Songs like Reign of Darkness, Shadow of Eternal Sin and Immolation have multiple wonderful solos in them, but almost everything else on this record is so generic. Generic chuggy breakdowns, generic wigger shout vocals, generic drumwork. This is a great problem because everything on The Adversary was the exact opposite. The riffs were razor sharp and very technical, the vocals were guttural and enjoyable, the drums were insanely fast and the breakdowns were few, and even when you did hear a breakdown on that album it was fitted into the song structure perfectly.\n\nHowever, I can't say it's all bad. Like i've already said the leads are incredible. Dead Sun is a reasonably enjoyable track, becoming quite melodic in the last two minutes and even having some almost clean vocals coming in and Shadow of Eternal Sin has some very heavy thrash-like riffs.\n\nNevertheless, it's still a major disappointment. This album sounds unsurprisingly like Whitechapel's latest which was also very disappointing. Even TAIM's dreaded EP \"Infinite Death\" had a higher breakdown to riff ratio, and that's saying something because that 5 song EP was stuffed with chugs. Maybe diehard fans of the band and deathcore in general will like this, yet fans that liked The Adversary because it was so much more on the tech death metal side of deathcore than the hardcore side (like me) will probably not get much enjoyment out of this. Dead Sun is probably the only worthwhile song on here, maybe Immolation too.\n",
        "\nI totally get it, \"Infinite Death\" sounds a lot like the Australian, shortened version of Suicide Silence's \"The Cleansing\". But so what? That doesn't say anything about the quality - or lack thereof - of this first official EP by Thy Art Is Murder.\n\nWhile they band progressed to become a lot more technical and \"more metal\" after this release, this still has all the qualities that make a solid deathcore EP. The music already was quite technical, but instead of the speed of most of the songs on \"The Adversary\", TAIM rather focused on sludgy slam-death riffs on this one - which is probably the biggest similarity to Suicide Silence. Some may consider these riffs too \"hardcore\", but I'd be willing to disagree. Riffs like the one that sets in at around 0:30 in \"I'll Show You God\" are (death) metal. They are just not \"classic\" death metal but rather one slam-death side. \n\nThe whole EP consists of the standard-deathcore mixture of fast death-metal style tremolo riffing, chuggy slam-death riffs and - you might already have guessed it - tons of breakdowns. While the band focuses on technical death metal these days, the breakdown parts still had the upper hand on \"Infinite Death\". There are a lot of the the typical tech-death tapping riffs to be heard here, but they never really become the focus of the music - they are rather used as adornments, such as in \"Parasitic Autopsy\". Hints at what was to come are easy to find, yet the band was headed into a different direction, intent on chugging as quickly as possible instead of adding consistency through memorable riffs.\n\nThis would lead me to the second main similarity to Suicide Silence, the vocals. Brendan Van Ryn truly is like an Australian Mitch Lucker, even to the degree that his lyrics are as mildly retarded as Lucker's. \"I'll Show You God\" vs. \"Unanswered\", \"Whore to a Chainsaw\" vs. \"Bludgeoned to Death\" - you get the gist. Most of the lyrics on \"Infinite Death\" sound like a paraphrasing of lyrics from Suicide Silence's \"The Cleansing\". Yet, vocals are the main reason why the songs here have hooks - the vocal patterns of a song like \"Whore to a Chainsaw\" are highly memorable, while the music isn't that much.\n\nDespite all this, \"Infinite Death\" is an okay EP. Why? Because it's goddamn catchy, that's why! Hate Suicide Silence all you want - they know how to write a catchy song, even if it's mostly due to the vocals. The vocals wouldn't work if the music wasn't able to support them. And at this stage, Thy Art Is Murder basically were Suicide Silence's best copy. I'll admit that some riffs are really repetitive and similar (the beginning riffs of \"I'll Show You God\" and \"Breeding Bacteria\", I mean, seriously?!), but overall, this isn't even half bad. It's just different from \"The Adversary\".\n",
        "\nDeathcore, that number one hated metal genre. A hybrid between death metal and metalcore. Every metal fan knows of it and let's just say not all of them are too fond of it. But let's be honest, there are a good number of praise-able deathcore acts out there (Veil of Maya, Rings of Saturn, Bleed from Within just to name a few) and there are the ones that fall flat (Emmure, Float Face Down, We Butter the Bread with Butter) but in the midst of it all there are definitely deathcore releases that almost retain as classics even though they were just released 5/4 years ago or so, because after all, deathcore still is a relatively young genre and more bands are being formed of the genre every day. The Infinite Death EP by Thy Art Is Murder almost compliments into being one of these classics and by Thy Art Is Murder's growing success, this EP is still enjoyed by whom that preferred more of their purist deathcore style continues to reign as a recognized release within the genre. Someday it may even surface the boundaries of deathcore glory in the realm of Job for a Cowboy's Doom EP, but let's not speak too soon, young brutal kid.\n\nWithin these five tracks, you have what you'd most expect from deathcore; heavy riffs, fast drumming, some blast beats and pack it all up with breakdowns and you're all set, not to mention vocals that alternate between growls and screams — just naming off the typical deathcore formula here. But what really sets this release apart from the whole pack I believe is mainly the production and Brendan Van Ryn's insane voice. Drums come in like a charm, they're smacky-loud and don't overwhelm the guitar work either. Speaking of the guitar work, one of TAIM's most renown techniques lies in Gary Markowski's laser-speed sweeps giving the band another innovation away from the deathcore clones. These kids play like all hell gaining their influences from early Cryptopsy, Suicide Silence, The Black Dahlia Murder, Necrophagist and See You Next Tuesday and deliver each and every idea into these songs at different variations and intervals.\n\nIn terms of vocals, I can ultimately see why this band have had a handful of fans that prefer Van Ryn over CJ McMahon (the band's current vocalist). And although I prefer McMahon more, Van Ryn's deathcore voice sounds completely mad and fits the music into a way that no one else could, his style is described as a \"whiny Mitch Lucker\" or a \"death metal madman\" and yet given that he sounds so insane it's almost no wonder there were false Internet rumors floating around about this guy like her murdered his own mum with barbed wire after he left the band, pfft. \n\nAnywhoo, regarding the lyrics, most of them are highly misogynic. Lyrics such as \"I'm inflicting bloodshed upon bitches just because I hate the female race\", \"there's no remorse in my heart, women were born to be fucked\", \"die you fucking whores, you putrid wastes of space, stop breeding fucking rats you bitches gonna get it\" and finally \"dumb bitches, fuck, they don't understand. This world does not revolve around them.\" leads me to ask was this kid just an angry teenager trying to get off some horrible breakups he went through or is he truly in anger at females and actually hates them? Or it could just be a \"brutal\" concept to write for the EP but whatever these three reasons may be for writing such lyrics, I'll just have to say, putting relentless hate towards women would be the low mark for this EP. Probably my least favorite thing at that, he could have been a tad more creative and not have made such a controversial move.\n\nOverall this release is packed with five extremely fun songs. If deathcore with neat sweeps and distinct vocals tickle your fancy, Infinite Death is definitely for you and may it live on remembered for years and years on within this genre.\n",
        "\nWow. What a total disgrace. This band went from a non-generic technical deathcore band to another generic Emmure clone.\n\nThe song starts with a quiet build up with some distant chords getting louder until it starts with a really generic breakdown that lasts for most of the song. Abandoning their razor sharp technical riffs for basic chugging breakdowns is not a move anyone should've recommended. Even the vocalist has changed his style from legitimately brutal sounding guttural growls to wigger shouts. The drums are played in time with the breakdowns which seems to suggest they're trying to jump on the djent bandwagon and play a style similar to Meshuggah but it just ends up coming off as generic beatdown deathcore for the scene/hardcore kids.\n\nIt's not all bad however. The solo in this track is fucking awesome, but it just does not save this song from being a total slap in the face to anyone who loved \"The Adversary\". I really hope the rest of the album isn't like this because this is just horrible.\n",
        "\nSo Thy Art Is Murder's demo \"This Hole Isn't Deep Enough For The Twelve Of You\" wasn't all that bad. It wasn't great, but it was certainly listenable deathcore. This, however, is very hard to listen to. The main reason is the ever-present breakdowns. I really don't know how they thought having constant breakdowns could equate to something interesting and original. Also, there is lots of technical wankery, which otherwise would be quite annoying, at least add some variety to the guitar work. It still is pretty pointless, though. The drums, the vocals, the riffs - nothing is good about this. \n\nWhile Thy Art Is Murder was never an interesting band and probably never will be, at least the demo was passable. While it still had many of the same problems as this release, those problems were kept to a minimum. While there was a bit of technical wank, it was infrequent and actually a fairly cool addition. There were also lots of breakdowns, but they were more original and balanced out by other riffs. It looks like the main problem with \"Infinite Death\" is that Thy Art Is Murder has forgotten what moderation is. Its like for this release they took the worst aspects of the demo and expanded on that while completely neglecting the good parts. The melodic guitar work was something I enjoyed very much about the demo, and while still present here in small parts, it sounds like a carbon copy of how it was on the demo. Only a bit less interesting.\n\nMy two biggest problems about the previous release, besides the breakdowns, were the mechanical drum sound and the vocals. Well maybe it was just because it was a first demo, and they've improved their abilities for the second coming. Nope. The mechanical drumming persists, with it being especially bad on the bass drums - which happen to be used almost constantly. With the fast sections the drummer plays with as much speed as he can with no thought to playing anything remotely interesting. The vocals are even worse here, the higher pitched vocals are annoying and the more guttural ones are weak. \n\nIt is utterly perplexing that they think that constant über-downtuned breakdowns is a good idea. I'm sure some kids in their scene kid phase will think its unrelentingly brutal or whatever, but truth be told, its kind of boring. They do play them at different tempos, but they are all as typical as you can get. One thing that really irked me is that when different riffing did emerge, they still found ways to incorporate breakdowns. All the technical wanking is pretty boring too. Never is any emotion put into these parts, it just seems like the guitar player is trying to show off. Great, so everyone now knows you're technically pretty decent - was it worth sacrificing the integrity of your music for? Not that this has much integrity to begin with. The only song that isn't completely abysmal (not to say that its actually good) is \"Parasitic Autopsy\". I suspect that this is because it is a reworked version of the same song from the demo. \n\nThis is nothing but endless breakdowns and silly technical lead guitar. Never does it become interesting. Never does it become passable. The only place this release belongs is at the bottom of a trash bin. Truly an abysmal slab of unlistenable hogwash, this is only for the most vapid scene kids. Which is why I think they chose this direction, because they knew those people would buy it. The demo certainly showed some potential, but they chose to throw that away to make their music appeal to the lowest common denominator of heavy music fans (I am hesitant at calling this metal as I'm not sure if this kind of deathcore would qualify).\n",
        "\nI had a bad feeling checking out this band, I heard they were the worst kind of vapid deathcore. Deathcore is not at all a genre I am partial to - mostly because of the ever-present breakdowns. While this is definitely deathcore and certainly has breakdowns, I find it hard to hate. Thankfully there is enough other guitar work to balance out the breakdowns. \n\nThe breakdowns are undeniably a big part of this music, and they do drag it down a bit. While there are probably more than there should be, a hell of a lot of deathcore bands are a lot worse with that. Breakdowns aren't the only type of guitar work Thy Art Is Murder employ. The best guitar style by far on this demo are the tremolo riffs. While a bit melodic, they are still heavy. They function best when two guitars are playing the tremolo melody in harmony. There are also occasional riffs which sound like metalcore, which aren't great, but are good for what they are. The random riff of other varieties are also included. The lead guitar is noteworthy. There is some melodic wankery, which is used sparsely enough to be an interesting addition. This technique is most notably used in \"Parasitic Autopsy\". \n\nThe vocals vary a lot. There is your average guttural growl, along with a high pitched rasp. Both of these are done adequately but never spectacular. The BREE BREE vocals and the over the top death gurgle, which both call brutal death metal home turf, also make the occasional appearance. While I usually have high disdain for those vocal styles, they are very well executed here and cause no problems at all. Besides the influx of breakdowns, the drumming is one of the only things really wrong with this. The tone they get sounds very mechanical. Also, these drums are definitely triggered, and not in a very original fashion. While they don't ruin everything, they don't add that much. \n\nWhile annoying in sections, as a whole this demo isn't bad at all. I'm not sure it breaks into \"good\" territory, but for something with so many typical highly down-tuned breakdowns, this isn't horrible. This is highly accessible and features production that would not at all reveal that this is a band's first demo. While the breakdowns and mechanical drumming do put a damper on things, I would rather listen to this than a countless number of deathcore bands.\n",
        "\nCome on, as they'd only previously released a demo and an EP. You have to give them the band a chance, even though the two previous releases were boring and plain with a total of about 2 decent tracks, they still deserve a chance. The Adversary shows why. It’s fast, aggressive, and technical, I don’t know of any band that has changed their style for the better so quickly. Going from a below average whiney core vocalist, they got a new vocalist. Thy Art now has a lot more to the band, making them more interesting. \n\nNow I’ll talk about the album itself. The first track (excluding the intro ‘Unholy Sermons’) ‘Soldiers of Immortality’, starts off with some nice guitar work, but then speeds up with some technical riff-work and some powerful growling from CJ. You can hear right from the start the amazing work that Lee Stanton has done on the drums, fast and aggressive, the whole album progresses like this, with technical guitaring, fast drumming, and brutal growls. Another thing to mention about the new and improved Thy Art Is Murder is that they actually have PROPER guitar solos, gone from s***ty core solo rip-offs to proper, technical solos. Next song is ‘Laceration Penetration’ which is probably my most favourite of the album, which starts with some chugging along, but then again CJ’s brutal vocals kick in and speed everything up. Lee’s drumming is perfect for the song (and entire album for that matter), with some fast double-bass and speedy drum rolls. About 1:30 into the song is where things start to get insane, Lee’s drumming, technical guitaring and some of CJ’s best vocals following a nice little guitar solo. \n\nSkipping to the end of the album I’ll talk about ‘Cowards Throne’ which is another masterpiece from The Adversary. Starting off great, to ending great; the whole song is technical and brutal from start to finish. CJ’s vocals speed up and down, suiting the music perfectly. Lee pulls off some more amazing work with his drumming, and makes this song even more aggressive. Again, with the guitars, aggressive and technical, changing from your occasional –CHUG-CHUGGA-CHUG-CHUG-CHUGGA-CHUGGA- to your more technicality with the higher strings instead of the lower strings.\n\nAll in all, Thy Art Is Murder has done a MASSIVE change from your generic deathcore to some technical death metal/deathcore. The lyrics are the best they’ve written and the vocals bring out the brutality they have put down on their paper. Personally, Thy Art Is Murder done one of the greatest changes I’ve noticed. This album is a definite 9/10 effort.\n",
        "\nSo this is the EP that so many TAIM fans insist is their best work? Naturally, they're all scene kids who luv da breakdownz, so their opinion is invalid, but I still had to have a few listens to work out why this is so loved. This is one of the worst things i've heard in deathcore. This is on the same level as Suffokate and Chelsea Grin in terms of sheer shittiness.\n\nWhere to begin? I think i'll start with the guitarwork. It is laughably bad. Lots of random wanking that neither fits or sounds good. They seem to just be placing these random sweeps wherever they can fit them amongst the breakdowns (of which there are many) in a poor effort to sound technical. The breakdowns (or rather, breakdown, as it's the same one played several times) are absolutely awful and do not fit into the song structure at all. Typical chugfests you've come to expect from deathcore.\n\nThe drumming, on the other hand, is solid, and saves this album from a complete zero. Instead of simply blasting on his double bass like so many other deathcore drummers do, he adds some decent fills and rhythms that save the music from being a complete snoozefest and proving the band weren't a completely talentless collective at this point.\n\nThe vocalist is beyond awful. He sounds like before recording he sucked some helium out of a balloon. His screams are irritating, annoyingly high pitched and sound like nails on a chalkboard. His growls are average at best, and really lack character and sound very forced. His lyrics aren't much better. They range from amateurish anti-religious rants (I'll Show You God), butchering females (Whore To A Chainsaw), br00t4l gore (Parasitic Autopsy, Breeding Bacteria, Infinite Death). At times, you'll be laughing at how bad these lyrics are. At one point, the vocalist is chanting \"BITCH, YOU'RE DEAD!\" over a breakdown. Total failure\n\nThe main problem with this release, is that it just has too many flaws, flaws that were all rectified on the follow-up The Adversary. They got a better vocalist, they cut out the random soulless guitar wankery, they stopped using breakdowns so irritatingly frequently, and as a result became a good band. Every band starts somewhere and usually aren't that good on their first couple releases, but this band were beyond bad. Stay the fuck away.\n",
        "\nThis is just...wow. I have never seen a shitty band change their act so quickly. What the fuck happened? Last time I checked, these guys were playing Suicide Silence-worshiping deathcore with insipid breakdowns and constant blasts with riffs so downtuned they were impossible to pick up. Now it's...old-school Cryptopsy with breakdowns, I guess. Think of it as a perfection of the formula used on The Unspoken King. And the odd thing is - it fucking works. This album is not great, no, but it's a good example of how deathcore should be - fast, brutal and relentless, with the occasional, djent-influenced, mid-pace breakdown.\n\nLet me first call out this release on its shining element - the fucking speed of these compositions. It surpasses Brain Drill, Fleshgod Apocalypse - hell, I haven't heard death metal riffs this fast since Cryptopsy's None So Vile. The riffs themselves are slightly melodic tech-death numbers, and they're usually made faster by a constant snare beat behind them. Sometimes the band even combines deathcore chugs with these fast riffs (like at 1:23 in \"Laceration Penetration\", which is similar to the infamous blast riff in Cryptopsy's \"Phobophile\"), and despite all laws of how music should sound, the band makes these riffs work somehow. The breakdowns are still there, but mind you they're placed aptly in the music, in places where the pace needs to slow down a bit. Besides that, they're just fucking good. Most of them consist of polyrhythmic djent triplets, and they're altered every so slightly every time they're used, so they're never truly boring. Indeed, these are some of the best breakdowns I have heard in a long, long time.\n\nAs I've mentioned before, the drums are almost constantly blasting to give the music a feeling of speed. Thankfully, unlike some bands (certainly none whose names rhyme with Freshmod Uhknockalips) the snare isn't intrusive in the mix. It's rather quiet, actually...maybe a bit too quiet. Great drumwork on this album, regardless. As for the vocalist, Thy Art Is Murder ditched their old shitty Mitch Lucker clone, and in his place is a guy who can best be described as Glen Benton in constant low-growl mode with a slight Aussie accent. The man's vocals have none of the distorted gurgly nonsense that most of his contemporaries do. There are also brutal death metal-esque gurgles every now and then, often used on dual-track vocals on this album to accent whatever other vocals are going on at the time. Sadly, they're rather weak-sounding (but what was I to expect from a deathcore band?), but I suppose they make the cut. His screams are deathcore shrieks, but they shed away most of their whiny -core tone, and instead opt for a rather black metal-esque rasp. Neither the growls or screams are mindblowing (though I was impressed with the dual vocals at the start of \"Soldiers of Immortality\"), but they fit the music and aren't offensive either way.\n\nMy gripes about this album are small. For one, this release is very single-minded - two songs in, the listener knows more or less what the rest of the album is going to sound like. The production job could use a good amount of bass added to it, a la new Job for a Cowboy, and while I'm bitching about how things sound, the cymbals on the drumkit are hollow and annoying, particularly the china. Finally, the drums could be just a bit louder in the mix; the guitars seem to overpower them more often than not.\n\nBut those complaints are pretty much nitpicking when one considers the overall quality of this album. I'm not sure if anyone was expecting this from the people who released Infinite Death and presumably got egged off every gig they tried to play. This is exactly how The Unspoken King should have sounded, and if you don't mind continuing to label Cryptopsy as a deathcore band, feel free to think of The Adversary as a muscial progression from that album. All in all, this is a great technical death metal album with some nice, legitimately catchy breakdowns, and I'd recommend it to fans of Brain Drill, new Job for a Cowboy, and Origin. I'd also recommend it to people who wanted to find a reason to stop mocking one of the shittiest deathcore bands to ever exist.\n",
        "\nSo let's back up a few years from the abomination that was Infinite Death. Thy Art Is Murder still have another work under their sleeves. It's deathcore, like the EP that would follow. But is it as notoriously shitty as its follow-up would be? Well, thankfully, the answer is no. Suicide Silence were still a very small name around the time this demo was released, and thus they aren't a primary influence on TAIM this time around. Instead, one could say the main influences here were a combination of Bring Me the Horizon and Doom-era Job for a Cowboy. The end result is not godawful, but rather inoffensive early deathcore.\n\nThe guitars are mostly an alternation between chugged triplet breakdowns and your typical overly cheesy melodic death metal riffs. Now I'll admit I can enjoy a good breakdown every now and then, but the ones that populate this release are extremely dull and predictable. On top of that, they lack the constant, often polyrhythmic beat that a good breakdown needs. The melodic death metal riffs are just a more cheery version of something you'd hear in a TBDM song, and not only are these types of riffs boring more often, they're hackneyed beyond all belief. Being the darkest of the three songs, \"Parasitic Autopsy\" has at least two riffs I enjoy, and surprise surprise, they draw more influence from modern technical/brutal death metal than anything that has to do with dahlias or murders. The rest of the songs are rather worthless riff-wise, however.\n\nThe drums are mostly buried beneath the crappy demo production job, but to be fair they're not doing any of mention so the listener isn't missing much. Typical alternating blasts, waves of double bass, et cetera. The vocalist may actually be crappier here than he would be on Infinite Death - the screams are snarly and hoarse, but rather unrestrained in pitch, making them feel quite sloppy. The growls are even more boring than they would be a couple years from now, but the most terrible thing in this release, hands down, is the use of pig squeals. They're not the good, guttural pig squeals used by Guttural Secrete and Devourment - no, it's all slurry, inhaled pig shit that sounds more like a low, malformed pig squeal than the decent type.\n\nOne of my biggest complaints about this release is the general lack of coherence in these songs. It's probably partially due to the boring melodeath riffs, but the songs don't really seem to have a start or an end - they just play x amount of riffs, pad it out with x amount of breakdowns, and then end once they've played for long enough. A feeling of conclusion (and start, for that matter) would not be minded by me.\n\nOverall, this is not utterly despicable like Infinite Death, but it's rather boring, even by mid-2000s deathcore standards. I doubt this will seriously appeal to anyone beyond -core fans who will love anything as long as it meets a chug quota.\n",
        "\nThy Art Is Murder in their early days were little more than an uninteresting Suicide Silence clone. Their vocalist sounded like a whiny little 5 year old on helium and their music was little more than repetitive breakdowns. 2 years after their EP \"Infinite Death\", they found a new vocalist and started work on a full-length, and what an improvement. Long gone is those horrible whiny vocals and irritating CHUGGA CHUGGA breakdowns, replaced with genuine death growls and more solos than you can shake a stick at.\n\nThe guitars on this release are really fantastic. Nice heavy tone. The riffs are very heavy and very interesting, and the solos. Man, the solos. These aren't dry, soulless solos that every deathcore band has mastered. These are genuine technical solos that bring thoughts of Necrophagist or a similar band. These mini shredfests pop up several times, usually in the same song, but each time sound different. Some of them are memorable, others not so much. This album also has breakdowns, but they sound more tech death based than metalcore based, which should please anyone who would rather hear shades of Suffocation than Suicide Silence.\n\nThe drumming on this album is also great. It's blatantly triggered, but if you can look past that, then you should enjoy them. Perfect blast beats, solid fills and skull smashing double bass a-plenty. Again, nothing original. Just good enough to do the job.\n\nThe bass guitar, predictably, cannot be heard, unfortunately. This sadly loses the album some points.\n\nFinally, the vocals. Like I said before, the old vocalist was trying to channel Mitch Lucker of Suicide Silence fame, and doing a much worse job of it. He sounded like before his performances he sucked a load of helium out of a balloon. Fortunately, TAIM got a real vocalist to replace him. He has a reasonable range, nothing extraordinary. He uses standard death growls, a fewer higher pitched screams and occassionally some guttural slam gurgles. Not one style is overused, so the vocals never got boring, a problem that affects most deathcore these days.\n\nThe only real problem this album has is the useless intro. It fails to set an atmosphere or prepare you for what's to come, and could've quite easily have been left out\n\nOverall this is just over 37 minutes of quality technical death metal with some deathcore elements. A must-have addition to your collection if you're interested in tech death, deathcore or both.\n",
        "\n(EDIT - November 23rd, 2012: Opinion changed radically enough to warrant a complete rewrite.)\n\nHaha, wow, there was a point of time where I hated this? I feel really sorry for myself 18 months ago because I effectively shaved 18 months off my life that I could've spent listening to this EP. Infinite Death is a surprisingly solid chunk of material, and while it's certainly not the most original thing you'll ever hear (but who the fuck am I kidding, you already know that because it's a deathcore album; if you thought that would hinder your enjoyment of it you'd be listening to Unexpect or some other band that features a man using a kazoo as a butt plug), it's definitely a worthy listen for anyone interested in the more thuggish, retardedly brutal side of deathcore.\n\nI was correct in my original assessment that this is basically a Suicide Silence clone, though I don't consider that to be an immediate dealbreaker this time around. These songs, solid as they are, all admittedly sound like outtakes from The Cleansing with a bit more technicality on display from all the musicians involved, so the enjoyment you take out of this will directly hinge on how well you're able to tolerate that album and its predominantly metal-lacking, extremely chug-heavy approach to deathcore. Infinite Death is -core with almost all its ties to melodic death metal cleanly cut - or death metal of any sort, really. \n\nWhile the guitar tone isn't as distorted and in-your-face as the one utilised on The Cleansing (which is a bit of a disappointment), it's still entirely competent for the material being played as it's loud, bassy and relatively thick. The majority of the guitarwork alternates between downtuned tremolo riffs with vaguely death metallish melodies tied in, and chugging that doesn't even attempt to make melodies detectable to the human ear. Both styles are backed up by near-constant blast beats on the drum kit - be they vanilla, alternating between the cymbal and snare, or rapid-fire gravity blasts - and overall the material here is usually a lot faster than Suicide Silence have ever been in their entire career. The drums here also feature a surprisingly large amount of fills (they're mostly just going down the toms, but hey I'm just surprised they discovered that there were toms on the kit) and various other little bits of technical flair every now and then.\n\nThe breakdowns are pretty good overall, but don't reach the perfect simplicty-to-catchiness ratio like Suicide Silence did on their debut album. There are a few stinkers lurking around like the one at the end of \"Parasitic Autopsy\" which seem to settle for \"chug this one note in an absolute monotone\", and there simply aren't as many dumb, stompy breakdowns as there could be. Then there's the occasional noodling to take into account, which usually falls flat on its face and comes off less like awe-inspiring technicality and more like an attempt to box in and structure a Brain Drill riff to show off to the listener. It's also worth noting that the wank is usuallly shoved into the breakdowns as what is ostensibly an attempt to add in a bit of extra substance (but oh, you're so silly, Thy Art Is Murder; breakdowns honestly don't need to be anything more than a bunch of chugs sewn together), but in execution the simplicity of the chugs contrasted with the note-barrages gives off more of a feeling of awkwardness than whatever the band were going for.\n\nThe vocals here are probably the weakest overall performance on Infinite Death. The lower vocals are reserved to growls (no gurgles, pig squeals, etc.), but even then they're not as obscenely low and unintelligible as I'd rather them be. They're decent, but pretty hard to describe, if only because they're about as unoriginal as deathcore vocals can get; honestly, the only reason his performance comes across as having any sort of identity is because his annoyingly thick Australian accent is still easily detectable under the harshness. The screams are a bit more unique, registering pretty high (not Mitch Lucker high but still notable by deathcore standards) but unfortunately coming across as a bit whinier than I think he intended.\n\nThere are a few other flaws in Infinite Death: excluding the awesomely clunky snare, the drum kit is godawful in its tone, with the cymbals sounding like undefined whooshes of air most of the time and the kick drum sounding like someone slapping a wad of raw meat. And while it doesn't particularly bother me or factor into my opinion of the music, it's worth noting that this EP features what must be the most immature lyrics I've ever heard in a relatively extreme band: trust me, we get it, you hate women because some fucking whore bitch slut harlot broke up with you once upon a time, bless your heart. (Also, misogyny makes you gay - take your pick.) So yeah, this isn't perfect by any means, but considering the quality of the actual riffs and the breakdowns here, plus the intriguing amount of speed added to the mix, this is definitely worth a listen for people who like deathcore best when it stops trying to be melodic death metal with metalcore influences. If you hypothetically wanted more music that sounds like The Cleansing, this EP certainly wouldn't be the worst you could do.\n\nAnd fuck you for trying to be smart and voicing your shitty opinions, 2011 MutantClannfear. This new review took me like an hour to write and I could have spent that time masturbating or sleeping if not for you. Fuck you.\n",
        "\nWhat a huge improvement these guys have made with this album. No more generic sissy deathcore bullcrap and certainly no more annoying angry kid vocals. Perhaps a few breakdows are present but they actually sound good and memorable. This album has nothing I haven't heard before, since many of their riffs sound very similar to other bands. But hell, just ignore that and you'll have a very memorable, brutal and enjoyable moment while listening to these Australian fellows.\n\nFirst of all this album has no more angry kid vocals, meaning the annoying ultra high pitched voice has been dropped and instead they have an actual death metal vocalist that knows how to deliver very brutal sounding growls a la Decapitated. I BULLSHIT THEE NOT. No pig squealing either, so you can feel relieved now. \n\nYou will also enjoy the guitars, having memorable riffs and something I've never thought... solos. Yes, and not the typical forced bad sounding guitar leads that pretend to be solos like the ones Job For A Cowboy has mastered. Instead Thy Art Is Murder incorporated proper sounding solos with a punishing guitar tone that will almost bring Behemoth to your mind. Again, THIS IS NO JOKE\n\nLately the metal scene sees no importance in the bass guitar and these guys have done the same thing. The bass sounds deep but it's nothing that Alex Webster would acclaim. \n\nLast but not least, you have triggered yet very astonishing drum patterns with furious double bass and very solid blast beats. Some breakdowns may appear as well but they don't predominate, so do not worry. \n\nReluctant tracks: Laceration Penetration, Engineering the Antichrist and Cowards Throne.\n",
        "\nOne of my best friends recommended me this album, so I decided to give it a try. I really try to enjoy deathcore music and I'm always looking for a deathcore band that doesn't sound generic or boring. I guess I would be able to find it, after all, I read several positive reviews that claimed this to be the new sound of metal with awesome guitar work, brutal vocals ,and extremely scary lyrics. After all, some deathcore bands sound decent and entertaining. \n\nUnfortunately, nothing here has musical value whatsoever. This album reminds me a lot of Bring Me The Horizon (not a good thing). Why? Let me start with the vocalist, or should I say ''vokillist''? That annoying vocalist kid needs to shut the fuck up. He sounds like some retarded baby crying his lungs out. He's actually whining more than screaming, and if you add the brutal wannabe lyrics, you end up hearing the angriest high schooler ever. Mostly because the vocals sound too forced, they just don't sound aggressive or good whatsoever. Infinite Death and Whore To A Chainsaw prove this.\n\nAlso notice how all the songs sound pretty much the same. Kind of like a slower, whinier version of Suicide Silence playing an infinite breakdown. What's so awesome about breakdowns? A mystery that shall remain unsolved. \n\nGuitars sound extremely soft with very few guitar leads and endless chugging. It sounds as boring as it gets. Also the bass is pretty much inaudible and if you pay close attention, you'll be able to hear it's only the first 4 frets of the thickest string being played, so there's nothing much to enjoy in the guitar department. \n\nTheir drummer, however, seems to be able to pull some non-sucky chops once in a while. Too bad everything he plays ends up in a breakdown, so it all goes to hell, especially with the annoying triggered sound. \n\nOverall, stay away from this absurdly bad release.\n",
        "\nI have finally found one, my search is over for finding yet another great deathcore band, that doesn't sound like Christian metal shit. A band that shows the true influence deathcore has always had, and the very aspects to make a good band.\n\nThe guitar was written well, good riffs that keep your headbanging without needing to slow down, and a breakdown or two just to give a break, and realize this is awesome. However, the breakdown or solo, outstanding parts went on a little too long is some parts, which made you think \"When are we gonna get back to those wicked riffs?\" Which is not such a big deal, because the guitarist put a very technical edge to these parts, which are all very impressive. True talent.\n\nAs a drummer, I find most bands in this genre don't show their true talent, but this band's drummer blew my mind. He didn't just keep a beat by blasting all the time or just giving bursts of double bass, he MADE the rhythms, occasionally speeding up the double bass, moving around a lot, and giving a few very good fills to set the mood. He knew when to play slow, when to chill, and then when to blast you away. May I also add, he has really fucking fast feet, tremendous double bass skill.\n\nThe bass was not much of a difference, it didn't stand out that much, nothing special about it, there is some parts where you can hear him stand out and give a good line, but really, he just follows along. Show us your talent, bud.\n\nFinally, the vocals were great to show in this EP, he did use a wide range of notes, going from high to low and not stopping. However, it's pretty much all the same, nothing really special, no pig squeals, but it does give you that feel that THIS IS GOOD.\n\nA true technical deathcore band, a mix between Whitechapel's heaviest songs with that technical edge you might get from bands like Viraemia or Brain Drill (only really for the guitar, though) This is a great band, another anti-religion band that we don't see too often, due to so many Christian Metal bands.\nBut that's a different story from their greatness.\n\n-Bloodyhavok\n"
    ]
}