{
    "Band Information": {
        "Country of origin:": "Sweden",
        "Location:": "Arvika, Värmland",
        "Status:": "Active",
        "Formed in:": "2004",
        "Genre:": "Death Metal (early); Gothic Metal (later)",
        "Lyrical themes:": "Horror, Death",
        "Current label:": "Century Media Records",
        "Years active:": "\n\n2001-2004 (as Hazard),\n2004-present ",
        "Number of Reviews": 35
    },
    "Band Reviews": [
        "\nHaving somehow missed owning \"The Dhampir\" due to not picking up the double vinyl or the proper CD edition, I'm stoked that this 18+ minute epic is now available for myself and all the other plebeians to enjoy in an economic digital version, and in three digestible chunks. It offers what might even be the most fulfilling blend of Gothic haze, proggy escalation and hints of Tribulation's death metal roots that can be found among the Where the Gloom Becomes Sound sessions, if not perhaps as catchy as some of the originals that wound up on all versions of the album. I can see why such a thing might be clipped, but after wallowing in the experience I'd recommend tracking down any of the physical media where it's present as opposed to where it isn't.\n\n\"Part I\" definitely builds to a steady clip after a folksy introduction with some great drumming, a very 70s vibe offset with some riffing that almost feels post-punk in places, but also features most of the 'metal' riffs in a conventional sense, and gives a similar melancholic, uplifting atmosphere to some of the tunes from the album proper. \"Part II\" is a more spacious, doomy section with a lot more experimentation in the instrumentation, some anthemic guitar harmonies and no real vocal presence, and \"Part III\" returns mostly to the pacing of the first, but then segues out into some rather abrupt changes that range from cleaner guitars, to almost ghostly sheens of atmosphere. Though the tracks flow pretty well into one another, there are certainly an excess of ideas here that don't necessarily need to be experienced in conjunction, but work well enough when the tune is divided into these parts. I wouldn't say that the experience as a whole is dull in any way, but there are a few parts that don't match up to others.\n\nThe coolest thing about The Dhampir is that it hints at even more open musical spaces the Swedes might traverse on future records...you could easily hear them going in a more prog direction (maybe not in the same way they did on Formulas of Death), or more psychedelic folk, or even using more cinematic soundscapes where the instruments drop out for haunting feedback. As a part of Where the Gloom Becomes Sound, or even independently, it helps round out a broad swath of influences, and provides a lot of gas left in the creative tanks even though parts of it conform to the general style of that particular album (or Children of the Night). A cool listen, although not immortally carving itself into my conscience like some of their other tunes.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nIf I was already surprised that Tribulation stuck to the same general sound for two full-length albums, I was even more so when that number became three. Where the Gloom Becomes Sound cultivates another minor evolution to the Goth-driven melodic death metal niche that the band has become possibly the sole inhabitant of, but it certainly does lack the element of surprise you might have experienced on Children of the Night. But don't take that as some deal-breaking critique, because this album is thus far their best manifestation of the corpse-painted, emotional noir that the band has been vibing off, and it's an album that repeatedly rewards the listener, especially when you can set the proper mood: an autumn drive through the countryside, an empty city during lockdown, or just the candles and shadows of your personal Batcave.\n\nThe tunes here are all written at accessible lengths, and not immediately impressive, but that's the true strength of Where the Gloom Becomes Sound. The riffs aren't 'long', per se, but the Swedes have learned how to play the long game with them, and craft tunes that are so much more appealing when you pull the lens back and appreciate their entire structure, which is more or less rock-based and then filtered through the grisly guttural vocals. Most of the guitars are wistful, melodic, even folksy, and the use of pianos, percussion and other elements definitely gives this one almost a Gothic country/folk spin to compliment the weaving of the electrics. That's not to say it isn't guitar-heavy or metallic, because the guitars dazzle with a bevy of hypnotic patterns in tunes like \"In Remembrance\" and \"Leviathans\" that are among the best they've written, but it's all fairly smooth and inoffensive, an extremely far cry from the harsh death/thrashing on the band's underrated debut (though the intro riff to \"Funeral Pyre\" gets a bit speedy for a moment, just not in the same way).\n\nThe bass lines are simple and perfect, the organs melancholic, the drumming is great, the entire band is aces, really, and what's even more important is that the tracks here are more effective and impactful than those of the prior two albums. I'm not even sure what else to compare this to? Maybe a bit of Sentence post-Amok, or Moonspell's earlier Goth metal diversions come to mind, where you'd hear a similar approach to the guitars, but Tribulation has really mastered the emotional resonance of this style by now. That's not to the album is 100% perfect for me...the piano segue \"Lethe\" is fine, and there are certain a few tunes in the depths that use samey techniques to some of the extremely strong album openers (\"Elementals\" starts like a reconfiguration and re-tempo'd \"Leviathans\"), but there's nothing in the 48 minutes that is really skippable, the lyrics read like gorgeous and fitting Gothic/doom lamentations, and the album is definitely one that hits me even closer to the feels with each successive listen. If I hadn't such a hard-on for The Horror, which could almost be a different band altogether, this would nudge past its two predecessors to become my favorite of their albums.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThe real question I had when I saw that Tribulation had announced its first live album was just how well their diverse slate of material was going to jive together in that setting. I can totally hear The Formula of Death mixing in with their more Goth-oriented records Children of the Night and Down Below, but how would an audience react to tracks off The Horror and its far different, intense death/thrash sound? To be frank, as much as I've enjoyed their evolutions, that record is still my favorite due to its reckless, explosive songwriting and carnal sound, but I can understand why the band would want to leave it behind them as they explored their gloomier new territory, the contrast might be a little jarring when you're trying to set a mood on stage. Stranger things...have happened? Maybe an encore with the masterful \"Beyond the Horror\"?\n\nBut not here, because the two-disc live album wisely avoids the answer by offering material just off the three most recent albums to its own release. The first disc is Down Below performed in its entirety, and the second disc is a mix of The Formula of Death, Children of the Night and a few fresh live bits. At any rate, the recordings sound quite excellent, with a great mix of the band's riffing melancholy, hoarse rasped vocals and drumming thunder. The band has a tendency this last decade to play pensive, melodic and sorrow-saturated material which really needs the air to breathe to lay in on the audience, and this live offers just that. Crisp clarity that doesn't drain the rhythm guitar of power, well-performed leads that scream straight into the mix where they belong, extremely professional beyond even the bands' years; there are legacy metal acts with 30-40 years experience that will often put out sub-par live products that cannot even come close to matching this. And the set is amazing, even the intro/organ instrumental that sets up the second disc, and the beautiful guitar instrumental later on. Turns out the slightly more adventurous, proggy pieces off The Formula of Death mixed in quite well with the black & white melodic Goth/death. That wafting gloom is never lifted throughout, and I can only imagine breaking out into the death/thrash of their formative years would have probably spoiled the spell this can cast on the listener...EVEN in the context of the live disc.\n\nYou also get a DVD of the performance with some added bonus materials, and it might even be my preferred way to experience the music, with a funereal din to it thanks to the lighting and the way the musicians' faces are pretty much obscured throughout. The whole package is a victory for Century Media, a live product that is wholly worth the money a Tribulation fan will spend on it, appreciated largely by folks like myself who haven't had the pleasure yet to actually catch them on a stage. After listening through and watching this several times, that's something I need to put on my bucket list, but even if tragedy strikes and I'm unable to do so, this feels like its nearly as good as being there.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThe Nightbound EP was another skimpy little fan EP that arrived with little fanFARE, available in two versions, of which the digital was the more substantial by one track. This is really just multiple versions of the same song, and while I like \"Nightbound\", and LOVE Tribulation, I don't really think there's enough of a deviation between the separate incarnations that it warranted any sort of additional product. Now, that's not to say that any of the three are BAD, but usually if you're going to release something 'extra' you throw the audience a bone or something, maybe include a cover, a rarity, something that makes them feel as if they've locked ears on something exclusive and interesting. In fact, this very band has done such before with singles. I'm going ot hazard a guess that this 7\" and digital EP probably wasn't entirely the band's idea...\n\nNow, all three of the \"Nightbound\" tunes included are fine...the studio track we already know off of Down Below, but the live recording certainly sounds pretty good in that context, with bright guitars, vocals and rhythm section all mixed quite well, and arguably this is the most energetic deliver of the track on the EP. Lastly, there's the instrumental demo, and while it's not a song that truly benefits from the lack of vocals, it's fine for mood music. I'm covering the digital edition myself, but if you go for the 7\" I'm pretty sure it doesn't even include the studio version, so it's another reason you're just buying it for that minimal artwork and to have another 7\" record sitting on your bloated shelves that might not ever even be listened to again...but hey, maybe will be worth something? Doesn't seem like the content to this is even historically worthwhile as a collectible. So the bottom line, I love the band, the song itself is cool, and I love their albums as I've written about numerous times, and the Nightbound EP is entirely skippable.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nIt took me more than 7 months to nail down this review, reason for that is because I needed to concentrate and give an honest review about this record, there are some records that strike you right out of the gate when they get released, there’s the hype and the sort of need to like the record because it’s one of your favorite bands and want to like it, but let’s be honest, there are some records that don’t age well and as the time goes by you start to realize you don’t really like the album.\n\nI have a long story with Tribulation, when the band released their third album Children Of The Night (first with Century Media) it took me by surprise, as I was expecting a different album coming from The Formulas Of Death and The Horror, gave it some time and it grew on me after 4 months listening to it every single day. By the time Down Below was released I was already used to the new approach and sound of the band but once again it took me a few months to digest the record and actually like it. To me it was a nice follow up record but a bit plain and no surprises across the board.\n\nDuring the last 2 years I didn’t even listen to Tribulation that much to be honest, but by the end of 2020 when information came out about their 5th studio album and the news mentioning it was going to be the last record with founding member Jonathan Hulten the expectations were high. I didn’t even listen to the singles and waited for the album to be released to see what the band tried to accomplish with this latest record.\n\nAs soon as the album kicks in you know this album is very well produced compared to their previous albums and the listening experience is way better than before. The balance between the songs make the album a nice ride, from the haunting passages of “In Remembrance” to the catchy “Hour Of The Wolf” to the post-punk infused “Daughter Of The Djinn”, the epic almost anthemic “Inanna”, the fast “Funeral Pyre” and the last song “The Wilderness” will make you think you are listening to a march song, all those remarkable attributes makes Where The Gloom Becomes Sound the best record of the band so far (at least their best record sound wise, and mixing a bit of all their previous elements all in one).\n\nBut Where The Gloom Becomes Sound is not a perfect album, by any means, there are long sections where you might think the track could have been a bit shorter, but overall Tribulation did an amazing job with this album. Great lyrics, gloomy vibe, nice artwork, best production so far, drums sound way better than before, there are a lot of things to praise.\n\nJonathan Hulten’s legacy and career with the band was greatly sealed with this album, let’s see how the band can take it from here, it’s going to be a big challenge to top this record without the aid of one of the long lasting members. But while we wait and hear what the band will bring in the future, enjoy Where The Gloom Becomes Sound as it has to be one of the Top 10 albums of 2021 for sure, and I’m positive it will make it into lots of year end lists across the metal, gothic and rock community in general.\n",
        "\nTribulation is a band that transforms itself much faster than I can think. This results in the fact that their second work gave me an ambivalent feeling and I was not interested in their following efforts, because the way ahead was already charted. But their debut left an enormous impact, at least in my living room. Due to the great potential of the band, it still baffles me that the Swedish horde released its first work on a label from Singapore. Did nobody in their homeland - or at least in Europe - realize their great abilities? Okay, my boss does not realize my great skills as well, but this review does not deal with that physically fat yet mentally thin guy. (I mean my boss, not me.)\n\nAptly titled, \"The Horror\" spreads a nightmarish aura. All tracks are totally reckless and many combine furious and morbid elements, but the raging sections definitely prevail. The songs cannot be easily categorized. It's a mix of all relevant extreme sub genres, black, death and thrash metal - in this order. The high level of energy has the highest priority and ensures the homogeneity of the debut. The listener faces the eye of the storm as soon as the opener breaks loose. Its solos border on insanity and King and Hanneman (R.I.P.) would love them if they could listen to them. But the solos are just one building block, it happens a lot during the tracks. They are equipped with the right amount of breaks without being progressive. On the other hand, the tempo changes, the slicing guitars and the omnipresent force guarantee an exciting listening experience. Tribulation do not only concentrate on high velocity, but they have integrated hyper-fast sections in each and every song. This leads to nine high class eruptions which profit from a brilliant sound. The voluminous guitars pave the way, but they do not sideline the hateful voice or the thundering drums. No doubt, listeners who are not used to consume metal, will describe this mix with words like apocalyptic, hellish and brutal.\n\nSpeaking of brutality, we may not forget that these dudes originate from Sweden. This means that their DNA is a very specific one and they are not able to present brutality for the sake of itself. They also have great technical skills and therefore they play very tightly, precisely and powerfully. And, even better, the group does not run out of ideas. Quite the contrary, the longer \"The Horror\" lasts, the better its songs become. The outbreak on the eighth position, \"Seduced by the Smell of Rotten Flesh\" starts with flattening guitars, but a high speed eruption is following immediately. Great riffs and hammering drums characterise this relatively long outbreak of hate, but there is also a contrasting section that holds some gloomy keyboard. All different parts go hand in hand and its spooky outro seems to be an excerpt of a feast of vampires in an old castle. (Please send me an e-mail if vivid imagination needs to be treated.) \n\nThe closer convinces with a fantastic structure, too. It delivers an example for those songs where, all of a sudden, a pretty melodic guitar line leaves the orgy of brutality behind and adds an unexpected ingredient. No doubt, Tribulation used a great recipe when penning this diabolic work and it remains a pity that they threw their successful formula away after finishing it. I guess they belong to these overly ambitious musicians who always feel the need to say that they hate to record the same album twice. But who has ever asked me whether I agree with that attitude? I wish \"The Horror\" would have a very similar brother, but its kinship rather consists of dubious creatures.\n",
        "\nI've already gone on at length about Tribulation's latest album, Down Below, the first case in my opinion in which they've decided to stick around on one particular style and refine it. The results were roughly even with Children of the Night for me, but I've enjoyed both the albums quite a lot when I'm in the mood for an overcast but beautiful admixture of traditional, melodic heavy metal, death metal and the Gothic overtones the band has been obsessed with in both sound and image the last couple outings. \"Lady Death\" is the third cut on that full-length, opening with an ambient escalation into a downtrodden, mid-paced mope-rocker glazed in great, classic melodic lines that merge very well with the harsher bite of Johannes vocals and the sparser, steady lower chords...a treat for fans of melodic death, Euro-Goth metal, or even Trouble-esque doom metal since a lot of the note choices just put me in a similar mood to much of their material from around 1985-1990.\n\nBut, as with the first two entries in this triptych of Tribulation singles I'm reviewing, I had already heard half in advance. The \"Lady Death\" half. What truly drew me to this short player was the second song, \"Skärselden\", which I had not been acquainted with. To my surprise, it is not at all a cover or another rock-oriented piece, but instead a 4 minute swell of haunted dark ambiance which feels gloomily cinematic in its scope, cresting at about a minute in, and then again later in the song. Now, as a dark ambient fan in general, I was fairly satisfied with this. Usually I'd like a longer time to get these vibes festering in the shadows of my imagination, but if nothing else its proof Tribulation could have a career on a Cold Meat Industries or some other comparable label, alongside one of their talented ambient countrymen like Raison d'être. That being said, I could see how this would throw off some fans...I mean we don't have much context for this in terms of Tribulation's body of work, and I'm sure a lot of people anticipating Down Below would have preferred a more representative example of their music to whet their appetites alongside the lavish \"Lady Death\". Mileage is going to vary on this one, but it's probably not the wisest career decision. Nonetheless, in hindsight, the title track is about on par with the rest of their fourth full-length, and the ambient piece is fine for what it is. As to the value of this single? Or this 'EP', as semantics would have it? Not much at all, though the cover of the 7\" is eerie, minimalist and classy.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nIdentical to my approach towards Tribulation's prior single, The Death & Rebirth of..., released in early 2015 before Children of the Night dropped, I was only interested in Waiting for the Death Blow for one reason alone...the Swedes' cover of \"One Hundred Years\" by Gothic heads of state The Cure. Now, this single is actually comprised of TWO covers, the other being \"Pay the Man\" by the pop punk sensations The Offspring, but I had already heard that from the Melancholic EP in 2016, on which it was repressed. It was a strange choice, to be sure, but probably one of the Californians' least obnoxious tunes, and I'd say that its transformation into moody, melodic deathpunk metal probably raised its stock with me, but if I compare it to any of the original Tribulation material, in ANY of their stylistic eras, then it falls short of the mark.\n\nOn the other hand, \"One Hundred Years\" is closer to a stunner, capturing the mood of the original but also twisting it into something more appropriate for the cult, black & white horror nightscapes that the Swedes have become known for these last several years. This is Jack the Ripper and Vlad Dracula taking tea in some dingy corner pub while gleefully swapping tales of victimization. The vocals are a little overloud, moreso even than the complaints I occasionally read about their growling in general, and the bass guitar doesn't quite have the same presence as in The Cure version on Pornography. But the atmospherics conjured up by the guitars and steady shuffle of the kit are wonderful, and the lyrics, which contribute the title of the single, still haunt as they did coming out of Robert Smith's quivering wails. So this one is well worth a listen, and guess what...if you're smart, and not me, you can pick this up alongside \"Laudanum Dreams\" from the last single I covered, on the digipak version of Children of the Night through Century Media. Waiting for the Death Blow itself is unnecessary unless you've committed to collecting just about everything. Cool cover pic though.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nI'm actually coming at this single in reverse order here, having already been exposed to the demo version of \"Holy Libations\" as it appeared on the band's Melancholia EP one year later. To briefly reiterate, I found it and the other demo recordings there to be roughly on par with the versions on Children of the Night, slightly less polished and fractionally more passionate due to the mix, but not enough that I'd switch over to them rather than just run through the entire album. For this single though, it definitely seems as if it would be hurried out the door just to have something ready for the band's installed audience, perhaps even a 'shot across the bow' for those who might not have been anticipating their transformation from the progressive death of Formulas to the more sultry and melancholic Children. To that extent, it serves its purpose, with this memorable, morose tune the vanguard, and the bonus that it's a limited press 7\" collector's item.\n\nBut for those not interested in such baubles, fear not, because the B-side, the reason I was actually interested in checking this single out, is also available on several of the full-length presses, only somehow not on the one I originally covered, because fuck my life. \"Laudanum Dreams\" was the real attraction for me, and I was not in the slight bit disappointed, since it's a driving, solemn and vicious piece rife with thundering fills, walls of chords, and threads of melodic tremolo picked lines which almost create a mid-90s, mid-paced melodic black metal feel, and the brazen, shining 'chorus' of the guitars is well worth the investment, along with its overall triumphant aesthetic blow the torn throat roar of Johannes Andersson. Cool band pic, too, in coffin shapes on the cover, a Gothic noir sort of 'teaser' in the title as to their style change. Ultimately, you just want to track down a version of the full-length that includes \"Laudanum Dreams\", and if you need experience the demo mixes then go for Melancholia upon which there are more than them. So I can't stack praise on this, only that it's got a good B-side which is album worthy.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nTribulation has been one of the few bands out there lately which can make such huge tectonic shifts in style between albums and still pique my interest, exploring every continent on Planet Death from the kinetic thrashing Swedish death/thrashing intensity of The Horror, through the psychedelic augmentations of The Formulas of Death, and then subsequently into a melancholic style of Gothic-tinted heavy growl metal which seems a lot more laid back yet no less effective than the earlier incarnations. This is why Down Below strikes me as an anomaly, because for the first time the Swedes seemed to have staked their claim on a terrain and hung around for awhile. It wouldn't be a stretch to call this Children of the Night Part Deux; there are some minor variations in production and songwriting, as this seems a bit louder, mildly more energetic and straight to the face, but it does lack some of that surprise factor you might have experienced when first listening to the two full-lengths before it. Which might be a turn-off, if the style just weren't so attractive in and amidst all my other listening.\n\nThe riffing remains simple, sad, and beautiful, owing to its atmospheric adornments as much as any internal nuance. I'm not saying it's entirely predictable the first time through, but the band is relying a lot more on traditional senses of harmony and rhythm chords and not so much the death metal roots. When I listened to its predecessor, and when I also hear this, I feel like I'm hearing what shape a 'melodeath' sound might have taken if the amplification technology and rock music existed back in the Victorian era. The tunes all evoke cult horror imagery, and are unquestionably inspired by both the black & white cinema of those early Hammer and Universal flicks, or the Gothic literature of writers like Poe, Shelly, Stoker and Radcliffe. I realize this creates a strange anachronism, and even more so when Johannes Andersson's nihilistic gutturals stretch out over the gloomier but warmer rhythm guitar passages, but it's just one of those melodic death sounds that feels instantly distinct when compared to the more frantic, showy Scandinavian bands that have dominated that style for well over a decade. In fact, I could draw parallels between this album and Sentenced's underrated Amok in 1995, which also had a moody, Romantic heavy metal foundation contrasted by the grueling and charismatic growls of Taneli Jarva. Or maybe even their countrymen Raise Hell on the 2nd and 3rd albums, where they'd weave in similar horror-inspired melodies; only this is far less brash and not at all thrashy.\n\nAt any rate, Down Below is extremely catchy, with a lot of focus on leads and melodies that glaze its moderate rock beats like synth lines from classic horror films. Voluminous percussion. Grand, grating growls that, while monotonous, are strangely subduing. Well-developed bridges, breaks in the rain, exhalations across the dark smokestacks or gargoyle-laden skylines. Solos that are never overly indulgent, but fit the moods of their individual tracks and overall consistency of the album just fine. Even the few moments where this record devolves into sheer ambiance are wonderful. I would say that it does often seem a little too samey in its riffing structures and pacing, perhaps even more than Children of the Night, but that's only a problem so long as I don't enjoy what I'm experiencing, and for me Down Below and their last albums are emblematic of extravagant, ghoulish productions that I really enjoy sitting down to watch, or read. What a fucking great band this is, whether they stick around in this same sphere or once again forge ahead into the unknown, I'm on board, shivering in the full moon, checking out the windows for any black wings that might fly past.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nThis split sampler was exclusively released with German Hard Rock magazine to promote Watain's upcoming studio record Trident Wolf Eclipse and Tribulation's future release Down Below. Along with two new tracks in each case, this release also includes a rehearsal song from Watain's last release The Wild Hunt as well as a rare The Cure cover from a single released by Tribulation two years ago. I had heard about both bands before but wasn't familiar with their styles yet. This release shows that I didn't seem to have missed much.\n\nWatain plays atmospheric black metal with a few early thrash metal influences that work best in the more elaborate \"Sleepless Evil\". Tribulation rather sounds like a gothic metal band with atmospheric, numbing and smooth riffs that sounds best in the elaborate and gloomy \"The Lament\". I would compare the former band to Dissection and the latter to early Moonspell.\n\nOverall, Tribulation's sound is a little bit more down my alley even though the three songs already have overlong, predictable and repetitive patterns. Watain's cuts sound like quite generic black metal and fail to grab my attention. The songs of both bands aren't bad but rather qualify as background music at an extreme metal party or gothic festival in my book. This split release with an old school cover art in the key of old cassette tapes isn't a shabby gimmick as free giveaway with a metal magazine but I wouldn't buy any of the band's new outputs so far.\n",
        "\nA follow up album will always be measured by the standards set on the previous one that is a fact, high expectations can kill an album release, marketing involved, the release date, the promotion, etc.\n\nTribulation set new standards in death metal with their highly acclaimed “The Formulas Of Death” and right after its release all the fans and critics alike popped the question, what would they do to make a better record ?. After 30 spins I am writing this review. \n\n“The Children Of The Night” is not your average record coming from a band trying to reinvent the wheel, as it wasn't crafted about experimentation and progression. Lots of people (including me) might think this 3rd full length was going to be a hard listen, going deeper into the depths of what the band created with “The Formulas Of Death” and might polish the trademark sound created with it. Well… guess what? That is not happening here.\n\nAs the album begins it’s almost impossible not to compare the intro to what Ghost (Ghost BC) have done in the past, with a Hammond organ giving the creepy atmosphere for the entire record. Then the starting riff of the second track begins and the whole picture is unveiled, my hope for a total metal album was gone, I knew right there that this was going to be a rock album with an obscure traditional heavy metal approach. The guitars sound like classic Jimmy Page overdrive sound with a bit more bottom end reminiscent to NWOBHM distortion, the drums are as rock basic as possible, no fast parts, no double bass drum kick and a 70s, 80s edge to it, specially the snare and cymbals. Bass guitar is pretty much audible every moment which gives a sense of clarity and open sound to the record.\n\nNow the most critical side of “The Children of the Night” apart from what was mentioned before, are 3 things: Songwriting, Structures, Keyboards. The songwriting approach is weird, parting from 2-3 main riffs per song and just play around those to finish the song. The structures were also affected, going from intro, verse, chorus, verse, bridge and end, to an even more basic structure in a couple of songs. And now the risky dice played in this record, the keyboards (to me) make this record lose its focus on the main idea, as it gives more filler time than flow over the songs, abusing of its sound was not the right idea on my perspective as instead of making the band sound mature, it could made the band sound a bit pretentious. After listening to the first 2 songs I pretty much knew 90% of how the record will end up sounding in general as they keep the same mood and vibe through the entire album.\n\nBut not everything is bad about “The Children Of The Night”, actually I can say this is a very enjoyable, fun and easy listening record, you don’t need to pay lots of attention to what is going on, you just put the record in the player and let the flow takes you to a mix of 70s, 80s and 90s rock with heavy metal and even some post rock and post punk sounds, this is the kind of record you can listen every time, every day and won’t put you to think much about if it’s good or not, just make you play the air guitar like trying to mimic Pete Townshend, Jimmy Page and the early guitar gods. If it wasn’t for Johannes Andersson vocal delivery this album could have been aimed to a different market.\n\nThe artwork is magnificent, but not original (again), as it’s some sort of inverted copy of the cover from a classic horror movie of 1915, however it displays the music contained pretty well, the layout is awesome, very dark and classy. The length of the album might be a problem for some people wanting to listen to a 30-40 minutes album, as it clocks over 55 minutes for the regular edition and over 60 minutes in the special editions making it an album hard to listen completely again after you listen to it a few times and maybe just selecting your favorite songs for the casual listen session.\n\nI must say that even when this album is an easy ride record, it’s a joyful ride and bring back feelings that other bands don’t deliver anymore, I went ahead and revisited some Led Zeppelin, Rush, Deep Purple and Black Sabbath records, and now I think of them as timeless pieces of art due to their catchy and easy approach, and I think Tribulation aimed for it and succeeded, creating a timeless record were rock meets early metal, no matter if you like Iron Maiden, AC/DC or Van Halen everyone is invited to rock the hell out of it and have a good time.\nOld school death metal fans will criticize the path Tribulation took this time, and will probably say they sellout by signing to a bigger label and putting out an album like this, however this is not about evolution, sometimes we just need simple stuff to make us remember where we come from, how do we end up listening to rock music and why we love it so much.\n\nIs “The Children of the Night” a contender to album of the year? Well my friends, I must say it will sure make it into tons of end of the year lists, and I will feel very disappointed about the entire human race if not. If there is an album you need to buy this year, I would say go grab this one.\n",
        "\nThe Melancholia EP is presumably, ideally, a means to stash a bunch of unreleased material somewhere fans can access it while they eagerly await Tribulation's next eclectic transformation on album #4, but an initial scan of its contents does not look wholly promising. You've got the titular cut already released on their last full-length Children of the Night (which I loved, don't get me wrong), two remixes of that track, three demos of other songs from the album, and...an Offspring cover. That's right, an Offspring cover (\"Pay the Man\"), which was itself fairly expansive and largely uncharacteristic of the band's standard punk rock anthems. If you weren't aware of the song beforehand, however, you might not even realize that this wasn't original, because of that very fact; Tribulation do a decent job with it but I can't actually say it's better than the original even if prefer Johannes' growls to Dexter Holland's irritating high pitched timbre. Still, the fact that they take such an unusual choice and blend it into their most recent aesthetic is pretty interesting, it was far from a throwaway choice.\n\nSome might actually find the demos of \"Holy Libations\", \"Motherhood of God\" and \"Winds\" a little better than their final album counterparts, because they sound a fraction more visceral and raw. I might be on board with that, only beyond that fact there is not a terrible amount of difference with how they ended up. The emotionally resonant, drifting heavy/death moments of the tunes come off the same, though, and they lack the element of surprise when I first experienced them in their polished studio format. I couldn't care less for including the title track like on any cash cow maxi single, so a lot of my interest was directly focused on its remixes. The 'Steingrim' remix is more or less a remaster with different instrumental volumes, but it sounds a little clunky and in no way would I prefer it to the original. Far more of a risk is the Author & Punisher version of the tune, which does actually dissect it down into its components and bake them in a minimalistic trance of hip hop and industrial lite sound forms, keeping the growls intact but making everything else rather hypnotic, to the point that it's the best part of this EP and its only truly redeeming feature, just for the tones the musician is able to produce.\n\nThat said, industrial/electronic remixes of metal tunes are old hat, and this isn't exactly more unique or compelling than a lot of what you've heard from bands who used that as their primary style, or more severe experimenters like Ulver, etc. So while I enjoyed this deconstruction a few times as background noise, it wasn't really worth the price of admission for the physical EP. Ultimately, while I didn't hate all the content here, I think I would have much preferred 3-4 new or unreleased tracks over the choices the Swedes made. Maybe tack on the Author & Punisher mix and the Offspring cover as bonus tracks on that, but the fact is it's 2016 and releases like this have very little currency except as prehistoric means to claim a few dollars from the painstakingly loyal audience members. Considering the amount of buzz Tribulation were able to generate with their latest album, and the positive critical reaction to the prior two, it appears they've hit a level where frivolous product like this is possible. Not entirely garbage, and worth listening to once or twice if you care about the band, which I do, having thoroughly enjoyed each of their records for its own reasons. However, I'm far more excited for what their next complete creation/direction will prove, and this was barely even substantial enough as an appetizer. I'd tell the wait staff it needed much more seasoning. Bland.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nI am still of the mind that The Horror is the greatest thing Sweden's Tribulation has yet recorded, but that's not to say I'm any less intrigued when there's the announcement that they're releasing anything new. Yes, their explosive, rabid death/thrash origins have yet to be eclipsed by their experimentation, and the sort of constant reinvention they pursue is likely to earn the ire of many a purist; but The Formulas of Death was certainly an excellent departure into a murky swath of prog/death territory which hadn't been explored with quite the same sound. The album I'll turn to when I wish to listen more with the skull-brain and not the dick-brain spearheading my testicles. With Children of the Night, the Swedes have yet again morphed into a new state of being, one quite unexpected, and if you're in the mood for it, one quite poignant and passionate.\n\nThis is essentially a brand of melodic, melancholic death metal with simple chord patterns that are infused with cleaner licks, pianos, and other means to conjure up a more emotional response from the listener, and it works really damn well as long as you're not just jonesing to chew out the band for simplifying its sound a few steps below its predecessors. I've seen descriptions of this as 'indie rock' with growled vocals, and I'm not sure there's much merit to that statement, but certainly the songs take a shift towards the dramatic minimalism of pure heavy metal or hard rock and occasional chord patterns wouldn't be out of place on a driving, melodic punk record. The difference is of course that the little leads (\"Melancholia\") and the snarled vocal anchors it into a shadier terrain which really holds the attention if you're tracking down something which is catchy and relistenable, reminding me of what I liked a lot about an album like Sentenced's magnificent Amok or a bunch of other Finnish bands whose balance of aggression and melody was derived from the Amorphis sophomore.\n\nRhythm guitar patterns are quite simple in structure, but the chords issued are quite nice in conjunction with the leads, and every song bears some form of distinction, while functioning near seamlessly on the whole. Every choice of mood and shadow seems practiced and deliberate, the tempos are fairly widespread across the track list, and Johannes Andersson's nihilistic rasp is a great contrast to the sadness espoused by the instruments. I couldn't even name a singular song on here which I'd hold above the rest, because it's all so consistently wrought over the hour-long experience, and it's an album I've come back to almost as much as anything else this year. Lyrically it's also a mesmerizing record, paying ode to the personal horrors of nightmares and other intangible unknowns, a 'ghost story' as opposed to a visceral death metal record. To that extent, Tribulation have yet another winner on their hands, and I'd be lying if I said I didn't enjoy this more than the sophomore. The rare effort where the sum is the equal of its parts but any individual piece of music would be a delight taken out of the context of the entire album. Something unexpected, ethereal, but never lacking in the underpinning darkness of blacks & grays, midnight signals from haunted columns and cobbles. Aesthetically, a 'Gothic novel' of the death metal medium, its dread patient, not punishing until that very last moment when the curse or loss is recognized.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\nIn a world devoid of originality and quality, a small number of bands have emerged to bring excellence back to music. One of these bands is Tribulation, hailing from Sweden. \n\nAt the beginning of their career they played a style of death metal similar to that of fellow Swedes Entombed, Dismember, etc. Already on their second output, The Formulas of Death, they evolved their sound immensely from being an almost tribute-sounding act, to bringing something new to the world of metal. A broader spectrum of sounds arrived here, with clear influence from progressive rock which resulted in a long record with much more variety and depth than anything in death metal at the time. \n\nWith their new record they have stripped down, and changed, their sound a lot. While the former record had a big sound and almost epic riffing at times, this record, The Children of the Night, focuses more on clean picked guitars and atmosphere. This is not a bad thing at all because they really accomplish creating these simultaneously melancholic and eerie sounding melodies that send shivers down the listeners spine. \n\nWhile their two first records were rooted in death metal, the only thing that hints at the bands earlier outputs, is Johannes Andersson's raspy vocals. Everything else seems much more influenced by the aforementioned progressive rock and perhaps black metal in the atmospheric parts. In regards of this, it must also be mentioned that every song here is more or less mid-tempo, and thereby there are no blastbeats. The drummer, Jakob Ljungberg, does not try to play as technical as possible. The drumming does its job, so to speak, without being unnecessarily spectacular. What he does is keep himself in the background but create a strong backbone for the guitars to shine.\n\nAnd the guitars are certainly he highlight on this record, played by the two fantastically talented guitarists, Adam Zaars and Jonathan Hultén, who do not only write those clean guitar intros but also excellent solos that lifts this record to the next level. \n\nFrom this record it becomes clear that Tribulation is a band that is true to themselves and does whatever they want as a band. From the clearly Bo Hansson-inspired instrumental Själaflykt, which features a lot of organ, like the intro song Strange Gateways Beckon, to the extremely catchy singles, In the Dreams of the Death and The Motherhood of God, the bands sounds inspired, and draw influence from a wide variety of bands, and as seems so rare in the scene nowadays, creates something original without trying to sound like their idols. An exceedingly brilliant record.\n",
        "\nOkay, first off it is really hard for me to rank any album as 100% or perfect. Now, I hadn't heard of Tribulation until \"The Children of the Night \"came out this year. When I heard it, I was immediately blown away by the dark, melancholic atmosphere only to be compared to the first couple of Dissection albums. There's this weird, eerie vibe throughout the whole album that sends you to a dark Transylvanian type place. But it's only theatrical in that sense. But even though the aesthetic of the album seems fictional, the emotion behind it is so real which is why this album stands out to me so much. One more thing to point out on the subject of theatrics is their stage presentation. They dress up kind of gothic, or like vampires, which does suit the music and themes without being cheesy. \n\nAfter listening to this album, I went back to check out their first couple of albums. In my opinion they were good, especially The Formulas of Death, but in no way as unique as this release. Compared to the first two full lengths, they have slowed down the pace a bit and introduced a lot more melody and atmosphere, a lot of which comes from different instruments such as xylophone and synths. Unlike their previous releases, there are no thrash or blast beats to be found on this album, but it doesn't lose any power or momentum. Despite Johannes Andersson's growled vocals, it is not simply just a death or black metal album. It also has elements of horror punk, psychedelic rock and goth as well. And even though his vocals are in the vein of death metal, the lyrics are very audible (not unlike Jon Nödtveidt of Dissection). There's also a cover song of The Cure's \"One Hundred Years\" on the limited edition version, which is really fitting to their style because they seem to draw inspiration from The Cure's dark, moody vibes. \n\nBottom line: check this album out. It deserves the recognition. \"The Children of the Night\" stands out among the hordes of generic, uninspired metal releases coming out. There is not a weak song on this album, but my favorites are \"Melancholia\", \"The Motherhood of God\", \"Holy Libations\" (which has an awesomely epic guitar solo), and one of two instrumental tracks entitled \"Själaflykt.\" This is one of those albums where you have to listen to it from start to finish, like watching a good movie. It seems as this is the type of album that is going to separate fans because of such a stylistic shift, but I think that the shift was for the better because these guys are true musical geniuses and obviously have drive to create innovative music without being pigeon-holed into any specific genre. Hell, I can almost bet their next release won't be too similar to this one, and I hope it's not!\n",
        "\nTribulation has come a long way since the days of “The Horror.” The acid surge of slaughtering death metal transformed on “The Formulas of Death” to a progressive death metal template, which the band later dropped on “The Children of the Night” for a rock-based blueprint protruding from Tribulation’s death metal seeds. While the changes have been drastic, Tribulation has maintained a sense of individuality, establishing itself more as a concept than a particular sound. What “The Children of the Night” lacks in intensity it makes up for in a horror-themed brand of subtlety, lightly glazed over the band’s death metal roots and the more experimental elements of “The Formulas of Death” hiding in its cracks and fissures.\n\nTribulation proved early on they weren’t easy to trip up—taking on death/thrash metal in its truest form on “The Horror” proved fruitful while some have yet to even make a dent. The band’s creative skill and knack for writing excellent music are the cogs on which “The Children of the Night” gains momentum, despite showing a different trajectory. The production of the album reveals something more passive and careful; the drum sound and the heaviness of the guitars have been dialed back a bit. The songs, likewise, are structured like rock tunes, not so eager to ejaculate constant bedlam. Clean guitar lines and rocking riffs have replaced the blazing death metal aesthetic of yesteryears. There are no blast beats, no Slayer-esque solos, no recipes for annihilation.\n\nBut “The Children of the Night” merely twists the symmetry of the Tribulation dynamic into something subtle and atmospheric. The band seems more adventurous than ever in this reserved state of mind, ironically. “Strange Gateways Beckon” props up soft guitar lines between its heavy, crawling rock riffs, while “In the Dreams of the Dead” and the rocking “Melancholia” flirt passively with psychedelic influences lingering in its backdrop. The melodies and lead guitar aesthetic, especially in this style, are profound to the record’s addictive sound and its mystery. These points come to a head on the closing “Music from the Other,” a spine-chilling, shadowy opus of Tribulation becoming more than a specific sound.\n\nThe vocals are still harsh, unmistakably the same voice heaving over “The Horror” and “The Formulas of Death.” The important thing to realize is that while Tribulation’s roots are still present in lingering forms, the rock-based template brings a new energy to a paradigm that had proved itself ahead of the pack. Tribulation’s efforts prior to “The Children of the Night” were outstanding, and while it did take a while for the conditions of this evolutionary curve to make sense, the results, when fully revealed, were worth the sweat. The group’s ability to expand creatively is augmented by superb musical performances and memorable tracks, which drip with the dark genius of Tribulation. It’s important to take “The Children of the Night” for what it is, not what Tribulation was.\n\nThis review was written for: www.Thrashpit.com\n",
        "\nThe initial reception to the sophomore Tribulation album has been a matter of listeners ‘adapting’ to their change of musical direction.This of course comes on the back of a trend within the metal genre where the presence of a ‘new old school’ has gained widespread approval and currency.\n\nOften, a stylistic shift can reflect a desire to move with the times, or even eschew the restraints and norms of a generalization. Whilst the musical content here is certainly more accessible, the sense of structure is more intricate, broad and sophisticated.\n\nWhere many releases never transcend a ‘collection’ of songs, ‘The Formulas Of Death’ maintains a broad, conceptual depth that brings a progressive aesthetic and framework to the forefront.This was mildly hinted at on earlier work through the use of brief, subtle interludes but becomes conspicuous here.\n\nIn the artwork as well, this aesthetic is hinted at greatly. In font and cover choice one immediately thinks of Goblin. Musically this is more so prevalent, and the influence of Italian progressive rock bands such as Premiata Forneria Marconi, Biglietto per Infierno and Jacula can certainly be felt here. A comparison to the recent ‘occult rock’ acts can be sensed on a surface level, though may rather be a case of these artists sharing a similar set of ideas.\n\nThe clean, psychedelic guitars are similar to Negative Plane and song structures are at times like Fleurety or Ved Buens Ende, more accessible and less disjointed. The guitar riffs are here more accessible than on their first album. They are enriched in melody and epic like Dissection, though the punchy rhythmic strum, similar to Entombed and Dismember has more emphasis on the power chord than it would on tremolo picking. The predominant heavy metal influence could easily be compared to Mercyful Fate and Death SS.\n\n‘The Formulas Of Death’ is an album that works its wonder when played from the beginning to end. Hearing an individual track from this record might mislead the listener into assuming that all of the songs have been simplified, and went down purely more accessible path that fellow Swedes Tiamat and Hypocrisy took in and around the mid-90′s.tribulation band Collectively, this proves otherwise.\n\nWhere their full-length debut, ‘The Horror’ was a solid effort, it only gave a mere hint towards the grandeur that Tribulation aspire to, and achieve here. Where the ‘opening up’ of many bands is often code word for going soft and watering down, Tribulation flourish with a mystical sense of ambition.\n",
        "\nI want to really like this. It's not a bad album by any means and is basically \"melodic death metal\", albeit with more Mercyful Fate/In Solitude overtones along with a hint of classic Swedish-style death metal. \n\nAt the heart of things, the band isn't necessarily bad as they have a lot of the basic components down and are fairly talented musicians, clearly skilled, but not showy nor necessarily technical either. The band choose their riffs well, stripped of any excess weight or flashiness and make them hit hard and move sharply with adequate instrumental support playing like very well-trained traditional metal musicians. To add to this is an incredibly well done production job that would be the envy of countless other \"revivalist\" metal acts. However, the songwriting doesn't quite live up to what they were clearly trying to do. It's more so in the vein of classic heavy metal with some moments more akin to earlier Swedish death metal, but for all its splendor and expert re-appropriation, it never achieves the same compositional depth of groups like Eucharist, The Chasm, or Vex. The core problem is that it's a bit repetitive at the end of the day and the songs never quite develop too far beyond their initial premises; death metal it might be advertised as, but this is straight up traditional heavy metal at its heart. It's not bad due to this, but not quite as well fleshed out as it could have been in spite of all the promise shown. \n\nIf this band really want to up their game, they'll go for more narrative approaches to songwriting, structuring their songs in a way that offers more detours and alternate views of introductory ideas as well. For now, this is a better alternative to the usual tripe that passes for accessible extreme metal, albeit a somewhat disappointing one.\n",
        "\nRecently I had a discussion online about which has more historical precedent- a band defining their style on the first album, consolidating it on the second and then facing a difficult third album where they must adapt to stay relevant, or whether the second album was the typically difficult one. I still maintain that the former is true, and that most bands really hit mature and hit their stride on their third LP, but occasionally we get bands who bypass one of these stages and drop their real gamechanger on album number two. Morbid Angel's huge leap into the abyss between Altars Of Madness and Blessed Are The Sick is the most recognisable historical example and it is a comparison that has been made in discussion of the new Tribulation album all over the dark recesses of the web where those things are discussed. There is many things that have changed in Tribulation since then, and a Morbid Angel-like evolution is a perfect way of describing the scale of it.\n\nOne way I have been describing this shift to people is that Formulas Of Death is to Dario Argento movies what The Horror was to James Whale creature features, but there is much more to the atmosphere of this album than that. Overall the album sound in the atmospheric parts is cleaner- less distorted and more overdriven, and has a lot of influence filtering in from Classic, Progressive and Psychedelic strands of Rock. There's no pussyfooting whatsoever with this and the first thing that pokes through the mire on opening instrumental “Vagina Dentata” is how much it resembles The Doors' classic “This Is The End.” It ends in a more Opeth/Camel sort of vibe but The Doors, and to a lesser extent Jefferson's Airplane, figure quite heavily into this album's sonic makeup, like on the second instrumental \"לילה\" which mixes it with some vaguely John Carpenter-ish synths and some absolutely beautiful piano-playing. Pink Floyd are the other key Prog influence especially on the epic, twisting and melodic “Rånda” and also the brilliantly-composed closer “Apparitions” where it is fed through a Nachtmystium filter. Some of the influences on this album's aura though are a bit closer to home, especially the warm exotic feeling of “Wanderer In The Outer Darkness” which has a huge smack of the Tiamat classics Sumerian Cry and The Astral Sleep off it. \n\nThis last comparison serves as a handy reminder that such progressive touches are by no means antithetical to being a Death Metal band, or that it renders Tribulation incapable of doing what they almost perfected on The Horror. In fact, “Spectres” not only has some of the blitzing Repugnant style Death/Thrash of their début but some of the most chaotic riffing they've ever had, and “Spell” is a bona fide piece of ear-shattering darkness too. Just because these lads wear skinnier jeans and some very fetching Italian leather footwear in their promo shoots these days doesn't mean they can't string together a bludgeoning riff or too any more!\n\nWhether it's a case of Tribulation seeing the oncoming horizon of oversaturation in the Death Metal sea that dawned on Sweden 2 decades ago, or whether the resolutely old school style was always too restrictive for their ambitions I do not know, but either way the days of them being a straight-up Death Metal band seem to have been left behind. In fact, there are some bits on this album which have much more of a Black Metal feel. The famous and prolific Necromorbus Studios was the choice for The Horror too, but this time round that typical Necromorbus sound shines through much more, and the riffs and chaos-filled sqeuals of horrid noise on the aptly titled “Through The Velvet Black” show this progression too, along with some early Atheist-like technical riffing too.\n\nIt might sound like a mess on paper, and in fact it might sound like a mess on your first listen too, but where this really conquers The Horror is how much more compositionally solid it is. What might at first seem like chaos is actually very much focused and willed, and the nuances often make sense in the context of the song or songs after repeated listens. For example, it took me at least 10 spins of this album til I noticed that the brief twinkle of keys on “Suspiria de Profundis” links it sonically with the preceding instrumental interlude track, and once I did it opened up this record just a little bit more. Nothing is by accident on this record, and everything is conjured by the most intelligent of designs. [9/10]\n\nFrom WAR ON ALL FRONTS A.D. 2013 zine- www.facebook.com/waronallfronts\n",
        "\nThe moment one sees the album cover of The Formulas of Death they should already know that it’s going to be different than the Swedish quartet’s 2009 release, The Horror. And it is. Although some fans that saw Tribulation as part of an old school Swedish death metal revival may be disappointed by the artistic changes, the album shows a tremendous amount of technical and creative growth when compared to its predecessor. It is much less a pure death metal album and borrows influence heavily from black metal and progressive. The black metal influence really comes out in the dark chord changes, occult atmospherics, and aggressive tremolo picked riffs. The second track, “Wanderer in the Outer Darkness,” is a perfect example of this influence at play.\n\nIn addition to the darkness, the album also has many up-tempo and almost punk moments that are incredibly catchy. Yet, at its heart this is still Swedish death metal, but its range of sounds is blown wide open by the band’s creative experimentation. When compared to Tribulation’s previous album, the thrash elements are also greatly dialed back in favour of the new black metal influence. In certain respects, The Formulas of Death calls to mind the Cobalt album Gin. While Gin is without a doubt a much darker and strictly a much more black metal release, both albums quite honestly have a similar musical flair. This is due in part to complex song structures that, while quite progressive, don’t ever seem pretentious or too technical or mathematical to be enjoyed in a traditional sense. This is absolutely an album with a number of searing and well positioned leads that you can bob your head to.\n\nThe introduction of a number of clean guitars on the album has widely expanded the band’s musical expression and atmospheric possibilities. Vocally, Johannes Andersson delivers a barking growl that calls to mind Joel Grind of Toxic Holocaust, or a rabid dog, in both technique and tenacity. Song tempo and style throughout the album is quite varied all the while maintaining an important aesthetic cohesion that begs the album to be experienced as a unified piece. For example, the song “Suspiria” features a groovy bass line and a truly expansive vibe that is far beyond traditional death metal fare, and “Apparitions,” the closing track, is a thirteen minute nearly psychedelic journey through the mysticism of the occult that predominates the album. In between the two you have “When the Sky is Black with Devils” which starts with a haunting clean guitar intro before kicking it up a notch into a catchy death metal riff.\n\nClocking in at almost seventy-six minutes over eleven tracks, The Formulas of Death is a grand and monstrous affair. The running time certainly ensures you get your money’s worth, but if you’re looking for something lean, or an album you can spontaneously and easily enjoy in its entirety, you’ll probably be a bit disappointed. Likewise, if you’re looking for The Horror II, you are just as likely to feel let down. But those sounds are still audible on this album. Additionally, it is a tad meandering at times, but I ultimately found this to be, for the most part, an ingredient of a very enjoyable journey.\n\nThe Formulas of Death was released on March 1st via Invictus Productions and The Ajna Offensive.\n\nOriginally posted at IronHops.com on March 8, 2013.\n",
        "\nMy naive expectations of getting the opportunity to review \"The Horror\" pt II when signing up for this album were quickly dashed upon listening to \"The Formulas of Death\" - the task of following up an album that was as warm in production as it was cold-blooded in execution, Tribulation have taken the brave decision to alter the recipe significantly and the result is nothing if not unexpected. Going from 33 to 75 minute releases is one thing, but to go from all-out assault to textured, mystical expressionism is quite another. Re-working the success of \"The Horror\" was one option, but what this is is Tribulation's supreme confidence in their own abilities.\n\nOpener \"Vagina Dentata\" (google the term if you wish) proves that change; a care-free usage of four minutes for atmosphere building is quite something but symptomatic of the artistic freedom with which Tribulation continue. Thereafter the Swedes deliver a run of tracks which flow in the kind of distorting, challenging ways that are keeping me interested after umpteen listens. At their fastest the pace is no match for much of \"The Horror\"; these riffs feel too calculated to be delivered at breakneck speed. Interspersing those fast riffs that do exist are moments of calm, these emerging as anything from bridges of momentary transition to the kind of the long winding passages from which there is no indication of what might exist on the other side. The success of the album is built upon these, although in the likes of \"Spectres\" and \"When the Sky is Black with Devils\" they can come at just the wrong time, like when someone pauses your favourite song just as it is about to enter the best moment. These sharp changes were to also make for what I thought to be a difficult performance of some of these new songs when I saw them in London earlier this year, although I hesitate to say with time they will come to be delivered with better results.\n\nFirst song proper \"Wanderer in the Outer Darkness\" says all you need to know, sewing countless highly intelligent riffs together to create a quilt of intriguing Middle Eastern darkness. From its blistering start \"Spectres\" wanders off into post-metal territory and back, while \"Suspiria\" utilises a backbone of morose Katatonia moods under slow-motion Morbid Angel riffs to weave a very complex 11 minutes. Through the Velvet Black\" harks back to \"The Horror\" more closely than much else here as the same crusty, melodically-inclined death metal band briefly return. In \"Spell\" the leadwork of Adam Zaars is a great example of how to adapt a performance to the over-riding feel of a song without adding those kinds of flourishes that add nothing to a song. \"Ultra Silvam\" features more Eastern chords in what ultimately feels like an introduction to 14-minute closer Apparitions\", a song that begins quickly but which drags on a little too long in its blackened, moody closing stages.\n\nI have read elsewhere of \"The Formulas...\" being to \"The Horror\" what Morbid Angel's \"Blessed are the Sick\" was to \"Altars Of Madness\" - a comparison I'd love to have penned myself as it summarises the change perfectly. With most songs topping six minutes and a total running time of 75 minutes this is sure to be one of the most challenging listens of the year, necessitating the kind of patient listening that is beyond all but metal's diehards. For this reason \"The Formulas of Death\" will not be enough to break Tribulation to the wider ranks of death, but in all other means they have come close to constructing the perfect album to do so. \n\nOriginally written for www.Rockfreaks.net\n",
        "\nThe follow-up to 2009's acclaimed retro death gem 'The Horror' has been a highly anticipated one. Most of us surely expected another primitive relentless death metal attack as heard on the debut. Interviews and the release of the cover art promised though promised something completely different and surely puzzled more people than yours truly. Statements of a more mature sound combined with a cover art more resembling alternative rock than death metal did not exactly raise my hopes for an 'album of the year'-candidate.\n\nSure enough something has happened to Tribulation. A more mature sound generally means either overtly experimental, excessive technical wankery or plain boring. To be quite honest, during the first couple of spins I could not figure out which of the three to apply to 'The Formulas of Death'. Sure, the albums foundation firmly relies on good old Swedish death metal with technical parts more resembling the Tampa scene and a fairly polished production.\n\nThe album however is packed with moody passages bearing influences from jazz, oriental music, folk music and Beelzebub knows what. The common theme of these passages as well as the album in whole is an amazing dark feeling few death metal bands has managed to conjure. Whereas 'The Horror' had a darkness resembling your average zombie apocalypse, 'The Formulas of Death' is melancholic and plain creepy.\n\nAll this experimentation sure is a mouthful to handle. It took me about seven or eight spins before the brilliance of this sophomore disc finally started to emerge and it gets more brilliant with each listen. The mood from start to finish is simply captivating and the riffs even outmatch those of the excellent debut. The true strength though lies in the album as a whole, this truly is a piece of art supposed to be heard in its whole rather than hacked up in a party playlist.\n\nIt is a demanding album for sure and penetrating the depths of 'The Formulas of Death' will take time, but the reward makes it worth every second. Contrary to my initial expectations this one will most likely find its way into my Top 10 of 2013.\n\n\nChoice cuts: Wanderer in the Outer Darkness, Rånda, Apparitions\n\nPerformance: 8 out of 10\nOriginality: 9 out of 10\nProduction: 7 out of 10\nVocals: 8 out of 10\nSongwriting: 7 out of 10\n\nSummary: 7 chalices of 10\n\n\nOriginally written for www.MetalCovenant.com\n",
        "\nTribulation’s The Horror was a fantastic death metal album that went largely unnoticed if one considers how well-above the heap it was. The recording featured some of the most furious guitar playing the subgenre has offered and the vocals of Johaness Andersson were just bestial. Yet, in part because of the label’s (Pulverised) weak push and in part because of the abundance of death metal releases, Tribulation was unable to stand out as much as they deserved. Especially Statewise, where guitarist Adam Zaars’ other band Enforcer was at the time gaining widespread recognition after 2008’s pompous Into the Night, Tribulation barely got any coverage before sinking in at the bottom of the review pile.\n\nFast forward four years and Zaars is out of Enforcer. Perhaps because he is now able to focus on Tribulation, the once death metal combo has now released a rather ostentatious second full-length. It is titled The Formulas of Death and it spans over an hour and fifteen minutes of music. Barely any of it could be considered death metal, which is good because we are now presented with a band that is shaking off the genre limitations and is attempting something different and is, to some, not so good because there will be a bunch of death metal bitches whining about how The Formulas of Death is a weak treason of sorts and an unfocused record. \n\nNot to say that The Formulas of Death doesn’t feature any death metal traits, because it sure does. Andersson, for instance, is still a fierce beast throughout, grunting morbidly through entire songs that last as long as thirteen minutes and entire passages feature visceral musical arrangements of straight ahead songwriting. But for the most part The Formulas of Death was designed as a game changer. Tribulation are in here to claim evolution, to step forward and break their own mold. And this could not have been possible without the total concentration of Zaars, whose guitar playing is as incendiary as it was in Enforcer, but is also rather progressive, focused and joyful. \n\nThere are moments of utter exhilaration. Mostly those belong to Zaars and his guitar. The Swede crams lots of juicy riffs on each song, but still somehow you know this ain’t pure wankery and while his solos are dexterous, there are no Malmsteen-type excesses here. Largely, the excesses are in the duration of some tracks and in the inclusion of three instrumentals that amount to over ten minutes of music.\n\nAs for the majority of the songs themselves, it is rather hard to classify them. It’s nothing you have not heard before, it is just played better and written with a level of thought hardly seen in the genre. It is post death metal in the sense that a song like “Spell” is that at its ferocious core, but is not as a whole since it borders on black metal, albeit featuring a top notch production job and flawless musicianship. This track embodies Tribulation in 2013. A band that is a step ahead of most, but also willing to risk and show a little more than they should.\n\nOriginally written for deaf Sparrow Zine\n",
        "\nOver the past few years death metal has witnessed rabid resurgence. While most have fulfilled the needs of the desperate old school death metal fans by taking elements of the overlords of the death metal genre and rehashed them in an innovative way, some have at this junction of time decided to push the boundaries of this genre. Now humans have this tendency to stick to the tried and tested out way, and have a demurring attitude towards change but some have had the urge to boycott this train of thought and instead possess within them a proclivity towards thinking out of the box. Bands like Necrovation infused elements of rock in death metal without disastrous results, Karanrium infused elements of ritual ambient into its music, Antediluvian and Mitochondrion took chaotic brutality to its extremes and Dead Congregation crushing atmosphere would have made forefathers of the genre proud. Now, the boundaries of the death metal genre have been rather solidly expounded by the laureates of the death metal genre that roamed around in the golden era which lasted from 1983-97, but Tribulation have pushed these very boundaries to parts un-thought of.\n\nNow, Tribulation have been around for almost a decade and this Swedish band released their debut ‘The Horror’ back in 2009 which gained wide acceptance as a brutal slab of a death-thrash assault which showed a severe penchant towards the mould of death metal crafted by the likes of Merciless and Repugnant. Now four years later they have released their sophomore effort entitled ‘The Formulas of Death’. First and foremost, expect absolutely nothing like ‘The Horror, because the music impregnated within this revolves around a different axis completely. On ‘The Formulas Of Death’ the band has matured. Now I used the word matured carefully because even on the previous album the band showed that they were very proficient in the language of horror influenced death metal (well, I personally thought it was a decent album, but the general cry of the mass was that it was some of the best death metal that had ever graced our ears) with their song writing and merciless onslaught of riffs and blastbeats and lyrics gyrating around necrophilia, but to be brutally honest, this kind of Swedish death thrash has been done masterfully well by the likes of Repugnant and Winterwolf, and however good Tribulation were, they weren’t original.\n\nHowever, on this album they have chosen to take the elephantine burden of death metal on their backs and forge it into something new, something original. It is not highly uncommon for a band to change their style of music as they progress. Many like Darkthrone, Skyclad, Anathema and Pestilence have done it. Closer to their home Tiamat did it, but I believe that the change in sound initiated by this band most closely resembles the metamorphosis in Morbid Angel’s ‘Altars of Madness’ and ‘Blessed are the Sick’. While both Morbid Angel and Tribulation’s debut album were an aggressive sonic strike that were genuinely malevolent and sinister affairs, their follow up LP’s though firmly ingrained within the sphere of death metal focussed a lot on the aspect of creating an atmosphere. Even an inadvertent glance on the artwork and you see that the unsophisticated screaming zombie with the haphazard hair has been replaced by a beautiful foggy landscape which hypostatizes the band music contained here beautifully.\n\nMusically, describing which genre this LP belongs to is a tough one but I’d call it a mix of atmospheric black metal with elements of progressive metal inculcated with touches of early psychedelic rock though firmly adhered within the death metal genre. Lasting 75 minutes this is more than twice the length of the predecessor and the only trait similar between both releases are the throaty screaming vocals of Johannes Andersson and at few occasions the riffing as well. The guitar tone has gone from a bone dry, razor sharp type of feel to a highly layered feel drenched with a ton of guitar effects and pedal work. Apart from that the band has opted for a sound that boasts of numerous but extremely well structured and rich in detail guitar solos which become rather atypical of the album which add to the extensive soundscape repertoire of this album. The production done by ‘Invictus Productions’ requires special mention because their warm production gives the band a much cleaner sound which adds an extra dimension which massively helps Tribulation achieve what they intended to with this release. Though most of the lead guitar work seems comparable to the psychedelic tremolo riffing of bands like ‘A Forest of Stars’ or ‘Hail Spirit Noir’ or the melodic tremolo riffs of ‘Dissection’ there are moments on tracks like ‘Wanderer in the Outer Darkness’, ‘Spell’ and ‘Apparitions’, the riffs of which are an instant throwback to the thrashy vibe of the debut album.\n\nHowever, the department where the band seems to have taken a quantum leap is that of the intense song writing which has been given thought of the highest order because of which Tribulation has been able to coalesce such a freakish amount of variables into a cohesive and fluid record that never loses direction with its sharp twists and turns and you find something new awaiting you each corner. The abrupt changes in tempo from a brutal chaotic maelstrom to an eerie, calm section and back to the former, which is best exemplified in ‘Spectres’ acts as a testament to how far the band has progressed. Be it the progressively labyrinthine structures of Ved Buens Ende or the classic Deathspell Omega atmosphere (you know, when the band manages to create a cataclysmic and suffocating surrounding only to put that in a pressure chamber and then channel it using all its energy to a particular point) or the alternating between the melodic riff work and the lo-fi, raw soloing reminiscent of early Darkthrone, Tribulation manage to channel them all and make each such section a small piece is a massive puzzle. Everything from the meaningful instrumentals to the violent ragers like ‘Spell’ and the almost post rock influenced tracks like ‘Ultra silvam’ fit in perfectly. On ‘The Horror’ the bands’ up roaring bedlam grabbed the listeners attentions by the throat, but here the onus is on the listener to give his highest concentration to the songs as they progress so they can thoroughly contemplate the aural enlightenment they have been subjected to. Even though it is mostly about noticing the subtle changes and the individual thought patterns and flow of ideas in each track and how each track progresses from section to another and from atmosphere to another, rather than specific attention to any particular aspect, there are moments on tracks like ‘Spectres’, ‘Through the Velvet Black’ and ‘When the Sky Is Black With Devils’ that are highly infectious and catchy. However, the high point for me in the last track, ‘Apparitions’ where towards 8 minute mark the band starts the build up to one of the greatest crescendos ever created which explodes upon the listener and puts the likes of Immortal to shame, and as the crescendo progresses the rhythm guitar enters with its tremolo picked riffs, bass enters with its sepulchral bass lines and the Goblin influenced ethereal horror effects enter. Epic, majestic, beautiful.\n\nThe bands central focal point though, throughout the album has always been the evocative atmosphere, as can be seen due to the presence of as many as three instrumental tracks, and if that wasn’t enough, what is to be noticed is that the band do not stick to a particular type of atmosphere only. While the majority of the album brings to mind the experience of meandering in a dense and foggy forest which collides with the artwork of this release there are a plethora of emotions aroused as the LP progresses. While on tracks like the instrumental opener ‘Vagina dentata’ which starts off with a middle eastern sound which evokes an atmosphere of 60’s psychedelic music or the eerie occult like humming in ‘Spectres’ which conjures feelings of agitation, there is a sepulchral and desolate feel on the piano based לילה (Hebrew for Night), and the uplifting phases in tracks like ‘Apparitions’ and ‘When the Sky Is Black With Devils’. While on the previous album the band used horror influenced the straightforward horror influenced sound effects, here the band has shunned those for a more ethereal horror sound effects, like the ones created by Italian progressive rock band ‘Goblin’ for the horror movie ‘Suspiria’ and evidence of that sound in splattered all throughout especially on tracks like ‘Suspiria’, ‘לילה ‘and ‘Apparitions’. Great production vastly enhances the presence of the bass as it plods along with the rhythm guitar and the drums and is reminiscent of early progressive rock bands and thus is an entity on its own. Making the bass audible nearly throughout makes a titanic difference to the atmosphere and the bass riffs / drum fills combination which the band uses in rare instances brings about a sense of dread and impending doom, something extremely valuable for a horror influenced quartet.\n\nAnd as the last tracks extended outro acts as an intro to the opening track you wonder what message the band wants to convey. Do they wish dwell upon the circle of life or is my noticing this feature just my imagination?I honestly don’t know, but what I do know is that on ‘The Formulas Of Death’, ‘Tribulation’ has done with its ambiguous approach is force the listener to think and to interpret the meanings themselves. What this is, is an evidence of a forward thinking band. This is evocative and this is thinking man’s metal. This album is a hard pill to swallow and takes many listens to understand. On my first listen I thought it was sloppy and too long, but the more you listen to it the more you understand the complexity and beauty and the catchier it gets. This is the kind of release where you notice something new each time you decide to give it a spin. Keep this is mind, this right here is one the best metal albums of the decade, and being highly original, the band may have created a fountain of inspiration for others to sip from.\n\n[Originally posted on http://toolatetopray.blogspot.in/]\n",
        "\nEndowed with what must be the year's most deliriously sarcastic album title, The Formulas of Death proves anything but. I'll be the the first to disagree with the prevailing notion I've encountered that Tribulation has somehow transformed from a prime example of the 'standard Swedish retro death' sound to something far more artistic, because even a cursory listen through their fantastic debut The Horror reveals a higher thrashing potency, with some of the most explosively entertaining leads in the field. Clearly this wasn't your typical, dime a dozen knockoff of Entombed or Dismember, thriving only on second rate D-beat death punk riffage and Clandestine production standards, but a truly memorable collection of songs that transcended the status quo. One of the better albums of 2009, in fact, which is saying a lot, since in my estimation, that was one of the most 'loaded' years of quality metal I can recount since the late 80s. Particularly in the more extreme categories.\n\nWith that said, The Formulas of Death is surely a major transformation for a band so early along its career trajectory. We are talking Darkthrone or Ulver proportions of disparity from debut to sophomore effort. I can recognize certain core characteristics that have been carried through from the one to the other: Johannes Andersson's treacherous, bloody barking vocal isn't a far cry from its original form, and the band's tendency to strafe the border between death and primeval thrash metal in both their groovier mid paced chops and the more rapid guitar runs is still pulsing through the music's veins. Yet the external, atmospheric shell crafted over the 76 minutes of material that is The Formulas of Death is so prevalent that it soaks itself deeper into the cell lining of the quartet's metallic entrails. Tribulation have essentially created a psychedelic, progressive death metal mirror universe in which they explore worldly occult themes across a variety of cultures and subjects, while ramping up their already impressive musicianship. In fact, thus far in 2013, I have not heard an album with so much ambition; so much instrumental proficiency. Not that the songs are the most technical, or polyrhythmic out there, as you might find in jazz-influenced brutal death metal or math metal shredding...\n\n...but there is this immense sense of fulfillment, no shortage of ideas careening through this opus which will stand out to the ear of someone looking for metal that can balance riffing against atmosphere. The most obvious new ingredient to the Tribulation repertoire is the implementation of a myriad of cleaner guitars. Often they'll resemble 60s psychedelic folk, fit for a traipse across a maudlin meadowland with a slight complement of Eastern strings (\"Vagina Dentata\"). Elsewhere they are spry and spooky, to saturate the compositions with a tinge of occult horror (\"When the Sky is Black With Devils\"). The lion's share of the material is still driven by heavier guitars, but even there we get a considerable expansion of technique. Loads of droning, atonal ringing notes that drift out into a greenish/black mental fog. Muddier cleans. Dextrous clips of melodic picking sequences which sound like speed exercises being imbued into harder driving rhythms more redolent of their last album. In addition, the distortion levels have been dialed back for greater clarity. There is no shortage of guitar effects, but the rhythms are really clean and blunt, where they had a lot harsher hiss trailing behind them on The Horror.\n\nThe rhythm section here is like a dream. The bass lines are pendulous and polished, swaying and swaggering into various grooves that evoke distant memories of dreamy prog rock or swirling pop records from the 70s and earlier. Then they'll turn right around and surge into the metal like a bong-ripping Steve Harris. Beats are incredibly well managed, and play a vital role in steering the versatility of the guitars. For example, a slow and steady cadence is used to set up the opener \"Vagina Dentata\" into a march-like piece reminiscent of what Metallica might have written in the 80s. The kick and snare are directly up front, and the fills and cymbal crashes constantly audible, which becomes even more obvious when they erupt into a more traditional blast sequence like in \"Spell\". Vocally, there is less evolution, but as you find yourself drifting through this 'cosm of nuance and nightmare, you'll hear some airier, eerie clean tones shimmering against the rhythms, like ghosts attempting to cross dimensions and faintly manifesting themselves from their natural incorporeality. There is always something waiting around every corner, under every eave...it's a busy and consistent arrangement.\n\nIt's definitely a difficult task to pinpoint shortcomings in such a lengthy work as this, but that's actually one of its few problems: The Formulas of Death feels overlong by a good 15-20 minutes. Not to say that it falls into a slump of needless repetition or runs short on imagination, but in listening straight through the track order, there were several points at which I felt I had reached some natural conclusion, only to have the next track kick into view. There are enough ideas here to fuel two or more albums from lesser bands, but not all the material is necessarily sticky beyond just its sense of novelty and refreshment. In listening, I felt almost as if I were salivating at some buffet table of tasty if not delicious fare, with a stomach that was already half fulls. Frankly, the harsh vocals and a lot of the heavier guitar progressions just weren't interesting or varied enough over the full 75-76 minutes to keep it entirely compelling. 'Busy' simply doesn't always translate into 'catchy'. The more I listened through, the more frustrated I became that a sizable portion of the music was more able and moody than memorable.\n\nLastly, though comparing this to The Horror is like comparing Dark Side of the Moon to a sole twelve-bar blues guitarist being rafted through a swamp, the debut was a more engaging and exhilarating burst of tunes with a lot of bite. You weren't coming away from tracks like \"Beyond the Horror\" or \"Curse of Resurrection\" without fang punctures on your neck in a best case scenario, tagged and bagged in the worst. Here, much of the dingy and adventurous atmosphere just does not feel as morbid or haunting as the album's occult themes would imply. I was creeped out a few times, but a lot of the riff progressions feel too consonant or ethereal to evoke the boogeyman. Don't get me wrong, this is ultimately an impressive, otherworldly album that will no doubt have people shitting themselves at its level of aesthetic vision and musicianship. Its sure to stun fans of progressive black metal and psychedelic doom just as much as it asserts new ideas into a stagnating spectrum of death metal nostalgia. Almost like a more complex and atmospheric response to last year's s/t sophomore from another Swedish band, Necrovation. Worth owning, or at the very least checking out, and overflowing with creativity; but once in a while the excess spillage dries out a little too quickly.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\n“The Horror” is the debut album from Swedish zombies called Tribulation and I must say that ever since I’ve heard the “Putrid Rebirth” EP I was expecting this album to come. I remember the day when the vinyl have arrived my home, it was few years ago. When I looked at the cover I was like “WOW!!!!!! Just look at that!”. Yeah, “The Horror” has one of the best artworks I’ve ever seen in my life, it is awesome. The whole vinyl looks brilliant, as it’s a nice gatefold, with huge band drawing inside plus an eight page booklet with some additional artwork (I love the Nosferatu ones most!) plus the lyrics, etc. Yeah, it is amazing, so just by judging the book by its cover, this one gets an immediate 100 out of 100. Music wise those Swedes also do not disappoint, maybe I found their previous recording slightly better and more savage, but this one is also damn brilliant and stands on the left hand side next to Repugnant’s “Epitome of Darkness” masterpiece with pride.\n\nMusically Tribulation has developed a little bit since their EP days, I think. I have an impression they’re more into thrash metal now than before. It’s still the blend of death and thrash of corpse, but that thrash metal influence is even clearer now (maybe due to better production?) and more in the traditional vein of this genre. While the EP had a totally obscure and raw kind of death / thrash, “The Horror” presents it dropping off the Morbid Angel influences into more of the cults of old Kreator, Onslaught, Pestilence (debut LP) and Possessed, adding the influence from Swedish classics like Merciless, Grotesque and Nihilist. The riffing is just relentless and cruel, with many brilliant and slashing parts and the tempo, which hardly ever slows down and thus the side A goes by incredibly quickly. “Crypt of Thanatophilia” is pure thrash death metal classic and absolutely killer song, with devastating riffs and extremely great vocals. And when the band catches my attention from the first part, it doesn’t let it go even for a second, the rest of the album is equally great. With “Curse of Resurrection” I almost ejaculate in ecstasy, such great this track is, I especially love the melodic playing in the second part of it. The music becomes truly infectious, almost possessing with the horror atmosphere that comes from within the every sound and voice, the artwork and the killer and so well written lyrics (“Hear them calling the children of the night. The curse will last until the end of time. Enduring it for centuries through darkness and pale death time is an abyss profound as a thousand nights…”, “The fog on the graveyard lies thick on ground. The undead are moaning a terrible sound. Eerie surrenders the fiends of the night, corpses will strike with malevolent might...”).\n\n“Sacrilegious Darkness” definitely belongs to the best tracks from the album, at first it will hit you with neckbreaking speed, but later it even develops into one doomy riff. “Spawn of the Jackal” is maybe better, with the satanic lyrics and amazing melodies in few parts it brings some of the most Swedish sounding bits of the whole LP. Sometimes I have a feeling like I just played some unknown Dissection tunes, really, from their early “The Somberlain” times, such is the atmosphere and the style of this track (maybe more straight forward and less epic than Dissection, but still it’s in the same vein, I think). And when “Seduced by the Smell of Rotten Flesh” starts with a wonderful doomy riff in the good old Autopsy vein, I’m just like: “fuck, are these guys going to bring all the best old school metal ingredients into one album”? Hmm, no, “Seduced by the Smell of Rotten Flesh” only starts slow and creepy, soon it speeds up into Tribulation’s trademark thrashing death metal, what maybe disappoints me a bit, as I would love maybe to hear one slower and totally darker track, like Death Breath or Maim do sometimes. Anyway, “Seduced by the Smell of Rotten Flesh” also is one of the highlights, so who cares? Great track and again awesome eerie atmosphere! And finally “Graveyard Ghouls” also brings some serious damage to my surrounding, mainly with some more of the traditional Swedish death metal influences, which I love a lot and think that Tribulation, next to Repugnant, could be the best of all Nihilist’s heirs. Arggghhh!!!!!!! I just have been massacred, rest in pieces!\n\nStandout tracks: “Seduced by the Smell of Rotten Flesh”, “Crypt of Thanatophilia”, “Sacrilegious Darkness”, “Spawn of the Jackal”, “Curse of Resurrection”, “Graveyard Ghouls” (Shit, that’s almost the entire album!)\n",
        "\nThis is an amazing Swedish death metal band, that have been formed in the beginning of the 00’s, first being active under the name Hazard (which released a couple of thrash metal demos). After the name change (for Tribulation in 2004) those Swedes have also changed their music style into more death metal oriented and released “The Ascending Dead” demo in 2005 and then have spawned this obscure recording in 2006 which is a 7”EP titled “Putrid Rebirth”. I guess the title couldn’t explain the musical direction of Tribulation better, as this music was one of the first attempts to resurrect the old styled, putrid death metal music, one which bands like Kaamos and Repugnant started to exhume from the grave first and which were later joined by the likes of Necrovation and Tribulation. This is how the Swedish scene started to become really exciting yet again.\n\nAnyway, Tribulation was one of those first bands, which were playing the old style again and man, when listening to “Putrid Rebirth” it does feel like going back in time, into the not so distant past of early 90’s, when as a kid I was discovering such amazing albums as “Show No Mercy” / “Hell Awaits” and “Abominations of Desolation” / “Altars of Madness”. The opening song – “Dread City of Death” – do fuckin sound like a mixture of those cult LPs, trust me, at the beginning you may have a feeling like you’ve just discovered an unknown Morbid Angel recording from their “Abominations…” session! The production of the EP is really similar, which I find amazing and just love it! When the song starts with chaotic guitar leads and merciless riffing, maaan… I have a feeling of déjà vu, but in a good sense of this word. Even the vocals of Johannes Andersson feel like they were recorded by a young lad named David Vincent (or Mike Browning at least) hehe. Then “Zombie Holocaust”, a second song, has more of “Show No Mercy” influence, is more thrashing, but at some point it speeds up so much that again the good old Morbid comes to my mind, as well as the mighty Possessed and even Amon in few riffs. This is a crushing song, really, maybe even my favourite one from the whole EP, with such a cool chorus part (“Holocaust!!!!!!! Zombie holocaust!!!!!!!!) that I can ask myself: “Are you morbid? You bet I am!”.\n\nWhile side “A-bomination” was recorded in 2005, then side “B-lasphemy” was recorded in 2006, so there’s a small difference in the sound, but the ferocity and relentless aggression from side A was kept on side B, which is good for us. Two songs from B-side are just as fast and old school as you would wish, “Imprisoned In Abhorrence” is 6 minutes long, which is sort of surprise, but is a fuckin smasher really, the quality is never going down. The thrash metal influence again gets bigger in few parts, but think of bands like Massacra and Messiah, which were always on the verge of thrash and death metal… With Tribulation it’s the same, really. There may be riffing in Kreator, Slayer and Sadus vein, but the feeling is more aggressive and uncompromising than in those bands and that’s cool. Anyway, Tribulation do not let you rest and throughout the whole EP they keep crushing with cool riffing and raspy vocals. The final song is cool instrumental bit, and as soon as “Putrid Rebirth” finishes, I swap the side of the vinyl to listen to it all over again. Really, really good single, one which Blood Harvest has actually released twice, but both versions look exactly the same, so there’s no way you can tell which one is which… So, get it and blaspheme in abomination.\n",
        "\nSurprise! More Swedish death metal! Well, sort of. Tribulation released one of the finest records of 2009 with their full-length debut, The Horror, however it’s much more than just 90s Swedeath worship. Instead, this feels like a hybrid of styles, seemingly drawing heavy influence from the Swedish death metal scene, while also taking some influence from the Floridian death metal scene and the German thrash metal scene. While the Swedeath is certainly the dominant force on this album, the combined influence of the other two lead to this sounding incredibly familiar, yet also quite unique. All of that, combined with perfect execution lead to this album being one of the best death metal albums of the past decade.\n\nIf the album title wasn’t enough, the 16 second intro makes it perfectly clear that this is a horror-themed album. By that, I mean the cheesy kind of horror from all those movies back in the day. Well, once that’s over with, ‘Crypt of Thanatophilia’ starts things off really well, being one of the riff-iest songs on this album. This song is literally all over the place (in the best possible way), with seamless transitions from one aggressive part to another. In addition, this song introduces us to the fact that Tribulation are not at all afraid to implement simple, groove-laden riffs into the picture. While that’s normally a scary proposition, Tribulation pull it off very well, not abusing said riffs and instead letting them fit in their particular moment and then quickly moving on.\n\n‘Beyond the Horror’ has one of the thrashiest riffs on this album, and it’s here where the thrash influence is at its most obvious. I tend to not be a fan of thrash mainly because it feels like a more restrained death metal, but here, the thrash riffs work wonders, especially with the high-pitched death metal vocal style implemented.\n\nSince I’ve covered the Swedish and German parts of this album’s sound, I guess I might as well mention the parts that sound like Floridian death metal. One of my personal favorite Floridian moments on this album is the really simple riff at the 1:50 mark in ‘Sacreligious Darkness.’ Holy fuck, that thing is catchy as fuck, and the accompanying cymbal rhythm compliments it wonderfully!\n\nThe album closes on a particularly Swedish note, with ‘Graveyard Ghouls’ sounding about as Swedish as it gets. This might just be the most ferocious song here, with blistering blastbeats and fucking heavy riffs. The slow section in the middle just screams of building up tension, and of course we’re treated to one of the catchiest riffs on the album right after. At this point, the Floridian influence comes in for one last time, and with one final intense scream, this album is sadly over as the music fades out.\n\nDespite the fact that there’s not really any black metal influence here, I feel like I must make a comparison to Necrophobic. Like Necrophobic, Tribulation have created a very catchy death metal album that is full of clear and melodic lead guitar melodies, while also boasting one of the most genuine vocal performances I’ve heard in a long time. If anything, the vocal performance is what reminds me most of Necrophobic. It’s very similar, except less restrained. Thus, it seems a bit more fierce, but is less controlled, and thus less clear as to what is being said.\n\nThe Horror is easily one of the best modern death metal albums, while also being one of the most varied I’ve heard in quite awhile in terms of influences. These influences are seamlessly incorporated into Tribulation’s sound, making for an album that any respectable fan of death metal should enjoy. If you like Swedish death metal, this will appeal to you. If you like Floridian death metal, this should be something that you might like despite overall being more intense than any Floridian band. If you like German thrash, but not death metal, try this as a transitional album. Simply put, this is an excellent, top-tier death metal album that easily competes with the best of the death metal greats.\n\nWritten for http://thenumberoftheblog.com/\n",
        "\nMusic is an infinite pit of magic. Sometimes it feels emotional. Other instances it can appear enraging. And on occasion, your face is sprayed with so much violence and chaos it seems incendiary gunk that melts your goddamn face into a mess of burned flesh while the sickening scent of phosphorus hovers about would equate the musical madness perfectly. Tribulation, a young and promising death metal band from Sweden, takes that idea to heart unlike others attempting such destruction. Their formula is like napalm that burns and churns, yet it’s a clear fact that something so violent has never been so fun. Do you and your kids enjoy good, hardy tales of horror and murder while enshrouded in gore and undead madness? If so, Tribulation is for you!\n\nAnd you know what makes this record so great? It’s rather simple actually: it’s just fun, beefy death metal. No experimental shenanigans or anything like that; just a four-man guillotine machine. I quickly noticed right off the bat that the riffs are no laughing matter. Filled with old-school thrash touches and tremolo picking so devastating your ancestors will sway in their graves, I promise you’ll get everyone in seeable range to go nuts. It’s not only that though, because Tribulation’s guitar attack is wonderfully crafted within the radius of brutality and instrumental responsibility perfectly, so it’s a clear observation a few gentlemen passed Death Metal Riffing 101 with flying colors. The lead work is also absolute insanity captured on plastic, with such swelling chaos that if you don’t have your jaw on the floor after experiencing the technical insanity and the utter shredding corruption, then you should probably leave the hall.\n\nAs for everything else, “The Horror” continues to inherit the genetic abomination that could make a hemophiliac run dry in seconds. Johannes Andersson’s growls are dark, horrifying, and fantastic when discussing the pattern his voice takes throughout Tribulation’s damning voyage. The drums are likewise a riveting force behind Tribulation’s attack, releasing an unrelenting montage of turbo-charged footwork layered over perhaps the best sounding snare I’ve ever heard and symbol usage and audio features that shriek of Sweden in 1990. Overall though, the quartet forges a nifty sample of what death metal is supposed to be: something like “The Vampyre” marches through with burst-fire gallops, intense riffing, and so much audio velocity your neck will dislocate, and technically personifies Tribulation’s sonic artillery beyond words. To do such a thing takes a special band, and Tribulation is indeed fresh air compared to a lot of other death metal groups that couldn’t nail the sound if Alex Webster provided a tutorial. \n\nEverything about this record is superb. The riffs are furious and well-crafted, Johannes Andersson’s growls appear fresh and lively, the percussion is devastating, the solos absolutely magnificent, and it obviously delivers an overall sound that can split your skull. So aside from the obvious fellatio venting from my clear love of “The Horror,” I can verify that Tribulation is a great band, and this is a fantastic record. If you find sanctuary within the quarters of such harnessing, blasphemous tribes from the immortal tongues of bands like Possessed, Grotesque, Kreator, or Death, then I can’t stress enough how essential “The Horror” will fit in your collection. In conclusion, Tribulation is a man among little boys when compared to today’s majority opinion, and they thankfully rekindle the burning reputation of golden death metal once again. They know what they’re doing, folks!\n\nThis review was written for: www.Thrashpit.com\n",
        "\nThe second half of this decade has brought about renaissances of both the thrash, and to a lesser extent, death metal scenes, and in the process yielded some excellent releases in both. Of course there are always the albums which frankly suffer the life of a coaster post-review but you've gotta have the crap ones to enjoy the good ones right?\n\nWell Tribulation, a four-piece from trusty old Sweden have by god not only released a 'good' one, they've only gone and blown the bloody doors off with a death metal album that is dare I say, nigh on perfect. Arguably more successfully than any other DM band that wallow in the glory of the old masters, Tribulation have on their debut \"The Horror\" managed a rendition of brutal old-school Swedish and American death metal with an identity of their own, a startling production job squaring DM crust against visceral power and adequate referencing of their old Gods to keep the purists happy. With Enforcer guitarist Adam Zaars in the ranks, \"The Horror\" is a mastery at all things old Kreator, Possessed and Morbid Angel, with more than a nod to Entombed and Incantation too. It's far from ancient-worship though; \"The Horror\" bares elements of the likes of Angel Corpse, Dead Congregation and Kaamos in an album with all the key elements of attention-grabbing, catchy riffs, melodically inclined lead riffs and stinking brutality.\n\nIf \"Beyond The Horror\" was a cut from a 1988 album it would be hailed as a classic by now, both sickeningly attention-grabbing and catchy like all the best DM used to be. \"Seduced By The Smell Of Rotten Flesh\" and \"Graveyard Ghouls\" are Incantation-heavy, schooled by Slayer yet frozen melodically in the name of Dissection in their lead riffs which angle out without warning before re-aligning to join the onslaught of brutality that is the spine of the song. Wonderfully produced with just the right level of crust and clarity to (hopefully) appeal to all generations, \"The Horror\" is near perfect at home and I can only imagine a hoot in the live setting. Carefully maneuvering itself around the dual landmines of plagiarism and recognition, the tomes inside this release show a band well-versed in extreme metal's classic bands though only the most miserable of bastards could say \"The Horror\" is too reminiscent of any one band that it should be written off as a mere clone.\n\nI'm always wary of praising brand new albums to the sky as they are untested against the passages of time that is the undoing of many before them but I genuinely can't find a fault in \"The Horror\" and suggest, nay implore, anyone with a passion for any band I've referenced in this review to buy \"The Horror\". In my mental arguments of why this shouldn't get the maximum I couldn't deduce a single quantifiable reason. Of course others may disagree but I believe this has everything a great Death Metal album should without ever resorting to parody or becoming tired after 32 minutes of utilising the past with a view to moving forwards. What a record. \n\nOriginally written for Rockfreaks.net\n",
        "\nOnce again, a swedish death metal band born on a fertile ground. Although TRIBULATION has been around since 2000/2001, their previous works didn't receive an unanimous agreement. Only swedish death metal fanatics came forward, so to speak .The others could have said : \" well... nothing really bad, but nothing which really deserve recognition and attention. Let's wait what happens next\". “The Horror” is thus their first full length album to see the light of day.\nWhat have we there? - Pure swedish death metal in the vein of KAAMOS/REPUGNANT or even the young NECROVATION following the same path!\nIf those names don't appeal to you, don't waste your time, change course!\n\nThe introduction is a piece of piano sounding like an old school morbid movie's soundtrack from the 70's, it doesn’t do much for the quality metal that follows according to me. The first real track is thus \"Crypt Of Thanatophilia\" and it becomes manifest piano is now a distant memory. Only low-tuned guitars and non-stop blast beating reign. Musically speaking itself, it's once again a mixture between black and death metal. Really not obvious to say if we deal with blackened death metal or the opposite, but who cares ? What sets TRIBULATION apart from all the other death metal bands are also their heavy thrash influences especially in solos composed sometimes upon the pentatonnic scale which create a jazzy atmosphere. A brillant combination that shows that the musicians how to bring their own 'touch' since that's not something very popular.\n\n\"Curse Of Resurrection\" is one of my favourite tracks due to a second half absolutely insane.A significant slowdown that keeps the door open for a simple but damn effective solo!\"Beyond The Horror\" is more or less in the same vein even if it extends with a malefic and atmospheric clean guitars part.\n\n\"The Vampyre\" is actually the first track i had heard before buying this opus (online on their myspace).Pure swedish compositions... i'm running out of words on this one.( the same for \"Sacrilegious Darkness\")\n\n\"Seduced By The Smell Of Rotten Flesh\" is also one of their best ones. it begins very slowly with an intense rythmic escorted by a simple lead tune. Here we touch slightly the doom.it ends with some light keyboard works before shifting into the final song. \n\n\"Graveyard Ghouls\" contains maybe the best riff of the whole album starting at 03:02 (damn, listen to it honestly)\n\nTo finish, even if the album looks a bit short, it contains awesome parts and it is definitely a brillant first full-lenght!\n",
        "\nThis kind of thing isn't very hard to get wrong, what with the formula being about as simple as catchy, snarky riffs layered over with a biting bass, pounding drums, nails-on-a-chalkboard vocals and a production that accentuates the whole thing as the metal-spiked killing machine that it is, and Tribulation are one of those that manage to ace it easily. These young Swedish guys are clearly enthusiastic about what they're doing and they obviously know their roots - this debut album, titled The Horror takes influence from bands like Possessed, Kreator and early Death to create a maelstorm of bubbling, boiling, thrashing Death Metal that is hard to dislike if you like this kind of metal at all.\n\nSure, the songs are sort of samey, and sure, the album is pretty short, but who the fuck cares about that? Tribulation know their modus operandi here - bash out killer tracks of ass-kicking Death Metal for thirty minutes straight, rinse and repeat. See the doctor for further instructions - and they go after it like a pack of rabid wolves after a slab of meat. The album starts off with a misleading piano intro, but once \"Crypt of Thanatophilia,\" with its raging riffery, kicks up, you'll be sold faster than a kid buying his first car. The band varies things up a little with slower passages in songs like \"Curse of Resurrection\" and \"Beyond the Horror,\" and even applies some liberal horror-movie-esque synth passages here and there for extra effect. This album is just ace, and if I were you, I would definitely buy this. Even though I already have the promo.\n\nOriginally written for http://www.metalcrypt.com\n",
        "\nFuck you, Sweden. Where were you hiding this one?\n\nTribulation are a four-piece death metal band rooted heavily in the chaotic, early German thrash. Think Kreator upgraded with that classic, thick Swedish death guitar tone and then prepare to have your ass kicked all the way back to Hell. After a few demos and an EP, they release this devastating first full-length. They've opened up my new year with bang because this is one of the best debuts I've heard in the death metal genre in some time.\n\nChaotic yet controlled bursts of infectious, infernal energy will drive these 9 tracks deep into your soul. Pianos grace a creepy horror intro called \"Into the Jaws of Hell\" before the band levels you with \"Crypt of Thanatophilia\", a beast of blazing death metal riffing with a structure not unlike something you'd find on Terrible Certainly. Not only is the rhythm section rock solid but they can rip off into the crazy evil solo style made legend by bands such as a Slayer or Pestilence. \"Curse of Resurrection\" begins with another Kreator-like power volley, fast as fuck and entirely unforgiving. \"Beyond the Horror\" starts with an intense thrash hook before grinding out the complete fucking evil. \"The Vampyre\" just blows your veins out with its descending melodies and fist pumping death/thrash mayhem. \"Spawn of the Jackal\" starts a little slower with some thrash/doom riffs but picks right up. The other songs are likewise intense, the closer \"Graveyard Ghouls\" is furious.\n\nThe album sounds stunning. The guitars are like meat hooks, sinking themselves directly into the flesh and then pulling you in multiple directions at once. The vocals are a good blend of the death and thrash styles, not as snarly as Mille but otherwise similar. The band is extremely consistent, this is one of those fast and fairly short albums like a 'Reign in Blood' or 'Extreme Aggression'. Get in. Get out. Fuck and fight. Take no prisoners. Leave no evidence.\n\nWe're unlikely to hear many more debut albums this year of the quality Tribulation offers, if you are a fan of Swedish death metal, classic German thrash, or really... ANY extreme metal, this is essential to check out. They may not offer much in the way of originality, but the intensity is hard to match.\n\nFuck you Sweden, for doing it to us again.\n\n-autothrall\nhttp://www.fromthedustreturned.com\n",
        "\n...unless you're a giant wanker. \n\nTribulation, the second so-named act from Sweden, has really got a good thing going here. For close comparisons, you'd have to look to the classics of death/thrash out of Germany and Sweden - bands like Protector, Merciless, and Massacra. In fact, if those three bands got together with a bottle of whiskey and had a hideous zombie baby, Tribulation is about what it would be like.\n\nThis 7\" release has everything you could possibly want out of the genre. It's ridiculously, silly, Sadus-fast. The occasional mid-tempo parts just render you more shocked and amazed when they whip back into another maelstrom of precisely executed warp-speedery. It's usually just south of blast beat territory - more like very crazed thrash tempos, which is just about my favorite kind. The other instruments lock in with the drums and never get out of time, which is extremely impressive at these speeds (and from a little-known band). The riffs are kinetic and spidery - very Kreator-influenced with bits of Possessed and Protector seeping in. Over the top are some seriously pleasing mid-range death growls, poised somewhere perhaps between Possessed and early Morbid Angel. \n\nThrow in some EC-comics-worthy sleeve art and clean, balanced production that belies the band's obscurity, and you have the ingredients for one of my favorite 7\" releases of the last few years. Tribulation along with similar-minded Swedish revivalists Lethal and Corrupt really have a good thing going. Let's hope that these bands make good on their potential and put out a full-length or two. Or at least a handful more seven inches like this one.\n"
    ]
}