{
    "Band Information": {
        "Country of origin:": "United States",
        "Location:": "Clearwater/Ocala, Florida (early); Tampa, Florida (later)",
        "Status:": "Active",
        "Formed in:": "1997",
        "Genre:": "Metalcore (early); Alternative Rock/Post-Hardcore/Metalcore (later)",
        "Lyrical themes:": "Christianity (early); Consequence, Heartbreak, Inner struggles, Depression",
        "Current label:": "Fearless Records",
        "Years active:": "\n1997-2013,\n2015-present ",
        "Number of Reviews": 48
    },
    "Band Reviews": [
        "\nUnderoath’s They’re Only Chasing Safety was such a massive pile of shit that it took years for the band to redeem themselves. Their efforts paid off with the explosive, abrasive onslaught that was Ø (Disambiguation) which, while not perfect, was a new chapter and acceptance of their darker nature. They tapped into the callous side of modern metalcore and spun it with their own brand to create some potent, ferocious music. It took ditching one of their (since returned) key members, Aaron Gillespie, to do it. When they broke up, it was like all that zealous productivity hadn’t reached its full potential and we were left without hearing their Final Form, so to speak. In reuniting, they turned a What Could Have Been… ending into a Finish What We Started arc. But now that we have the answer, maybe it’s better to have gotten the bittersweet finale as opposed to the lackluster return.\n\nErase Me is a letdown. It has to start somewhere – Gillespie (and his now deepened boyish cleans) is an easy scapegoat, but I don’t believe it’s him. I described Gillespie’s drumming in the past as undulating, which is apt as I think helps add to the weight of Erase Me like it did for Lost in the Sound of Separation. The metal scene changed drastically and to an extent left Underoath behind playing catch-up. It’s one thing to play brazen, dissonant metalcore of old when crushing riffs, passionate crescendos, and odder conventions elevated the music. It’s another to throw that all away and completely disregard the changing of times. There used to be an Underoath awash with ideas, packing their songs with several post-hardcore harmonies, balanced roars and screams complimented by restful cleans, pounding rhythms, and metallic grit. Now we’re stuck with pedestrian alternative rock at the core and some remnants of who they used to be.\n\nI’d joke by saying it’s almost as if the album telegraphs which songs are bad (the even-numbered ones). It’s a little more nuanced than that, but the core problem still remains the writing. It’s too simplistic, the hooks don’t hit as strong, they pushed the guitars under the drums, there’s no single song that outshines the others, and all that’s left is a pretty underwhelming experience. It’s a bad sign when songs have nothing to offer except mild choruses like in “Rapture” or “Wake Me”. Then you have others like “Sink With You” that cave in on itself by going absolutely nowhere. And don’t get me started on “No Frame” wasting my time with all but the last thirty seconds being worthless. I’m not sure what the band’s intention was to have so many songs that don’t click with each other (like there was no singular vision behind any of it). \n\nGreat alternative / post-hardcore bands weave intertwining emotional melodies, use vocals to accentuate the central tone, and then attract the listener through whatever means they see fit. Great bands don’t write stagnant verses and predictable choruses to justify their existence. I don’t mind if they want to low-ball it with songs like “I Gave Up” and “Bloodlust” because they’re catchy, but it’s totally effortless. No amount of electronic noises and keyboard doodling can cover that up. Instead, it’s a surefire way for me to want to listen to Saosin or Ghost Atlas where I’m rewarded with deeper introspection and gripping payoffs. The opener and “On My Teeth” have a bit of that poise in riffing and ardent atmosphere, as do aspects of “Hold Your Breath”. But that’s few and far between, and what ends up sounding the best on this album would pass as one of the weaker tracks on previous ones.\n\nI’m not sure where Underoath goes from here. After publically disavowing Christianity, which was a big moment in redefining their identity, Erase Me feels like a footnote. It fails to stand on its own merits as an alternative / post-hardcore album. It benefits from slick production and generally good performances, but suffers from ineffective writing and lack of ingenuity. It makes the years they spent rebuilding their reputation through incrementally improving their writing style, incorporating heavier influences again, Chamberlain developing his vocals, and individual resolve feel like it was abandoned. They’ve atoned for past mistakes more than once. Let’s just hope they’re able to recognize that and do what they have to do.\n",
        "\nLong before “deathcore” was a genre, and at the time when hardcore bands playing metal riffs was at its peak in the scene, there would occasionally forthcome a few young bands that would posses a few death metal fans in their lineup. The result would be a metalcore band that would make an observer at the band's live show utter “that guitarist listens to Possessed and it shows.”\n\nDeath metal-tinged metalcore is what this kind of music was and it was awesome when you’d see it done in the 90s (not to be confused with deathcore; although this stuff was definitely a prototype for that upcoming genre). At the time Underoath was one of two Christian bands to perform this DM-influenced brand of metalcore, the other being Embodyment, and well I will say EVENTUALLY Underoath got the formula right by the second album, but unfortunately the debut album proves to be a bit of a sloppy misstep. Most of the content here comes across as rushed and a bit amateur, even for 90's metalcore. Riffs that try to get to a point fast—while at the same time never had a point in mind from the start frequent this album until it's time for the breakdown and by then you're already bored anyway. Rinse and repeat.\n\nLet me just come out and say that I think the band really shouldn’t have rushed out a full-length as quickly as they did; these songs would have much better suited a demo tape or at least an EP, but being that the material heard here is the band’s debut full-length album and with how much evidence on this release exists that they really weren’t ready to find their sound just hurts the overall presentation and material as a whole. Too many metallic riffs misplaced in random sections make the end of result of this record feel more like a jam-session instead of songs. Couple this with Aaron Gillespie’s noisy percussion the best thing this album has going for it seems to be aggression without direction, which is more of the name-of-the-game playbook for a genre like grindcore. Alas, that’s not the impression that I’m trying to find here, if I wanted to hear pure unadulterated audial chaos I’d rather turn on Dahmer or Insect Warfare and not a Christian metalcore band.\n\nWhile it isn't all terrible, the flaws definitely outweigh the good moments. But some comments I can give to Act of Depression are stuff outside the way the songs are crafted such as Aaron's snare tone is great here. The almost proto-St. Anger snare works so well in these heavy-ass riffs. Also I should say just because the riffs are usually a mishmash of mediocrity, it doesn't mean there aren't decent sections, for example the wonderful uplifting tremolo during the 1:35 mark on \"A Love So Pure\" is probably the best moment the album has to offer. Moments like those serve as a preview to what the band was going to continue onward with on the proceeding (and much more superior) album Cries of the Past.\n\nVocals are a decent combination of screams and death growls with spoken-word passages. The typical false chord metalcore scream in the vein of Zao is pretty much the name of the game here in terms of vocals. Now on the topic of lyrics, young Dallas Taylor was obviously very dedicated to his Christian faith and isn't afraid to show it, even if his words are uhh... let's just say not the easiest to digest. One example is the song \"Watch Me Die\" which has a monologue opening in spoken words performed in some of the most annoying tones of voice possible. But that's not even the worst of it. It gets worse, such as how at the fucking ending of \"A Love So Pure\" he literally starts singing (not screaming, literally singing) \"Jesus Christ I love you.....\"... Uh ok. But would you believe that's not the worst part either? Here's where I have to acknowledge the elephant in the room here that this album contains the notoriously cringe pro-life song \"Burden in Your Hands\", which features the infamously horrid lyrics:\n\n\"You should of thought about the baby before you had sex, because you have destroyed a gift from God / You kill, you destroyed / Never will this baby be able to grow up or show it's love / You'll never hear it say I love you, I love you / God does not give you the privilege to carry a child for nothing / When you kill, you destroy that child's dreams and hopes / How innocent a baby is... how can you put it to death?\"\n\nJesus fucking shit, I wish I was making those lyrics up. It's not like I was even cherry-picking any cringeworthy sections of the song either. Those are all in-conjunction with each other. Yeah it's uh bad. Bad enough to not be able to take seriously, but also not terrible enough to consistently laugh at. It's just bad. Now I usually don't clown on people's lyrics because I personally do not believe in being able to rate passages of words that mean something to someone, but if your lyrics concern an advocation against the practice of abortion using the absolute worst metaphors possible to do so, I'm just gonna have to call it out. It’s horrible.\n\nFor Underoath's debut album, it comes up disappointing. The record isn't god awful, but it's also not good. This is not even the kind of album I would recommend to fanatics of 90s metalcore. Even with the good sections sprinkled here & there, there are still those persisting moments you'll experience in the course of the hour-long record where you begin to ponder if subjecting yourself to these metalcore jam sessions (not songs) are sometimes worth it merely to hear those good parts. Every single track here pushes over 5 minutes, with a majority of them pushing 7. I know Cries of the Past has longer songs, but everything about that album is better in every way. On the other hand all I can say about this one is it should’ve just been a demo, \nlet’s just pretend that it is.\n",
        "\nOnce upon time there was a band called Underoath, they were playing the heaviest metalcore around. One day got tired and decided to shift away. And so, they lived happily ever after. End of the story.\n\nIf we have a look upon the year of this release, it dates back to 2004, once back when every single band on this planet was playing post-hardcore. There was post-hardcore, emo, and pop punk literally everywhere: in pubs, bars, supermarkets, hospitals, as elevator music, in discos, at rave parties, funerals, weddings... you were turning on the radio, the tv, and there were always these emo-screamo-pop punk bands on every single channel; even cartoons, talk shows or news had post-hardcore and pop punk songs as soundtrack or theme song (not joking! eg. Maximum the Hormone), as well as there was absolutely no videogame without, at least, a song of this style (From first to last, Billy Talent). So this genre has been the soundtrack of a decade, that - luckily, thank God - has passed away. Were Underoath following the trend? Were they \"chasing more profits\" in the same way as \"they (I suppose the Government) were chasing safety at the time\"? (curious fact, that the cover art and album title were prophetical of the 2020's pandemic). Probably. Who knows? \n\nIf they were sucking at the time, they were however doing it in a proper manner. Because, compared to the sea of shit in which we were suffocating once back when labels were devastating our ears with that shit, this album is excellent. This isn't absolutely Cries of the past, but at least is not Lostprophets or Thursday, because Underoath are talented and there's difference between wasting talent or not having it at all. \n\nMay ask why that vote, the reason is simple: this album is a giant sculpture covered in bird's shit, still standing over the decades, resisting to the recurrent vandalism, but still singing of its time like Today. They started for sure a chapter in their career, they've pursued a new path, and the fact that this album drives nuts the most orthodox metalheads, makes this even more enjoyable. I don't really care if this isn't \"true\" at all, if they are \"posers\", if they aren't part of the \"scene\", because there's nothing worse than pursuing a label, especially from a generation who has bitched and whined for a long-time for being labelled or put under categories. Music and creativity have no boundaries, and this fascist manichaeism is absolutely detrimental. So I kindly welcome and appreciate those bands who have the courage to explore new territories and start new adventure, like Ulver or Manes.\n\nThis album was made to his era accordingly, with a far better production of most albums of this wave. The solutions are interesting, melodies are catchy, it's clearly commercial but undeniably a step above the works of their colleagues. Let's stick to the fact others were copying their homework, because Underoath are talented musicians, who can actually play an instrument: their live performances prove this, the composition of even this album is at the same level of their albums. So metal or not, it doesn't matter: if you're good, you do things in a good way. \n\nNo one here is saying this is perfect, because there are flaws and it's some kind of trivial if compared to the overall rock music universe, but musicians are people like us who have their background and pack of experiences and references. The album connects back to the roots of the genre, back in the days when emo was still a borderline mixture of post-hardcore and college rock. Songs such as Young and Aspiring, The Impact of Reasons and I'm content with losing are absolutely enjoyable and seem more played by a band like Funeral for a Friend or You and Me at Six, rather than by the same one who 4 years before made a blackened deathcore album. Don't even give much importance about the lyric content which is quite juvenile and predictable, not because it's religious inspired - the majority of the art is, just look at the paintings of Caravaggio and Raffaello - but it's simply because are pathetic and vacuous. \n\nNot clearly for everyone, but somewhat good in its own way. Maybe \"so bad it's good\" for some of us, but we cannot forget those days which we were playing at the console and listening to it. And to feel nostalgic is absolutely part of our nature.\n",
        "\nWhoever knows Underoath, knows how they have become throughout the years. And how their style has worsened and shifted towards a completely different place to stay in line with the trend, making them a commercial alt-rock/pop-punk-influenced metalcore band, even though not as bad as you might think. This disease, which affects a lot of contemporary American bands, obsessed with becoming pop-stars of the metal scene, literally ruined what actually the spirit of the underground music, that both metal and hardcore actually is, something meant to be by the few for the few. And, as I've said in another review, this doesn't just inherently applies to metalcore but to other genres as well.\n\nDon't get me wrong, I'm not calling for elitism, but for God's sake, to each his own. Experimentation is welcome, indeed, innovation too, breaking the schemes is wonderful and risk is sometimes is the name of the game. I've always admired bands who got enemies from breaking the scheme, but there's a huge difference between taking a strategic manoeuvre to catch more fans and breaking a tradition, questioning your beliefs and do things for yourself because you simply don't care about what the others say.\n\nUnderoath falls, unfortunately, within the first category. Because, they simply don't belong to a certain scene, and this album is a clear demonstration of this. Cries of the past is a solid flawless record, an insane monolithic mixture of black, death and hardcore: the music has a dark, melancholic, dismal atmosphere. This album is capable of being heavy, brutal, introspective and reflective at the same time. The songwriting is solid and intelligent, with lyrics talking about a personal point of view about different aspects of life, such as feelings, heartbreak, spirituality and faith, and how all of them relate each other (Walking Away, And I Dreamt of You). It's the depiction of the modern humanity, which has disowned God and spirituality and has opted for a comfort zone, but when things start falling apart, starts looking for answers and so desperately looking for a light in a sea of darkness, of endless pain and sorrow. So the religious point of view conceived not as a pathetic self-referential ridiculous hymn (as in Act of Depression), but as a way to look above the abyss. \n\nThis album is highly and undoubtedly influenced by Starkweather, as all the tracks are surprisingly long and no one is shorter than seven minutes. So, consequently the music is absolutely more rooted in black and death metal, has more focus is more upon the music rather than singing, as precisely as hardcore conceives songwriting. Even the choice of the breakdowns, which are basically doom metal parts, makes the album even darker, angrier and gloomier. The vocals are grasp and no monotone at all, a perfect blend of all the three genres, which the work is based on. Riffs are like razor blades, they literally penetrate through the ears like a drill: heavy, naughty, brutal. And perfectly combined with tremolos and trashy-palm muting, and they sometimes leave open space to melodic, suffered solos like flashes of light in the dark. The shifting transition between different styles within the same song happens sometimes gradually and other times unexpectedly, the same as the first, metalcore acts were doing, back in the days when the genre has been just a bastard son of hardcore, metal and noise rock. Undeniable is the death metal influence in their way of composing, which makes the album away\n\nCries of the past is indeed a step further from me Act of Depression, which is of course a good album, but not as mature as this subsequent chapter, in which they have put more effort into writing and playing. The production level is sensibly better than in the previous album, as well the purpose in itself. To be honest, the debut didn't actually show the band's talent, giving instead an incomplete introduction of what they actually were able to do. The first album wasn't going anywhere, it has been just enjoyable, but nothing more than that. However, this is definitely not to blame, as it's rare that a band isn't unripe on its debut.\n\nA bit of a shame they have shifted towards a completely different sound with the passing years, not to blame on them absolutely, everyone is free to pursue the purposes, which thinks best, but this still remains the milestone of their entire career, and, in it's genre, Cries of the past is one of the best metalcore works ever. And perhaps one of the fewest records of this style enjoyable even to the most extreme metal fanatics, especially if those who aren't disdaining traditional heavy hardcore. Underoath have probably become tired of playing metal, not sure, but what they are now and what they were once are two complete different bands. Like In Flames.\n",
        "\nThere comes a time in every popular band's life-cycle when it becomes commercially viable to pump out auxiliary material to keep fans spending while awaiting the group's next proper release. Boxed sets, live albums, rarity & b-side collections, deluxe re-issues and collector's editions; these are nothing new. Underoath was not the first band to do it, and this boxed set isn't even the first time Underoath has re-packaged their material, but never before have I seen a cash-grab as half-assed and uninspired as 2011's Play Your Old Stuff. Marketed as a collection of early Underoath albums, Play Your Old Stuff fails at both being 'old stuff', and at providing anything to validate the existence of this set.\n\nAs far as containing 'old stuff' from Underoath, the set overlooks their first two out-of-print albums, Act of Depression and Cries of the Past, in favor of their first three offerings on Solid State Records, The Changing of the Times, They're Only Chasing Safety, and Define the Great Line. At the time Play Your Old Stuff was released, the included albums were all less than 10 years old, all three were readily available in digital stores like iTunes and Amazon, while They're Only Chasing Safety and Define the Great Line were also still in-print as CDs. The only saving grace from this selection of albums was the inclusion of a physical copy of The Changing of the Times, which had gone out-of-print after the departure of founding vocalist Dallas Taylor in 2003.\n\nThe set also fails to provide even one bonus or extra to justify its existence. The albums are not remastered or remixed in any way, nor are there any physical collectibles or memorabilia, and the albums are void of any bonus songs or other features. Somewhat more confusing is that the set even fails to include any of the previously released bonus features of the included albums: None of the DVD features from the special editions of They're Only Chasing Safety and Define the Great Line are present, while the set also lacks the several bonus tracks featured on various editions of They're Only Chasing Safety.\n\nThis boxed set is designed for no one. It's no good for completionists, as it lacks material found in other editions of these albums. It's no good for old fans, as it fails to include the early albums they're looking for, and it's no good for newer fans, as it simply collects albums already available to the public. So avoid this set, and spend your money elsewhere. Unless, of course, you're in that small demographic of people that needs to have a physical copy of The Changing of the Times, and is willing to pay the price of three albums to obtain it.\n",
        "\nBefore I start the review, I have to clear a point about this album- which is that the band drastically changed its sound from its fantastic previous album in this release and that this album should be approached with an open mind. \n\nThe album wasn't called The Changing of Times for nothing, as it shows an almost completely different Underoath. Long gone are the chuggy breakdowns, the complex song structures and most of the musical diversity shown in Cries of the Past, and instead, goes on a more streamlined approach (and is not completely streamlined like They're Only Chasing Safety was) which is definitely overshadowed by the legendary previous album but is still pretty good on its own. A very notable thing that characterizes this album is that instead of the 180 degree turn that many people claim this album to be it shows a pretty strong COTP vibe on a few tracks, with the recognizable black metal influences, the impressive double kicks and a significant part of the dark atmosphere that was prominent in it. Songs like \"A Message for Adrienne,\" \"Never Meant to Break Your Heart,\" and \"Angel Below\" prove that the band hasn't completely shifted its musical approach from the former release.\n\nThen there are the obvious changes that the band was made notorious for. The first part of the title track and the first track sum it up- despite the latter actually being good and also being one of the most uplifting songs ever made. The intro section of \"The Changing of Times\" has to be one of the lamest things the band has ever done and is one of the worst things in the album. \n\nAside for that, the instrumentation is pretty damn good. Despite the huge lineup change and stylistic departure from COTP, the band still manages to show a variety of influences with also keeping the prominent metallic base. Tremolo riffs, chuggy breakdowns, crunchy riffs, alt rock-y chords sections and clean interludes are woven together to create a huge wall of sound, along with the thumping bass, and the drumming skills of Aaron Gillespie which proved himself to be one of the most capable drummers of the genre. The keyboards play a semi-important role in the album as well when they sound good and not like Sonic the Hedgehog powerups (*cough* \"Letting Go of Tonight\" *cough*) in which they do nothing but invading the album's atmosphere.\n\nThere is a huge letdown of the album though- that has nothing to do with the music (well, except for the intro of the title track, fuck that) but with the lyrics instead. Lyrics were never a strong point in Underoath's career, but seriously guys? COTP was at least poetic in some manner, but the lyrics that were featured in this album are just plain stupid and trigger nothing but laughter. They are super emo-ish, pseudo emotional, have \"we love Jesus so let's just say that in every possible way we can\" aesthetics, and are overall really pathetic and embarrassing:\n\n\"Letters explained his grief\nBut she would never read\nHis wrists would bleed\nBut she would never see\nSo he took his life at the age of 23 (\"A Message for Adrienne\")\n\nOverall, this album isn't bad. Just avoid the lyrics and the intro of the title track. Recommended.\n",
        "\nBefore Underoath became the second most egregious example of a talented metalcore band developing a unique and interesting sound only to throw it away for commercial success; they were a shitty death metal infused metalcore band with not a whole lot going for them. And like all much heavier debuts by mainstream metalcore bands of the day it really isn't worth your time; despite its supposed 'brutality'. It is a little better than the worst of their post-hardcore days; but is still far worse than its successor or either of this outfit's latter two albums. Basically it sucks, really badly.\n\nThis album is plagued by a number of issues. For instance, the vocals are terrible. Nearly as awful as the emo screams of Spencer Chamberlain around 2004 in fact. Tony Dallas' screams are very dry, incredibly pulpy, quite thin and weak, and have literally no expression or variation to them at all. They do at least obscure the lyrics; which are awful not because of their Christian bent but because they are so ham fisted and preachy. There are more eloquent, subtle and creative ways to say 'I hate abortion' and 'I love Christ' than this crap - just look at something like 'Burden in Your Hands'. Jesus wept.\n\nThis pulpy nature of the vocals would be a bit more tolerable (like on their next album) if the music was any good. It's alright in some places, with this album containing a smattering of decent death metal-ish riffs, but these riffs are broken up by a ludicrous number of lengthy breakdowns. Riffs are repeated far too often and not developed enough. The whole album is frantically and sloppily played, and topped off with its tinny and thin production (particularly that snare) the whole thing comes across as a bad rush job. Just as well, the bass can barely be heard, giving rise to a thin and clinical guitar tone. The overlong and haphazard approach to songwriting (repeating an idea ad nauseam before suddenly switching gears) cements this as a thoroughly sloppy and pretty awful piece of metalcore. Yeah its heavy compared to what this band is known for and it has riffs - but that doesn't make it any good. Underoath was good before they got big but this isn't the album people are talking about - the potential was there but they put too much time into being heavy and screaming a lot and not writing riffs and stitching them together properly. Skip this one.\n\nAnd that acoustic thing with Aaron singing tacked on the end is the cringiest thing ever. Good grief are his prissy gushing cleans awful; fortunately they don't come about all that often during this album, which is a relative plus.\n",
        "\nClung onto the rear of that mightily terrible monolith to all things emo and crappy that was They're Only Chasing Safety is this festering dingleberry of a single, which is yet more of the irritating and screechy nonsense the band were making around this time. The vocals are some of the most retch inducing and grating of their type - there are these really high-pitched, pulpy and irritating bitch cries/screams by Spencer Chamberlain that constantly fall into a sort of whimpering wail and sonically flail about all over the song, being exactly 4976 times louder than the instruments. The hideous prissy cleans of Aaron Gillespie are somehow even worse than this though, given that they sound whinier than a good number of mallcore or other metalcore vocalists and expose the lyrics, as well as being more exposed in general as they are there for the soft, 'uplifting' hooks. The music is completely without merit, it is just a fuzzy, melodic backdrop that is nothing more than a loud hiss in the background that is never developed at all. It cycles between 'ambient' electronic bits with Aaron and 'aggressive' verses with Spencer, bringing out the worst in both of the frontmen by being too noisy or too quiet.\n\nThey even adorned this shit with the same hideous cover art as the album that preceded it, and then gave it a stupid Fall Out Boy-esque overlong title and some of the worst whimpering emo lyrics imaginable. Needless to say: fucking avoid.\n",
        "\nAnd here it is, (hopefully) the final recordings from those two-hit core wonders who helped bring forth screamo as a viable musical concept (I still hate them to this day.) Fortunately; they had been moving away from that sound with every album since their hideous turdburger pretending to be music that was They're Only Chasing Safety, and this single represents a complete evolution from that sound. They've nearly redeemed themselves with this one, showing that they won't throw away a good sound like they seemed so intent on doing all those years ago.\n\nGone are the fuzzy alt-rock chord strums of old and in come choppy, properly heavy chugs that actually have some sort of discernible rhythm and variation to them. The songs feel much tighter and more driven as a result, which is a welcome change from the irritatingly loose crap this band used to churn out. Spencer's screams have massively improved with every recording, having taken on a deeper, heavier, somewhat throatier and more overall more grounded approach than the bitch screams of before. Perhaps even more crucially however, his clean vocals are worlds above the prissy-ass, teeny-boy punchworthy slobbering of the former (at the time) drummer Aaron Gillespie - they still have that angsty and sappy alt-rock feel to them but they channel these emotions without being hideously revolting in a boy-band sort of way.\n\nThe songs are built around the standard metalcore harsh verse-clean hook formula that has been set in stone since the genre's modernisation and mainstream breakthrough, only here it is done without the whiny emo trappings owing to the less overt angst in the lyrics and the vocals, which avoid histrionics. The hooks aren't that much 'larger' than the rest of the song, so they don't feel forced or abrupt like many of this band's contemporaries. The production isn't quite as noisy in the drum department or as crisp in general as this single's two predecessors or something like Architects' The Here and Now, relying less on noise and more on the vocals than one would expect, which is good given that the vocals are actually decent and the lyrics aren't embarrassing, as well as making it less off-putting to those unfamiliar with the style.\n\nSadly, this band died before they could make any more good stuff like this, and then reformed with their eternal bane Aaron Gillespie. For God's sake guys, *don't* make any more music. We don't need Aaron to open his bloody trap in our speakers ever again. Let the memories be memories.\n",
        "\nSometimes you just need to change your view about things in music. If I would've known that I ever listened to this type of music, my ears would be cut off already by the time this review is being written. So yeah, this is cheesy emopop, but pretty good one in this case.\n\nTo make my points clear, and the first and most important- THIS IS NOT METAL OR METALCORE. THIS IS \"EMO\"CORE, but the more stable version of it. This is not even close to the crappy BVB (which their name isn't even worth of being in bold) or any of today's \"emo\" shitcore. This album has more passion and talent (although the talent here is very lacking, but this will be discussed later on the review) than any of those bands, which is a thing that makes this release very fun and lightweight. \n\nNow, to the musical part of the album. After the major lineup change that came after the almost black metal Cries of the Past, the band headed for a more commercial direction which means that the metal sound had to be changed into a more acceptable form of \"heavy\" music, and in fact, this isn't heavy at all. The drums aren't shattering metal beats, and instead focus on more alt-rock/pop punk rhythms which definitely with the music which was targeted at the audiences of those genres. The guitar riffs feature very simple chord-driven melodies that are repetitive but are straight to the point and are one of the album's good points. Another interesting feature here is the vocals- the clean vocals are very cheesy and sugar-coated but are really catchy and provide some really great vocal hooks, and those are opposed by wannabe emo screams which surprisingly are stable and consistent, in opposing to other emocore bands. \n\nThe songs themselves are well structured, with a \"loud\" part at the beginning, a more quiet refrain at the middle of the song with occasional some acoustic guitars, and then back to a louder section which is packed with energy and passion. Although this structure may seem very repetitive at the beginning, it isn't that boring and drives They're Only Chasing Safety forward without any things that would interrupt it. The only cons about the album are the bad production which lacks any bass, the useless instrumental The Blue Note, and the closing song which sounds whiny even compared to this album.\n\nOh, and let's not forget the fucking lyrics. I admit it. THEY SUCK. They're your typical whiny wannabe emo teen lyrics which fell in love with another wannabe and she dumped him so he cut his veins and cried about it while stealing his mom's makeup and cutting his veins:\n\n\"Well look who's dying now\nSlit wrists for sleeping with the girl next door\nI always knew you were such a sucker for that\nIt doesn't matter what you say\nYou never mattered anyway\" (A Boy Brushed Red Living in Black and White)\n\nWhat could be more said about this? It is an improvement from their last album, but not from the one before that. It isn't suitable for everyone, but it is pretty enjoyable. Recommended.\n",
        "\nOh man... why do I do this to myself? \n\nIt is time to return to a familiar stomping ground of mine - the place that is inhabited by what I once considered to be the worst notable band on the archives, and released what I still consider to be one of the worst notable albums of all time, one of my 'unholy trinity of 2004' - Underoath. A.K.A. bible-thumping prissy emo losers that were part of that explosion of emo bands around the early 2000s, and are also those bastards that released They're Only Chasing Safety. If ever there was a band that I would have considered fundamentally worthless and awful, it would be this band. Of course, upon discovery of Ø (Disambiguation) and Cries of the Past I realised that this band can occasionally make something really great... but those albums are the exception, not the rule.\n\nAnd this album is the start of the trainwreck that is the vast majority of Underoath's career. Some may point to their debut and claim that the band have always sucked and that the metalcore masterpiece that followed was merely a fluke, but even Act of Depression had some redeeming qualities. Most of that album’s issues arose from the preachy lyrics and awful structuring; the actual music wasn't that bad, even if it was a bit breakdown-heavy. This however, is just pure garbage. One of the worst 'metalcore' efforts imaginable, it manages to combine everything I hate about this style of music and sap any sort of life-affirming qualities that I may otherwise get from something completely bitchy like this. Even by emo standards this is crap.\n\nMy main issue with the album (and this style of music in general) is how banal the actual music is. The guitars for instance are just continuous fuzz in the background, and that's it. No rocking riffs of any kind, certainly nothing like the majesty of their previous album. There isn't really any chugging or any sort of rhythm from the guitars at all, in fact. It is just a bland noise that is there just so they can claim to be some sort of rock band, rather than pop music with a screamer. And inexplicably, occasionally out of nowhere (like at the beginning of 'A Message for Adrienne'... I'll get back to the lyrics) some heavy chugging part or even a groove will make its way into what is meant to be completely gentle music with screaming. I don't know why this is, so I assume it to be the band mocking the 'old-fashioned conservative metal fans' who liked their last album by showing that they can come up with something decent, but choose not to stick with it because MONEY! It makes no sense and annoys the piss out of me.\n\nThe rest of the instruments follow suit, with the bass being part of that indiscernible and indistinct fuzzy wall of sound with the guitars, and yet not really giving the guitars any sort of crunch. Like all the instruments in fact, it is just noise for the sake of noise. Nothing of note happens with it, nothing intriguing, nothing creative, there are no signs of life from it. And the same goes for the drums; it is just a very lightweight timekeeping device that does nothing else interesting at all. And given that the guitars are just continuous fuzz, the drums don't even have a real rhythm to follow, so it just comes across as a loose and sloppy performance, and the whole album feels really off-kilter and off-time as a result. It also makes the album extremely unpleasant and jarring to listen to. \n\nAnd then there is the construction of the songs, which is focused on hooks. Following suit, the mix brings the vocals to the forefront... nothing wrong with that, right? RIGHT?!\n\nWRONG! Another thing that makes the album extremely unpleasant to listen to is the goddamn vocal performance. Going back briefly to the instruments, the only reason that I lambasted them for not doing anything of note is that Underoath here have crafted vocally-orientated music but forgot to bring any good vocals or lyrics, forcing me to look past the utterly hideous butchering of the concept of 'vocalisation' at the mic. If the band can bring a good set of pipes to the table and make things catchy, I'm all ears for something with bland instruments. Here though, what we get is the weak as fuck and completely whiny wailing of Aaron Gillespie. Clearly thrown in there for hook purposes, the guy just screams (or whimpers) 'emo' at every given turn. His voice is so full of whiny angst, he puts literally no power into it at all, and it just makes me cringe with how pathetic and child-like he sounds. And Dallas Taylor... is just awful. Absolutely fucking terrible. I never particularly liked his high-pitched screaming even on the last album, but they weren't exposed and there was a wealth of good music behind him to focus on, and the overall aggression of the music made them fit in a bit better. Here, they are entirely exposed and don't fit at all with the ultra-bland, saccharine music. He has such a dry and grating tone that it gets tiresome to listen to the guy after about 3 minutes. All he does, like Spencer Chamberlain on the next, is obscure those awful lyrics.\n\nAnd that's another thing! The lyrics on a vocally orientated album are complete shit! Emo garbage through and through. This sort of shit can work, it can appeal to the ultra-sappy, angsty and whiny scene kid that I like to keep locked away within me, but here... it just doesn't. The vocals are one factor - they sound so bitchy and limp that there is no way that I could ever identify with this trash. It is just completely cliché, predictable, awful lyrics about that girl this guy wanted, the girl who didn't come back, 'oh woe is me', blah blah blah and SHUT THE FUCK UP! I've been depressed over nothing, I've thought about suicide over the tiniest and most ridiculous of things, I've had a crush reject me, and I have quietly cried to myself over this rejection. You know what I didn't do? Pick up some instruments, then scream and whine into a microphone for 36 minutes with some of the most generic teen diary poetry imaginable, and then sell it to someone! If you can't articulate such (or any sort of) emotions and thoughts with some sort of energy, fire, and creativity, then don't bother, especially if you can't write good lyrics on an album clearly designed to be vocally orientated and hook-centric!\n\nI realise that I spent an entire paragraph dissing the lyrics, but that is because there really is nothing else to talk about. Awful, whiny, generic, dull, boring, revolting emo/'metalcore' fodder of the lowest order. The album sounds like shit too - everything is really thin and quiet, and sounds like it was recorded in a dustbin. And I don't know what that cover art is supposed to be either, but the title font is ugly as hell. This isn't the worst album Underoath released, and it does have the occasional riff here and there... but it still fucking sucks. After this horrible misstep, Underoath's career went down the toilet for a good few years until the almost passable Lost in the Sound of Separation and the really fucking good Ø (Disambiguation). Nevertheless, what is displayed here is a pissing away of talent by a band that is capable of so much more. Sure there were line-up changes but the guitarists remained, where did all those riffs go, huh? Where did the songwriting go, and the atmospheric keyboards, and the creativity, and the passion, where did all that stuff go?\n\nOh yeah. None of those things make the money. Fuck Underoath.\n",
        "\nMany of us know Underoath as the go to band for fat American teenage girls from around 2004 till 2008 when crabcore pioneers Attack! Attack! stole the title. But what if I told you that Underoath had a past as a death metal influenced metalcore band? Thats right, Underoath had more in common with slammers Waking the Cadaver at one point in time than the screamo genre. But is the album any good? \n\nI will start off with the vocals first. The harsh vocals have more in common with the shrieks of Mayhem's Maniac than future post hardcore bands. They comfortably match the extreme nature of the instruments. My only problem with the harsh vocals is that they sometimes get burried under the tremolo picking melodeath sections. The clean vocals on the other hand are awful. They sound as if the band got a prepubescent male to sing them. They are the only scene element on the entire album which ruins the otherwise excellent vocal display. While on the subject of vocals, I will mention that the lyrics are terrible. A particularly bad example are the cringe inducing lyrics to the anti abortion anthem \"Burden in Your Hands\". \n\nNow onto the guitars. The guitars mainly play a death metal influenced version of 90's metallic hardcore similar to early Eighteen Visions with occasional moments of At the Gates worship.There are regular NYDM style breakdowns in the vein of Suffocation and Skinless which, while certainly entertaining the first time around, all sound similar bordering on identical. This makes listening to the album in one sitting seem like a colossal task as you feel as if you are travelling through a perpetual maze where there is a generic NYDM breakdown awaiting you round every corner. This fashion of brutality for the sake of brutality is easily the albums biggest flaw. While the breakdowns get tiresome quickly, the melodeath riffs are one of the main reasons why you should listen to the album at least once. Damn! I haven't heard finer Gothenburg style riffs since I first gave With Fear I Kiss the Burning Darkness a listen. If you listen to the album for any reason, let it be the melodeath sections. They sound like a slightly more black metal oriented rendition of the riffs on Terminal Spirit Disease.\n\nI will now focus on the rest of the instruments. The bass, while audible at times, is mainly dull when not smothered by the other instruments. The drums mainly fluctuate between mid paced fills and blast beats. They are probably the most consistent aspect of the album after the harsh vocals. \n\nOverall, Act of Depression is a decent metalcore album with a few major flaws that you will be able to have an enjoyable experience with if you look past the atrocious lyrics. I would suggest this to fans of proto deathcore like early Eighteen Visions and fans of modern metalcore.\n",
        "\nUnderoath's music at this point in their career transcends being terrible and becomes revolting. This has to be one of the worst albums I've ever heard; there is not a single redeeming factor about it and it's actively irritating and grating to listen to, which is incredible given what the band are evidently shooting for with this crop of songs. I've known about this album for several years now and even as I've grown to appreciate pop punk, alt rock, post-hardcore, metalcore, etc. this still smacks me as being the absolute dregs. It's a miracle the band would go on to improve from this thing; you'd think they'd have negative talent between them based on this.\n\nThe music presented here is vocally orientated screamo/post-hardcore with very strong pop sensibilities. Like everything in these genres the music is loaded with emotion, and as such it pretty much lives or dies by how authentic and emotionally compelling it sounds, with plenty of emo bands from the time shooting for a display of relatability and authenticity to their listeners. Technical flaws can be excused somewhat if the music conveys its message and its feel well, and this is the death sentence for the album. The entire thing listens like the most formulaic, safe, watered down and manufactured pop punk imaginable which simultaneously shoots for a level of abrasion with harsh vocals that are totally unwarranted given that music conveys no convincing angst, heartbreak, anger or indeed any real emotion at all. This total soullessness is a result of the deeply flawed and utterly pacified music, and it in turn makes the music even harder to take seriously once it sinks in what the band is doing. Not a single moment on this album will make you relate to it, all the music makes you feel is embarrassed for the band and yourself.\n\nThe guitars are fuzzy and sanded down of any real distortion, meaning even when the guitarists play anything approaching aggressive it's totally neutered. For the most part the guitars are mixed in the background; a melodic backdrop to the vocals that doesn't do much of anything beyond fuzzed out alt rock/pop punk riffing, unless that stops entirely for some chord picking, some more ambient material, or a totally generic breakdown that adds nothing to any song they're placed in. The drums are similarly lightweight and mixed in the background and admittedly keep up the energy, but it's all for naught when the material doesn't accomplish anything positive. There's nothing special about any of the instrumentation, and it's clearest when listening to the band behind the vocals how tame and manufactured everything is.\n\nAnd then of course, there are the vocals. Aaron Gillespie's cleans are boyish, gushing, and whiny, a common feature of the genre. His take on the style is particularly weak and pathetic sounding, so they're annoying to begin with. However, given that they are unconvincing of the angst they try to convey, their melodramatic nature becomes even harder to stomach than they would have been. Not helping this is that the lyrics are exposed during the singing, which reveals the manufactured and false teenaged emotions conveyed in them - the worst example being the opening to 'A Boy Brushed Red Living in Black and White'. They never fail to make the listener feel awkward and once again, embarrassed. They don't make the songs catchy as you won't want to remember or sing along to the material even if some of the choruses here are annoyingly earwormy. \n\nThe high pitched, pulpy screams of Spencer Chamberlain are equally grating; he sounds as if he's about to cry and sometimes falls into a really weak yell between his fits of very poorly executed and pathetic-sounding screams. However once again, they convey no emotion at all and sound very forced, making them actively annoying to listen to. It listens like noise for the sake of being loud with no other purpose, which cancels out the one benefit they have of hiding the lyrics. They aren't aggressive to begin with and the 'heavy' instrumentation they're backed up with isn't at all punchy in any way. Not helping matters is that the vocals are at the front of the mix, so they are impossible to avoid (and even then, there's nothing to look out for instrumentally.)\n\nThis entire album is the worst; it is total commercial fodder that doesn't even succeed at being inoffensive background noise. Not once does it serve up a memorable and emotionally compelling hook or song idea, it has no original ideas of its own beyond sanding down everything to the point of being rendered entirely ineffective, and what few ideas it does present (weak harsh vocals, equally weak clean vocals, cringey lyrics, neutered instrumentation) are used over and over again such that once you've heard one or two tracks you've heard the whole album. It has no identity to speak of beyond being entirely hollow and sub-par musically and it's actively annoying to listen to. This album is truly dreadful on every level.\n\nAt least the special edition has re-drawn cover art from Jacob Bannon; it looks a whole lot better than that crap up there.\n",
        "\nYes, this is an unbelievable album, and in this case, that is an extremely good thing. Underoath is a band I have a love-hate relationship with. Their first album \"Act of Depression\" was, in my opinion, a decent metalcore album, although it was fairly average and the overly religious lyrics annoyed the living crap out of me. Christian metal is definitely not my thing, and I can only tolerate a few bands labeled as such. On \"Cries of the Past\", Underoath moves somewhat away from the overly religious themes and includes them in a much more subtle way. The music is also just so much better, and simply calling this album a pure metalcore release is blasphemy (hehehe).\n\nIt is clear right away with the album's opening track \"The Last\" that Underoath wanted to create a purely metal album. While it definitely succeeds in that regard, there are a range of styles this beasts covers. We have of course metalcore (in surprisingly small doses), ironically black metal, and melodic death metal. This album is mainly made up of melodic death metal and a highly melodic injection of black metal. The guitar riffs on this thing are heavy, in your face, and crushing, yet throughout the album, the band compliments this brutality with gorgeous melody. The tremolo riffing on this album really reminds me of early Emperor or Dissection, which going into this album, I really was not expecting at all. The solos are absolutely breathtaking. Breakdowns, of course, do periodically show up within the mixture of beauty and chaos, but they are complimented with extremely melodic and, compared to a vast majority of metalcore acts, technical playing. Acoustic guitar is not used a different a main instrument on this album which definitely leaves more room for an aggressive metal assault. However, they do show up, for example, in the track \"Walking Away\" and are executed beautifully. They serve more as short interludes between musical ideas rather than long passages that become boring. \n\nThe keyboards play a huge role on that album and definitely attribute to the insanely dark sound this thing radiates. These keyboards are played in a melodic black metal fashion that really create an Emperor or early Dimmu Borgir atmosphere in these songs. This is definitely the darkest album the band released. It does have a few drawbacks, however; Because the music is so versatile, it does seem a bit too abrupt with switching from one musical idea to the next. This isn't a huge issue because it helps to justify the length of the songs, but at times, it does sound a little unfocused. The other issue I have is it's still a Christian metal album. I have yet to find a Christian metal album that I enjoy 100%, but this is definitely one of the best in the genre, and one of the few I can truly listen to all the way through and not totally cringe. There are still spoken word references to the Christian god, for example, the ending of \"Giving Up Hurts the Most\". This still made me cringe somewhat, but the music here is just so great, I try my best to block it out.\n\nDallas Taylor is a great vocalist on this release. He ranges from extremely hateful, high pitched black metal-like screams, to guttural death metal influenced vocals, to standard metalcore vocals and clean singing. This variation does the music justice and makes it really unique. This is an album for those who generally cannot stomach Christian metal. I was highly cautious about listening to this band because of their lyrical content. Although there are definitely moments when the cheesy Christ worship lyrics are presented, the extreme vocals really make the lyrics incomprehensible for the most part. This assures no distractions to the truly amazing musical talent. For any fan of extreme metal who can drown out the whole religious aspect of this music, and certainly for any fan of Christian metal, this is an amazing extreme metal album to listen to. It may not be completely perfect, but it is highly enjoyable.\n",
        "\nUnderoath's early extreme metal past comes as a surprise to many people. They played borderline blackened death metal with minor hardcore influences on the fly. This album alone sounds like a 90s Gorgoroth album just with better production, keyboards and short \"jam-out\" parts. The band members that made up the \"Underoath\" name during the time of this release really had a knack for some Emperor-stage Norwegian BM. This album is metal as balls with almost nothing replicating what is seen in this band as the Warped Tour embarked Christian metalcore outfit that they're usually recognized for. Coming from someone who has an Underoath tattoo, I will admit that I love almost everything the band ever did even after this album. So pardon me if it comes off like I'm dissing out the band's material that put them on the map (because I'm not. I absolutely adore They're Only Chasing Safety and Define the Great Line). But Cries of the Past is my all time favorite Underoath album in terms of songwriting.\n\nThe Christian message is still strongly perceived through the music, but if you're just a fan of music and go right into what it sounds like instead of worrying about its lyrical theme (like me), it shouldn't matter. Corey Steger's ridiculously high tuned buzzing guitar sounds like it was recorded in Varg Vikernes' garage while the drum kit of Aaron Gillespie is almost perfect. It's mixed excellently, I wouldn't expect anything more or anything less from black metal than a drum tone like his on this record. While it should be mentioned (before I get ahead of myself) that this is the debut release for keyboard player Chris Dudley, who brought a solid atmospheric sound to the album than what would have been if it was just as raw as its predecessor Act of Depression. \n\nNow the only thing I don't like about this album, is honestly the vocals. I hate saying that, but it needs to be addressed. Dallas Taylor's vocals are far too metalcore sounding for as black metal-esque as this album reaches. Not like that's a bad thing when he's singing on an actual metalcore album. I mean he sounds top-notch on The Changing of Times (the album following after this). But his alternate screams and then growls along with the occasional spoken word part seems too groaning for my liking on a style of music like this. Some people also complain that his lyrics are too \"emo\". But I won't tackle that topic because if there's anything I never do, it's criticize someone's lyrics who clearly had meaning to them when writing. Judging someone's lyrics to me is basically the same thing as reading someone's diary and saying that it's a terrible novel. But that's just the thing; it's a not novel. And lyrics aren't a performance if not more of words that are said whom meant something to the vocalist who wrote them. If Dallas Taylor was upset that he lost his girlfriend, by all means, he can make full albums about it. No complaints from me. \n\nBass guitar is barely audible under some of the riffs, but not enough performance is really all that clear to the ears for me to judge, so I'll just skip talking about that bit. If you ever hated Underoath, I would recommend checking this album out for a second opinion on what they really had going on long before what they started doing what they're known for. Cries of the Past is an essential listen. \n\nRecommended songs: \"Walking Away\" and the title track\n",
        "\nTo be honest with you, I've never had any interest to listen to Underoath before and the only reason I bothered with Cries of the Past anyway is because I heard it was some fusion of melodic black/death metal and metalcore. Now, I'm not usually a big metalcore fan but the supposed synthesis of genres seemed interesting enough. Even though I did have doubts about the quality of the music, I pushed play and I was pleasantly surprised.\n\nComing from a band who is notorious (from what I here) about playing accessible post-hardcore/emo, I was not expecting what hit me. There's a HUGE black metal influence on this album, there's a lot of tremolo picking and a focus on keyboards to create a haunting ambiance. The vocals of Dallas Taylor are your typical high pitched shriek, I like how they're passionate and powerful, and although the growls don't lack as much character as the shrieking, they work well with the context of the music.\n\nMusically, Underoath play an interesting blend of melodic death, black metal and metalcore. Now, usually if I hear a fusion of core with black metal that'd send me running, but Underoath play it with a degree of finesse and skill I wouldn't have expected. The metalcore influences aren't that pronounced actually, instead there's much more of a traditional screamo influence, with the screamed vocals being particularly influenced by screamo rather than taking a rasped black metal approach. I think I only counted about one breakdown within this album, this really isn't metalcore as many people view it, but instead there's a much more traditional post-hardcore vibe within the music. The influence from black and death metal is the most striking aspect of the music. The riffs are mainly tremolo picked leads mixed with thrashier sections, breakdowns aren't a large part of the music on Cries of the Past and instead the focus is just on damn good riffs. Much of the riffs have a definite Dissection vibe to them, and mixed with the ethereal keyboard work then the whole album is wrapped up in a black metal atmosphere. It's a rather odd mixture but honest to god it works. \n\nWith the album clocking in at over 40 minutes with only 5 tracks, this either shows a really bad attempt at making long songs or that the band are stellar song writers. For Underoath, it's the latter. There's a rather large progressive vibe running throughout the album, as songs run through numerous transitions. The transitions never feel haphazard or lazy however, the music has a strong sense of fluidity, with each riff complementing the one that came before. There's enough variation between each song to keep the album interesting and no single idea is repeated long enough to wear out its welcome. The use of acoustic guitars serve more than to break up the faster sections, they're suitably atmospheric and work well with the context of the music. What I really like about this album is just how damn consistent it is, nothing ever feels out of place or awkward, the whole thing just comes together to create one solid, cohesive package. \n\nSo overall this is a phenomenal album from a band I wasn't expecting much from, the musicianship is absolutely stellar and each song is fantastic. It's a shame that the band changed their sound so much as this is one of the best metalcore albums I've ever heard. From a band who has become the epitome of generic post-hardcore/metalcore I can't say I was expecting the quality Cries of the Past delivered, well worth listening for people who like their metal atmospheric and melodic. Cries of the Past comes highly recommended.\n",
        "\nThis album really means a lot to me. It spoke to me in so many ways during my high school years, I know it sounds probably dumb or pathetic, but let me first explain that They're Only Chasing Safety is in no way a metal album. It's post-hardcore, but it's glorifying, almost life changing music that helped me for years so it may seem a bit odd for a review of an album that is potentially belonging to rock music to be reviewed on a metal website, but I want to explain how great this record really is and why.\n\nThe first time I heard these songs compiled with insane amounts of passion, angst and pain, I was drawn in. The music written and displayed on this album is like looking through a museum of afflictions with yourself and serves as a professional written manual to guide yourself through your own problems. Most of the album's pure concept is drummer/clean vocalist Aaron Gillespie's intense pain of ending his four-year relationship. Some claim that this album was influenced by pop music generally while put up in-comparison to Underoath's entire album library. In some cases this is true, since the head of writing was handled by Gillespie whom of which is mainly influenced by pop rather than anything pertaining to metal as the rest of the members that Underoath had previous and even after Gillespie had left the band. \n\nCurrently, Underoath is broken up. If I had reviewed this album while they were together I would discuss their future albums combined with the notion of their past discography, but unfortunately I cannot do this. What I can say, however is that if you've been at least a little keen to their earliest years, you'd be able to take notice that the band's first two albums primarily consisted of influences to the likes of black and death metal with groove-laden structures. Underoath were originally pretty much a purist metal band during these early years before taking on metalcore with their 2002 LP The Changing of Times that combines poppy-hooks, catchy verses, shrilling screams and even some of the extreme elements that they had on their first two albums are even on there for a few songs. Underoath are a very creative, deep fun band. That's how they've always appealed to me personally, the influence that all six members incorporate is simply divine and frankly insane. Here with the band's fourth LP They're Only Chasing Safety, the band build upon the warm poppy bits heard on The Changing of Times but discard absolutely every last bit of all the brutality the band once incorporated in the likes of albums like Cries of the Past. There is no metal on this album, it's post-hardcore. It's perfect, pure, astonishing rock music.\n\nIt should also be noted that the record would see the band's famed and final frontman Spencer Chamberlain taking up the screamed vocals in replacement of Dallas Taylor, whom moved on from the band following The Changing of Times. Taylor's scream tended to feature more of a barked sound wherein Chamberlain's fry scream technique is off the charts. It's exactly the vocal style that this band and whole genre as together has the face of. Chamberlain on this release is powerful, tortured sounding and emotional all at once. How is this all done in just screamed vocals? I'm not even too certain, his vocals nailed it. Partnering up with his vocals, however, is drummer Aaron Gillespie providing the clean, sung vocals heard throughout. Gillespie seems to have had an adolescent singing voice his whole life considering even in today's age as I review this, he still sounds like a high schooler at the current age of 30. His lyrics are also unbelievable words of near-poetry. While Chamberlain co-wrote much of the lyrics heard here, Gillespie served a driving force using his intense heartbreak at the album's main influence as I started earlier above. \n\nAs for the musicianship, Gillespie's variety on the skins is almost not even a competition for others in this same genre. While his snare is the loudest of his whole kit on this album, the tone of his cymbals sway in back and fourth through the background of the music, It has none of that overly clashy sound or sounds like they're too almost air-thin which is a common problem in bands like this that variate between fast/slow tempos. Albeit the album is produced in such a way that when the music does speed up, his cymbals are turned up. His bass drums are put at the very gritty channel as everything else that has bass merit on this album. In other words, when you focus on the bass drum, you can clearly hear Grant Brandell's bass guitar hovering just above it. There is no fight for dominance over the instruments on this album. Everything is finely audible, even the synthesizer. All six members shine and they all play their own parts, save for the only exception that the band doesn't have much use of a rhythm guitarist at some points, but during an appropriate amount of verses they take use of the lead/rhythm factor when they're not just following along with each other. \n\nFor the sake of me speaking about songwriting, now this is something I forgot to get onto even further. None of the tracks here even come close to sounding the same. They're not like to such an insane variation to the point where it sounds like a different band on each song, but they get far, far away from blending in with each other. The opening song \"Young and Aspiring\" simply just gets straight to the point at a fast pace while the album's following song \"A Boy Brushed Red Living in Black and White\" slows down to mid tempo featuring some of the album's most catchiest offering. \"The Impact of Reason\" following after features more of a cold/hopeless sound and the album just variates from these elements until it reaches its final track which tends to sound like an electrpop piece before the song's (and album itself's) climax. While \"Down, Set, Go\" seems to be the band's biggest ever attempt at pop rock, the entire musical essence of \"They're Only Chasing Safety\" variate between influence of post-hardcore, pop rock and some minor metalcore elements they had the album before while sounding different for each track.\n\nAfter this album, Underoath would later ditch the post-hardcore and return to metalcore in a similar style to what was heard on The Changing of Times, completely abandoning the sing-a-long choruses and all that jazz, but nonetheless did a good job by showing to the world how talented and different they are than just your typical metalcore unit. Many bands would gladly false market themselves as a Christian band just to fit among a crowd that would accept them for exposure. It's not like that with Underoath as they truly show how faithful they are to their god in what they say, but it's not like that with their lyrics. I personally believe in no religion, but more power to them if they're Christian kids and making some absolutely outstanding music in the process. Here, Underoath (and pretty much every album by them for that matter sans maybe Act of Depression) never take their religious views and make the listener choke on it. The word \"Jesus\" is only said once on this album, other than this occurrence almost everything on the record is negative/depressing themes with absolutely nothing concerning religion. As the band once put it themselves \"Christianity is the backbone of our lives, but not the backbone of our music.\" I could name off personally so many individuals that wouldn't hesitate to tell any band to fuck off they only made songs about God and Jesus all day. I believe Underoath should be deeply respected for the simple fact that they're not douchebags about their religion.\n\nThey're Only Chasing Safety deserves the 100% score I gave it for all counts. It's not that I find this album literally flawless, yet it's more like I just find nothing wrong with it enough to deduct anything from its final score. I mean heck, I already mentioned numerous times in this review that this is not a metal album... but should my score affect that if it's amazing music nonetheless to the fact that it's a record that doesn't follow to the accordance that this website expects from its content? Of course not. Outstanding music will always just be amazing music to me regardless of its genre. \n\nIt may sound lame or cliché, but this record has simply done just way too much for me in my past for it to be forgotten as just another -core band opus. Everything from its musicianship and lyrics have saved me from myself far too many times to pass it off as a rehashed emo recording. I could go on all day about this album, but everything I've needed to explained have been written above and if you need to fully fathom how I appreciate what they did with a record like this, then start at the top of this review and re-read all these paragraphs three more consecutive times. \nIn my opinion this is Underoath's best work. But it also ranks in my heart as one of my favorite rock albums ever.\n",
        "\nIf I were to name one genre I know of that is even more reviled than metalcore on heavy metal websites such as this one, it would be post-hardcore--the modern form, in particular--at least when sludge metal has little or nothing to do with it. When Underoath released the aptly-titled The Changing of Times and parted ways with Dallas Taylor shortly thereafter, it would sow the seeds of some immense commercial success, greater accessibility, and unfortunately, a less-than-stellar musical direction. Ultimately, they became one of the prominent acts, if not the foremost act, in the whole emo explosion of the mid-2000's. I won't bore you too much with the history--especially since I can't say that I know, or care to know, very much of that history myself--but I will state that those days feel like ancient history now, especially after listening to Underoath's wonderful swansong, Ø (Disambiguation), a title I initially thought to be a rather amusing nod to Wikipedia or some such, but in actuality, a more clever exercise in the practice of self-titling.\n\nIt is, of course, common sense that Underoath do not return to their death metal roots on this album, and I always found it idiotic to negatively compare their newer works to the older, rawer outings by simple virtue of the two eras obviously being intended for two completely different audiences with different taste. That is to say that death metal purists and death metal fans with a certain appreciation for older forms of hardcore punk will find nothing truly redeeming in Ø, but also to accede that that this is certainly Underoath's most aggressive album. At heart, it still feels like a post-hardcore record, but what pop appeal might have remained on the two preceding albums, Define the Great Line and Lost in the Sound of Separation, has been shed.\n\nWhat have been retained are the Isis-inspired post-rock/metal passages, in a vague manner on tracks like \"Who Will Guard the Guardians\", \"A Divine Eradication\", and \"In Completion\", but welcome all the same. Spencer Chamberlain has certainly never been better as a vocalist for this band either, and I wouldn't argue with any claim that he is or was perhaps the best vocalist the world of modern post-hardcore ever knew. His screams have an immensely satisfying intensity about them, exhibiting none of the typical boyish yells of Underoath's contemporaries and truthfully being closer to that of Klas Rydberg, ex-vocalist of Cult of Luna, or perhaps As I Lay Dying's Tim Lambesis if Lambesis placed less emphasis on the lows. They, along with his respectably neutral and whine-less cleans, sit comfortably atop the heavier and meatier riffs, as well as Daniel Davison's stellar performance behind the kit (he filled Gillespie's shoes and subsequently wore them out in this record's forty-minute run time).\n\nI think that Underoath may have taken one or two more cues from prominent sludge metal acts this time around. Isis get another obligatory mention here in regards to composition (\"Catch Myself Catching Myself\", \"Who Will Guard the Guardians\", \"In Completion\"), but the guitar tone suggests something more akin to a less chaotic Siolent Green (\"A Divine Eradication\", \"My Deteriorating Incline\"). The difference is that Underoath put a slightly more alternative and accessible, but altogether acceptable, spin on things. Though certainly qualifying as metalcore, there are no songs here that devolve into the characteristic chugging breakdowns that so often break the flow of a song that otherwise had a lot going for it. All of these tracks are fluent, fluid, and gripping from start to finish, and in so being, contribute to one solid experience.\n\nØ is more concise than its predecessors, most of its eleven tracks not passing the four-minute mark, making for a tight and powerful little package that takes off and doesn't spend much time slowing down. \"Paper Lung\", the most alternative and vestigial track of the bunch (and still not too shabby, mind you), represents the only respite the listener is afforded through this ride until the post-metal-charged closer, \"In Completion\", apart from some inter-missive experimentations (\"Driftwood\", \"Reversal\"), courtesy of Christopher Dudley. They are welcome in the interest of preventing sensory overload (keep in mind that this is a dirty and distorted, but very pristine and loud record), and even admirable for not breaking the flow of the disc, but otherwise, they don't add much more than that. It might have been interesting for Dudley's synths and programming to have a more prominent role, but that would amount to some risky nit-pickery raised against an album that says what it says more than adequately and doesn't really need to say much else.\n\nThis is a record I can always go back to, especially when I want to stop treading the underground for a while, but it has something to offer to open-minded metalheads as well, provided they're not too hung up on the general disdain attached to the band's name. All apologetic statements aside, however, the record stands tall on its own, and is fitting as the final full-length offering by a storied band whose time was altogether short in the grand scheme of things, but whose members always opted to expand into new territories, leaving behind a varied catalogue that validates their legacy. Admittedly, I'm sad to see them go in spite of that; it would have been interesting to see where they would have gone from here. But I can't say I'm not thankful, having heard this.\n",
        "\nListening to this makes me feel humiliated. This album has that pathetic MTV pop-punk / alternative vibe all over it. At the same time, it attempts to don a post-hardcore shell in an attempt to sound edgier than it really is. Expect nothing but undemanding power chords, dippy melodies, a crystalline wall-of-sound, and a scream / clean vocal duo that are appalling. Lyrics about break-ups and high school drama push the Christ preaching all the way to the closing track. Even by proper post-hardcore / metalcore standards, this is some of the yuppiest of the genre.\n\nAaron Gillespie let loose everything he wasn't able to accomplish on the previous albums. Dallas Taylor can do harsh and clean vocals pretty well (his current band Maylene... is proof of that), but in Underoath he was regressing. Aaron's here-and-there vocals had to settle for less-than-second during those years, but They're Only Chasing Safety is his true debut. Aaron's sugary-teen style of singing gussies up the already tame and cacophonous rock chords filtered crisply in order to attain this uplifting tone of hope. No matter how inspiring or spiritually elevating this may seem, it's a falsehood that begets dishonesty for every second. Only one track, \"It's Dangerous Business Walking Out Your Front Door\" (ugh, and the music video introduced me to the band), with its disconsolate tone and super-sweetened chorus, is the one section that lives up to what the band wanted to have happen.\n\n(Then) Newcomer Spencer Chamberlain is trying way too hard to sound like he's in turmoil. His screams and growls would come into their own much later with this band, but his first role in Underoath on what amounts to the band's wussiest album leaves a lot to be desired. Hearing him scream with his shrill, pulpy voice shows a boy wanting to be the center of attention. These screams are very tiring and antithetical to what they're trying to accomplish. Seriously, shut the fuck up and do a suitable scream / growl. It's infuriating hearing vocals so improperly executed, as if he was seconds away from crying after a break-up. \n\nI'm not even kidding, go hear \"A Boy Brushed Red...\" and, if you can get passed the uncomfortable intro (sounds like the opening to Jimmy Eat World's \"A New Aesthetic\"), you'll hear some of most irritating lyrics and screams on the album. A band like Jimmy Eat World, for all they sum up, actually come out playing the same type of chords while being awesome at it. On the other hand, these kids have flailing breakdowns, copy-paste guitar leads from every other pop-screamo band, clean soundscapes, accessible drum fills, and hold-your-hand mentalities for every hook and chorus. There's not a moment of not being pretentious, and that's without the cloak of some of the worst lyrics I've heard from this type of band.\n\nThis album only added to humanity's imperfection. Electronic cluttering alternative rock with wet screams and glittery cleans among sparkling guitar chords culminates into this mess. It's not helpful either to try and avoid this and end up having to see that awkward cover art intermittently (the alternate one's barely any better). They're Only Chasing Safety's awfulness is something to behold, and only the worst of human creations are able to top this.\n",
        "\nThis is two shades heavier and less demeaning than They're Only Chasing Safety. The gushy clean vocals, accessible guitar leads, phenomenal number of breakdowns, and developed-world suburban angst are discomforting. This is the band's attempt at trying to refine emo / post-hardcore and make it a footstep in the direction of being respectable. The crystalline production makes this super crisp sounding, and such glossy music is so fitting. However, the music is anything but compatible, as catchy, heavy, godly, dishonest screamo, and the goal to be gripping try to merge and fail pitifully (except for one track). Define The Great Line is defined by easy hooks, poppy choruses, tenuous rhythms, forced vocals of both styles, and electronic filler. It's just an embarrassment.\n\nThis is boy-band mainstream rock led primarily by squeaky screaming, frustratingly catchy clean vocals, and layers of clean guitar texturing. Not to the level of the previous album, but c'mon, the band didn't move forward much in their attempt to get heavier. The anthemic tone, metallic demeanor, and introspective vibe fall through the cracks between unnecessary feedback, squelched harshness, fumbling distortion, and candid, contrived hooks. This is textbook laziness with a sprinkle of being less whiny, which can be said about the lyrics overall, too. I get trying to make yourself seem humble and weak without Jesus, but these are sickly lyrics with even worse throaty, mad-at-girlfriend screams and pubescent clean crying / singing expressing them. Double this duo up with this streamlined alternative rock in post-hardcore filler and it makes for an album with too much to say (with little of it being of value).\n\nThe one song that's very unlike Underoath in this period is \"Casting Such A Thin Shadow\". Within this realm of breakdown dependent metalcore / post-hardcore glistening in suburban agony and turmoil is a song that turns out being the best thing the band would write until Ø (Disambiguation). Without hyping too much, if you enjoy post-rock, then you'll love this song. This song represents an Underoath with lush build-ups containing lots of ambient-like guitar harmonies, intense zest in the riffs, crafty flow, delectable atmosphere, and vocals that are pretty good (bearable at worst). This is Define The Great Line as it could and should have been.\n\nInterest does not wane with \"Casting Such A Thin Shadow,\" but every other track fails in their own way. Nitpicking good parts would be a waste since nothing amounts to a higher level of praise. Breakdowns and flaky riffs with tasteless drumming and progression had to go through a major change to be of any use. The keyboards / programming ought to have been dropped, as they added practically nothing besides some acceptable lines and atmosphere support. Their role in this band is overstated to the point where it hurts more than it helps. Well, many years too late to expect that kind of a change.\n",
        "\nYou'll hate this if you hate post-hardcore, metalcore, and the kind of music that appeals to your most poppy sensibilities. That's a given fact, as the inert drumming and dabs of keyboard / programmed filler (ala Kid A Radiohead at times) wash over dejected riffing, abundant bass grooves, and clean harmonies. Things spike with lots dependency toward wall-of-sound guitar lines and some post / progressive bearing that don't have much direction anyway. \"We Are The Involuntary\" is a perfect example of this blend of noise / metallic-influenced post-hardcore that falls out of its own formula and becomes quite accessible sounding alternative rock. That's the worst case scenario, but the album's full of misdirection and issues with flow. Songs are typically short but stagger as they attempt to make their way through their attempts at composing with their influences and the pop sound the band latched onto years before.\n\nThe music sounds squeaky clean with digital overtones thrown in throughout. The blend of post-hardcore and alternative / metalcore basks in such polished production. There are only hints of gritty atmosphere and harsh distortion. These opposites can balance, and Underoath were the closest in years to regaining that equilibrium. However, Gillespie was still the leading band member, providing his skimpy and undulating drumming and pubertal clean singing. His vocals are annoyingly catchy at best and nauseatingly revolting at worst. Some songs like the opener and the closer don't even feature his vocals, while others have minimal use as both types of songs opt for discordant soundscapes and intensity over hooks.\n\nNonetheless, Gillespie's singing exists primarily for hook purposes, taking away lead prowess (a stretch in itself) from the guitar leads and from Chamberlain's duties and potential. Chamberlain's ability to scream with measurable callousness and sing (by post-hardcore standards) with teenage angst at least go hand in hand (and relatively aren't as grating). Songs like the opener, \"Emergency Broadcast :: The End Is Near,\" and \"The Only Survivor...\" follow his lead in a way that hits closer to the jarring post-hardcore the band would find themselves doing properly on the next album. What Chamberlain himself accomplishes here (appropriately showing vocal authority) is also carried over onto Ø (Disambiguation) with more vigor and roughness.\n\nNot to disregard this point, but this album can be my worst enemy or moderately enjoyable given the mood. Ultimately however, Lost In The Sound Of Separation failed in being legitimately heavy and profound for its respective genre. The band tried very, very hard to be thoughtful, catchy, and preachy. Unlike the album following this, the music here got a little strained overall and too forced at times. The signs of a genuine post-hardcore album aimed to be significant, and would have been primary given a couple of major changes. Thankfully, those changes were undertaken for Ø (Disambiguation) (and it showed enough to be more than listenable).\n",
        "\nThe loss of Aaron Gillespie was the greatest thing to ever happen to this band. His departure alone correlates to the creative breathing room this band received. The addition of Daniel Davison and his blustering, unguarded drumming shows a replacement overcoming every fault the predecessor had. Does this change the band drastically by any significant stretch? Not so much - this album won't change the opinions of the most ardent people that dislike Underoath. Hell no, but if there were inklings of even enjoying what this band did with Lost In The Sound Of Separation (specifically songs like \"Breathing In A New Mentality\" and \"Emergency Broadcast :: The End Is Near\"), then Ø (Disambiguation) is a darker, less poppy continuation of that album with better flow.\n\nGillespie's exit marked a change to a sound that incorporates blemishes of proper hardcore, noise, and progressive / post-metal elements. At heart, Underoath was already going for this sound, but it seems as though Gillespie was the sole member preventing a natural, dynamic shift from taking place. Gillespie's whiney, boyish cleans killed any chance this band had from moving away from alternative / emo-pop territories. This is when Spencer Chamberlain, the band's de facto leader, steps in to fill clean vocals. Comparatively speaking, he's not the harshest screamer / growler nor the most passionate clean singer. For metalcore he isn't bad. I'll take a lot over him, but his basic, fundamental screams and growls coat the pseudo-dissonance and inscrutable soundscapes well enough to fit the part. Chamberlain's cleans essentially are pasted over what Gillespie would have done, but Chamberlain's are less shrill and more complimentary to both the callousness of the harsh vocals and the austerity of the rest of the music. \n\nWhile metalcore, Ø (Disambiguation) is like listening to a far more straightforward Burst (the Swedish post-metal band). The same polished production, the same blubbery bass, the same caving sound of washy guitars surging with crisp distortion, and the same abstruse drumming (way better on Burst's end) revitalizes the music. On the other hand, such compulsorily pensive metalcore with clean post-metal melodies and a meditative pace (akin to \"Emergency Broadcast :: The End Is Near\" from the previous album) leaves even less for the keyboards to do. The electronic / programmed aspect of this band could be diminished even further without harm by booting keyboardist Christopher Dudley - another band member taking up space. His effects don't add that false sense of cinematic / Radiohead vibe that the previous album had, which was pretty useless there as it is here. The one song that he entrenches himself in is in \"Reversal,\" which builds up to nothing.\n\nThe main praise falls on how well everything fits together. These intensity-driven songs will do more to overlook the band's previous misses. The aforementioned influences and the loss of Gillespie helped drive the sound to become an Underoath less governed by the worst aspects of the band's past. Don't expect omissions (but certainly expect less) of the following: juvenile cleans, wussy lyrics, alternative rock riffs and leads, incompatible songwriting, and (manufactured) digestible hooks. Nothing this band can do (I hope) will ever top the monumental suckage that was They're Only Chasing Safety. Ever since then, the band has crept their way back into being listenable, with this album being the final step into territory that allows me to remain with them for an entire album. Ø (Disambiguation) is a plain endeavor that shows hope for a stronger direction the band could take.\n",
        "\nI remember growing up in the metalcore generation. In those days, I was just discovering metal in a family that has no taste for metal whatsoever; as such, those bands such as Bullet for My Valentine, Trivium, and namely Avenged Sevenfold really pulled me in. Among those bands was Underoath, whom I discovered due to an old friend exposing me to \"Writing on the Walls\" from this album. At that point, I considered those albums perfect and spent months and even years listening to them as I slowly delved into \"true\" metal or whatever one wishes to name it.\n\nFast forward to now, a time where my favorites list is cluttered with bands such as Opeth, Amorphis, Blind Guardian, and other such artists. Those same metalcore albums I used to love I no longer enjoy the same as I used to (aside from Avenged Sevenfold and some Trivium; those bands receive way too much hate), and Define the Great Line is no different.\n\nFrom an objective and more experienced viewpoint, I believe the key to accepting this album is the viewpoint indeed: this is either a resplendent post-hardcore album (a genre I have always deeply loathed, even during my metalcore days), or a semi-generic metalcore album. Therein may be why the latter era of Underoath receives so much criticism: if one cannot accept this as a hardcore album, he will not accept this as an album worthy of any time at all.\n\nThe songwriting is actually quite good for the most part. \"Moving for the Sake of Motion\" has always been the biggest highlight for me, with slick riffing and an overall enjoyable atmosphere. \"To Whom It May Concern\" twists the heavy atmosphere on its side, delivering a smooth yet enjoyable and perhaps even emotional experience. On the other hand, songs like \"Returning Empty Handed\" and \"Casting Such a Thin Shadow\" work as the antithesis to the songs above, seeming insincere and unnecessary. Then there's \"Sālmarnir\" - minimalistic and just pointless, with little going on and little reason to exist. Overall, the riffing is generally good enough; the problem with it is when it veers into metal territory. The hardcore-style riffs are good and enjoyable, but the metal riffs seem stale and trite - they are blended well, often times making one difficult to distinguish from the other. In both cases, the song structure is never anything more than simple in rhythm, and rarely deviates from the norm in terms of song structure in any way differently from most other hardcore bands. What this basically means is anybody expecting anything remotely complex or \"progressive\" is going to hate this.\n\nAnother thing that mars the album is the vocals. By all rights, Spencer Chamberlain is a good vocalist, and I certainly prefer him ahead of their previous vocalist. I think he has a great growl, and his hardcore scream is actually good too, though I could go without that. The clean singing is what will drag this album down for any metal fan: it is a textbook example of the emo singing style. There's nothing that separates Aaron's vocals from the hordes of other hardcore bands. I don't think his vocals are bad per se, but it's not what a metal fan is looking for, either in tone or delivery; furthermore, sounding completely unoriginal is nothing but a detriment to the album. That said, there are moments where I believe the vocals to be delivered well, namely in \"Writing on the Walls\" and \"To Whom It May Concern.\"\n\nLyrically, this is another bust for the metal elitist, but I honestly believe the lyrics to be good. They're not poetic by any means, but they are an expression of emotion in the best way a hardcore band can do. There's no depression, no wishes of one's own death or the death of one who harmed the writer, and there's no immature idiocracy like one would find in bands such as Blood on the Dance Floor. They are a testament to the struggles of life and an admittance of the writer's faults, in hopes others may read them, relate to them, and find comfort in them; in this, I see nothing wrong. I find \"Moving for the Sake of Motion\" to be the best display of Spencer grieving over his own faults, and I find something to relate in it myself. Closer \"To Whom It May Concern\" wraps the lyrical themes of the album up perfectly, leaving a message of hope to the reader, showing this is no suicidal, depressive showcase.\n\nI do not believe this to be a must-have for any metal fan whatsoever. Actually, unless you have any interest in hardcore or metalcore music already, I would advise you to stay away from this. The metal elements here will not hold your attention long enough for you to value what good this album has to offer. With a far more matured taste in music, I no longer appreciate it as I once did either; yet, even so, I find plenty of moments here can still beckon a positive reaction.\n",
        "\nTo be honest, I'm not a huge fan of this album. I gave it a higher rating simply because if Underoath could return to the past, they might still have the attention of the metalcore community. The way I view the modern Underoath is that they are a band that began to focus on money and fame rather than the music. I've met so many people who never knew a thing about the metal bands I listened to, but when they found out I have this album on my iPod, they automatically recognized the band name. Of course, they didn't recognize the music, but they knew the band name. It truly is sad, in my opinion, when bands change so drastically from what had potential to a complete waste of time. This is where their potential thrived.\n\nThe songs in this album have much more to them than Underoath's modern works. There are only 5 songs on this album, yet it clocks in at over 40 minutes in total length. This shows either good songwriting ability or a really bad attempt at making long songs. With this album, I usually end up feeling the first of those rather than the latter. There are several changes throughout the songs, too, which is a welcome addition to the popular metalcore trend to use one incredibly extended and incredibly boring riff per song. There are some very nice keyboard atmospheres that really fit with the low production quality. The atmosphere is dark and the emotions it gives vary from person to person. It doesn't really affect me too much, but I've met some people who say the album sounds \"scary.\" Either way, I like the heavy and dark effects used in the album, which are an incredibly bright form of the band's musical talent compared to their dull works that came much later.\n\nThis album may be metalcore, but at many points, it plays like an early black metal album. There are some very dark and somewhat creepy passages accented by tremolo riffs and high shrieks that simply scream black metal. However, there are some somewhat annoying clean parts. They aren't as bad as some modern bands, though. Normally, combining hardcore music and black metal ends up making a disaster (need I mention Abigail Williams, a band with so much potential that simply never hits the mark?). In this case, it works. There are no brutal breakdowns. There are breakdowns, but none of them are chugfests. This is just an example of a pretty decent combination of dark, atmospheric metal with American hardcore music.\n\nThere really isn't a lot to say about the individual talent of the musicians. Overall, the album is mediocre. However, for metalcore, it isn't bad at all. There is absolutely nothing groundbreaking about this album aside from the fact that it is one of the few good metalcore albums. It probably will fade out of memory for 90% of the population in a few years as more and more terrible metalcore bands come out. This will always remain a classic, but like with many classics, it only laid a foundation. Unfortunately, most metalcore bands missed the foundation and began building their music on shaky bases.\n\nI was very shocked when I first heard this album about 4 or 5 years ago, which is probably why I gave it a higher rating. I knew about Underoath beforehand. I knew I hated their music with everything I had. The people at my church often listened to bands like Switchfoot and modern Underoath. I hated both of those bands. When I heard this album, I was blown away by the differences. The only thing that is \"emo\" about this album is the lyrical content. I consider this to be the true Underoath and the modern albums to be a completely separate band. Unfortunately, this album is Underoath's masterpiece. At the rate they are going right now, they will never produce anything as good as Creis of the Past.\n\nOverall, this is a pretty solid metalcore release. It has all of the right elements to be mediocre metalcore and it has some nice additions to make it worth listening to. Is it fantastic? No. Is it groundbreaking? Again, no. It's just a good offering from a once-good band. Take it or leave it at that. This is Underoath's best and they will never reach this quality again.\n",
        "\nUnderoath, along with many other bands in the genre known as metalcore, polarize popular opinion. Some people absolutely love this band and would like to do dirty things to its members' members. Others would like nothing more than for bands like this to drop off the face of the universe. I will readily admit to not being the biggest fan of the more post-hardcore bands in metalcore, as well as the post-hardcore genre in general; I've always been more keen to listen to normal hardcore punk bands. So when I heard that Underoath, the poster child for Warped Tour attending scenesters aplenty, made two legitimate metal albums in their early days, I was reluctant to believe so. Their first album, Act of Depression, is a sloppy, overly preachy mess of an album. Their second album however, Cries of the Past, is one of the best -core albums I've ever heard.\n\nWhen the first song \"The Last\" came through the speakers, I was astounded to hear something I thought was foreign to the members of Underoath: actual guitar riffs. Lots and lots of heavy, thrashy, black and death metal based guitar riffs. The keyboards used in this song, as well as the rest of the album, draw heavy traces from melodic black metal, with parts on \"The Last\" reminding me of the keyboard parts on Satyricon's first album \"Dark Medieval Times\". There is A LOT of tremolo picking on this album, once again drawing influence from black metal. There's also some slightly experimental aspects to this album; a few of songs feature acoustic guitar sections. The songs are very long, with the shortest one being 7:36 and the longest one being 11:24. Because of this, there's only five songs on the entire album, but the album's running time as a whole comes up to 42:08, much shorter than Act of Depression but much longer than some of their later material such as The Changing of Times.\n\nThe band itself has a much different lineup than they do now. Aaron Gillespie and Christopher Dudley are there on drums and keyboards, but the guitars are played by Corey Steger (who left after this album, no doubt contributing to the style change on The Changing of Times) and Octavio Fernandez. Both make wonderful use of the aforementioned riffs and tremolo picking, considering the two of them are obviously much more influenced by extreme metal than the band's later guitarists. Bass is handled by Matt Clark, who, in general heavy metal fashion, is turned down so far he's inaudible in the mix. Dallas Taylor, current vocalist for Maylene and the Sons of Disaster, delivers an amazing vocal performance, with about 99% of the album being done in black metal screams or death metal growls (give or take a few spoken word sections as well as very intermittent clean vocals). Gillespie dishes out a wonderful drum performance, making good use of extreme metal standards like kank beats, double bass, and blast beats (yes, blast beating in an Underoath record). The instrumentation, while nowhere near as sloppy as Act of Depression, is still sloppy at times. This mainly occurs when Gillespie does a long, Dave Lombardo-esq double bass line; it sounds like every second hit isn't as strong as every first hit.\n\nThe lyrics are also MUCH less preachy than the lyrics on Act of Depression. This is probably the best improvement the band made between the two albums other than the songwriting. The lyrics on Act of Depression were just a bunch of teenagers whining into a microphone about how abortion is evil and God is great and all that shit (considering my stance against religion, overly preachy religious lyrics REALLY get annoying to me). Cries of the Past, however, takes the preachiness level down about 5 knots, making the overt references to Jesus very minimal and other references to Christianity much more subtle. Compare these two sets of lyrics from the two albums. Firstly, from Burden In Your Hand on Act of Depression:\n\nYou should of thought about the baby before you had sex, because you have destroyed a gift from God\nYou kill, you destroyed\nNever will this baby be able to grow up or show it's love\nYou'll never hear it say I love you, I love you\nGod does not give you the privilege to carry a child for nothing\nWhen you kill, you destroy that child's dreams and hopes\nHow innocent a baby is... how can you put it to death?\nWhat if you were aborted... you could of never had life\nAnd now you make a choice to take this child's life because it is a burden in you hands\n\nReally overly preachy and absolutely no subtlety. Now, from And I Dreamt of You on Cries of The Past:\n\nWords are pointless, for this love is speechless [x2]\nPreparing for the curtain's closure\nLaying there, clutching hands so tight; I can feel your heart\nTelling me it will be alright\nAscension to heaven where this love can not only walk,\nBut it runs through the endless fields of joy,\nWhere love neither ends nor begins but flows everlasting\nThis was thy dream this daybreak and will by thy prayer\nThat T will rest sleepless 'til the sun rises on that day\nAnd butterflies sing with us, as we write love symphonies\nThe pages of life fill the story of our love in a time long ago\nWhere fairy tales come true\nAnd you and I, my love, will live happily ever after. [x3]\nI love you\n\nWay more subtle and almost no overt references to Christianity.\n\nAll in all, Cries of the Past is the best album Underoath has ever made. It's a damn shame that they changed their style on The Changing of Times, because what they created on this album is among the best music ever put out by a metalcore band. I recommend this album to anyone looking for good metalcore music. Certainly knocks the piss out of They're Only Chasing Safety.\n\nhttp://www.youtube.com/user/Subrick\n",
        "\nBy this point, there is no questioning that Underoath will never return to their original deathcore sound roots. After making extreme contributions to the popularization of the modern metalcore movement with “Define the Great Line” and even the emo/post-hardcore scene with “They’re Only Chasing Safety”, Underoath seem to have set trends that they have since remained loyal to. \n\nTo some extent, that ends here. With the release of “Ø (Disambiguation)”, Underoath find ways to tackle their “signature sound” and add new elements with traits similar to that of progressive acts (think of a metalcore Tool, if you would). This album is most certainly the band’s darkest release since their sophomore album “Cries of the Past”. This could be a result of the departure of founding member Aaron Gillespie, the band’s longtime singer/drummer. Lead vocalist Spencer Chamberlain takes over on clean vocals, giving the band a similar, if not better, vocal aspect. Chamberlain’s clean vocals are similar to that of Saosin’s former lead vocalist Cove Reber’s aggressive moments with similar traits as Gillespie’s whines. Chamberlain’s aggressive tone is noticeable straight from the opening track, “In Division”.\n\nMetal extremists may cringe at the term “metalcore”, and they very well should, for metalcore is a subgenre that should be used only if used appropriately. With “Ø”, Underoath certainly use it appropriately, or at least more-so than in the past. Underoath have now become more creative concerning their guitars (their progressive riffs deserve another mention here) and the keyboards now work with the guitars, not vise-versa. The guitars are heavier and the melodies from the prior two albums are still present. Speed and intensity are quite possibly the biggest issues one may have with this album, yet tracks like “Illuminator” contain the intensity Underoath has had in the past. Another one is “My Deteriorating Incline” with its crazy guitarwork and fast drumming (fast compared to other songs on the album). \n\nAs mentioned earlier, metalcore is, in a sense, a “dangerous” genre to deal with unless it is handled properly. Underoath has stopped changing and has started maturing, being one of the few bands that have the ability to create a unique album. “Ø (Disambiguation)” marks 2010 as a year that sees multiple surprisingly decent metalcore releases, along with Parkway Drive’s “Deep Blue” and As I Lay Dying’s “The Powerless Rise”.\n\nRecommended for all metalcore fans, worth a listen from fans of progressive/melodic metal.\n",
        "\nUnderoath's new legendary metalcore album impressed me, I don't mind their emo attempts at metal, but from a metal point of view - their emo stuff did stuck! There's alot that I can say about this new album, but one thing I definitely did notice was the absence of Aaron Gillepsie:\n\nFirstly, there were no emo vocals, but rather progressive metalcore vocals, and Spencer's clean vocals which seems to act out calm didn't have the emo-ness anymore, there was emotion yes but not the self-pitying emo feel. That seemed to fit perfectly with the way he screamed, this new sound was different and after a few listens I started to love it.\n\nSecondly, with regard to drumming I could hear a different form of percussion. It was that kind of \"soft-agression\" drumming, don't get me wrong their were times when I could hear heavy agression in these drumming patterns, but whenever the clean vocals came up I could still hear agressive drumming, but it wasn't in your face. Which brings me with the conclusion that Underoath was starting to enter a new stage of metalcore, not deathcore (heavens no!) but a clever and intelligent attempt at mathcore! The new drummer did bring along a mathcore sound coming from Norma Jean. I loved every second of it, this was definitely legend!\n\nThird, the guitar wasn't that impressive sadly. It was filled with hard rock-ish riffs which really dissapointed me, this is where the drumming starting to make up for it. The album gripped me with the track \"In Division\" and left me calm with \"Paper Lung\" yet I was waiting for something more powerful and I was impressed after hearing \"Illuminator\" and \"My Deteriorating Incline.\"\n\nIf you weren't impressed with \"Define the Great Line\" maybe this album will make up for it, I recommend it! It was really something awsome!\n",
        "\nI'm probably going to take a lot of open hate for this, but I like Underoath. Well, not anymore. Their new albums have been a straight free fall into an ocean of shittiness. But at one time Underoath was good. Not great but good enough for me to call them my favorite band through my screamo-teen years. This was the first Underoath album I ever heard and really liked it. Their two later albums became piles of emo bullshit. While this album does have some emo-style music, I wouldn't off and call it an emo album. It sounds more like hardcore punk.\n\nCries of the Past was nearing the genre of black metal. It wasn't all the way there but it was definitely on the road. After Dallas Taylor left, Underoath got Spencer Chamberlain to do vocals. The songs on this album are very melodic and flow very well. I know lots of people hate on Underoath both for their VERY open Christian faith (open to the point of annoyance) and their appeal to emo twelve year olds.\n\nBut you have to look at Underoath from a completely different outlook. You can't judge them on their lyrics, genre, or image. The metal community practically automatically discards Underoath as \"a shitty Christian metalcore band.\" And yes, while they are Christian metalcore, you have to judge them on the outlook of Underoath itself. \n\nThe guitars flow like water and aren't all over the place like \"Lost in the Sound of Seperation\", where the guitars were just twanged like someone was jerking off. This album actually has good order. The drums aren't metal drums, in the sense that they aren't very fast or loud. They are normal rock/punk drums. Which is OK because I'm not judging them on a metal view. The drums have nice rhythm and tone to them without feeling to bland. Keyboards are almost not worth mentioning, as they are easily forgettable.\n\nNow on to the big issue: the vocals. In a metal sense, yes Dallas is better than Spencer. But judging on Spencers own ground, he is very good. His screams don't crack and they are very high pitched and not the typical low-tough-guy-deathcore shit. Spencers vocals are unique on this album. His clean vocals actually carry a tune and sound very nice. The screams and clean vocals flow together very nicely and cleanly to create a great experience.\n\nSo, it comes down to what you are looking for. If you are looking for a good metalcore album, here's a great choice. If you want something less metal than Dallas's albums, but better than the last two albums, pick this. If you are looking for a heavy, brutal metal album, you're looking in the wrong area completely.\n",
        "\nI've read the other reviews for this album, and I can't believe my eyes: this album is considered like shit! I have a completely different opinion, so I just want to say something about this. I write this words with indignation, because I think they're great artists and they shouldn't be treated in this way!\n\nI listened this album for the first time some years ago, when I wasn't very keen on this kind of music, and I found it a bit boring, most of all because of the length of the tracks... But some time later I decided to hear it another time, also if I wasn't very happy to do it. Well, I fell in love with this group, with this music, with these artists, and I repeat that, ARTISTS. I believe that this album is the highest expression of what being Christian means. They express their faith with such a power and a strength that only unblack bands like Antestror can do better than them. This is a faith that goes through any prejudice, through any event, and can be destroyed by nothing.\n\nTechnically speaking, they are not the best musicians ever, I know. Aaron Gillespie is a medium drummer, but he is very innovative. The same is for the guitars. The bass is quite banal, but in some bridges, when he plays alone, it's very expressive and powerful. But a special appreciation is for the singer, that is one of the very few singers that can makes you understand his feelings while listening to him singing. The very majority of the singers sings with no feelings at all, this is a fact, but also the few that feel something inside when they use their voice, are not always able to make their feelings come out. Dallas is the opposite: you hear him screaming in the title track, that deals about suicide, and you can feel all the pain, the depression and the sorrow inside him. This is the best element of their music.\n\nTalking about the lyrics, it's obvious that being a christian-oriented band, they talk about their love for Christ, and I know that many metal fans are not so happy about this topic. But being myself christian, and a fan of the Christian Metal movement, I particularly appreciate this lyrics, because they are sometimes very original: they talk about things in a different way, from a different point of view. I'll make you an example: in the title track the theme is suicide; well, many christian bands condemn suicide, but they rarely talk about the reason why someone can be pushed to do this. Underoath, instead, write this lyrics (that is pure poetry!) using a victim of suicide as the subject, and he explains that he was pushed to suicide because of the teasing and of the isolation. So it condemns the act of suicide, but it also condemns the behavior of the people that makes someone make this tragic decision.\n\nSo Act of Depression is the perfect mix between music, expression of emotions and christian feelings, and this is the best that music, and art in general, can do. Also the following records from this band are fantastic, but this is the perfect one. I agree, of course, with my friends reviewers, that the more recent works from this band are not metal, this is for sure...\n",
        "\nSome folks have taken it upon themselves to make Underoath their whipping boy. While understandable about three years ago (when they were still hot shit), they've since cooled down in terms of popularity. I don't hear their style of music over the airwaves all too often now, as another style has taken its place (we all know what it's called, tee hee).\n\nI now have some breathing space to dissect this band since they're no longer 'hip' to listen to. I will admit that I have a soft spot for shit like this. It's straight-up pussy screamo circa 2004. There isn't an ounce of fucking metal in this brew, and that's a good thing, because then I'd hate it for every metal influence it bastardizes. I can't put a finger on any of the inspiration on this album, so I have no anger to direct towards it. It's just pop-punk with screaming.\n\nMost of the music is relaxed, flowing at mid-pace. The drums maintain a laid back punk beat for the guitars to casually strum over. There's no fire in Underoath's music, just fluffy clouds and tulips. Some songs contain electronica (It's Dangerous Business..., Some Will Seek Forgiveness..., Young And Aspiring). However, the use of electronic music is brief, serving as a bridge to the next part of the song featuring acoustic instruments. There is no \"crabcore\" techno to be heard. Breakdowns are strictly limited to a dun-dun-dun pattern. They're easily digested, leaving no aftertaste of deathcore.\n\nAs expected, the vocals leave something to be desired. Soaring vocals are clearly out of range for both singers. Nonetheless, attempts are still made (A Boy Brushed Red..., Down, Set, Go). There's nothing truly grimace-inducing, but I suspect all possible flaws have been steamed out by using auto-tuners. The presence of artificial tuning is sometimes apparent. Thankfully, the blatantly synthesized tone, which has become so popular these days, is absent.\n\nThe harsh vocals suffer my ears a bit more than the clean ones. I always conjure the mental image of a scenie-weenie hollering at a cheating girlfriend, exasperated, pitiful, utterly embarrassing. As pathetic as they are, they fit the music. On a redeeming note, there's nothing vaguely resembling a \"low\" on this album. That warrants an 'amen'.\n\nIn my case, this album is a grower. I've given it some heavy rotation lately and it's proven to shine brighter with each successive listen. My initial impression was that of, \"Well, most of this is trash.\" But further listens have left me with recognizable riffs, even songs. I had thought at first that the bad and good tracks were at the beginning and end of the album, respectively. The first three tracks still fail to impress me, but I've since found that the rest of the opening half of the album is enjoyable.\n\nI can't pick out any filler tracks amongst the 11 tracks on the album (the last 3 are demos). Underoath have nailed their sound, staying pretty consistent. The only track that feels slightly out of place is Some Will Seek Forgiveness, Others Escape. Its somber opening never fails to catch me off guard after hearing the energetic track preceding it. That aside, I don't feel bored whilst listening to the album. Some tracks stick while others don't, but I attribute that more to my unfamiliarity with the musical style more than a lack of interesting songwriting.\n\nAll in all, 6.5 oaths out of 10.\n",
        "\n(Original review revised and edited in November 4th, 2009)\n\nOh god my ears hurt. This has to be some of the worst post-hardcore around. And seeing that the actual album is rated an average of 0%, the actual songs have to be one hell of a trek to listen to. Now how did my life ever cross paths with this mass of bullshit that scene kids call music?\n\nI go to the library to get my music. One day I got the 'MTV2 Headbangers Ball: The Revenge' compilation thinking there was good music there. I was wrong, it was polluted with masses of shitty post-hardcore, metalcore, and even emo bands. Back to UO, I found Underoath on the CD, where the name was familiar because of this forum (I'm part of the small minority of actual metalheads) and Underoath was one the of the bands whose name was often thrown around. This was the day before I listened to mostly real metal like I do today so I thought it would be good. But being those people that get music and never listens to it I left the li'l MP3 file to collect e-dust. But then I decided to listen to the post-hardcore for reasons unknown. This song appeared. Then my thought of this song being good...\n\nDisappeared in oblivion. I regretted ever having that thought and tried to cleanse my mind of ever trying to think the blasted thought. It never worked so now I'm stuck with a past thought from a long time ago thinking that Underoath was good. This is very embarrassing having this torment upon me and yet along revealing this to the metal world. Now onto this step-by-step review.\n\nIt starts with guitars for one or two seconds where there is barely some of the only decency in the song is but overall it is still a very sub-par and bland song and hardly stands out in the wave of contemporary post-hardcore. The vocals of Spencer Chamberlain kick in 'roundabout here. Probably some of the worst I've heard along with Bring Me The Horizon and Every Time I Die. He sounds like he's trying to do screaming of the new In Flames which no-one would to do by choice but ends up sounding like a whining, screaming emo (big surprise coming from a band like Underoath?). Along side the adult-style baby whines are the guitars, which are at this stages the same as before and still very boring and bland. After that atrocity there is also more atrocity and much more to come after that. Around here there is a keyboard part, where the keys are general rip-offs of the electronic genre but still better than any other part of the song. Laced in with the keys are some clean vocal, emo whining about a bad metaphor of running out of gas.\n\nLater the drums enter, playing a fairly simplistic pattern. And after a very soft interlude it goes back to the same guitar pattern as the start of the song and screaming and/or whining about crosses casting shadows, people remembering things, giant flames and \"stopping for you and me\". And then it goes into a 'soft, gooey' section sounding very similar to those of generic emo bands, especially Fall Out Boy. This part is what I would assume to be the chorus of the song. In this part Chamberlain whines about leaving some chick. All the instruments stop and a choir enters, probably to try and bring the mood back up since all the emo kids listening to this song would be crying their mascara off and cutting themselves by this time. But I was still having horrible stomach pain since the gooey section.\n\nRe-enter the first 15 seconds of the song with lyrics about thinking they'd \"be there by now\". The vocals are even worse than the beginning the song, like emo screaming/whining 'magically' made people scream like shit. And now it sounds like a melodeath death growl done horribly wrong which resembles that of Anders Fridén . Re-enter what I think is the chorus and re-enter agonizing stomach pain. And then, the pain ends as the songs does the same.\n\nThe lyrics of this song are written in a simplistic pattern that would appeal to little kiddies that think they are 'teh br00t4l' and know true emotion. For example, these kiddies would detest anything that isn't about vandalism, sex, drugs, girls and/or break-ups. This band decided to appeal to the kids by choosing break-ups, a topic that every other clichéd emotive band would choose. I personally don't see the point in break-up songs. This shows why I dislike break-up songs:\n\nAround this turn where\nthe cross will cast your shadow\nThe people will all gather\nTo remember such a day\nwhere the flames grew as high as trees\nAnd the world it stopped, it stopped for you and me\n\nAlright, crosses casting human shadows, people watching this supposedly momentous occasion in all of human history, tall-as-fuck fires. But how does it relate to break ups? If this is a metaphor I'm just not seeing it. I dislike songs that deal with breakups because it takes too long to get to the point. As well, will every people in the world really care that two people who were once intimate with each other aren't anymore? I don't think so. Stop placing yourself and your ex above everyone like you're superior to all human life.\n\nAnother reason I dislike songs that deal with breaking up is that they practically shout the same message. The lines \"Kiss me one last time, Shut your eyes\" show that it's going to be their last time. This is really nothing special as a line like this usually squirms its way into every song dealing with lost love.\n\nThrough this terrible but experimental experience I have learned to stay far away from the Underoath section of any CD store and any Underoath CD. But even because of this I have to give these guys a very small bit of credit since their drummer decided not to use those annoying-arse triggers which usually, if not always, ruins a metalcore/post-hardcore song. But damn those guitars get annoying after 5 seconds of listening. And then like every annoying -core the bass is either near or completely inaudible (*cough* Waking The Cadaver *cough*). Bottom line is to stay away from track fourteen disc one on MTV2 Headbangers Ball: The Revenge or anything associated with MTV.\n",
        "\nI had listened to clips of this album last year, and decided not to buy it, as it seemed like a step down to me. Well, I finally just got the album... so was I right to be wary? To some extent, yes, for the album is indeed a step down from their last album, Define the Great Line. The album has turned out much better than I thought it'd be, however, And I should say that this is actually as close to a previous album as Underoath have done, as they've spent their whole careers evolving with each new release (often with several new members). With this one, though, you get basically what you got with Define the Great Line, only the highs aren't as high, and the lows are lower.\n\nThe main problem with the album is the lack of discernable riffs, such that you sometimes have that \"wall of sound\" effect going on. Every once in a while one of the unorthodox riffs of Underoath shines through, but this doesn't happen as much as one might hope. This is definitely not the fault of the production, which is terrific on this album, but simply reflects the approach Underoath take with their guitar work. The producers and David Bendeth (mixing) did a good job on this album, which (whatever you might think of the actual music) sounds fantastic. As for the bass, it is audible throughout the album, and even quite prominent in the mix at certain points.\n\nAaron's back with the clean singing, while Spencer is back with the screams. Well, except that Spencer does that part talking/part screaming stuff sometimes. One review I read of this album said that Aaron is getting worse with each release, but I don't think that's a fair judgment. I'd say that they are at about the same level or competency as they've had over the past few albums. With Underoath vocals it's almost always a case of either loving them or hating them for most people, but I'm one of the rare few who fall in the middle: I don't mind them, but I don't love them either. Every once in a while they come up with something that really hits the mark, though usually it just sounds like typical screaming to me.\n\nSo, to sum up, while this album doesn't quite reach the heights of Defline the Great Line, it's still a solid release. Certainly worth buying if you're into the genre, or like the band (I know, not likely around here).\n",
        "\nOkay, wow, we have some fans of REAL heavy metal, clap your fucking hands. Unfortunately, the point of metalcore is completely different, and this album is possibly one the best pop-metalcore releases there ever was. There's some corny stuff, like When The Sun Sleeps, and Angel Below, yes, but the rest of the material really makes up for it.\n\nVocally speaking, Dallas probably has one of my favorite screams. His voice just a raw shriek thats full of emotion, and his lyrical content is absolutely beautiful. It's a bit whiny, but it fits absolutely perfectly. Aaron, on the other hand, sounds very young and untrained on this album, but luckily he doesn't sing nearly as much as he does on other albums.\n\nTimmy and Octavio's guitar parts are really well written, and quite ahead of what bands like Misery Signals are currently trying to accomplish. There's a whole sense of depression in the melodies but its a kind of soothing feel, and the breakdowns transition really well, its a perfect contrast of layered ambience to chugging simplicity and it adds a whole feel of frustration to it. And remember kids, this is back when breakdowns were being made the cool thing, not when they were somehow seen as the defining factor of metalcore.\n\nThe keyboards add a lot to the layering and ambience throughout the album, though they're pretty cheesy and invasive in songs like A Message For Adrienne and Angel Below (which does have a fucking awesome breakdown).\n\nThe drumming is quite tight, and really busy throughout the album, especially in the song Best Of Me... the drumming is freaking great. \n\nThe best points of the album though would definitely be Short Of Daybreak and Alone In December... the songs are so much more intense than anything else on the album, not in a sense of aggression, but just a certain sense of weight... the music just seems so honest and forlorne.\n\nSo basically, if you're into straight up aggressive metal, this definitely isn't your thing, but if you're into more melodic slower metalcore like 7 Angels 7 Plagues, then this is definitely a must have.\n",
        "\nIn the year and a half since I first reviewed this album, my perception of this album has slightly changed (for the better), Underoath have released another CD, and I noticed a few mistakes in my review. So, with that said, I think it's time for an updated review of this album. \n\nAt one point on this album, the vocalist yells: \"You want me to disappear? Well so do I!\" ('There Could Be Nothing After This'). I'm sure many metalheads hope that this does indeed happen. As for me, the last thing I want is for Underoath to disappear, because over the course of the last three records, they've gotten progressively better with each effort, culminating with this record, their best since their debut in my opinion.\n\nI have done two negative reviews of Underoath material: I gave 'Underoath: 777' (DVD) a rating of 35, and 'The Changing of Times' (CD) a rating of 20. Suffice to say, I wouldn't hesitate to slam this band if I thought their material sucked. But that's not the case with this CD, which actually has some very good music on it. And I don't know if it qualifies as metal according to the Metal-Archives criteria, but this album is a bit heavier than the previous two efforts as well. \n\nI only have one minor issue with this album: the vocals. They aren't terrible, they're just... almost everywhere, and sometimes quite lackluster. Especially frustrating is Underoath's knack for covering up their half-way interesting guitar work with vocals (e.g. 'Everyone Looks So Good From Here'). This is not to say that they have a ton of cool riffs like a thrash record might, but only that some riffs are better than others, and that the riffs that skew towards the good side often seem to be the ones playing servant to the vocals. \n\nThe screaming, and especially the clean singing, on this album are hit and miss, with songs like 'To Whom It May Concern' being absolutely fantastic and very memorable, while songs like 'You're Ever So Inviting' are definitely lackluster. Overall the vocals don't really detract from the songs, but on the other hand there are only a few times when they help a song soar. This band does much better when using a darker, more atmospheric tone, though they don't often delve into those realms. \n\nWhen the vocals do rest for a moment, this album is much better than previous ones at distinguishing between guitars, bass, drums, etc. This time around we don't have a big glob of sound. The riffs are on the simplistic side, but they are also improved here, and create a decent soundscape throughout the album. The guitarists are not overly technical, fast, or even heavy for that matter, but they do the job somehow in creating aggressive music when needed, and also slower, more atmospheric stuff when needed. A lot of people probably think that these guys can't play their instruments, but I think it's just a case of them having an unconventional style. Certainly Underoath aren't doing the more conventional style of riffing that they were doing on their first two releases.\n\nThe bass plays a more prominent role on this album, which is certainly a positive. Having said that, the bass still \"sits at the back of the bus,\" so to speak. It works out well, though, as someone has to be towards the back, to help create a thick, three-dimensional sound. On drums, Gillespie seems to not be the most technically advanced drummer, but he plays well with and to the music, and it seems to me that he busts out some interesting stuff every once in a while.\n\nEverything sounds good on this album as far as song lengths go, with nothing sounding rushed, or on the other hand drawn out. Nothing seems forced, but everything is in it's place. It is true that many of the songs sound the same at first. I think that this is one of those albums that takes a dozen or more spins to really get into. There are significant differences between songs, but because of the pervasiveness of the vocals on the heavier material, those differences get blurred at first. \n\nSome variety is added in the middle in the form of two contrasting songs back to back. The first song, Salmarnir, is an excellent, slow, atmospheric song, in which a man is speaking in Russian. The second song, Returning Empty Handed, while not being ultra-heavy, is still the heaviest song on the album. These two songs define the line, as it were, and from that point on, the flow of the album is improved and the material is better.\n\nThe lyrics on this record are about becoming more than you are, daily struggles, and about facing life and it's problems. I think the lyrics are actually pretty good, and have kept a small part of the catchiness exhibited on the previous album, 'They're Only Chasing Safety'. Underoath don't beat you over the head with Christianity, with the only possible exception being the inclusion of Ps. 50 (spoken in Russian). But then, how many people listening to this record actually understand Russian? In my opinion, anyone who finds the lyrics on this album preachy are definitely engaging in eisegesis.\n\nThe booklet that came with the CD is a bit of an enigma to me. It is 30 pages long, yet has only 7 pages being used for lyrics and such. The rest of the pages are for pictures and artwork. The problem is, it's all very dark. And I don't mean that the imagery is dark, but I mean that the book is literally dark, and it's hard to see the pics and art work. It was definitely done on purpose, though I'm still not sure what the meaning of it all is.\n\nIn the end, I'd say that there is a lot of decent music here. This band started out their career pretty well, then hit a rut in the middle, but they came back with this very good record (though in a totally different genre than the early Underoath albums). I found nothing terrible on this album, much that is above-average, and even some great moments here and there. Of particular note are 'Salmarnir,' 'To Whom It May Concern,' and the magnificent song 'Casting Such a Thin Shadow'.\n",
        "\nUnderoath's earlier albums were metal--some may say that it was average metal, but it's hard to deny that it was metal. This album, on the other hand, is not even close to metal. This is a transition record from metal to screamo, with 95% of the music falling down on the screamo side. The drummer Aaron Gillespie (the only remaining founding member) has said that they didn't really know what they wanted to play back in the day, in an apparent attempt to explain the transition to a whole different sound. Well whether they knew what they wanted to play or not, it was a lot better than this! Having said that, when I looked this band up on Wiki, I found something interesting. By the time The Changing of Times came out, Underoath had been around 4 years, and in that time had had something like 10 members in their band. With that many member changes, it's no wonder they were confused as to what they wanted to play!\n\nThe guitars often sound incidental to the music being played: you know they're there, and they're playing, but you can hardly pick them out. They're just part of this annoying glob of noise. The riffs are on the simplistic side, and very few have a metallic quality to them. Underoath lost their guitar player, Corey Steger, before they made this record, and it was apparently Corey who played the metal. \n\nI'm not a fan of either the clean or extreme vocals for underoath. Dallas does the extreme stuff, and frankly he's not cut out for that kind of music. A couple guys do the clean vocals, with Octavia being the worst at it. Underoath also do this annoying thing where one singer will sing most of a line, and then the other one will finish the line with one or two words. They did this before, but it was nowhere near as disruptive or bad in the past.\n\nThe bass guitar work is fine here, basically what you'd expect. The electronic noises, on the other hand, can get quite annoying. The last \"song\" is nothing but 48 seconds of noises. Great! The keyboards are usually kept at bay on this album, but sometimes they come up front, and it's a hard thing on the ears. Particularly pathetic was the keyboards on Angel Below, which sounded like something out of a quirky 80's pop song. \n\nSo, what else can you say about such an album as this? It's not catchy, not memorable in the least. Thankfully it is only 35 minutes. I will give them their due, there were a few riffs with some metallic edge to them (especially in A Message for Adrienne), but there were few and far between, and they were utterly simplistic. Even apart from the member changes, I can I understand why these guys wouldn't play any of these songs in concert.\n",
        "\nThis is absolute garbage. Completely and absolutely. Anyone who likes this crap most likely also likes Fallout boy.\n\nEvery second of this album screams scene at me, from Chamberlain's emocore vocals, to the boring, repetitive guitars, and the blastless drums. Truthfully, I'm not even going to listen for a bass part, because it annoys me to much to pick through all these obnoxious songs.\n\nGeneric and emo infested are some good describing words of this album, with it appealing to the losers who listen to pop-punk and all other mainstream music. Wait...this IS mainstream music. The kind that 14 year old girls listen to, especially if their friends do! Trend trend trend.\n\nIt starts off bad, with arguably the most annoying guitar chords I've ever heard. Play that 8 times, switch down a fret, then watch the fans scream and marvel at the amazing guitar playing. Give me a break. After that repeats a few times, then comes the emo screeches. Incessantly wailing, then going into the...wait for it...SINGING! Yes, if Chamberlains vocals weren't enough to raise the mainstream factor, them add Gillespies and Chamberlains wails to the mix.\nNow multiply that by 10, with the exception of an absolutely retarded nonsense track in the middle, and you have Underoath's \"Define the Great Line\"\n\nThere is no musical talent in this album.\nGive an Orangutan a guitar and some sticks and you'll get better results than this.\n\nWhy do you need am infinite amount of monkeys to produce Shakespeare's \"Hamlet\" when you can use 6 and get Underoath?\n",
        "\nI'll start with the positives for this disk. The audio is pretty good, especially compared to the previous DVD they released with live performances (which came with the They're Only Chasing Safety CD). There is some \"making of...\" stuff, which adds a bit of meat. And that's about it.\n\nAnd then there are the negatives. First, you only get half a live show. They only seem to play the songs off of their last two records, how hard would it have been to give you all these songs? That's less than an hour and a half of music. Then again, the live performances of the songs weren't that good, so maybe it's a blessing-in-disguise that more didn't make it onto the DVD. It was a hardship just watching what was on here.\n\nThere is some lame stuff on this DVD. I don't know if it's just the guys trying to be funny for the camera, or what, but some of the stuff on here makes them look like idiots. Throwing the guy in the air is the thing that sticks out at the moment (on the last DVD it was the spinning in the chair in the hotel room scene). It just seems so forced, like they're trying a little too hard to make things exciting--either for themselves, or for the viewers. \n\nThere is some gratuitously disgusting stuff that I could have done without. On the last DVD it was primarily the vomit stuff and the odor issues. The vomit stuff makes another appearance here. Why do bands put this kind of crap on these DVD's? Do you really think that I want to watch you chug milk and vomit it back up? Will you want to watch that 15 years from now? Do you think that I want to watch that? \n\nDo not pick this DVD up if you value your time.\n",
        "\nHow this can be the band that made \"They're Only Chasing Safety\" is beyond me...but then again, the line-up present here on \"Cries of the Past\" is quite different from the emo Underoath we've all come to hate. Hell, the only members from this line-up remaining are the drummer and the keyboardist...who seem to have sold their souls along with...any notion of talent or creative songwriting. Onto this album.\n\nThe album's main weakness is the occasional lack of fluency. Riffs are thrown together in a seemingly mish-mash way, without much regard for standard song structure. However, it refrains from being jarring and mostly just keeps your attention to see what riff will appear next. The clear vocal parts have been a bit of a problem for most people, but I can stomach them. There are, in fact, solos on this album. None of them will go down in history, but are enjoyable listens. This coupled with the rock-solid riffing which includes a lot of tremolo riffs shows a growth in the guitar-playing abilities of this band. And as for this being metalcore, the absence of breakdowns is...odd. This is a much different release from \"Act of Depression\" or later efforts. Very varied, keeping in a somewhat melodic death metal style, or (here's some irony) melodic black metal. As far as the lyrics go, I actually can kind of enjoy them. Written with a certain poetic flair, most will shun it due to the Christian/emo aspect of it, but I can appreciate good emotionally cathartic lyrics and the music is great, so it's not that important. And don't worry, whenever I catch any of those damn references to Jesus in the lyrics, I usually cringe.\n\nTo wrap up my review, let me finish by saying...an Underoath album that can honestly be headbanged to...and is most likely worth your energy.\n\nHighlights: \"Giving Up Hurts the Most\", \"And I Dreamt of You\"\n",
        "\nForget the Underoath of today. This is a completely different band - in sound at least. This album is an interesting mix of metalcore, death metal, and even black metal (especially in the vocals). It's heavy, brutal at times, and full of good riffing and solos. Bass is even audible! Several of the songs are above average length, and are - dare I say - EPIC, even PROGRESSIVE at times.\n\nIf there's one complaint I have about this album, its the drumming. Despite the obvious metal-ness of the rest of the instruments, the drums keep to a simplistic punk-style beat most of the time, which distracts from the more interesting parts of the music. If you can numb the dull drumming, or if the album featured better drumming, the score would probably be at least 10 points higher.\n\nAs it is, Cries of the Past is a mindboggling album for a band thats recently become the epitome of generic metalcore. Worth a listen, especially for those like myself who cannot stand Underoaths latest offerings.\n",
        "\nAfter the emo crap-fest that was \"They're Only Chasing Safety\", Underoath promised that their next album would be heavier, more aggressive and \"disappoint 12-year-old girls\". Now we've all heard the promise of being heavier and more aggressive as nearly every metal, metalcore, and hard rock band says this every time an album is released, but that last promise was interesting. So did they deliver on that and give up what made the last album so obnoxious?\n\nHardly. It's true that this album is less poppy than the predecessor and that Spencer does some almost-good growls, but every new sound on this album sounds completely insincere. From more breakdowns to Southern tinges and grindcore clashes, this album screams \"trend\". And the sad thing is that outside these thrilling new elements, everything else is the same.\n\nThe guitarists still do nothing of interest and are content to double each other the whole time, the listener has to strain incredibly hard to hear the bass, the drums stick to standard tempos and style, and the keyboards appear rather sparsely and still don't add much. It's kind of a shame that the instrument that used to be a big part of the band's sound is now reduced to a few tinkerings here and there. And while the emo vocals appear somewhat less frequently and the \"harsh\" vocals are more abrasive and sometimes decent, they're still very annoying. The songcraft hasn't improved much either and is sometimes less structured and coherent (thanks to the more \"hardcore\" elements) than the last album was. \n\nNothing exciting for metal fans at all, but the scene kids eat it up like discount pizza. It might disappoint 12-year-old girls, but not 14-year-old girls. Underoath continues their trend-hop and one can only wonder with horror where it might end up.\n",
        "\nSay the word \"Underoath\" to any kid in a mall or Hot Topic store and chances are that he or she will know who you're talking about. This band is now ridiculously popular and this album makes that easier to understand. From the first second of the first song, you'll know that this will be awful. \n\nEverything that made this band good (or at least worth listening to) is gone and replaced with stuff that is whinier, weaker, less inspired, and all-around annoying. Just looking at the song titles will tell you that this will be annoying. Typical emo vocals from drummer Aaron Gillespie (who is more content to pound out 4/4 tempos and whine than play stuff of substance anymore) and the agitating singing and \"screaming\" from new guy Spencer Chamberlain are just one layer of suck. The two guitars don't do much at all, and that's one of my pet-peeves when bands have two guitars that just double each other. Such a waste. \n\nThe lyrics have to be some of the worst I've ever read. They're so whiny and stereotypically emo. Such a far fall from the old band's wordy lyric adventures. But at least the stuff is easy to make fun of, especially the \"I'm drowning in my sleep\" line.\n\nThere is nothing metal or even good here, and it is very obvious as to why this sold over 400,000 albums. Mainstream drivel in every way.\n",
        "\nI was really surprised that Underoath was accepted. The first time I found out about this band, a cousin recommended it to me. I went over to his place, listened to a couple of tracks, and I thought it was an OK band. As far as metalcore goes, there are better album’s out there, but if you’re curious about the band, this won’t be a bad place to start.\n\nThe album starts out with the energetic track “In Regards to Myself”. Its also the most energetic track of the entire album. After the second track “A Moment Suspended in Time” the album goes into this weird calmness. Many of the tracks here are slow, and are the kind that are supposed to make you think, however, they will make you dream instead, since these are boring as hell. These calmer tracks stop, if only briefly, by the speedier track “Returning Empty Handed” and it goes into more slow songs, but these are at least competent. \n\nLyrically, the album is preachy, but not obnoxious, unless you just can’t stand Christianity, in which case, you’ll just be punishing yourself. Some of the lyrics may make you wonder whether these guys were hired by the pope himself or do it because it part of their belief system.\n\nOverall, the many of the songs lack the drive that others have, many songs feel really inspired, but many feel like fillers that were made because of the label’s pressure. Its really sad to see another uninspired metalcore/emo act, its really depressive, and it seems that many bands have been appearing since My Chemical Romance hit the mainstream. There are way better metalcore acts out there, but even so, this album is enjoyable after a couple of listens. If Underoath didn’t convince you with their earlier albums, then don’t bother buying this, but if you like Underoath, then you’ll definitely enjoy this album. Lovers will find plenty to love, and haters will find plenty to hate, and for those in the middle, there are a couple of enjoyable songs.\n",
        "\nYou know you are listening to a great album when you feel enticed to scream along with the song, put your hands in the air and twiddle them to the solos, and bang your head against anything you can find – computer monitor, desk, bottle of water, shoe, brick – and when you are done listening to the album through and through, you just want to go masturbate alone and…Ahh fuck, wrong review. Nevermind.\n\nThey’re Only Chasing Safety has to be the second worst album ever posted on the Metal Archives. I am not touching the only album that might top this noisy bullshit, Underoath’s Define the Great Line. \n\nTo describe this album musically is the easiest thing in the world, although a wee bit tricky. \n\nOkay, you know how some people who are mentally retarded shake their wrists? Do that with your guitar picking hand, with pick in hand, and just play guitar like that. There you guy, you just played this entire album. Don’t even bother playing anything that sounds remotely good, as long as it makes some sound it should be all right. Add screaming and crying and a plastic drum set and voila… They’re Only Chasing Safety. \n\nAs for the bass... I can't hear any.\n\nDo I need to describe the vocals? Alright, I will, I'm in a good mood, okay... piece of cake. Jesus Worship. There you go, this is the best Jesus worshipping will ever sound, as some of it is indecipherable whining, the rest is just moaning and groaning over juvenile concepts such as \"my gf died waaaaa\". \n\nDo not bother with this album, there is absolutely nothing of worth here. There is no metal, no inspiration, no good lyrics, no worth, just mainstream money lusting Emopop. I'm just sad that I can't go lower than 0 in rating this bullshit. I will say that anyone who gives this a rating higher than 0 must be mentally incapacitated or something. So there, I insulted any prospective 1s, 2s, even the shocking rating of 3... Hahaha.\n",
        "\nSo Underoath has officially released 42 minutes of good music throughout their career. This just goes to show that their decline from inspired metal on Cries of the Past to the uninspired emopop they play now was a very steep decline. \n\nThis recording carries the same vocalist, guitarist, and drummer. However, that doesn’t seem to be enough, as apparently their new second guitarist, bassist and keyboardist was all jacked up over emo that they incorporated a shitload of repetitive whining into their music. \n\nThere’s some death metal parts, tremolo picking, even a mediocre riff her and there, but it is not worth listening to each song to see which one is the ‘good’ one. Instead, I’ll do that for you.\n\nHere is a list of good songs:\n\nFinished reading? Okay. \n\nSo yeah, even the heavy breakdowns sound absolutely off the wall metal to me when the next thing I hear is whining and carrying on about an ex-lover and loads of that bullshit excuse of guitar playing that is characteristic of emo. \n\nUnlike the previous two albums, the bass on this album is absolutely awesome! If you compare it to the guitar playing, that is, since at least you can pick out riffs. The bass has riffs, but good bass riffs with horrible everything else does not a good album make.\n\nDid I mention how bad the vocals are? I’m not even touching the lyrics, just more of that WAAA my gf died WAAAAA I luv Jesus WAAAAAA type bullshit. The screaming isn’t all that far from Cries of the Past, as it still continues to serve its purpose of “shielding” my ears from the despicable Christian lyrics, but there is enough girly boy ‘clean singing’ to drive me insane. \n\nI just dare you to listen to this album without biting something…\n",
        "\nYeah, that pretty much sums up my expression when I first heard this. This isn’t the –best- album I’ve heard, but when I was expecting to hear more uninspired Jesus trash, instead I hear RIIIIFFS, SOLOS, RIFFFS and more SOLOS among the breakdowns and screaming vocals.\n\nThe guitar work is the best Underoath is probably going to get. There is more depth and variety to the music, it’s not just tremolo-breakdown-scream4Jesus-breakdown-tremolo-screamsomemore-etc… the songs are long and intricate, probably even bordering on the realm of progressive. It gives me something that I can actually head bang to. The bass even comes through at times, and while it still sounds average, at least it has a part in providing a neat introduction to one of the songs. \n\nOne of the biggest improvements are the vocals. They aren’t the substandard metalcore screaming yelling bitching yadda yadda yadda, but instead they are more evil sounding screaming yelling bitching yadda yadda yadda. Okay, so there isn’t all that much improvement. However, there is no clean singing during the Jesus parts, and that at the very least makes these songs enjoyable. I don’t want to hear about Jesus, and the indecipherable barks of Dallas Taylor allows me to enjoy the song without the dreadful lyrics getting in my face. I do mean dreadful, as one thing that has remained constant throughout the history of Underoath is their uninspired Christian lyrics dealing with OMG my girlfriend broke up with me / I broke up with her / she died somehow / she became a Muslim :’( and other shit… There is more variety to the vocals at times, sometimes even incorporating a falsetto scream ala Iron Maiden.\n\nThere are a lot of good parts to this album, and even if you despise Christianity like me, you might enjoy it if you just pretend that they are singing about Satan and stuff. At times the music is even inspiring. I dare say I do like this, even if it is Underoath. There are times when it devolves into emo, but only during the spoken word parts, such as the intro to the song Cries of the Past. This is above-average Metalcore, if I can even call it just that.\n",
        "\nA few years ago, one of my friends played a song by a \"mystery metal band\" that he thought I'd like. I loved it and after listening to it I jokingly said, \"This isn't Underoath, is it?\" I couldn't believe that the same band who wrote Reinventing Your Exit wrote the song I just listened to (which was The Last). It really isn't the same band, though, as the only people still in the band now are the drummer and keyboardist. For those of you who know Underoath from When the Sun Sleeps or their newer works, you are in for a major surprise. \n\nComing off of the less-than-stellar Act of Depression, Cries of the Past is miles ahead in terms of production, musicianship, and song-craft. The death/groove elements are turned down a bit and black metal is added as a major influence. The addition of a second guitarist adds many leads and solos to the music and the major addition of a keyboardist gives the music the atmospheres needed for a quality experience (the first and last songs are the best examples). The songs are tighter than ever and actually have feel this time around. There is enough musical meat to make the long songs interesting rather than trudging along like Act of Depression. There are no emo clean vocals or acoustic worship songs either. \n\nThe lyrics aren't quite as bold as Act of Depression's, but they're still pretty powerful. They work more to create moods and atmospheres, but you'll have to read the lyrics to know what they're about because Dallas' shrieks are almost completely unintelligible.\n\nI don't think either Dallas Taylor, Aaron Gillespie, or the new Underoath will ever be able to top this. If you like metalcore but feel that the majority of bands leave much to be desired, check this album out.\n",
        "\nThe first exposure I had to Underoath's metal past was Cries of the Past. I downloaded Act of Depression (since it's out of print and I didn't feel like dropping $50+ for it on eBay) expecting close the same thing, but what I got was very different.\n\nFirst of all, the production and music are more rough as they lack the polished edges that Cries of the Past has. There are no keyboards on this album and the only black metal influence is in the screechy vocals. The music itself is like death/groove-influenced metalcore with audible bass (don't get too excited, it pretty much just follows the guitars) and many tremolo picking riffs. The staccato, chuggy power chords are also omnipresent. It's definitely not an exciting album especially considering the length of the songs. The clean singing parts outright suck and Dallas has this habit of trailing-off his screams some kind of whine or whimper or something. Kind of embarrassing when listening to this with your metal friends. Other iffy parts include the weird-as-hell laughing that begins Heart of Stone and the very wussy acoustic worship song/sermon at the very end.\n\nThe lyrics are wordy, long, very bold, and straight-forward in their messages. Topics include rape, abortion, and (of course) the love of God/Jesus etc. If you're a fan of Christian lyrics and/or are dissatisfied with the way many other Christian bands write lyrics, there may be something here for you. And if you're not a Christian (like me), I guarantee that you won't be able to understand a word (unless it's sung).\n\nOverall a rough start, but I would rather listen to this than their newer albums any day.\n",
        "\nI cannot dispute the fact that this is in fact metal. However… this is some of the shittiest metal I have ever heard. It’s shittier than everything on this site that has been given 0% reviews. It makes In Flames STYE look like a metal classic. This is even worse than Hellyeah! And by golly, this shit still was enough to put them onto the Metal-Archives. Shameful. \n\nAt times, musically at least – ignoring the vocals – there are good parts. The lead Guitar shows that the guitar player can play guitar sometimes. I do like how they pull off tremolo picking, it comes through nicely in the mix, and these tremolo parts appear often. You can hear the bass, and the bassist can play bass enough to play in a band, but it still consists of nothing more than strumming along with the guitar, it has no identity, and it does nothing for the music except provide a bass layer. The drums are half-decent, you got some variety, but nothing much beyond that.\n\nThe vocalist? AWFUL. Absolutely awful. Emo screams galore, this guy sucks. They should’ve thrown him out when they had the chance, but no – they knew damn well that awful singers sell well, so they kept him. \n\nIt is clear with the lack of guitar solos and breakdown-a-plenty song-writing, mixed with spoken word preaching bullshit, awful vocals, and an attempt at ripping off everything heavy metal stands for, that Underoath was in for the money. The only reason I gave it a 2 is it's better than all of their latest stuff. \n\nNow, had they ditched the vocalist, ditched the Christ bullshit, ditched the emocore, ditched the breakdowns, and added some variety, maybe Underoath would’ve been able to put out something decent after this shit-fest. However, that didn’t happen. They got worse, and for them to be listed here on the metal-archives is ironic – they stand for everything that opposes heavy metal.\n"
    ]
}