{
    "Band Information": {
        "Country of origin:": "United Kingdom",
        "Location:": "London, England",
        "Status:": "Active",
        "Formed in:": "2016",
        "Genre:": "Stoner/Sludge Metal/Metalcore",
        "Lyrical themes:": "Inner conflict",
        "Current label:": "Candlelight Records",
        "Years active:": "\n2016-present ",
        "Number of Reviews": 1
    },
    "Band Reviews": [
        "\nI think it’s been well over a decade since I’ve listened to, and genuinely enjoyed, a heavy metal record. Don’t just go thinking that Serpent & Spirit is just that, we’ll get to that in detail soon. My point is that it feels like it’s been forever since I’ve heard a similar sound on an album which I really enjoyed. British trio URNE are definitely going to grab your attention with their first full-length. It’s not that it’s a metal masterpiece, but rather how it shines through its clear-cut vision like a veritable star.\n\nSo, what makes Serpent & Spirit so great? A ton of things actually, in spite of it feeling otherwise upon a preliminary listen. Alright, so the album is definitely a heavy metal record at its base. However, it also makes sure that the pillars holding the structure aren’t made of the same thing. There’s a fair amount of sludge in there for added weight. I’m also picking up on some thrash metal and doom metal elements scattered across, as well as some stoner metal fragments. I’d also say that there are some hardcore influences here and there. The whole package is tightly bound together with a progressive metal approach, which offers a lovely nuance to all the details and just makes everything all the more engaging.\n\nIf you want something more palpable, albeit possibly less accurate, imagine that someone just threw Mastodon, Metallica, Death, and Gojira in a cement mixer, broke the knob off on maximum, and encased the resulting product in a steel cask. Now, of course, take this wild comparison with a boulder of salt, alright? Anyway, I think that the occasional semblance to Mastodon is the one that unmistakably makes itself heard the most out of the entire comparison. Personally, I especially dig that part as it hearkens heavily to early Mastodon, which is something we didn’t get any more of.\n\nThe opener and title track, “Serpent & Spirit”, definitely epitomizes the heart and soul of the record, musically as much as atmospherically. It showcases basically everything the band can – and do – ultimately offer. It kicks hard while also retaining poetic sensibilities. As it opened the record and I heard the gloriously flourishing, harmonized melodies, I was definitely not expecting the punch around the two-minute mark. I can’t remember what caught me this off guard in recent memory. It was a pleasant surprise and a big one too. You’re suddenly immersed in a volatile vat of churning riffs, accompanied by a truly savage and visceral vocal delivery. Just when I caught the hang of it, around the third minute it all breaks into this melodic and dreamy thing, only to revert soon after.\n\nThis is a record that really wants to make you think it’s only one thing, and it just can’t make up its mind on which is it, really. So, I’m guessing the band just found a way to neatly tie everything together and try to confuse the listener until said listener figures out what the plan is. While every following song, up to the end, features a similar dynamic and delivery, each ultimately revels in its own distinct flavor. This would also make the point that the entire blend flows very neatly and is very consistent, without sacrificing diversity and engagement. I would also like to note that I’m really digging the production here. Everything is crisp yet organic, heavy yet smooth, and crowded yet sparse.\n\n“Memorial” is definitely one of my favorite parts of the record. It’s probably the most intricate part of the record, and it makes a great pair with what I assume is its continuation, “Memorial: Sing Me To Rest”. I think it’s also the peak of the progressive leaning of the album, with lots of twists and turns on a technical level, which are executed with a lot of great taste. The second ‘part’ of the song fleshes out a great deal of the heavily atmospheric segments present. It creates a heavy yet tender mood which is difficult to encapsulate in words.\n\nNow I really don’t have the space to go on in the painstaking detail I’d like to with everything we have here, but right about now, you definitely get the point. Serpent & Spirit is a mammoth which requires every last pinch of your attention. URNE showcase a level of synergy that is rare and a level of promise that is equally rare. This year has been rife with amazing things musically, but I’m confident when I say that URNE are definitely at the top of these standouts.\n\noriginally published at: https://everythingisnoise.net/reviews/urne-serpent-spirit/\n"
    ]
}