{
    "Band Information": {
        "Country of origin:": "Finland",
        "Location:": "Lahti, Päijät-Häme",
        "Status:": "Active",
        "Formed in:": "2013",
        "Genre:": "Melodic Death Metal",
        "Lyrical themes:": "Winter, Nature, Apocalypse, Wolves, Warriors, Bloodshed, Battle, Melancholy",
        "Current label:": "Napalm Records",
        "Years active:": "\n2013-present  ",
        "Number of Reviews": 13
    },
    "Band Reviews": [
        "\nLess than a year after their latest record, the Finnish wolves are back with a new EP. Connecting to the theme of the Winter War of 2020’s \"Wolves of Karelia\" album, Wolfheart’s new release titled “Skull Soldiers” is probably a consequence of tracks on the same theme having not made it onto the album, which allows for this cool little surprise for the fans to emerge now. The EP includes 2 new songs, an acoustic version of \"Aeon of Cold\" from the band’s 2015 sophomore record “Shadow World” and a live recording of “Reaper” from the aforementioned “Wolves of Karelia” album.\n\nThe title track opens the EP with tribal sounding battle drums and explodes straight into raw driving death metal riffing with Wolfheart’s trademark metallic sound and a strong blackened influence. The guitars and bass roar and chug away monstrously backed by the most vicious drum sound in Finland and fronted by the grittiest voice in Finland. The song keeps this pace steady throughout and brings two cool surprises with a verse in Ukrainian and ending on a dynamic solo with great phrasing. Then we have “Hereditary” which is more akin to the songs on Wolves of Karelia, a bit more melodic and it also brings a well fitted acoustic guitar bridge in the middle. The orchestra was less prominent on \"Wolves of Karelia\" then on previous records and it is even more sparse on these new songs as well, giving us what might be Wolfheart at their most raw blackened sounding point.\n\nThe acoustic take on “Aeon of Cold” I honestly felt would be better fitted closing the record, but as they did on the previous album, the band probably wanted to break up the brutality of the record for a breather in the middle before the final banger. The song offers raw acoustic guitars harmonizing beautifully and clean vocals from the band’s bassist Lauri Silvonen. There's no better way to express Finnish sorrow gloom. And then we close with the live version of “Reaper” which is just as massive sounding and almost as balanced as the studio version. The vocals and lead guitars aren’t as loud in the mix as the studio sound, but we do get the live energy instead which gives a bit of a different feeling to the song, and a much needed nostalgia for live shows.\n\nWolfheart prove themselves once again as one of, if not the most proficient band in Finland with this release coming so soon. And despite the slightly awkward format of the EP and the re-use of 2 older songs, it sure offers a fresh breath to the fans much sooner than expected. Check out Skull Soldiers on Bandcamp and at Napalm Records!\n\nEnjoy!\n\nOriginally written for The Metal Observer\n",
        "\nWolfheart's Skull Soldiers sees the light of day a little bit less than a year after the quartet's fifth studio album Wolves of Karelia. In a time of canceled concerts and festivals due to the ongoing pandemic, even such little releases are very pleasant to discover.\n\nThe first two songs enter familiar melodic death metal territory. The title track has an atmospheric and epic note as it tells a gruesome tale of war that suits the bleak cover artwork as well. ''Hereditary'' is even more sinister with thrash metal riffs and minor black metal influences in the guitar work that make this the best song on this extended play.\n\n''Aeon of Cold'' was initially released six years ago to open the second album Shadow World. The track has been cut from six and a half minutes to less than three and a half minutes. It has been transformed into a melancholic acoustic version. Even though this idea looks interesting on paper, the final result can't quite convince me. The track plods on rather unspectacularly and must be perceived as a missed experiment.\n\nThis extended play concludes with a live version of ''Reaper'' from the last studio album. This track was recorded during the band's virtual concert stream performance. Many bands have released pandemic recordings in recent months such as Katatonia and In Extremo. While this approach might work for more introspective and sorrowful groups like Katatonia, it doesn't pay off for energetic and uplifting bands like In Extremo. Wolfheart's version lies somewhere in between these extremes. The song's strong atmospheric side works well in this live version but the group's energy on stage that I could already witness in concert doesn't fully shine through. Ultimately, this is a good to average version.\n\nIn the end, Wolfheart's extended play Skull Soldiers can only be recommended to faithful fans. The two new songs are decent melodic death metal tunes with a few thrash metal riffs and black metal inspirations without being particularly outstanding. The acoustic song and the live track are rather unspectacular. Let's hope the band comes around with another gripping full length in the near future and gets back on stage once the dreadful pandemic will finally be over.\n",
        "\nTuomas Saukkonen has been a busy man since his tenure with early 2000s Gothic-tinged melodeath stalwarts Before The Dawn began to make waves, and even the demise of multiple projects including his talents in 2013 has seen his studio output continue unabated. Though originally billed as a solo project meant to occupy his talents following the aforementioned discontinuation of all his other efforts, Wolfheart has proven to be a metallic beast with a mind of its own, and for the past seven years has evolved into a fully fledged band that has brilliantly merged the meaty, percussive riffing approach of the likes of Kataklysm and early Scar Symmetry with the prototypical dreamy and cold atmospheric aesthetic typical to fellow Finnish icons such as Insomnium and Omnium Gatherum. Their 2020 LP Wolves Of Karelia proved a highly ambitious conceptual undertaking that recounted the events of Finland’s war against the invading Soviet Army (dubbed The Winter War), so much so that Tuomas and company still have a few things to add to the story a year later.\n\nContinuing across the same frost-covered battlefield that typified their last album, 2021’s Skull Soldiers EP recount the exploits of an elite group of Finnish soldiers that adored their helmets with skulls and skeletons while braving the wintry landscapes against seemingly insurmountable odds. The new exclusive studio songs to come in this package are unabashed anthems of total war, with the opening title anthem entering with a massive percussion intro like something out of a Hollywood war film before inundating the airwaves with a barrage of pounding, heavy-ended grooves. Though this musical chapter and its faster thrashing cohort “Hereditary” are mostly exercises in raw, unfettered aggression with Saukkonen’s deep guttural barks battle the punchy guitar chugs for prominence, there is also a subtle whisk of wintry beauty nestled in the background via a droning keyboard line at key points, and the wailing guitar solos supplied by newly acquired Greek axe man Vagelis Karzis (who provided lead guitar work on the previous album in a guest capacity) further bolsters the dual sense of savage brutality and melodic splendor at play in the band’s signature style.\n\nAlong for the march into battle are a pair of bonus offerings that provide a greater level of depth and variation to this otherwise consistent fit of distilled aggression. Opting for a subdued ballad by campfire between fits of auditory carnage, the all acoustic and shorter rendition of 2015 sophomore album Shadow World’s opening anthem “Aeon Of Cold” provides a necessary respite and point of contrast to given this short studio offering a storybook feel. The vocal performance delivered by bassist Lauri Silvonen proves to be a haunting affair, coming off as a melancholy every man reflecting upon the frozen surroundings with his fellow soldiers listening intently. Rounding out this abridged continuation of the war torn spirit of Wolves Of Karelia is a live rendition of one of said album’s most distinctive anthems “Reaper”, recorded during a streaming event early in 2020. The song is performed so masterfully that one will struggle to distinguish it from its original studio version, yet it retains the intensity and energy of a concert event despite the lack of a cheering audience.\n\nIt’s a foregone conclusion that anyone who enjoyed the furious odes of war and pride that rounded out Wolves Of Karelia will want to hear this, along with any self-respecting fan of melodic death metal. At times it seems torn between sounding like a modernized, mechanical chugging homage to the recent output of Kataklysm and the more elaborate and nuanced sound typical to the scene of its birth, but it works well in merging these two seemingly opposing styles and balancing a forbidding impact factor with a cold and dreary wintry atmosphere. There is definitely something to be said for taking pride in the history of one’s homeland, and this is the sort of album that, like its predecessor, commands respect from all whom hear it regardless of their national origin. Definitely a band to keep tabs on in the coming years, as their impressive level of quality output over the past 8 years puts many in the Northern European melodic death metal scene to shame, regardless of whether the topic is Finnish history or artful descriptions of the scenery contained within said nation.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nLess than two years after the last output, one of Finland’s most outstanding acts, the mighty Wolfheart, returns with the fifth full length studio release. After four compact and convincing albums have hit the shelves since 2013, it has become clear that quality and consistency are the words to describe this band’s craft. Having not suffered much change since the inception of the band, the branded “Winter Metal” genre has stayed true in its form. An unprecedented blend of riff driven melodic death metal, black metal and orchestral arrangements is what defines said label and sets Wolfheart apart from any of their neighboring creators of the epics. More simply put, while Nordic epic metal is no novelty, it has never come across as fierce, raw and earth shaking as it does from these warriors. On “Wolves of Karelia” it may be at its heaviest peak yet, and tracing back to the ruthless times of the Winter War has given the Finns just enough context to keep the streak going.\n\nHistory lesson time! The Winter War took place in the winter of 1939-1940 between Finland and the USSR. Following a demand from the Soviet Union that Finland would simply hand over strategically valuable territory (which of course didn’t happen), the Russians, overpowering in numbers and arms, invaded the picturesque lands of Karelia. After suffering an unforgiving battering for three frostbitten months, the soviets finally achieved a hollow bitter victory. History lesson over! Back to metal!\n\nWolfheart’s take on this historical event, is as expressive as it possibly could. The new record takes a turn for the heavier compared to 2018’s “Constellation of the Black Light” which was more melodic and emotional. The intense riffage and drumming is as driven and corrosive as ever, yet even more impactful due to a more obvious tinge on black metal territory. Especially the three opening tracks include consistent use of blast beating drums and raw sounding melodies. Tuomas Saukkonen’s growl tops the songs with impeccable grit and raw catharsis, easily one of the most unique harsh voices in the scene. The vocal delivery grows even more imposing when the backing vocals of his bandmates join in for the choruses. When it comes to the melodic side, the impact of the orchestrals is also less obvious. The metal instruments were always at the forefront in Wolfheart’s albums and the orchestra came as a dense backing layer to slightly soften the blow and add a strong emotional background. This time around, it’s used more to convey the wintery atmosphere and create dynamics, leaving the high-octane pummeling to completely take over. In addition, some explosive orchestral hits are used to amplify the blow of the riffs and transitions, in my opinion perfectly embodying the raging artillery on the battlefield. And speaking of simulating firepower, there's really nothing quite like the drums on this record, technical and super precise but still easily blending into the whole organic texture.\n\nFrom a structural standpoint, the album has a very cool flow, and one that really relates nicely to the concept. The first two opening tracks are really pushing on the epic side, almost as if the first contact with the enemy is presented. The following two are harsher, steady and bring a lot of weight to the sound. Especially “The Hammer” brings the sickest opening/closing riff on the record. Then comes the turning point with “Eye of the Storm”, that gives a breather moment with acoustic guitars, piano and violin, but also creates suspense before the assault continues. It’s perfectly positioned, sandwiched between the grooviest tracks on the record, throwing you off when it starts and allowing the album to not lose momentum through the next track. The closing track “Ashes” also lifts of the foot off the gas, depicting the aftermath of the war, with a nice acoustic passage in the middle, a more obvious orchestral layer, and the most emotional performance. I feel it embodies the silence after the war as well as the weight of the loses and really brings the record to a memorable ending.\n\nI do have a knack for the winter epics, but I never cared much for battle themed metal, and I don’t generally applaud consistency over variety in a group’s catalogue. This only comes to show how well executed this piece of music is. Five streams in and having not been exactly surprised by the style, I still feel rather compelled to go for run six. Wolfheart are definitely on top of their game and show no sign of slowing down, or any problems staying relevant. With this juggernaut of a record the Finns provide just enough top class metal and fresh winter breezes to keep you sane through quarantine. “Wolves of Karelia” released April 10th and is available through Napalm Records and Bandcamp.\n\nEnjoy!\n\nOriginally written for The Metal Observer: http://www.metal-observer.com/3.o/review/wolfheart-wolves-of-karelia/\n",
        "\nWith albums released every two years, Wolfheart's \"Wolves Of Karelia\" is their most daring conceptual venture of a career started in 2013. Led by Tuomas Saukkonen, with this record the Finns describe the Winter War, which opposed Finland and the Soviet Union between November 1939 and March 1940. In one of the pivotal moments during the beginning of World War II, so often overlooked, Finland maintained independence.\n\nNow, after about 80 years, Wolfheart write a very rich album, both directly and bluntly how they present the lyrics as sound-wise, being the band's most epic and aggressive work to date.\n\nThe opening with “Hail Of Steel” is a typical Wolfheart song, but you can already hear the orchestration that will be prominent and highlighted throughout the album as the band never did before, with an effective and captivating duel between arrangements and guitars. In turn, in the third “Reaper” more complex riffs start to appear, something that, like the orchestra, is more present on this album than in the previous ones.\n\nThe warlike content at a sound level happens most blatantly in “The Hammer” through another piece between orchestrations and guitars that, thinking about the Winter War, takes us to courageous runing between tall trees and snow that boggles us distressfully while listening to the hiss of a bullet passing just inches from an ear. In short, this track is one of the most visual and violent, without ever losing a certain melodic sense, and it also surprises due to the final contrast with acoustic guitar, piano and cello.\n\nAnd if you think that mentioning a certain ingredient so usual in Wolfheart is missing here, so the melancholy, almost doom metal, so inherent to the band's sound appears finally in “Born From Fire” and “Arrows Of Chaos”, being necessary to make the observation that a sense of grief continues to persist on this new album, but instead of being sad it presents a colder and more furious approach. “Ashes” follows the same tone as the previous two tracks but it sounds more mournful and mid-tempo than angry and fast, ending the album in a great way through a sound so recognizable and unparalleled.\n\nIn yet another high-quality album, Wolfheart prove that the winter metal label has never made more sense than now with “Wolves Of Karelia”.\n",
        "\nAfter having witnessed Wolfheart in concert not too long ago, I was determined to check out one of the regular studio albums released by the Finnish melodic death metal quartet. New record Wolves of Karelia comes at a welcome moment in times of confinement and quarantine. This album stylistically represents everything the band stands for, offers eight tracks with a consistent running time of forty-two minutes and the beautiful cover artwork deserves an honourable mention as well.\n\nThere are two things that stand out regarding this album. It's interesting to note that the rhythm section consisting of bass guitar and drums doesn't always play at the same pace as guitars and vocals in numerous tunes. The rhythm section is often fast and relentless while the guitar riffs and vocals are mid-paced to evoke epic storytelling. This almost progressive approach shines through in strong opener ''Hail of Steel'' for instance.\n\nAnother remarkable element are the numerous prolonged atmospheric instrumental passages. Album highlight ''The Hammer'' offers diversified entertainment with multiple changes, ideas and transitions but the wonderful instrumental coda slows things down and gives the occasion to digest the things one has just heard.\n\nInstrumental tune ''Eye of the Storm'' isn't impressive from a technical point of view but convinces with gloomy atmosphere of cinematic dimensions. The combination between folkloristic acoustic guitar melodies and melancholic piano sounds works particularly well. One can almost imagine a group of warriors standing in an icy field and getting prepared for the decisive battle.\n\nIn the end, Wolfheart's Wolves of Karelia offers imaginative epic melodic death metal that convinces most in its slightly progressive approaches and solemn instrumental passages. The album grows with every spin and would make for a wonderful soundtrack to a movie about a historical war in ice and snow.\n",
        "\nWhen a fairly young band makes an impressive splash into the scene, the force behind said project is often a more seasoned veteran of the art. Such was the story of Finland’s relatively recent melodeath export Wolfheart back in 2013 when the riveting debut Winterborn was unleashed, functioning as a sort of missing link between the straight up aggression and Norse heroism of Amon Amarth and the serene yet dreary winter atmospheric quality of Insomnium and Omnium Gatherum. Founder and multi-instrumentalist Tuomas Saukkonen initially fielded the band as a one-man project after the same spirit of many others that he had helmed the preceding decade, but with all the potential that had obviously been realized, this band would require a permanent lineup in both the studio and on the road, and subsequent studio albums would continue to build upon an impressive foundation until the closing years of the 2010s saw this Lahti-born powerhouse become a major player in the Finnish scene.\n\nDespite the winter that ushered in the new decade was of a mild character, the early weeks of spring may see the season of death having a massive final upsurge if the cold anthems of Wolves Of Karelia have any say in the matter. The overall demeanor of this epic foray into the land where Baltic, Slavic and Nordic forces collide strikes a bit closer to the more technical and nuanced territory of the dreamy melodeath common to many latter day Finnish bands and also the Australian affiliate of the style Be’lakor, but it’s definitely ferocious enough to trade blows with recent Viking-obsessed offerings like Berserker and The Hunt For White Christ. The songs themselves are of a generally moderate length, yet have a sense of gradual development and variation that makes them seem longer, balancing a sorrowful coldness with a biting rage that is spearheaded by a blistering roar out of Saukkonen that maybe a tad less deep than Johan Hegg, but equally as effective.\n\nIt goes without saying that melodic death metal lives and dies by the quality of the melodies that accompany the storm of aggression, but the true ingenuity behind the best offerings of the style are being able to have a constant stream of consonant tunes while still bludgeoning the sky with a battle axe. Such a slab of war-hungry brutality is offered up right at this album’s very onset with the colossal “Hail Of Steel”, a song which takes its time from the looming march of an infectious melodic hook until exploding into a blinding fury of blasting and thrashing that also happens to be chock full of atmospheric keyboards. It hits that sweet spot between violence and implicit tranquility that makes it both a fun head-banging romp and also a thought-provoking listen, and it’s not alone in that eventuality. Similarly chaotic monsters that borderline on Nile-inspired degrees of aggression like “Horizon On Fire” and “The Hammer” land in similar territory, the former starting from an Insomnium-inspired atmospheric whisper, the latter featuring some brilliant precision riff work and a riveting solo out of newly recruited Greek shredder Vagelis Karzis.\n\nNaturally an album of this caliber does not live by high octane death metal madness alone, and some of its most memorable moments are actually when things have been toned down a bit. “Reaper” takes things in a bit more of an overt Amon Amarth direction with a more stripped down thrashing riff set, but still takes plenty of moments to allow the accompanying orchestral elements to heighten the density factor of this band’s sound and also features a nice folksy lead guitar theme that’s along somewhat comparable lines to Ensiferum. “Arrows Of Chaos” sets itself apart nicely by introducing some subtle black metal elements to the riff work and occasionally sounds like something that could have appeared on the latest Abbath album. One would be remiss to discount the departure into purely atmospheric territory on “Eye Of The Storm” with acoustic guitar and piano lines painting a picture of a snow-covered battlefield drenched in blood and felled warriors. Yet when all is said and done, this band’s brilliance is at its peak at the end of the line with “Ashes”, which revisits incorporates the aforementioned acoustic elements in with a more violent death metal assault to a masterful conclusion.\n\nThough a somewhat younger project when measured against many of the previously cited juggernauts of the style from Sweden, Finland and elsewhere, this is an album that definitely could be held on equal terms to said bands’ seminal offerings. It’s indicative of a master songwriter who spent the better part of his formative career splitting his talents between nearly a half dozen projects bringing that prowess into a singular and even more potent vision, and a continual reminder that excellence doesn’t necessarily come at the expense of a prolific output. Now with 5 fine releases under their belt in a little over 7 years, it’s a foregone conclusion that this will not be the last that the metal world hears of Wolfheart, though the recent revival of one of Saukkonen’s former projects Dawn Of Solace (which also put out a solid offering a little earlier this year) may require a slightly longer respite. This is a definite boon for the rank and file Scandinavian melodeath consumer, and an opus with some staying power to boot.\n\nOriginally written for Sonic Perspectives (www.sonicperspectives.com)\n",
        "\nTuomas Saukkonen is one of metal's most hard-working musicians. Wolfheart has managed to release four albums since he disbanded his array of musical projects in 2013. I was a big fan of his previous project Black Sun Aeon (check it out if you haven't heard it), and Dawn of Solace and Before the Dawn delivered quality dark metal music as well. Most of his music is somewhere in between melodic death metal and doom metal, zoning in on the darkness that is present in so many Finnish metal bands.\n\nWolfheart's releases have been somewhere in between the catchy Before the Dawn melodicism and the more heavy, emotionally driven sound from Black Sun Aeon. The debut album Winterborn is probably my favorite so far, even though all three releases are well over par.\n\nThe song \"Breakwater\" that was released prior to the album is a signature Wolfheart tune. Walls of blastbeat-fueled Finnish melodic death metal neatly cascades into lighter, atmospheric parts. It's majestic, confident and catchy; right up there with previous Wolfheart singles like \"Boneyard\" and \"Zero Gravity\".\n\n10 minute opener \"Everlasting Fall\" is the longest Wolfheart song released so far. It has a three minute atmospheric opening that suddenly erupts in the familiar Wolfheart sounds; a growled verse accompanied by fast melodic tremolo guitars and blasting drums. The ambitious scope of the track is a new take. Some parts remind me more of Insomnium than Wolfheart ever previously did. However, it's not as adventurous as 10 minutes entails though, it's basically just a drawn out Wolfheart track, for good and bad.\n\nIn terms of guitar melodies and vocal hooks, the Wolfheart sound hasn't changed much. It doesn't have the freezing winter feeling that the first album had, but you can certainly tell that this album is from Scandinavia. There's an underlying folkiness to the melodies and atmospheric parts. The keyboard presence is slightly stronger on \"Constellation of the Black Light\".\n\nThe reliance is still on a backbone of melody driven guitar riffs and Tuomas's vocals. In terms of vocals, nothing has changed. It's still the same mid-range growls and rasps. They're competent and deliver the hooks confidently, but rarely go beyond that. Some clean sounding choirs are added in the places in \"Breakwater\". I find myself missing the extra edge that the clean vocals gave some of his previous projects. It's not a big deal, but the variation would help.\n\nThe downtuned guitar tone packs a lot of punch. It's masterful in the album's stronger moments and fuels the less inspired guitar melodies. To me, Wolfheart has always been more of an atmosphere band than a riff band. It feels like the band is trying to bring some straight death metal fury at times and it's not really what they're best at. \"Breakwater\" and \"The Saw\" stand out as the strongest tracks, due to combination of Wolfheart atmosphere and memorable hooks.\n\nDespite strong musicianship, my relationship with this band is based on its passion and character. There is a lot more to this music than the notes played on paper. I can see many non-Scandinavians fall for Saukkonen's focus on snow, cold and other things Nordic. I find myself doing the same. There's an intangible force of nature present in Wolfheart that I really like.\n\nAs usual with Tuomas Sakkuonen's projects, the production and musicianship is noticeably professional. Soundwise, this competes with the absolute metal elite. Drums and guitars sound massive and it really gives the album extra magnitude. To me, it's no doubt that the massive production is a big factor in Wolfheart's success.\n\nTo sum it up, \"Constellation of the Black Light\" is simply another quality album. This won't turn around any Wolfheart haters, but it's another solid addition to their discography. Saukkonen fans will like it. It will probably help them to win over new ones as well. I recommend this album to fans of melodic death metal and doom metal.\n\nOriginally written for deathdoom.com\n",
        "\nLet's get one thing straight first. Tuomas Saukonnen is a fucking genius. The true father of winter metal.\n\nThe third album by these berserkers, Tyhjyys (whoever can pronounce it correctly will receive a cookie), is more brutal than they have ever been. One of Wolfheart's more prominent stylistic features is their use of very fast blast beats, and this album takes that to the next level. The song \"Boneyard\", also released as a single, showcases these brutal blast beats beautifully.\n\nAnother prominent feature in this album is the extensive use of acoustic guitars. Some of Wolfheart's best works (the masterpiece known as \"The Hunt\" comes to mind) feature extended acoustic passages, but here it exists in almost every song, and to me it never feels out of place. There is no sign of the piano, used in the previous album in several songs. However, orchestrations do feature here and there and they add to the atmosphere of the songs. Overall, the cold and epic atmosphere of the previous albums is strong as always in this album and as they get more and more technical, Wolfheart never abandon the frozen landscapes that their music brings to mind.\n\nThe lyrics of the album seem to be partially based on Tuomas' personal struggles (as he once mentioned in an interview) and they are quite dark. One of my favourites, \"World on Fire\", for which an awesome music video was released, is about going to great lengths to take revenge. This is another one of the songs that features an epic blast beat with tremolo picking that would give most of the melodeath scene a run for their money. Another one of the masterpieces, \"Boneyard\", is about an apocalyptic war. I mentioned these two songs because they are, in my opinion, the two top songs of the album.\n\nIn the end, I have but one recommendation: buy this album. There is no better companion in cold weather, than a Wolfheart album.\n",
        "\nReview Originally Published at www.teethofthedivine.com by E.Thomas\n\nNot content with dropping the reissue of debut, Winterborn, on us earlier this year, former Before the Dawn and Black Sun Aeon founder Tuomas Saukkonen is already dropping his new project’s second album on us to fuck up 2015 year end lists everywhere.\n\nWhereas the template of the music is still heavily rooted in his past along with a touch of Amorphis, Insomnium, October Falls and Noumena, Shadow World expands it a little, and one only need look to the color scheme of the album artwork. Whereas Winterborn was a more somber, cold and cello laden affair, Shadow World is more indicative of autumnal, fiery hues and a more aggressive sound. The cello is all but gone, replaced by a piano and more driven, chunky riffs; though still flocked with that unmistakable downtrodden Finnish sheen.\n\nThe delicate piano that opens “Aeon of Cold” could have come from any recent Amorphis album, but explodes in a furious blast beat, immediately signalling Saukkonen’s more aggressive intent. And from there, if you heard the debut or any of the above mentioned bands, you know what you are getting into, production, riff and vocal wise, even if is is rendered with a little more bite than you might expect.\n\nAs with Winterborn, there isn’t a weak song or riff, even if missing the more introspective moments and atmospherics. This is all about big, crunchy, slightly sonorous Finnish riffs and big, bellowed vocals. Picking out favorites is difficult, but the frantic stomp of “Storm Centre” struck a chord with me reminding me of “Hell Is Where the Heart Is” from Edge of Sanity‘s Infernal. Also, “Last of all Winters” has that perfect, emotive Amorphis bounce and chug while “Abyss”, the album’s most restrained track, still rumbles with moody purpose. It’s followed by “Resistance” a polar opposite and one of the album’s most forceful tracks. 8 minute closer “Veri” is the album’s lone truly ‘slow’ doomier track closing things out with an appropriate mood and orchestral ending.\n\nBut really, all 9 tracks and 46 minutes are enthralling, top notch, Finnish melodic death/doom metal and it looks like Saukkonen and Wolfheart look to have the rare double dip of killer albums in one year in 2015.\n",
        "\nReview originally posted at www.teethofthedivine.com by E.Thomas\n\nWolfheart is the solo project of one Tuomas Saukkonen, who you might recognize as the brainchild behind such acts as Before the Dawn and Black Sun Aeon. Winterborn is the first project under this moniker after disbanding all his other projects, and though it was originally self released back in 2013, Spinefarm is now making this slab of Finnish melodic doom death perfection available again to no doubt adorn year end lists in 2015.\n\nThose familiar with albums from both Black Sun Aeon and Before the Dawn (2012’s swansong Rise of the Phoenix was a criminally underrated, brilliant release) will know what to expect here, as Saukkonen is going back to the same musical well in style; Lush Finnish melodic death/doom metal with a melancholy edge that’s full of big chunky riffs, deep bellows, crestfallen leads and all lightly flecked with some gorgeous cellos. You can’t help but make comparisons to the likes of Insomnium, October Falls, Noumena and Rapture and certainly at times, Amorphis, the godfathers of the style.\n\nAnd my god is it ever good. Even with such obvious nods to a tried and tested sound, Saukkonen (joined by many of his Before the Dawn and Black Sun Aeon bros) as you’d expect, absolutely nails the sound. There are soooo many good riffs on here, it simply has to be heard from start to finish. The album has it all from more up-tempo urgent numbers (“Strength and Valor”, “Ghost of Karelia”) to slower more morose lopes ( “Gale of Winter”, “I” both where the Amorphis sound really comes through) and plenty of wilting atmospherics (“Breathe”, sorrowful interlude “Isolation”). And of course, all of it is rendered with a big Finnish crunch, rending leads, powerful bellows (no cleans here either) and the light gloss of morose cellos and synths.\n\nPicking standout tracks is virtually impossible as there simply isn’t any filler here. Every track just oozes excellence. That being said, opener “The Hunt” and fifth track “Ghost of Karelia” which has pretty much a perfect opening riff, and the more somber “Routa pt 2″ are just simply jaw dropping in their perfect rendering of this style. But no disrespect to the likes of “Chasm”, or closer “Into the Wild”, as that’s like picking out the hottest person from a group of 10s. Every track is damn near perfect.\n\nWinterborn is about a perfect album as I’ve heard in a looooong time. Not only is this going to be very high on my year end list, if I’m still doing this writing thing in 5-10 years, don’t be surprised if this gets the ‘New Classics’ treatment at some point down the road. Sublime.\n",
        "\nThere aren't many bands that can efficiently capture the cold bleakness of a northern winter, but those that can do so very successfully. One is of course Norwegian black metal outfit Immortal. The other, far more recent band is the one man project from Finland, Wolfheart. Of course, sole member Tuomas Saukkonen is no stranger to the cold; having also been the sole member of his previous project Black Sun Aeon, Saukkonen has a talent for blending aggression, atmosphere and melody together. \"Winterborn\" the first album under the Wolfheart banner is no exception. \n\nWhat is so striking about this album is how the myriad ideas all come together to create a very unique animal. The vocals are death metal, and the guitar work has the sort of cold atmosphere you would expect from a band like Dissection, complete with melodic and melancholy guitar solos. Further adding to the mix are the use of acoustic guitar passages and a melancholy string opener on \"Routa Pt. 2\", giving the album an old world, folk metal feel. The result is a rare type of album: an album that defies any real categorization, and exists as it's own cold monster.\n\nWhat makes the album truly effective is how, as a songwriter, Tuomos Saukkonen allows these musical parts to come together. The softer passages serve as openers to songs such as \"The Hunt\", \"Routa Pt. 2\", and \"Chasm\", where they slowly draw the listener in, before blasting them with the icy fury of the music. This works particularly well in \"Routa Pt. 2\", where the melancholy notes from what I believe to be a cello seem to call back to a faraway time and place. Also working in the favor of the album are the lead guitar parts, which appear in nearly all of the songs, but work best in \"I\" and \"Chasm\", where the melody sweeps you into the frozen lands Tuomas sings about.\n\nSpeaking of the singing, the lyrics are just as important here as the music, even if the death growls don't make them immediately audible. Matching with the cold, melancholy music, the lyrics are full of love and longing for a land of frozen lakes and forests, remembrance of the battle (\"Strength and Valour\" and \"Ghosts of Karelia\" describe past battles and victories) and an intense reverence for the life giving and life taking side of nature. Call that description cheesy all you want, but when you read the lyrics of the songs along with the music (such as \"Ruler of the frozen lands/ From these woods and beyond/ Embraces the hunter's moon/ With howling forlorn\" from \"The Hunt\") the feeling that Tuomas is attempting to convey is perfectly captured.\n\nIn short, \"Winterborn\" is not just a good album, it is probably one of the best metal albums of 2013, and his Wolfheart project shows a lot of promise. The music and lyrics work perfectly together to create one consistent vision, and there is never the feeling of over indulgence or boredom with the material. Obviously the target audience is anyone into melodic death or black metal, but I would recommend this album to any metalhead looking for a perfectly composed album to take them to another realm. I've even known someone who didn't particularly like metal, yet highly enjoyed the album. When an album has the potential to be appreciated by different types of people, that's when you know the artist has done their job well.\n",
        "\nHow can this man do it every single time he releases a new album? How, I ask you? I can't explain it. First of all, I must say, I got pretty sad with the end of my favorite triplet: BSA, DOS and BTD. The moment I opened my FB and saw that statement I was like: \"worst day ever\". However, Wolfheart was mentioned to be the new Tuomas' project, so I had two different feelings beside sadness: apprehension (I didn't know what was there to come) and, of course, happiness. But enough talking about this, let's focus on the \"Winterborn\".\n\nIn the middle of the summer, throughout the night, there I was in my computer, doing nothing, until suddenly we receive the news: first single for \"Winterborn\", \"The Hunt\", is released. A cold winter breeze suddenly went through the room, but I didn't care. My eyes were drowsy but dammit, I didn't care about them too. The ears were all I needed. They say the first impression tells a lot about a certain person, and it also told me a lot about this album. If Tuomas had done such an awesome first song, then the rest had to keep being mind-blowing. And there was no way I could be wrong. I was so damn right...\n\nCombining touching melodies (like that part in \"Breathe\" that goes from \"When sorrow calls my name\" to \"stop seace breathing\") with powerful and aggressive riffs and drums (like the beginning of \"Strength and Valour\"), this album has almost everything you can ask from a melodic death metal album. Even though there has been some discussion concerning the genre of Wolfheart, I think melodic death is the simplest way to refer to it. As I already said, this album combines powerful and melodic guitar riffs but also beautiful acoustic guitar moments, great drums and bass work, awesome (of course) growls and great keyboards in the background (the touching cello moments, well expressed in \"Routa Pt. 2\" and \"Breathe\" are simply great). I think one of the songs that combines all of this elements is exactly \"Routa Pt. 2\": the beginning with the cello, followed by a more aggressive moment, followed by acoustic guitars and (once again) cello and then proceeded by all the other things: great growls, bass, drums, and a great solo by the special guest Mika Lammassaari.\n\nJust one small (not so good) aspect and, notice, I'm not, for sure, saying I don't like the songs I'm going to mention. I'm not saying that there is lack of originality, but I can find some very similar songs in his old projects (but it is also true that he said this new band was going to be kind of a mix from his old projects). Let's follow the album's order: \"Gale Of Winter\", one of my favorite songs in this album, reminds me a lot (in the beginning) of \"I Was Never There\", Dawn Of Solace. The starting riff is, for me, pretty similar. Now, we go exactly to the next song, \"Whiteout\", which reminds me (also in the beginning) of \"Frozen\" by Black Sun Aeon. But on the other hand, there are good aspects in this \"going back in time\" thing. I am a huge fan of \"Pitch-Black Universe\" (BTD), and \"Strength And Valour\" could be named, I think, \"Pitch-Black Universe Pt. 2\". I just love this two songs, I simply fell for both of them. Then, we have another thing I loved. The song \"Whiteout\" has a part of the lyrics already written in \"Nightfall\" (BSA), and I appreciated that a lot, because now we had the chance to listen to them with Tuomas' growls:\n\n\"Embraced by the nightfall\nThe darkness came to me\nWithout descent of the sun\n\nBefore the flames shall return\nAnd ablaze the sky on fire\nI will hide myself\nIn the shade of the moon\n\nLast ray of the light\nSole spark of the sun\nFinal and so fragile\nTravelled from afar\"\n\nIn the end of \"Breathe\", come the only lyrics sang in Finnish: \n\n\"Vaikka aurinko jo nousi\nJa valossa kylpee maa\nJää minussa ei murru sillä sisälläni on vain pimeää ja kylmää\".\n\nI just can't be the only one noticing that this is the exact same end of \"Routa\" (Black Sun Aeon). I find this awesome. One of everyone's favorite song from BSA has the ending part of the lyrics back in \"Breathe\". Amazing.\n\nSo as you have read in this lines, the album is, without a shadow of doubt, one hell of an album. My favorite songs are \"The Hunt\", \"Strength And Valour\", \"Routa Pt. 2\", \"Gale Of Winter\", \"Whiteout\", \"Ghosts Of Karelia\", \"I\", \"Chasm\" and \"Breathe\". Oh, wait a second, I just mentioned them all! And no, it's no mistake, they are all very good. And as one of the lucky ones that got the two instrumental pieces, \"Frey\" and \"4:19 a.m\", I will also talk about them in a couple of lines. Once again, the beginning of a song reminds me of a beginning of another. \"Frey\" reminds me of \"Nightfall\", Black Sun Aeon. But apart from that, it is a very beautiful song. \"4.19 a.m\" is also beautiful. These two instrumental pieces are good enough to fit in any album, from my point of view.\n\nSo although you can't have the bonus tracks if you order the album now, you will still have almost 50 minutes of great melodic death, done right. This man is a master in the realm of melodic death metal, and in every new album he proves that point. So when sorrow calls your name and grief runs in your veins, just pick up \"Winterborn\", listen to it and distract yourself from your sadness for 50 minutes.\n"
    ]
}